; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--matroskadec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--matroskadec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!995 = !DIEnumerator(name: "MATROSKA_VIDEO_DISPLAYUNIT_PIXELS", value: 0)
!996 = !DIEnumerator(name: "MATROSKA_VIDEO_DISPLAYUNIT_CENTIMETERS", value: 1)
!997 = !DIEnumerator(name: "MATROSKA_VIDEO_DISPLAYUNIT_INCHES", value: 2)
!998 = !DIEnumerator(name: "MATROSKA_VIDEO_DISPLAYUNIT_DAR", value: 3)
!999 = !DIEnumerator(name: "MATROSKA_VIDEO_DISPLAYUNIT_UNKNOWN", value: 4)
!1000 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1001, line: 47, size: 32, align: 32, elements: !1002)
!1001 = !DIFile(filename: "./libavcodec/flac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!1003 = !DIEnumerator(name: "FLAC_METADATA_TYPE_STREAMINFO", value: 0)
!1004 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PADDING", value: 1)
!1005 = !DIEnumerator(name: "FLAC_METADATA_TYPE_APPLICATION", value: 2)
!1006 = !DIEnumerator(name: "FLAC_METADATA_TYPE_SEEKTABLE", value: 3)
!1007 = !DIEnumerator(name: "FLAC_METADATA_TYPE_VORBIS_COMMENT", value: 4)
!1008 = !DIEnumerator(name: "FLAC_METADATA_TYPE_CUESHEET", value: 5)
!1009 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PICTURE", value: 6)
!1010 = !DIEnumerator(name: "FLAC_METADATA_TYPE_INVALID", value: 127)
!1011 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !954, line: 327, size: 32, align: 32, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016}
!1013 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGHORZ_UNDETERMINED", value: 0)
!1014 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGHORZ_LEFT", value: 1)
!1015 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGHORZ_HALF", value: 2)
!1016 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGHORZ_NB", value: 3)
!1017 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !954, line: 334, size: 32, align: 32, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022}
!1019 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGVERT_UNDETERMINED", value: 0)
!1020 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGVERT_TOP", value: 1)
!1021 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGVERT_HALF", value: 2)
!1022 = !DIEnumerator(name: "MATROSKA_COLOUR_CHROMASITINGVERT_NB", value: 3)
!1023 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSphericalProjection", file: !1024, line: 51, size: 32, align: 32, elements: !1025)
!1024 = !DIFile(filename: "./libavutil/spherical.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1025 = !{!1026, !1027, !1028}
!1026 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR", value: 0)
!1027 = !DIEnumerator(name: "AV_SPHERICAL_CUBEMAP", value: 1)
!1028 = !DIEnumerator(name: "AV_SPHERICAL_EQUIRECTANGULAR_TILE", value: 2)
!1029 = !{!1030, !1039, !1038, !1040, !1047, !1049, !1051, !1045, !1053, !1054, !1055, !1056, !1058, !1059, !1078, !1079, !1086, !1087, !1089, !1112, !1113, !1114, !1057}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1033, line: 221, size: 32, align: 8, elements: !1034)
!1033 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1034 = !{!1035}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1032, file: !1033, line: 221, baseType: !1036, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1037, line: 51, baseType: !1038)
!1037 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1038 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1039 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !1033, line: 220, size: 64, align: 8, elements: !1043)
!1043 = !{!1044}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1042, file: !1033, line: 220, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1037, line: 55, baseType: !1046)
!1046 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1037, line: 40, baseType: !1048)
!1048 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1037, line: 48, baseType: !1050)
!1050 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "EbmlBin", file: !939, line: 110, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EbmlBin", file: !939, line: 105, size: 256, align: 64, elements: !1062)
!1062 = !{!1063, !1064, !1076, !1077}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1061, file: !939, line: 106, baseType: !1039, size: 32, align: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1061, file: !939, line: 107, baseType: !1065, size: 64, align: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1067, line: 94, baseType: !1068)
!1067 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1067, line: 81, size: 192, align: 64, elements: !1069)
!1069 = !{!1070, !1074, !1075}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1068, file: !1067, line: 82, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1067, line: 73, baseType: !1073)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1067, line: 73, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1068, file: !1067, line: 89, baseType: !1053, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1068, file: !1067, line: 93, baseType: !1039, size: 32, align: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !939, line: 108, baseType: !1053, size: 64, align: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1061, file: !939, line: 109, baseType: !1047, size: 64, align: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1033, line: 222, size: 16, align: 8, elements: !1082)
!1082 = !{!1083}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1081, file: !1033, line: 222, baseType: !1084, size: 16, align: 16)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1037, line: 49, baseType: !1085)
!1085 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVMasteringDisplayMetadata", file: !1091, line: 69, baseType: !1092)
!1091 = !DIFile(filename: "./libavutil/mastering_display_metadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVMasteringDisplayMetadata", file: !1091, line: 38, size: 704, align: 32, elements: !1093)
!1093 = !{!1094, !1105, !1108, !1109, !1110, !1111}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "display_primaries", scope: !1092, file: !1091, line: 42, baseType: !1095, size: 384, align: 32)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 384, align: 32, elements: !1102)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1097, line: 61, baseType: !1098)
!1097 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1097, line: 58, size: 64, align: 32, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1098, file: !1097, line: 59, baseType: !1039, size: 32, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1098, file: !1097, line: 60, baseType: !1039, size: 32, align: 32, offset: 32)
!1102 = !{!1103, !1104}
!1103 = !DISubrange(count: 3)
!1104 = !DISubrange(count: 2)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !1092, file: !1091, line: 47, baseType: !1106, size: 128, align: 32, offset: 384)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 128, align: 32, elements: !1107)
!1107 = !{!1104}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "min_luminance", scope: !1092, file: !1091, line: 52, baseType: !1096, size: 64, align: 32, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "max_luminance", scope: !1092, file: !1091, line: 57, baseType: !1096, size: 64, align: 32, offset: 576)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "has_primaries", scope: !1092, file: !1091, line: 62, baseType: !1039, size: 32, align: 32, offset: 640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "has_luminance", scope: !1092, file: !1091, line: 67, baseType: !1039, size: 32, align: 32, offset: 672)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !1037, line: 38, baseType: !1039)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1115 = !{!1116, !2385, !2386, !2388, !2482, !2485, !2487, !2488, !2492, !2493, !2494, !2498, !2502, !2506, !2508, !2512, !2514, !2515, !2516, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2530, !2531, !2532, !2533, !2534, !2535, !2539, !2540, !2541, !2542, !2547, !2552, !2553, !2554, !2555, !2556, !2557, !2558, !2559, !2560, !2561}
!1116 = distinct !DIGlobalVariable(name: "ff_matroska_demuxer", scope: !0, file: !939, line: 4039, type: !1117, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_matroska_demuxer)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1119)
!1119 = !{!1120, !1123, !1124, !1125, !1126, !1136, !1208, !1209, !1211, !1212, !1213, !1226, !2366, !2367, !2368, !2372, !2376, !2377, !2378, !2382, !2383, !2384}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1118, file: !919, line: 638, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1118, file: !919, line: 645, baseType: !1121, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !919, line: 652, baseType: !1039, size: 32, align: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1118, file: !919, line: 659, baseType: !1121, size: 64, align: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1118, file: !919, line: 661, baseType: !1127, size: 64, align: 64, offset: 256)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1129)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1132, line: 44, size: 64, align: 32, elements: !1133)
!1132 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1131, file: !1132, line: 45, baseType: !3, size: 32, align: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1131, file: !1132, line: 46, baseType: !1038, size: 32, align: 32, offset: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1118, file: !919, line: 663, baseType: !1137, size: 64, align: 64, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1141)
!1141 = !{!1142, !1143, !1147, !1167, !1168, !1169, !1170, !1174, !1180, !1182, !1186}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1140, file: !486, line: 72, baseType: !1121, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1140, file: !486, line: 78, baseType: !1144, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!1121, !1078}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1140, file: !486, line: 85, baseType: !1148, size: 64, align: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1151)
!1151 = !{!1152, !1153, !1154, !1155, !1156, !1163, !1164, !1165, !1166}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1150, file: !464, line: 247, baseType: !1121, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1150, file: !464, line: 253, baseType: !1121, size: 64, align: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1150, file: !464, line: 259, baseType: !1039, size: 32, align: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1150, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1150, file: !464, line: 271, baseType: !1157, size: 64, align: 64, offset: 192)
!1157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1150, file: !464, line: 265, size: 64, align: 64, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1157, file: !464, line: 266, baseType: !1047, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1157, file: !464, line: 267, baseType: !1057, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1157, file: !464, line: 268, baseType: !1121, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1157, file: !464, line: 270, baseType: !1096, size: 64, align: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1150, file: !464, line: 272, baseType: !1057, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1150, file: !464, line: 273, baseType: !1057, size: 64, align: 64, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1150, file: !464, line: 275, baseType: !1039, size: 32, align: 32, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1150, file: !464, line: 300, baseType: !1121, size: 64, align: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1140, file: !486, line: 93, baseType: !1039, size: 32, align: 32, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1140, file: !486, line: 99, baseType: !1039, size: 32, align: 32, offset: 224)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1140, file: !486, line: 108, baseType: !1039, size: 32, align: 32, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1140, file: !486, line: 113, baseType: !1171, size: 64, align: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DISubroutineType(types: !1173)
!1173 = !{!1078, !1078, !1078}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1140, file: !486, line: 123, baseType: !1175, size: 64, align: 64, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!1178, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1140, file: !486, line: 130, baseType: !1181, size: 32, align: 32, offset: 448)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1140, file: !486, line: 136, baseType: !1183, size: 64, align: 64, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!1181, !1078}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1140, file: !486, line: 142, baseType: !1187, size: 64, align: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!1039, !1190, !1078, !1121, !1039}
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1193)
!1193 = !{!1194, !1206, !1207}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1192, file: !464, line: 360, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1205}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1198, file: !464, line: 307, baseType: !1121, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1198, file: !464, line: 313, baseType: !1057, size: 64, align: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1198, file: !464, line: 313, baseType: !1057, size: 64, align: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1198, file: !464, line: 318, baseType: !1057, size: 64, align: 64, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1198, file: !464, line: 318, baseType: !1057, size: 64, align: 64, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1198, file: !464, line: 323, baseType: !1039, size: 32, align: 32, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1192, file: !464, line: 364, baseType: !1039, size: 32, align: 32, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1192, file: !464, line: 368, baseType: !1039, size: 32, align: 32, offset: 96)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1118, file: !919, line: 670, baseType: !1121, size: 64, align: 64, offset: 384)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1118, file: !919, line: 679, baseType: !1210, size: 64, align: 64, offset: 448)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1118, file: !919, line: 684, baseType: !1039, size: 32, align: 32, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1118, file: !919, line: 689, baseType: !1039, size: 32, align: 32, offset: 544)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1118, file: !919, line: 696, baseType: !1214, size: 64, align: 64, offset: 576)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!1039, !1217}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1220)
!1220 = !{!1221, !1222, !1224, !1225}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1219, file: !919, line: 449, baseType: !1121, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1219, file: !919, line: 450, baseType: !1223, size: 64, align: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1219, file: !919, line: 451, baseType: !1039, size: 32, align: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1219, file: !919, line: 452, baseType: !1121, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1118, file: !919, line: 703, baseType: !1227, size: 64, align: 64, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!1039, !1230}
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1232)
!1232 = !{!1233, !1234, !1235, !1410, !1411, !1474, !1475, !1476, !2223, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2277, !2278, !2279, !2280, !2281, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2332, !2333, !2336, !2337, !2338, !2339, !2340, !2341, !2343, !2344, !2345, !2346, !2354, !2355, !2359, !2363, !2364, !2365}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1231, file: !919, line: 1342, baseType: !1137, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1231, file: !919, line: 1349, baseType: !1210, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1231, file: !919, line: 1356, baseType: !1236, size: 64, align: 64, offset: 128)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1279, !1280, !1284, !1288, !1292, !1298, !1385, !1391, !1397, !1398, !1399, !1400, !1404}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1237, file: !919, line: 498, baseType: !1121, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1237, file: !919, line: 504, baseType: !1121, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1237, file: !919, line: 505, baseType: !1121, size: 64, align: 64, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1237, file: !919, line: 506, baseType: !1121, size: 64, align: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1237, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1237, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1237, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1237, file: !919, line: 517, baseType: !1039, size: 32, align: 32, offset: 352)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1237, file: !919, line: 523, baseType: !1127, size: 64, align: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1237, file: !919, line: 526, baseType: !1137, size: 64, align: 64, offset: 448)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1237, file: !919, line: 535, baseType: !1236, size: 64, align: 64, offset: 512)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1237, file: !919, line: 539, baseType: !1039, size: 32, align: 32, offset: 576)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1237, file: !919, line: 541, baseType: !1227, size: 64, align: 64, offset: 640)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1237, file: !919, line: 549, baseType: !1253, size: 64, align: 64, offset: 704)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!1039, !1230, !1256}
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1275, !1276, !1277, !1278}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1258, file: !4, line: 1451, baseType: !1065, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1258, file: !4, line: 1461, baseType: !1047, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1258, file: !4, line: 1467, baseType: !1047, size: 64, align: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1258, file: !4, line: 1468, baseType: !1053, size: 64, align: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1258, file: !4, line: 1469, baseType: !1039, size: 32, align: 32, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1258, file: !4, line: 1470, baseType: !1039, size: 32, align: 32, offset: 288)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1258, file: !4, line: 1474, baseType: !1039, size: 32, align: 32, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1258, file: !4, line: 1479, baseType: !1268, size: 64, align: 64, offset: 384)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1274}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1270, file: !4, line: 1412, baseType: !1053, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1270, file: !4, line: 1413, baseType: !1039, size: 32, align: 32, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1270, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1258, file: !4, line: 1480, baseType: !1039, size: 32, align: 32, offset: 448)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1258, file: !4, line: 1486, baseType: !1047, size: 64, align: 64, offset: 512)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1258, file: !4, line: 1488, baseType: !1047, size: 64, align: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1258, file: !4, line: 1497, baseType: !1047, size: 64, align: 64, offset: 640)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1237, file: !919, line: 550, baseType: !1227, size: 64, align: 64, offset: 768)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1237, file: !919, line: 554, baseType: !1281, size: 64, align: 64, offset: 832)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!1039, !1230, !1256, !1256, !1039}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1237, file: !919, line: 563, baseType: !1285, size: 64, align: 64, offset: 896)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!1039, !3, !1039}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1237, file: !919, line: 565, baseType: !1289, size: 64, align: 64, offset: 960)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{null, !1230, !1039, !1054, !1054}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1237, file: !919, line: 570, baseType: !1293, size: 64, align: 64, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1039, !1230, !1039, !1078, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1297, line: 216, baseType: !1046)
!1297 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1237, file: !919, line: 581, baseType: !1299, size: 64, align: 64, offset: 1088)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!1039, !1230, !1039, !1302, !1038}
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1306)
!1306 = !{!1307, !1311, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1339, !1341, !1342, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1305, file: !548, line: 282, baseType: !1308, size: 512, align: 64)
!1308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 512, align: 64, elements: !1309)
!1309 = !{!1310}
!1310 = !DISubrange(count: 8)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1305, file: !548, line: 299, baseType: !1312, size: 256, align: 32, offset: 512)
!1312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 256, align: 32, elements: !1309)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1305, file: !548, line: 315, baseType: !1058, size: 64, align: 64, offset: 768)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1305, file: !548, line: 326, baseType: !1039, size: 32, align: 32, offset: 832)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1305, file: !548, line: 326, baseType: !1039, size: 32, align: 32, offset: 864)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1305, file: !548, line: 334, baseType: !1039, size: 32, align: 32, offset: 896)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1305, file: !548, line: 341, baseType: !1039, size: 32, align: 32, offset: 928)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1305, file: !548, line: 346, baseType: !1039, size: 32, align: 32, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1305, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1305, file: !548, line: 356, baseType: !1096, size: 64, align: 32, offset: 1024)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1305, file: !548, line: 361, baseType: !1047, size: 64, align: 64, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1305, file: !548, line: 369, baseType: !1047, size: 64, align: 64, offset: 1152)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1305, file: !548, line: 377, baseType: !1047, size: 64, align: 64, offset: 1216)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1305, file: !548, line: 382, baseType: !1039, size: 32, align: 32, offset: 1280)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1305, file: !548, line: 386, baseType: !1039, size: 32, align: 32, offset: 1312)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1305, file: !548, line: 391, baseType: !1039, size: 32, align: 32, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1305, file: !548, line: 396, baseType: !1078, size: 64, align: 64, offset: 1408)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1305, file: !548, line: 403, baseType: !1329, size: 512, align: 64, offset: 1472)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 512, align: 64, elements: !1309)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1305, file: !548, line: 410, baseType: !1039, size: 32, align: 32, offset: 1984)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1305, file: !548, line: 415, baseType: !1039, size: 32, align: 32, offset: 2016)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1305, file: !548, line: 420, baseType: !1039, size: 32, align: 32, offset: 2048)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1305, file: !548, line: 425, baseType: !1039, size: 32, align: 32, offset: 2080)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1305, file: !548, line: 435, baseType: !1047, size: 64, align: 64, offset: 2112)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1305, file: !548, line: 440, baseType: !1039, size: 32, align: 32, offset: 2176)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1305, file: !548, line: 445, baseType: !1045, size: 64, align: 64, offset: 2240)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1305, file: !548, line: 459, baseType: !1338, size: 512, align: 64, offset: 2304)
!1338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 512, align: 64, elements: !1309)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1305, file: !548, line: 473, baseType: !1340, size: 64, align: 64, offset: 2816)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1305, file: !548, line: 477, baseType: !1039, size: 32, align: 32, offset: 2880)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1305, file: !548, line: 479, baseType: !1343, size: 64, align: 64, offset: 2944)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1350, !1351, !1356}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1346, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1346, file: !548, line: 203, baseType: !1053, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1346, file: !548, line: 204, baseType: !1039, size: 32, align: 32, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1346, file: !548, line: 205, baseType: !1352, size: 64, align: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1354, line: 86, baseType: !1355)
!1354 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1354, line: 86, flags: DIFlagFwdDecl)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1346, file: !548, line: 206, baseType: !1065, size: 64, align: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1305, file: !548, line: 480, baseType: !1039, size: 32, align: 32, offset: 3008)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1305, file: !548, line: 505, baseType: !1039, size: 32, align: 32, offset: 3040)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1305, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1305, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1305, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1305, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1305, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1305, file: !548, line: 532, baseType: !1047, size: 64, align: 64, offset: 3264)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1305, file: !548, line: 539, baseType: !1047, size: 64, align: 64, offset: 3328)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1305, file: !548, line: 547, baseType: !1047, size: 64, align: 64, offset: 3392)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1305, file: !548, line: 554, baseType: !1352, size: 64, align: 64, offset: 3456)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1305, file: !548, line: 563, baseType: !1039, size: 32, align: 32, offset: 3520)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1305, file: !548, line: 572, baseType: !1039, size: 32, align: 32, offset: 3552)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1305, file: !548, line: 581, baseType: !1039, size: 32, align: 32, offset: 3584)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1305, file: !548, line: 588, baseType: !1372, size: 64, align: 64, offset: 3648)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1037, line: 36, baseType: !1374)
!1374 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1305, file: !548, line: 593, baseType: !1039, size: 32, align: 32, offset: 3712)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1305, file: !548, line: 596, baseType: !1039, size: 32, align: 32, offset: 3744)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1305, file: !548, line: 599, baseType: !1065, size: 64, align: 64, offset: 3776)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1305, file: !548, line: 605, baseType: !1065, size: 64, align: 64, offset: 3840)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1305, file: !548, line: 616, baseType: !1065, size: 64, align: 64, offset: 3904)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1305, file: !548, line: 626, baseType: !1296, size: 64, align: 64, offset: 3968)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1305, file: !548, line: 627, baseType: !1296, size: 64, align: 64, offset: 4032)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1305, file: !548, line: 628, baseType: !1296, size: 64, align: 64, offset: 4096)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1305, file: !548, line: 629, baseType: !1296, size: 64, align: 64, offset: 4160)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1305, file: !548, line: 645, baseType: !1065, size: 64, align: 64, offset: 4224)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1237, file: !919, line: 587, baseType: !1386, size: 64, align: 64, offset: 1152)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{!1039, !1230, !1389}
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1237, file: !919, line: 592, baseType: !1392, size: 64, align: 64, offset: 1216)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!1039, !1230, !1395}
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1237, file: !919, line: 597, baseType: !1392, size: 64, align: 64, offset: 1280)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1237, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1237, file: !919, line: 608, baseType: !1227, size: 64, align: 64, offset: 1408)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1237, file: !919, line: 617, baseType: !1401, size: 64, align: 64, offset: 1472)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DISubroutineType(types: !1403)
!1403 = !{null, !1230}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1237, file: !919, line: 623, baseType: !1405, size: 64, align: 64, offset: 1536)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!1039, !1230, !1408}
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1231, file: !919, line: 1365, baseType: !1078, size: 64, align: 64, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1231, file: !919, line: 1379, baseType: !1412, size: 64, align: 64, offset: 256)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1421, !1422, !1426, !1427, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1441, !1442, !1446, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1471, !1472, !1473}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1414, file: !650, line: 174, baseType: !1137, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1414, file: !650, line: 226, baseType: !1223, size: 64, align: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1414, file: !650, line: 227, baseType: !1039, size: 32, align: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1414, file: !650, line: 228, baseType: !1223, size: 64, align: 64, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1414, file: !650, line: 229, baseType: !1223, size: 64, align: 64, offset: 256)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1414, file: !650, line: 233, baseType: !1078, size: 64, align: 64, offset: 320)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1414, file: !650, line: 235, baseType: !1423, size: 64, align: 64, offset: 384)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!1039, !1078, !1053, !1039}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1414, file: !650, line: 236, baseType: !1423, size: 64, align: 64, offset: 448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1414, file: !650, line: 237, baseType: !1428, size: 64, align: 64, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!1047, !1078, !1047, !1039}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1414, file: !650, line: 238, baseType: !1047, size: 64, align: 64, offset: 576)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1414, file: !650, line: 239, baseType: !1039, size: 32, align: 32, offset: 640)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1414, file: !650, line: 240, baseType: !1039, size: 32, align: 32, offset: 672)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1414, file: !650, line: 241, baseType: !1039, size: 32, align: 32, offset: 704)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1414, file: !650, line: 242, baseType: !1046, size: 64, align: 64, offset: 768)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1414, file: !650, line: 243, baseType: !1223, size: 64, align: 64, offset: 832)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1414, file: !650, line: 244, baseType: !1438, size: 64, align: 64, offset: 896)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!1046, !1046, !1087, !1038}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1414, file: !650, line: 245, baseType: !1039, size: 32, align: 32, offset: 960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1414, file: !650, line: 249, baseType: !1443, size: 64, align: 64, offset: 1024)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!1039, !1078, !1039}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1414, file: !650, line: 255, baseType: !1447, size: 64, align: 64, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!1047, !1078, !1039, !1047, !1039}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1414, file: !650, line: 260, baseType: !1039, size: 32, align: 32, offset: 1152)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1414, file: !650, line: 266, baseType: !1047, size: 64, align: 64, offset: 1216)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1414, file: !650, line: 273, baseType: !1039, size: 32, align: 32, offset: 1280)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1414, file: !650, line: 279, baseType: !1047, size: 64, align: 64, offset: 1344)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1414, file: !650, line: 285, baseType: !1039, size: 32, align: 32, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1414, file: !650, line: 291, baseType: !1039, size: 32, align: 32, offset: 1440)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1414, file: !650, line: 298, baseType: !1039, size: 32, align: 32, offset: 1472)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1414, file: !650, line: 304, baseType: !1039, size: 32, align: 32, offset: 1504)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1414, file: !650, line: 309, baseType: !1121, size: 64, align: 64, offset: 1536)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1414, file: !650, line: 314, baseType: !1121, size: 64, align: 64, offset: 1600)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1414, file: !650, line: 319, baseType: !1461, size: 64, align: 64, offset: 1664)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!1039, !1078, !1053, !1039, !649, !1047}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1414, file: !650, line: 326, baseType: !1039, size: 32, align: 32, offset: 1728)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1414, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1414, file: !650, line: 332, baseType: !1047, size: 64, align: 64, offset: 1792)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1414, file: !650, line: 338, baseType: !1468, size: 64, align: 64, offset: 1856)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!1039, !1078}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1414, file: !650, line: 340, baseType: !1047, size: 64, align: 64, offset: 1920)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1414, file: !650, line: 346, baseType: !1223, size: 64, align: 64, offset: 1984)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1414, file: !650, line: 351, baseType: !1039, size: 32, align: 32, offset: 2048)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1231, file: !919, line: 1386, baseType: !1039, size: 32, align: 32, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1231, file: !919, line: 1393, baseType: !1038, size: 32, align: 32, offset: 352)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1231, file: !919, line: 1405, baseType: !1477, size: 64, align: 64, offset: 384)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1481)
!1481 = !{!1482, !1483, !1484, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2148, !2154, !2155, !2159, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2191, !2192, !2193, !2194, !2195, !2196}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1480, file: !919, line: 866, baseType: !1039, size: 32, align: 32)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1480, file: !919, line: 872, baseType: !1039, size: 32, align: 32, offset: 32)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1480, file: !919, line: 878, baseType: !1485, size: 64, align: 64, offset: 64)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1487)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1488)
!1488 = !{!1489, !1490, !1491, !1492, !1630, !1631, !1632, !1633, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1786, !1790, !1791, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1970, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1487, file: !4, line: 1561, baseType: !1137, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1487, file: !4, line: 1562, baseType: !1039, size: 32, align: 32, offset: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1487, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1487, file: !4, line: 1565, baseType: !1493, size: 64, align: 64, offset: 128)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1495)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1496)
!1496 = !{!1497, !1498, !1499, !1500, !1501, !1502, !1505, !1508, !1511, !1514, !1517, !1518, !1519, !1527, !1528, !1529, !1531, !1535, !1541, !1550, !1554, !1555, !1595, !1602, !1606, !1607, !1611, !1615, !1619, !1623, !1624, !1625}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1495, file: !4, line: 3475, baseType: !1121, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1495, file: !4, line: 3480, baseType: !1121, size: 64, align: 64, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1495, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1495, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1495, file: !4, line: 3487, baseType: !1039, size: 32, align: 32, offset: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1495, file: !4, line: 3488, baseType: !1503, size: 64, align: 64, offset: 256)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1096)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1495, file: !4, line: 3489, baseType: !1506, size: 64, align: 64, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1495, file: !4, line: 3490, baseType: !1509, size: 64, align: 64, offset: 384)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1495, file: !4, line: 3491, baseType: !1512, size: 64, align: 64, offset: 448)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1495, file: !4, line: 3492, baseType: !1515, size: 64, align: 64, offset: 512)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1495, file: !4, line: 3493, baseType: !1049, size: 8, align: 8, offset: 576)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1495, file: !4, line: 3494, baseType: !1137, size: 64, align: 64, offset: 640)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1495, file: !4, line: 3495, baseType: !1520, size: 64, align: 64, offset: 704)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1523)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1524)
!1524 = !{!1525, !1526}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1523, file: !4, line: 3402, baseType: !1039, size: 32, align: 32)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1523, file: !4, line: 3403, baseType: !1121, size: 64, align: 64, offset: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1495, file: !4, line: 3507, baseType: !1121, size: 64, align: 64, offset: 768)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1495, file: !4, line: 3516, baseType: !1039, size: 32, align: 32, offset: 832)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1495, file: !4, line: 3517, baseType: !1530, size: 64, align: 64, offset: 896)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1495, file: !4, line: 3527, baseType: !1532, size: 64, align: 64, offset: 960)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DISubroutineType(types: !1534)
!1534 = !{!1039, !1485}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1495, file: !4, line: 3535, baseType: !1536, size: 64, align: 64, offset: 1024)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!1039, !1485, !1539}
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1495, file: !4, line: 3541, baseType: !1542, size: 64, align: 64, offset: 1088)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1544)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1546, line: 223, size: 128, align: 64, elements: !1547)
!1546 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1547 = !{!1548, !1549}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1545, file: !1546, line: 224, baseType: !1087, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1545, file: !1546, line: 225, baseType: !1087, size: 64, align: 64, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1495, file: !4, line: 3549, baseType: !1551, size: 64, align: 64, offset: 1152)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{null, !1530}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1495, file: !4, line: 3551, baseType: !1532, size: 64, align: 64, offset: 1216)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1495, file: !4, line: 3552, baseType: !1556, size: 64, align: 64, offset: 1280)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{!1039, !1485, !1053, !1039, !1559}
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1561)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566, !1567, !1594}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1561, file: !4, line: 3921, baseType: !1084, size: 16, align: 16)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1561, file: !4, line: 3922, baseType: !1036, size: 32, align: 32, offset: 32)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1561, file: !4, line: 3923, baseType: !1036, size: 32, align: 32, offset: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1561, file: !4, line: 3924, baseType: !1038, size: 32, align: 32, offset: 96)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1561, file: !4, line: 3925, baseType: !1568, size: 64, align: 64, offset: 128)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1576, !1577, !1578, !1584, !1588, !1590, !1591, !1592, !1593}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1571, file: !4, line: 3886, baseType: !1039, size: 32, align: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1571, file: !4, line: 3887, baseType: !1039, size: 32, align: 32, offset: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1571, file: !4, line: 3888, baseType: !1039, size: 32, align: 32, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1571, file: !4, line: 3889, baseType: !1039, size: 32, align: 32, offset: 96)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1571, file: !4, line: 3890, baseType: !1039, size: 32, align: 32, offset: 128)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1571, file: !4, line: 3897, baseType: !1579, size: 768, align: 64, offset: 192)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1581)
!1581 = !{!1582, !1583}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1580, file: !4, line: 3855, baseType: !1308, size: 512, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1580, file: !4, line: 3857, baseType: !1312, size: 256, align: 32, offset: 512)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1571, file: !4, line: 3903, baseType: !1585, size: 256, align: 64, offset: 960)
!1585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 256, align: 64, elements: !1586)
!1586 = !{!1587}
!1587 = !DISubrange(count: 4)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1571, file: !4, line: 3904, baseType: !1589, size: 128, align: 32, offset: 1216)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 128, align: 32, elements: !1586)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1571, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1571, file: !4, line: 3908, baseType: !1051, size: 64, align: 64, offset: 1408)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1571, file: !4, line: 3915, baseType: !1051, size: 64, align: 64, offset: 1472)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1571, file: !4, line: 3917, baseType: !1039, size: 32, align: 32, offset: 1536)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1561, file: !4, line: 3926, baseType: !1047, size: 64, align: 64, offset: 192)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1495, file: !4, line: 3564, baseType: !1596, size: 64, align: 64, offset: 1344)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!1039, !1485, !1256, !1599, !1601}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1304)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1495, file: !4, line: 3566, baseType: !1603, size: 64, align: 64, offset: 1408)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!1039, !1485, !1078, !1601, !1256}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1495, file: !4, line: 3567, baseType: !1532, size: 64, align: 64, offset: 1472)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1495, file: !4, line: 3576, baseType: !1608, size: 64, align: 64, offset: 1536)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{!1039, !1485, !1599}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1495, file: !4, line: 3577, baseType: !1612, size: 64, align: 64, offset: 1600)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!1039, !1485, !1256}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1495, file: !4, line: 3584, baseType: !1616, size: 64, align: 64, offset: 1664)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!1039, !1485, !1303}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1495, file: !4, line: 3589, baseType: !1620, size: 64, align: 64, offset: 1728)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{null, !1485}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1495, file: !4, line: 3594, baseType: !1039, size: 32, align: 32, offset: 1792)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1495, file: !4, line: 3600, baseType: !1121, size: 64, align: 64, offset: 1856)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1495, file: !4, line: 3609, baseType: !1626, size: 64, align: 64, offset: 1920)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1629)
!1629 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1487, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1487, file: !4, line: 1581, baseType: !1038, size: 32, align: 32, offset: 224)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1487, file: !4, line: 1583, baseType: !1078, size: 64, align: 64, offset: 256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1487, file: !4, line: 1591, baseType: !1634, size: 64, align: 64, offset: 320)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1546, line: 129, size: 1664, align: 64, elements: !1636)
!1636 = !{!1637, !1638, !1639, !1640, !1641, !1659, !1660, !1666, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1635, file: !1546, line: 136, baseType: !1039, size: 32, align: 32)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1635, file: !1546, line: 151, baseType: !1039, size: 32, align: 32, offset: 32)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1635, file: !1546, line: 157, baseType: !1039, size: 32, align: 32, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1635, file: !1546, line: 159, baseType: !1303, size: 64, align: 64, offset: 128)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1635, file: !1546, line: 161, baseType: !1642, size: 64, align: 64, offset: 192)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1546, line: 117, baseType: !1644)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1546, line: 100, size: 832, align: 64, elements: !1645)
!1645 = !{!1646, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1644, file: !1546, line: 105, baseType: !1647, size: 256, align: 64)
!1647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1648, size: 256, align: 64, elements: !1586)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1067, line: 238, baseType: !1650)
!1650 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1067, line: 238, flags: DIFlagFwdDecl)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1644, file: !1546, line: 110, baseType: !1039, size: 32, align: 32, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1644, file: !1546, line: 111, baseType: !1039, size: 32, align: 32, offset: 288)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1644, file: !1546, line: 111, baseType: !1039, size: 32, align: 32, offset: 320)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1644, file: !1546, line: 112, baseType: !1312, size: 256, align: 32, offset: 352)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1644, file: !1546, line: 113, baseType: !1589, size: 128, align: 32, offset: 608)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1644, file: !1546, line: 114, baseType: !1039, size: 32, align: 32, offset: 736)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1644, file: !1546, line: 115, baseType: !1039, size: 32, align: 32, offset: 768)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1644, file: !1546, line: 116, baseType: !1039, size: 32, align: 32, offset: 800)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1635, file: !1546, line: 163, baseType: !1078, size: 64, align: 64, offset: 256)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1635, file: !1546, line: 165, baseType: !1661, size: 128, align: 64, offset: 320)
!1661 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1546, line: 122, baseType: !1662)
!1662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1546, line: 119, size: 128, align: 64, elements: !1663)
!1663 = !{!1664, !1665}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1662, file: !1546, line: 120, baseType: !1256, size: 64, align: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1662, file: !1546, line: 121, baseType: !1303, size: 64, align: 64, offset: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1635, file: !1546, line: 166, baseType: !1667, size: 128, align: 64, offset: 448)
!1667 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1546, line: 127, baseType: !1668)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1546, line: 124, size: 128, align: 64, elements: !1669)
!1669 = !{!1670, !1743}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1668, file: !1546, line: 125, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1674)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1675)
!1675 = !{!1676, !1677, !1701, !1705, !1706, !1740, !1741, !1742}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1674, file: !4, line: 5751, baseType: !1137, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1674, file: !4, line: 5756, baseType: !1678, size: 64, align: 64, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1681)
!1681 = !{!1682, !1683, !1686, !1687, !1688, !1692, !1696, !1700}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1680, file: !4, line: 5797, baseType: !1121, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1680, file: !4, line: 5804, baseType: !1684, size: 64, align: 64, offset: 64)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1680, file: !4, line: 5815, baseType: !1137, size: 64, align: 64, offset: 128)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1680, file: !4, line: 5825, baseType: !1039, size: 32, align: 32, offset: 192)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1680, file: !4, line: 5826, baseType: !1689, size: 64, align: 64, offset: 256)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!1039, !1672}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1680, file: !4, line: 5827, baseType: !1693, size: 64, align: 64, offset: 320)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!1039, !1672, !1256}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1680, file: !4, line: 5828, baseType: !1697, size: 64, align: 64, offset: 384)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{null, !1672}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1680, file: !4, line: 5829, baseType: !1697, size: 64, align: 64, offset: 448)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1674, file: !4, line: 5762, baseType: !1702, size: 64, align: 64, offset: 128)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1704)
!1704 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1674, file: !4, line: 5768, baseType: !1078, size: 64, align: 64, offset: 192)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1674, file: !4, line: 5775, baseType: !1707, size: 64, align: 64, offset: 256)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1709)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1710)
!1710 = !{!1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1709, file: !4, line: 3940, baseType: !658, size: 32, align: 32)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1709, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1709, file: !4, line: 3948, baseType: !1036, size: 32, align: 32, offset: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1709, file: !4, line: 3958, baseType: !1053, size: 64, align: 64, offset: 128)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1709, file: !4, line: 3962, baseType: !1039, size: 32, align: 32, offset: 192)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1709, file: !4, line: 3968, baseType: !1039, size: 32, align: 32, offset: 224)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1709, file: !4, line: 3973, baseType: !1047, size: 64, align: 64, offset: 256)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1709, file: !4, line: 3986, baseType: !1039, size: 32, align: 32, offset: 320)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1709, file: !4, line: 3999, baseType: !1039, size: 32, align: 32, offset: 352)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1709, file: !4, line: 4004, baseType: !1039, size: 32, align: 32, offset: 384)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1709, file: !4, line: 4005, baseType: !1039, size: 32, align: 32, offset: 416)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1709, file: !4, line: 4010, baseType: !1039, size: 32, align: 32, offset: 448)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1709, file: !4, line: 4011, baseType: !1039, size: 32, align: 32, offset: 480)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1709, file: !4, line: 4020, baseType: !1096, size: 64, align: 32, offset: 512)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1709, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1709, file: !4, line: 4030, baseType: !571, size: 32, align: 32, offset: 608)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1709, file: !4, line: 4031, baseType: !578, size: 32, align: 32, offset: 640)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1709, file: !4, line: 4032, baseType: !596, size: 32, align: 32, offset: 672)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1709, file: !4, line: 4033, baseType: !620, size: 32, align: 32, offset: 704)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1709, file: !4, line: 4034, baseType: !639, size: 32, align: 32, offset: 736)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1709, file: !4, line: 4039, baseType: !1039, size: 32, align: 32, offset: 768)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1709, file: !4, line: 4046, baseType: !1045, size: 64, align: 64, offset: 832)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1709, file: !4, line: 4050, baseType: !1039, size: 32, align: 32, offset: 896)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1709, file: !4, line: 4054, baseType: !1039, size: 32, align: 32, offset: 928)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1709, file: !4, line: 4061, baseType: !1039, size: 32, align: 32, offset: 960)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1709, file: !4, line: 4065, baseType: !1039, size: 32, align: 32, offset: 992)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1709, file: !4, line: 4073, baseType: !1039, size: 32, align: 32, offset: 1024)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1709, file: !4, line: 4080, baseType: !1039, size: 32, align: 32, offset: 1056)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1709, file: !4, line: 4084, baseType: !1039, size: 32, align: 32, offset: 1088)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1674, file: !4, line: 5781, baseType: !1707, size: 64, align: 64, offset: 320)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1674, file: !4, line: 5787, baseType: !1096, size: 64, align: 32, offset: 384)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1674, file: !4, line: 5793, baseType: !1096, size: 64, align: 32, offset: 448)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1668, file: !1546, line: 126, baseType: !1039, size: 32, align: 32, offset: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1635, file: !1546, line: 172, baseType: !1256, size: 64, align: 64, offset: 576)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1635, file: !1546, line: 177, baseType: !1053, size: 64, align: 64, offset: 640)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1635, file: !1546, line: 178, baseType: !1038, size: 32, align: 32, offset: 704)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1635, file: !1546, line: 180, baseType: !1078, size: 64, align: 64, offset: 768)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1635, file: !1546, line: 185, baseType: !1039, size: 32, align: 32, offset: 832)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1635, file: !1546, line: 190, baseType: !1078, size: 64, align: 64, offset: 896)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1635, file: !1546, line: 195, baseType: !1039, size: 32, align: 32, offset: 960)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1635, file: !1546, line: 200, baseType: !1256, size: 64, align: 64, offset: 1024)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1635, file: !1546, line: 201, baseType: !1039, size: 32, align: 32, offset: 1088)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1635, file: !1546, line: 202, baseType: !1303, size: 64, align: 64, offset: 1152)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1635, file: !1546, line: 203, baseType: !1039, size: 32, align: 32, offset: 1216)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1635, file: !1546, line: 205, baseType: !1039, size: 32, align: 32, offset: 1248)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1635, file: !1546, line: 206, baseType: !1039, size: 32, align: 32, offset: 1280)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1635, file: !1546, line: 209, baseType: !1296, size: 64, align: 64, offset: 1344)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1635, file: !1546, line: 212, baseType: !1296, size: 64, align: 64, offset: 1408)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1635, file: !1546, line: 213, baseType: !1303, size: 64, align: 64, offset: 1472)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1635, file: !1546, line: 215, baseType: !1039, size: 32, align: 32, offset: 1536)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1635, file: !1546, line: 217, baseType: !1039, size: 32, align: 32, offset: 1568)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1635, file: !1546, line: 220, baseType: !1039, size: 32, align: 32, offset: 1600)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1487, file: !4, line: 1598, baseType: !1078, size: 64, align: 64, offset: 384)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1487, file: !4, line: 1606, baseType: !1047, size: 64, align: 64, offset: 448)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1487, file: !4, line: 1614, baseType: !1039, size: 32, align: 32, offset: 512)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1487, file: !4, line: 1622, baseType: !1039, size: 32, align: 32, offset: 544)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1487, file: !4, line: 1628, baseType: !1039, size: 32, align: 32, offset: 576)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1487, file: !4, line: 1636, baseType: !1039, size: 32, align: 32, offset: 608)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1487, file: !4, line: 1643, baseType: !1039, size: 32, align: 32, offset: 640)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1487, file: !4, line: 1657, baseType: !1053, size: 64, align: 64, offset: 704)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1487, file: !4, line: 1658, baseType: !1039, size: 32, align: 32, offset: 768)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1487, file: !4, line: 1679, baseType: !1096, size: 64, align: 32, offset: 800)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1487, file: !4, line: 1688, baseType: !1039, size: 32, align: 32, offset: 864)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1487, file: !4, line: 1712, baseType: !1039, size: 32, align: 32, offset: 896)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1487, file: !4, line: 1729, baseType: !1039, size: 32, align: 32, offset: 928)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1487, file: !4, line: 1729, baseType: !1039, size: 32, align: 32, offset: 960)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1487, file: !4, line: 1744, baseType: !1039, size: 32, align: 32, offset: 992)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1487, file: !4, line: 1744, baseType: !1039, size: 32, align: 32, offset: 1024)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1487, file: !4, line: 1751, baseType: !1039, size: 32, align: 32, offset: 1056)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1487, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1487, file: !4, line: 1791, baseType: !1782, size: 64, align: 64, offset: 1152)
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64, align: 64)
!1783 = !DISubroutineType(types: !1784)
!1784 = !{null, !1785, !1599, !1601, !1039, !1039, !1039}
!1785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1487, file: !4, line: 1808, baseType: !1787, size: 64, align: 64, offset: 1216)
!1787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1788, size: 64, align: 64)
!1788 = !DISubroutineType(types: !1789)
!1789 = !{!667, !1785, !1506}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1487, file: !4, line: 1816, baseType: !1039, size: 32, align: 32, offset: 1280)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1487, file: !4, line: 1825, baseType: !1792, size: 32, align: 32, offset: 1312)
!1792 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1487, file: !4, line: 1830, baseType: !1039, size: 32, align: 32, offset: 1344)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1487, file: !4, line: 1838, baseType: !1792, size: 32, align: 32, offset: 1376)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1487, file: !4, line: 1846, baseType: !1039, size: 32, align: 32, offset: 1408)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1487, file: !4, line: 1851, baseType: !1039, size: 32, align: 32, offset: 1440)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1487, file: !4, line: 1861, baseType: !1792, size: 32, align: 32, offset: 1472)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1487, file: !4, line: 1868, baseType: !1792, size: 32, align: 32, offset: 1504)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1487, file: !4, line: 1875, baseType: !1792, size: 32, align: 32, offset: 1536)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1487, file: !4, line: 1882, baseType: !1792, size: 32, align: 32, offset: 1568)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1487, file: !4, line: 1889, baseType: !1792, size: 32, align: 32, offset: 1600)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1487, file: !4, line: 1896, baseType: !1792, size: 32, align: 32, offset: 1632)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1487, file: !4, line: 1903, baseType: !1792, size: 32, align: 32, offset: 1664)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1487, file: !4, line: 1910, baseType: !1039, size: 32, align: 32, offset: 1696)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1487, file: !4, line: 1915, baseType: !1039, size: 32, align: 32, offset: 1728)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1487, file: !4, line: 1926, baseType: !1601, size: 64, align: 64, offset: 1792)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1487, file: !4, line: 1935, baseType: !1096, size: 64, align: 32, offset: 1856)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1487, file: !4, line: 1942, baseType: !1039, size: 32, align: 32, offset: 1920)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1487, file: !4, line: 1948, baseType: !1039, size: 32, align: 32, offset: 1952)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1487, file: !4, line: 1954, baseType: !1039, size: 32, align: 32, offset: 1984)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1487, file: !4, line: 1960, baseType: !1039, size: 32, align: 32, offset: 2016)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1487, file: !4, line: 1984, baseType: !1039, size: 32, align: 32, offset: 2048)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1487, file: !4, line: 1991, baseType: !1039, size: 32, align: 32, offset: 2080)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1487, file: !4, line: 1996, baseType: !1039, size: 32, align: 32, offset: 2112)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1487, file: !4, line: 2004, baseType: !1039, size: 32, align: 32, offset: 2144)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1487, file: !4, line: 2011, baseType: !1039, size: 32, align: 32, offset: 2176)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1487, file: !4, line: 2018, baseType: !1039, size: 32, align: 32, offset: 2208)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1487, file: !4, line: 2027, baseType: !1039, size: 32, align: 32, offset: 2240)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1487, file: !4, line: 2034, baseType: !1039, size: 32, align: 32, offset: 2272)
