; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--nsvdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--nsvdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "NSVStatus", file: !917, line: 142, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/nsvdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926}
!919 = !DIEnumerator(name: "NSV_UNSYNC", value: 0)
!920 = !DIEnumerator(name: "NSV_FOUND_NSVF", value: 1)
!921 = !DIEnumerator(name: "NSV_HAS_READ_NSVF", value: 2)
!922 = !DIEnumerator(name: "NSV_FOUND_NSVS", value: 3)
!923 = !DIEnumerator(name: "NSV_HAS_READ_NSVS", value: 4)
!924 = !DIEnumerator(name: "NSV_FOUND_BEEF", value: 5)
!925 = !DIEnumerator(name: "NSV_GOT_VIDEO", value: 6)
!926 = !DIEnumerator(name: "NSV_GOT_AUDIO", value: 7)
!927 = !{!928, !937, !941, !936, !934, !948, !951, !952, !954}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !931, line: 221, size: 32, align: 8, elements: !932)
!931 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !930, file: !931, line: 221, baseType: !934, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !935, line: 51, baseType: !936)
!935 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !935, line: 48, baseType: !940)
!940 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !931, line: 222, size: 16, align: 8, elements: !944)
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !943, file: !931, line: 222, baseType: !946, size: 16, align: 16)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !935, line: 49, baseType: !947)
!947 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !949, line: 216, baseType: !950)
!949 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!951 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !935, line: 40, baseType: !953)
!953 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "NSVStream", file: !917, line: 163, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NSVStream", file: !917, line: 153, size: 224, align: 32, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !964}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !956, file: !917, line: 154, baseType: !951, size: 32, align: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !956, file: !917, line: 156, baseType: !951, size: 32, align: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !956, file: !917, line: 157, baseType: !951, size: 32, align: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !956, file: !917, line: 158, baseType: !951, size: 32, align: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !956, file: !917, line: 159, baseType: !951, size: 32, align: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "new_frame_offset", scope: !956, file: !917, line: 161, baseType: !951, size: 32, align: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "cum_len", scope: !956, file: !917, line: 162, baseType: !951, size: 32, align: 32, offset: 192)
!965 = !{!966, !2169, !2175}
!966 = distinct !DIGlobalVariable(name: "ff_nsv_demuxer", scope: !0, file: !917, line: 731, type: !967, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_nsv_demuxer)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !969)
!969 = !{!970, !974, !975, !976, !977, !987, !1029, !1030, !1032, !1033, !1034, !1047, !2150, !2151, !2152, !2156, !2160, !2161, !2162, !2166, !2167, !2168}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !897, line: 638, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !968, file: !897, line: 645, baseType: !971, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !968, file: !897, line: 652, baseType: !951, size: 32, align: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !968, file: !897, line: 659, baseType: !971, size: 64, align: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !968, file: !897, line: 661, baseType: !978, size: 64, align: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !983, line: 44, size: 64, align: 32, elements: !984)
!983 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !982, file: !983, line: 45, baseType: !3, size: 32, align: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !982, file: !983, line: 46, baseType: !936, size: 32, align: 32, offset: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !968, file: !897, line: 663, baseType: !988, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !992)
!992 = !{!993, !994, !999, !1003, !1004, !1005, !1006, !1010, !1016, !1018, !1022}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !991, file: !464, line: 72, baseType: !971, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !991, file: !464, line: 78, baseType: !995, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!971, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !991, file: !464, line: 85, baseType: !1000, size: 64, align: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !991, file: !464, line: 93, baseType: !951, size: 32, align: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !991, file: !464, line: 99, baseType: !951, size: 32, align: 32, offset: 224)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !991, file: !464, line: 108, baseType: !951, size: 32, align: 32, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !991, file: !464, line: 113, baseType: !1007, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!998, !998, !998}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !991, file: !464, line: 123, baseType: !1011, size: 64, align: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!1014, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !991, file: !464, line: 130, baseType: !1017, size: 32, align: 32, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !991, file: !464, line: 136, baseType: !1019, size: 64, align: 64, offset: 512)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1017, !998}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !991, file: !464, line: 142, baseType: !1023, size: 64, align: 64, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!951, !1026, !998, !971, !951}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !968, file: !897, line: 670, baseType: !971, size: 64, align: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !968, file: !897, line: 679, baseType: !1031, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !968, file: !897, line: 684, baseType: !951, size: 32, align: 32, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !968, file: !897, line: 689, baseType: !951, size: 32, align: 32, offset: 544)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !968, file: !897, line: 696, baseType: !1035, size: 64, align: 64, offset: 576)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!951, !1038}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1041)
!1041 = !{!1042, !1043, !1045, !1046}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1040, file: !897, line: 449, baseType: !971, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1040, file: !897, line: 450, baseType: !1044, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1040, file: !897, line: 451, baseType: !951, size: 32, align: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1040, file: !897, line: 452, baseType: !971, size: 64, align: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !968, file: !897, line: 703, baseType: !1048, size: 64, align: 64, offset: 640)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!951, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1250, !1251, !1314, !1315, !1316, !2007, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2061, !2062, !2063, !2064, !2065, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2116, !2117, !2120, !2121, !2122, !2123, !2124, !2125, !2127, !2128, !2129, !2130, !2138, !2139, !2143, !2147, !2148, !2149}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1052, file: !897, line: 1342, baseType: !988, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1052, file: !897, line: 1349, baseType: !1031, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1052, file: !897, line: 1356, baseType: !1057, size: 64, align: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1112, !1113, !1117, !1121, !1126, !1130, !1225, !1231, !1237, !1238, !1239, !1240, !1244}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1058, file: !897, line: 498, baseType: !971, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1058, file: !897, line: 504, baseType: !971, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1058, file: !897, line: 505, baseType: !971, size: 64, align: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1058, file: !897, line: 506, baseType: !971, size: 64, align: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1058, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1058, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1058, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !897, line: 517, baseType: !951, size: 32, align: 32, offset: 352)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1058, file: !897, line: 523, baseType: !978, size: 64, align: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1058, file: !897, line: 526, baseType: !988, size: 64, align: 64, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1058, file: !897, line: 535, baseType: !1057, size: 64, align: 64, offset: 512)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1058, file: !897, line: 539, baseType: !951, size: 32, align: 32, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1058, file: !897, line: 541, baseType: !1048, size: 64, align: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1058, file: !897, line: 549, baseType: !1074, size: 64, align: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!951, !1051, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1080)
!1080 = !{!1081, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1108, !1109, !1110, !1111}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1079, file: !4, line: 1451, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1084, line: 94, baseType: !1085)
!1084 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1084, line: 81, size: 192, align: 64, elements: !1086)
!1086 = !{!1087, !1091, !1093}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1085, file: !1084, line: 82, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1084, line: 73, baseType: !1090)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1084, line: 73, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1085, file: !1084, line: 89, baseType: !1092, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1085, file: !1084, line: 93, baseType: !951, size: 32, align: 32, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1079, file: !4, line: 1461, baseType: !952, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1079, file: !4, line: 1467, baseType: !952, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !4, line: 1468, baseType: !1092, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1079, file: !4, line: 1469, baseType: !951, size: 32, align: 32, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1079, file: !4, line: 1470, baseType: !951, size: 32, align: 32, offset: 288)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1079, file: !4, line: 1474, baseType: !951, size: 32, align: 32, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1079, file: !4, line: 1479, baseType: !1101, size: 64, align: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1103, file: !4, line: 1412, baseType: !1092, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !4, line: 1413, baseType: !951, size: 32, align: 32, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1103, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1079, file: !4, line: 1480, baseType: !951, size: 32, align: 32, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1079, file: !4, line: 1486, baseType: !952, size: 64, align: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1079, file: !4, line: 1488, baseType: !952, size: 64, align: 64, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1079, file: !4, line: 1497, baseType: !952, size: 64, align: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1058, file: !897, line: 550, baseType: !1048, size: 64, align: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1058, file: !897, line: 554, baseType: !1114, size: 64, align: 64, offset: 832)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!951, !1051, !1077, !1077, !951}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1058, file: !897, line: 563, baseType: !1118, size: 64, align: 64, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!951, !3, !951}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1058, file: !897, line: 565, baseType: !1122, size: 64, align: 64, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !1051, !951, !1125, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1058, file: !897, line: 570, baseType: !1127, size: 64, align: 64, offset: 1024)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!951, !1051, !951, !998, !948}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1058, file: !897, line: 581, baseType: !1131, size: 64, align: 64, offset: 1088)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!951, !1051, !951, !1134, !936}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1138)
!1138 = !{!1139, !1143, !1145, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1179, !1181, !1182, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1137, file: !526, line: 282, baseType: !1140, size: 512, align: 64)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 512, align: 64, elements: !1141)
!1141 = !{!1142}
!1142 = !DISubrange(count: 8)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1137, file: !526, line: 299, baseType: !1144, size: 256, align: 32, offset: 512)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 256, align: 32, elements: !1141)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1137, file: !526, line: 315, baseType: !1146, size: 64, align: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1137, file: !526, line: 326, baseType: !951, size: 32, align: 32, offset: 832)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1137, file: !526, line: 326, baseType: !951, size: 32, align: 32, offset: 864)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1137, file: !526, line: 334, baseType: !951, size: 32, align: 32, offset: 896)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1137, file: !526, line: 341, baseType: !951, size: 32, align: 32, offset: 928)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1137, file: !526, line: 346, baseType: !951, size: 32, align: 32, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1137, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1137, file: !526, line: 356, baseType: !1154, size: 64, align: 32, offset: 1024)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1155, line: 61, baseType: !1156)
!1155 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1155, line: 58, size: 64, align: 32, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1156, file: !1155, line: 59, baseType: !951, size: 32, align: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1156, file: !1155, line: 60, baseType: !951, size: 32, align: 32, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1137, file: !526, line: 361, baseType: !952, size: 64, align: 64, offset: 1088)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1137, file: !526, line: 369, baseType: !952, size: 64, align: 64, offset: 1152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1137, file: !526, line: 377, baseType: !952, size: 64, align: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1137, file: !526, line: 382, baseType: !951, size: 32, align: 32, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1137, file: !526, line: 386, baseType: !951, size: 32, align: 32, offset: 1312)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1137, file: !526, line: 391, baseType: !951, size: 32, align: 32, offset: 1344)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1137, file: !526, line: 396, baseType: !998, size: 64, align: 64, offset: 1408)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1137, file: !526, line: 403, baseType: !1168, size: 512, align: 64, offset: 1472)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1169, size: 512, align: 64, elements: !1141)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !935, line: 55, baseType: !950)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1137, file: !526, line: 410, baseType: !951, size: 32, align: 32, offset: 1984)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1137, file: !526, line: 415, baseType: !951, size: 32, align: 32, offset: 2016)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1137, file: !526, line: 420, baseType: !951, size: 32, align: 32, offset: 2048)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1137, file: !526, line: 425, baseType: !951, size: 32, align: 32, offset: 2080)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1137, file: !526, line: 435, baseType: !952, size: 64, align: 64, offset: 2112)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1137, file: !526, line: 440, baseType: !951, size: 32, align: 32, offset: 2176)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1137, file: !526, line: 445, baseType: !1169, size: 64, align: 64, offset: 2240)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1137, file: !526, line: 459, baseType: !1178, size: 512, align: 64, offset: 2304)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 512, align: 64, elements: !1141)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1137, file: !526, line: 473, baseType: !1180, size: 64, align: 64, offset: 2816)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1137, file: !526, line: 477, baseType: !951, size: 32, align: 32, offset: 2880)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1137, file: !526, line: 479, baseType: !1183, size: 64, align: 64, offset: 2944)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1187)
!1187 = !{!1188, !1189, !1190, !1191, !1196}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1186, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !526, line: 203, baseType: !1092, size: 64, align: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1186, file: !526, line: 204, baseType: !951, size: 32, align: 32, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1186, file: !526, line: 205, baseType: !1192, size: 64, align: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1194, line: 86, baseType: !1195)
!1194 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1195 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1194, line: 86, flags: DIFlagFwdDecl)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1186, file: !526, line: 206, baseType: !1082, size: 64, align: 64, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1137, file: !526, line: 480, baseType: !951, size: 32, align: 32, offset: 3008)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1137, file: !526, line: 505, baseType: !951, size: 32, align: 32, offset: 3040)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1137, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1137, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1137, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1137, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1137, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1137, file: !526, line: 532, baseType: !952, size: 64, align: 64, offset: 3264)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1137, file: !526, line: 539, baseType: !952, size: 64, align: 64, offset: 3328)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1137, file: !526, line: 547, baseType: !952, size: 64, align: 64, offset: 3392)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1137, file: !526, line: 554, baseType: !1192, size: 64, align: 64, offset: 3456)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1137, file: !526, line: 563, baseType: !951, size: 32, align: 32, offset: 3520)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1137, file: !526, line: 572, baseType: !951, size: 32, align: 32, offset: 3552)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1137, file: !526, line: 581, baseType: !951, size: 32, align: 32, offset: 3584)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1137, file: !526, line: 588, baseType: !1212, size: 64, align: 64, offset: 3648)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !935, line: 36, baseType: !1214)
!1214 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1137, file: !526, line: 593, baseType: !951, size: 32, align: 32, offset: 3712)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1137, file: !526, line: 596, baseType: !951, size: 32, align: 32, offset: 3744)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1137, file: !526, line: 599, baseType: !1082, size: 64, align: 64, offset: 3776)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1137, file: !526, line: 605, baseType: !1082, size: 64, align: 64, offset: 3840)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1137, file: !526, line: 616, baseType: !1082, size: 64, align: 64, offset: 3904)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1137, file: !526, line: 626, baseType: !948, size: 64, align: 64, offset: 3968)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1137, file: !526, line: 627, baseType: !948, size: 64, align: 64, offset: 4032)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1137, file: !526, line: 628, baseType: !948, size: 64, align: 64, offset: 4096)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1137, file: !526, line: 629, baseType: !948, size: 64, align: 64, offset: 4160)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1137, file: !526, line: 645, baseType: !1082, size: 64, align: 64, offset: 4224)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1058, file: !897, line: 587, baseType: !1226, size: 64, align: 64, offset: 1152)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!951, !1051, !1229}
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1058, file: !897, line: 592, baseType: !1232, size: 64, align: 64, offset: 1216)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!951, !1051, !1235}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1058, file: !897, line: 597, baseType: !1232, size: 64, align: 64, offset: 1280)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1058, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1058, file: !897, line: 608, baseType: !1048, size: 64, align: 64, offset: 1408)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1058, file: !897, line: 617, baseType: !1241, size: 64, align: 64, offset: 1472)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{null, !1051}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1058, file: !897, line: 623, baseType: !1245, size: 64, align: 64, offset: 1536)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!951, !1051, !1248}
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1052, file: !897, line: 1365, baseType: !998, size: 64, align: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1052, file: !897, line: 1379, baseType: !1252, size: 64, align: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260, !1261, !1262, !1266, !1267, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1281, !1282, !1286, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304, !1305, !1306, !1307, !1311, !1312, !1313}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1254, file: !628, line: 174, baseType: !988, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1254, file: !628, line: 226, baseType: !1044, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1254, file: !628, line: 227, baseType: !951, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1254, file: !628, line: 228, baseType: !1044, size: 64, align: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1254, file: !628, line: 229, baseType: !1044, size: 64, align: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1254, file: !628, line: 233, baseType: !998, size: 64, align: 64, offset: 320)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1254, file: !628, line: 235, baseType: !1263, size: 64, align: 64, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!951, !998, !1092, !951}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1254, file: !628, line: 236, baseType: !1263, size: 64, align: 64, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1254, file: !628, line: 237, baseType: !1268, size: 64, align: 64, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!952, !998, !952, !951}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1254, file: !628, line: 238, baseType: !952, size: 64, align: 64, offset: 576)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1254, file: !628, line: 239, baseType: !951, size: 32, align: 32, offset: 640)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1254, file: !628, line: 240, baseType: !951, size: 32, align: 32, offset: 672)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1254, file: !628, line: 241, baseType: !951, size: 32, align: 32, offset: 704)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1254, file: !628, line: 242, baseType: !950, size: 64, align: 64, offset: 768)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1254, file: !628, line: 243, baseType: !1044, size: 64, align: 64, offset: 832)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1254, file: !628, line: 244, baseType: !1278, size: 64, align: 64, offset: 896)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!950, !950, !937, !936}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1254, file: !628, line: 245, baseType: !951, size: 32, align: 32, offset: 960)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1254, file: !628, line: 249, baseType: !1283, size: 64, align: 64, offset: 1024)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!951, !998, !951}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1254, file: !628, line: 255, baseType: !1287, size: 64, align: 64, offset: 1088)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!952, !998, !951, !952, !951}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1254, file: !628, line: 260, baseType: !951, size: 32, align: 32, offset: 1152)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1254, file: !628, line: 266, baseType: !952, size: 64, align: 64, offset: 1216)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1254, file: !628, line: 273, baseType: !951, size: 32, align: 32, offset: 1280)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1254, file: !628, line: 279, baseType: !952, size: 64, align: 64, offset: 1344)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1254, file: !628, line: 285, baseType: !951, size: 32, align: 32, offset: 1408)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1254, file: !628, line: 291, baseType: !951, size: 32, align: 32, offset: 1440)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1254, file: !628, line: 298, baseType: !951, size: 32, align: 32, offset: 1472)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1254, file: !628, line: 304, baseType: !951, size: 32, align: 32, offset: 1504)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1254, file: !628, line: 309, baseType: !971, size: 64, align: 64, offset: 1536)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1254, file: !628, line: 314, baseType: !971, size: 64, align: 64, offset: 1600)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1254, file: !628, line: 319, baseType: !1301, size: 64, align: 64, offset: 1664)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!951, !998, !1092, !951, !627, !952}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1254, file: !628, line: 326, baseType: !951, size: 32, align: 32, offset: 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1254, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1254, file: !628, line: 332, baseType: !952, size: 64, align: 64, offset: 1792)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1254, file: !628, line: 338, baseType: !1308, size: 64, align: 64, offset: 1856)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!951, !998}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1254, file: !628, line: 340, baseType: !952, size: 64, align: 64, offset: 1920)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1254, file: !628, line: 346, baseType: !1044, size: 64, align: 64, offset: 1984)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1254, file: !628, line: 351, baseType: !951, size: 32, align: 32, offset: 2048)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1052, file: !897, line: 1386, baseType: !951, size: 32, align: 32, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1052, file: !897, line: 1393, baseType: !936, size: 32, align: 32, offset: 352)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1052, file: !897, line: 1405, baseType: !1317, size: 64, align: 64, offset: 384)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1792, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1893, !1899, !1900, !1904, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1936, !1937, !1938, !1939, !1940, !1941}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1320, file: !897, line: 866, baseType: !951, size: 32, align: 32)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1320, file: !897, line: 872, baseType: !951, size: 32, align: 32, offset: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1320, file: !897, line: 878, baseType: !1325, size: 64, align: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1328)
!1328 = !{!1329, !1330, !1331, !1332, !1467, !1468, !1469, !1470, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1496, !1500, !1501, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1680, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1327, file: !4, line: 1561, baseType: !988, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1327, file: !4, line: 1562, baseType: !951, size: 32, align: 32, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1327, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1327, file: !4, line: 1565, baseType: !1333, size: 64, align: 64, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1340, !1341, !1342, !1345, !1348, !1351, !1354, !1357, !1358, !1359, !1367, !1368, !1369, !1371, !1375, !1381, !1386, !1390, !1391, !1432, !1439, !1443, !1444, !1448, !1452, !1456, !1460, !1461, !1462}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1335, file: !4, line: 3475, baseType: !971, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1335, file: !4, line: 3480, baseType: !971, size: 64, align: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1335, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1335, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1335, file: !4, line: 3487, baseType: !951, size: 32, align: 32, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1335, file: !4, line: 3488, baseType: !1343, size: 64, align: 64, offset: 256)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1154)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1335, file: !4, line: 3489, baseType: !1346, size: 64, align: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1335, file: !4, line: 3490, baseType: !1349, size: 64, align: 64, offset: 384)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1335, file: !4, line: 3491, baseType: !1352, size: 64, align: 64, offset: 448)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1335, file: !4, line: 3492, baseType: !1355, size: 64, align: 64, offset: 512)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1335, file: !4, line: 3493, baseType: !939, size: 8, align: 8, offset: 576)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1335, file: !4, line: 3494, baseType: !988, size: 64, align: 64, offset: 640)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1335, file: !4, line: 3495, baseType: !1360, size: 64, align: 64, offset: 704)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1364)
!1364 = !{!1365, !1366}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1363, file: !4, line: 3402, baseType: !951, size: 32, align: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1363, file: !4, line: 3403, baseType: !971, size: 64, align: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1335, file: !4, line: 3507, baseType: !971, size: 64, align: 64, offset: 768)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1335, file: !4, line: 3516, baseType: !951, size: 32, align: 32, offset: 832)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1335, file: !4, line: 3517, baseType: !1370, size: 64, align: 64, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1335, file: !4, line: 3527, baseType: !1372, size: 64, align: 64, offset: 960)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!951, !1325}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1335, file: !4, line: 3535, baseType: !1376, size: 64, align: 64, offset: 1024)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!951, !1325, !1379}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1326)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1335, file: !4, line: 3541, baseType: !1382, size: 64, align: 64, offset: 1088)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1384)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1385)
!1385 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1335, file: !4, line: 3549, baseType: !1387, size: 64, align: 64, offset: 1152)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{null, !1370}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1335, file: !4, line: 3551, baseType: !1372, size: 64, align: 64, offset: 1216)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1335, file: !4, line: 3552, baseType: !1392, size: 64, align: 64, offset: 1280)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!951, !1325, !1092, !951, !1395}
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1402, !1403, !1431}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1397, file: !4, line: 3921, baseType: !946, size: 16, align: 16)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1397, file: !4, line: 3922, baseType: !934, size: 32, align: 32, offset: 32)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1397, file: !4, line: 3923, baseType: !934, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1397, file: !4, line: 3924, baseType: !936, size: 32, align: 32, offset: 96)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1397, file: !4, line: 3925, baseType: !1404, size: 64, align: 64, offset: 128)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1413, !1414, !1420, !1424, !1426, !1427, !1429, !1430}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1407, file: !4, line: 3886, baseType: !951, size: 32, align: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1407, file: !4, line: 3887, baseType: !951, size: 32, align: 32, offset: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1407, file: !4, line: 3888, baseType: !951, size: 32, align: 32, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1407, file: !4, line: 3889, baseType: !951, size: 32, align: 32, offset: 96)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1407, file: !4, line: 3890, baseType: !951, size: 32, align: 32, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1407, file: !4, line: 3897, baseType: !1415, size: 768, align: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1417)
!1417 = !{!1418, !1419}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1416, file: !4, line: 3855, baseType: !1140, size: 512, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1416, file: !4, line: 3857, baseType: !1144, size: 256, align: 32, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1407, file: !4, line: 3903, baseType: !1421, size: 256, align: 64, offset: 960)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 256, align: 64, elements: !1422)
!1422 = !{!1423}
!1423 = !DISubrange(count: 4)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1407, file: !4, line: 3904, baseType: !1425, size: 128, align: 32, offset: 1216)
!1425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !951, size: 128, align: 32, elements: !1422)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1407, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1407, file: !4, line: 3908, baseType: !1428, size: 64, align: 64, offset: 1408)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1407, file: !4, line: 3915, baseType: !1428, size: 64, align: 64, offset: 1472)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1407, file: !4, line: 3917, baseType: !951, size: 32, align: 32, offset: 1536)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1397, file: !4, line: 3926, baseType: !952, size: 64, align: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1335, file: !4, line: 3564, baseType: !1433, size: 64, align: 64, offset: 1344)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!951, !1325, !1077, !1436, !1438}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1136)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1335, file: !4, line: 3566, baseType: !1440, size: 64, align: 64, offset: 1408)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!951, !1325, !998, !1438, !1077}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1335, file: !4, line: 3567, baseType: !1372, size: 64, align: 64, offset: 1472)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1335, file: !4, line: 3576, baseType: !1445, size: 64, align: 64, offset: 1536)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!951, !1325, !1436}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1335, file: !4, line: 3577, baseType: !1449, size: 64, align: 64, offset: 1600)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!951, !1325, !1077}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1335, file: !4, line: 3584, baseType: !1453, size: 64, align: 64, offset: 1664)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!951, !1325, !1135}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1335, file: !4, line: 3589, baseType: !1457, size: 64, align: 64, offset: 1728)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{null, !1325}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1335, file: !4, line: 3594, baseType: !951, size: 32, align: 32, offset: 1792)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1335, file: !4, line: 3600, baseType: !971, size: 64, align: 64, offset: 1856)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1335, file: !4, line: 3609, baseType: !1463, size: 64, align: 64, offset: 1920)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1466)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1327, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1327, file: !4, line: 1581, baseType: !936, size: 32, align: 32, offset: 224)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1327, file: !4, line: 1583, baseType: !998, size: 64, align: 64, offset: 256)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1327, file: !4, line: 1591, baseType: !1471, size: 64, align: 64, offset: 320)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1327, file: !4, line: 1598, baseType: !998, size: 64, align: 64, offset: 384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1327, file: !4, line: 1606, baseType: !952, size: 64, align: 64, offset: 448)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1327, file: !4, line: 1614, baseType: !951, size: 32, align: 32, offset: 512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1327, file: !4, line: 1622, baseType: !951, size: 32, align: 32, offset: 544)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1327, file: !4, line: 1628, baseType: !951, size: 32, align: 32, offset: 576)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1327, file: !4, line: 1636, baseType: !951, size: 32, align: 32, offset: 608)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1327, file: !4, line: 1643, baseType: !951, size: 32, align: 32, offset: 640)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1327, file: !4, line: 1657, baseType: !1092, size: 64, align: 64, offset: 704)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1327, file: !4, line: 1658, baseType: !951, size: 32, align: 32, offset: 768)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1327, file: !4, line: 1679, baseType: !1154, size: 64, align: 32, offset: 800)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1327, file: !4, line: 1688, baseType: !951, size: 32, align: 32, offset: 864)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1327, file: !4, line: 1712, baseType: !951, size: 32, align: 32, offset: 896)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1327, file: !4, line: 1729, baseType: !951, size: 32, align: 32, offset: 928)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1327, file: !4, line: 1729, baseType: !951, size: 32, align: 32, offset: 960)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1327, file: !4, line: 1744, baseType: !951, size: 32, align: 32, offset: 992)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1327, file: !4, line: 1744, baseType: !951, size: 32, align: 32, offset: 1024)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1327, file: !4, line: 1751, baseType: !951, size: 32, align: 32, offset: 1056)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1327, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1327, file: !4, line: 1791, baseType: !1492, size: 64, align: 64, offset: 1152)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{null, !1495, !1436, !1438, !951, !951, !951}
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1327, file: !4, line: 1808, baseType: !1497, size: 64, align: 64, offset: 1216)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!645, !1495, !1346}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1327, file: !4, line: 1816, baseType: !951, size: 32, align: 32, offset: 1280)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1327, file: !4, line: 1825, baseType: !1502, size: 32, align: 32, offset: 1312)
!1502 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1327, file: !4, line: 1830, baseType: !951, size: 32, align: 32, offset: 1344)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1327, file: !4, line: 1838, baseType: !1502, size: 32, align: 32, offset: 1376)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1327, file: !4, line: 1846, baseType: !951, size: 32, align: 32, offset: 1408)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1327, file: !4, line: 1851, baseType: !951, size: 32, align: 32, offset: 1440)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1327, file: !4, line: 1861, baseType: !1502, size: 32, align: 32, offset: 1472)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1327, file: !4, line: 1868, baseType: !1502, size: 32, align: 32, offset: 1504)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1327, file: !4, line: 1875, baseType: !1502, size: 32, align: 32, offset: 1536)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1327, file: !4, line: 1882, baseType: !1502, size: 32, align: 32, offset: 1568)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1327, file: !4, line: 1889, baseType: !1502, size: 32, align: 32, offset: 1600)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1327, file: !4, line: 1896, baseType: !1502, size: 32, align: 32, offset: 1632)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1327, file: !4, line: 1903, baseType: !1502, size: 32, align: 32, offset: 1664)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1327, file: !4, line: 1910, baseType: !951, size: 32, align: 32, offset: 1696)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1327, file: !4, line: 1915, baseType: !951, size: 32, align: 32, offset: 1728)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1327, file: !4, line: 1926, baseType: !1438, size: 64, align: 64, offset: 1792)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1327, file: !4, line: 1935, baseType: !1154, size: 64, align: 32, offset: 1856)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1327, file: !4, line: 1942, baseType: !951, size: 32, align: 32, offset: 1920)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1327, file: !4, line: 1948, baseType: !951, size: 32, align: 32, offset: 1952)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1327, file: !4, line: 1954, baseType: !951, size: 32, align: 32, offset: 1984)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1327, file: !4, line: 1960, baseType: !951, size: 32, align: 32, offset: 2016)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1327, file: !4, line: 1984, baseType: !951, size: 32, align: 32, offset: 2048)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1327, file: !4, line: 1991, baseType: !951, size: 32, align: 32, offset: 2080)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1327, file: !4, line: 1996, baseType: !951, size: 32, align: 32, offset: 2112)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1327, file: !4, line: 2004, baseType: !951, size: 32, align: 32, offset: 2144)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1327, file: !4, line: 2011, baseType: !951, size: 32, align: 32, offset: 2176)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1327, file: !4, line: 2018, baseType: !951, size: 32, align: 32, offset: 2208)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1327, file: !4, line: 2027, baseType: !951, size: 32, align: 32, offset: 2240)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1327, file: !4, line: 2034, baseType: !951, size: 32, align: 32, offset: 2272)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1327, file: !4, line: 2044, baseType: !951, size: 32, align: 32, offset: 2304)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1327, file: !4, line: 2054, baseType: !1532, size: 64, align: 64, offset: 2368)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1327, file: !4, line: 2061, baseType: !1532, size: 64, align: 64, offset: 2432)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1327, file: !4, line: 2066, baseType: !951, size: 32, align: 32, offset: 2496)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1327, file: !4, line: 2070, baseType: !951, size: 32, align: 32, offset: 2528)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1327, file: !4, line: 2078, baseType: !951, size: 32, align: 32, offset: 2560)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1327, file: !4, line: 2085, baseType: !951, size: 32, align: 32, offset: 2592)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1327, file: !4, line: 2092, baseType: !951, size: 32, align: 32, offset: 2624)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1327, file: !4, line: 2099, baseType: !951, size: 32, align: 32, offset: 2656)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1327, file: !4, line: 2106, baseType: !951, size: 32, align: 32, offset: 2688)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1327, file: !4, line: 2113, baseType: !951, size: 32, align: 32, offset: 2720)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1327, file: !4, line: 2120, baseType: !951, size: 32, align: 32, offset: 2752)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1327, file: !4, line: 2125, baseType: !951, size: 32, align: 32, offset: 2784)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1327, file: !4, line: 2133, baseType: !951, size: 32, align: 32, offset: 2816)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1327, file: !4, line: 2140, baseType: !951, size: 32, align: 32, offset: 2848)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1327, file: !4, line: 2145, baseType: !951, size: 32, align: 32, offset: 2880)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1327, file: !4, line: 2153, baseType: !951, size: 32, align: 32, offset: 2912)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1327, file: !4, line: 2158, baseType: !951, size: 32, align: 32, offset: 2944)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1327, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1327, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1327, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1327, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1327, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1327, file: !4, line: 2203, baseType: !951, size: 32, align: 32, offset: 3136)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1327, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1327, file: !4, line: 2212, baseType: !951, size: 32, align: 32, offset: 3200)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1327, file: !4, line: 2213, baseType: !951, size: 32, align: 32, offset: 3232)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1327, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1327, file: !4, line: 2232, baseType: !951, size: 32, align: 32, offset: 3296)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1327, file: !4, line: 2243, baseType: !951, size: 32, align: 32, offset: 3328)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1327, file: !4, line: 2249, baseType: !951, size: 32, align: 32, offset: 3360)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1327, file: !4, line: 2256, baseType: !951, size: 32, align: 32, offset: 3392)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1327, file: !4, line: 2263, baseType: !1169, size: 64, align: 64, offset: 3456)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1327, file: !4, line: 2270, baseType: !1169, size: 64, align: 64, offset: 3520)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1327, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1327, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1327, file: !4, line: 2367, baseType: !1568, size: 64, align: 64, offset: 3648)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DISubroutineType(types: !1570)
!1570 = !{!951, !1495, !1135, !951}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1327, file: !4, line: 2383, baseType: !951, size: 32, align: 32, offset: 3712)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1327, file: !4, line: 2386, baseType: !1502, size: 32, align: 32, offset: 3744)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1327, file: !4, line: 2387, baseType: !1502, size: 32, align: 32, offset: 3776)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1327, file: !4, line: 2394, baseType: !951, size: 32, align: 32, offset: 3808)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1327, file: !4, line: 2401, baseType: !951, size: 32, align: 32, offset: 3840)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1327, file: !4, line: 2408, baseType: !951, size: 32, align: 32, offset: 3872)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1327, file: !4, line: 2415, baseType: !951, size: 32, align: 32, offset: 3904)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1327, file: !4, line: 2422, baseType: !951, size: 32, align: 32, offset: 3936)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1327, file: !4, line: 2423, baseType: !1580, size: 64, align: 64, offset: 3968)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1583)
!1583 = !{!1584, !1585, !1586, !1587}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1582, file: !4, line: 827, baseType: !951, size: 32, align: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1582, file: !4, line: 828, baseType: !951, size: 32, align: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1582, file: !4, line: 829, baseType: !951, size: 32, align: 32, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1582, file: !4, line: 830, baseType: !1502, size: 32, align: 32, offset: 96)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1327, file: !4, line: 2430, baseType: !952, size: 64, align: 64, offset: 4032)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1327, file: !4, line: 2437, baseType: !952, size: 64, align: 64, offset: 4096)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1327, file: !4, line: 2444, baseType: !1502, size: 32, align: 32, offset: 4160)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1327, file: !4, line: 2451, baseType: !1502, size: 32, align: 32, offset: 4192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1327, file: !4, line: 2458, baseType: !951, size: 32, align: 32, offset: 4224)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1327, file: !4, line: 2469, baseType: !951, size: 32, align: 32, offset: 4256)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1327, file: !4, line: 2475, baseType: !951, size: 32, align: 32, offset: 4288)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1327, file: !4, line: 2481, baseType: !951, size: 32, align: 32, offset: 4320)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1327, file: !4, line: 2485, baseType: !951, size: 32, align: 32, offset: 4352)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1327, file: !4, line: 2489, baseType: !951, size: 32, align: 32, offset: 4384)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1327, file: !4, line: 2493, baseType: !951, size: 32, align: 32, offset: 4416)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1327, file: !4, line: 2501, baseType: !951, size: 32, align: 32, offset: 4448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1327, file: !4, line: 2506, baseType: !951, size: 32, align: 32, offset: 4480)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1327, file: !4, line: 2510, baseType: !951, size: 32, align: 32, offset: 4512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1327, file: !4, line: 2514, baseType: !952, size: 64, align: 64, offset: 4544)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1327, file: !4, line: 2528, baseType: !1604, size: 64, align: 64, offset: 4608)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{null, !1495, !998, !951, !951}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1327, file: !4, line: 2534, baseType: !951, size: 32, align: 32, offset: 4672)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1327, file: !4, line: 2545, baseType: !951, size: 32, align: 32, offset: 4704)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1327, file: !4, line: 2547, baseType: !951, size: 32, align: 32, offset: 4736)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1327, file: !4, line: 2549, baseType: !951, size: 32, align: 32, offset: 4768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1327, file: !4, line: 2551, baseType: !951, size: 32, align: 32, offset: 4800)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1327, file: !4, line: 2553, baseType: !951, size: 32, align: 32, offset: 4832)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1327, file: !4, line: 2555, baseType: !951, size: 32, align: 32, offset: 4864)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1327, file: !4, line: 2557, baseType: !951, size: 32, align: 32, offset: 4896)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1327, file: !4, line: 2559, baseType: !951, size: 32, align: 32, offset: 4928)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1327, file: !4, line: 2563, baseType: !951, size: 32, align: 32, offset: 4960)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1327, file: !4, line: 2571, baseType: !1428, size: 64, align: 64, offset: 4992)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1327, file: !4, line: 2579, baseType: !1428, size: 64, align: 64, offset: 5056)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1327, file: !4, line: 2586, baseType: !951, size: 32, align: 32, offset: 5120)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1327, file: !4, line: 2615, baseType: !951, size: 32, align: 32, offset: 5152)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1327, file: !4, line: 2627, baseType: !951, size: 32, align: 32, offset: 5184)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1327, file: !4, line: 2637, baseType: !951, size: 32, align: 32, offset: 5216)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1327, file: !4, line: 2681, baseType: !951, size: 32, align: 32, offset: 5248)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1327, file: !4, line: 2709, baseType: !952, size: 64, align: 64, offset: 5312)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1327, file: !4, line: 2716, baseType: !1626, size: 64, align: 64, offset: 5376)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633, !1634, !1635, !1636, !1640, !1644, !1645, !1646, !1647, !1653, !1654, !1655, !1656, !1657}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1628, file: !4, line: 3642, baseType: !971, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1628, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1628, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1628, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1628, file: !4, line: 3669, baseType: !951, size: 32, align: 32, offset: 160)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1628, file: !4, line: 3682, baseType: !1453, size: 64, align: 64, offset: 192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1628, file: !4, line: 3698, baseType: !1637, size: 64, align: 64, offset: 256)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!951, !1325, !937, !934}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1628, file: !4, line: 3712, baseType: !1641, size: 64, align: 64, offset: 320)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!951, !1325, !951, !937, !934}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1628, file: !4, line: 3726, baseType: !1637, size: 64, align: 64, offset: 384)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1628, file: !4, line: 3737, baseType: !1372, size: 64, align: 64, offset: 448)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1628, file: !4, line: 3746, baseType: !951, size: 32, align: 32, offset: 512)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1628, file: !4, line: 3757, baseType: !1648, size: 64, align: 64, offset: 576)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1651}
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1628, file: !4, line: 3766, baseType: !1372, size: 64, align: 64, offset: 640)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1628, file: !4, line: 3774, baseType: !1372, size: 64, align: 64, offset: 704)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1628, file: !4, line: 3780, baseType: !951, size: 32, align: 32, offset: 768)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1628, file: !4, line: 3785, baseType: !951, size: 32, align: 32, offset: 800)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1628, file: !4, line: 3795, baseType: !1658, size: 64, align: 64, offset: 832)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!951, !1325, !1082}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1327, file: !4, line: 2728, baseType: !998, size: 64, align: 64, offset: 5440)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1327, file: !4, line: 2735, baseType: !1168, size: 512, align: 64, offset: 5504)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1327, file: !4, line: 2742, baseType: !951, size: 32, align: 32, offset: 6016)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1327, file: !4, line: 2755, baseType: !951, size: 32, align: 32, offset: 6048)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1327, file: !4, line: 2776, baseType: !951, size: 32, align: 32, offset: 6080)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1327, file: !4, line: 2783, baseType: !951, size: 32, align: 32, offset: 6112)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1327, file: !4, line: 2791, baseType: !951, size: 32, align: 32, offset: 6144)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1327, file: !4, line: 2802, baseType: !1135, size: 64, align: 64, offset: 6208)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1327, file: !4, line: 2811, baseType: !951, size: 32, align: 32, offset: 6272)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1327, file: !4, line: 2821, baseType: !951, size: 32, align: 32, offset: 6304)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1327, file: !4, line: 2830, baseType: !951, size: 32, align: 32, offset: 6336)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1327, file: !4, line: 2840, baseType: !951, size: 32, align: 32, offset: 6368)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1327, file: !4, line: 2851, baseType: !1674, size: 64, align: 64, offset: 6400)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DISubroutineType(types: !1676)
!1676 = !{!951, !1495, !1677, !998, !1438, !951, !951}
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!951, !1495, !998}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1327, file: !4, line: 2871, baseType: !1681, size: 64, align: 64, offset: 6464)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!951, !1495, !1684, !998, !1438, !951}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!951, !1495, !998, !951, !951}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1327, file: !4, line: 2878, baseType: !951, size: 32, align: 32, offset: 6528)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1327, file: !4, line: 2885, baseType: !951, size: 32, align: 32, offset: 6560)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1327, file: !4, line: 3005, baseType: !951, size: 32, align: 32, offset: 6592)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1327, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1327, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1327, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1327, file: !4, line: 3037, baseType: !1092, size: 64, align: 64, offset: 6720)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1327, file: !4, line: 3038, baseType: !951, size: 32, align: 32, offset: 6784)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1327, file: !4, line: 3050, baseType: !1169, size: 64, align: 64, offset: 6848)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1327, file: !4, line: 3065, baseType: !951, size: 32, align: 32, offset: 6912)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1327, file: !4, line: 3083, baseType: !951, size: 32, align: 32, offset: 6944)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1327, file: !4, line: 3092, baseType: !1154, size: 64, align: 32, offset: 6976)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1327, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1327, file: !4, line: 3106, baseType: !1154, size: 64, align: 32, offset: 7072)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1327, file: !4, line: 3113, baseType: !1702, size: 64, align: 64, offset: 7168)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1704)
!1704 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1705)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1706)
!1706 = !{!1707, !1708, !1709, !1710, !1711, !1712, !1715}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1705, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1705, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1705, file: !4, line: 720, baseType: !971, size: 64, align: 64, offset: 64)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1705, file: !4, line: 724, baseType: !971, size: 64, align: 64, offset: 128)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1705, file: !4, line: 728, baseType: !951, size: 32, align: 32, offset: 192)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1705, file: !4, line: 734, baseType: !1713, size: 64, align: 64, offset: 256)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1705, file: !4, line: 739, baseType: !1716, size: 64, align: 64, offset: 320)
