; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--wma.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--wma.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CoefVLCTable = type { i32, i32, i32*, i8*, i16* }

!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !888, line: 77, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!892 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !888, line: 83, size: 32, align: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!896 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!897 = !{!898, !899, !900, !901, !905, !906, !912}
!898 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!899 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!900 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !904, line: 51, baseType: !900)
!904 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !909, line: 221, size: 32, align: 8, elements: !910)
!909 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!910 = !{!911}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !908, file: !909, line: 221, baseType: !903, size: 32, align: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !904, line: 48, baseType: !913)
!913 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!914 = !{!915, !923, !926, !932, !937, !938, !939, !955, !959, !961, !965, !969, !971, !975, !979, !981, !985, !989, !991, !995, !999, !1001, !1005, !1009, !1011}
!915 = distinct !DIGlobalVariable(name: "ff_wma_hgain_huffcodes", scope: !0, file: !916, line: 54, type: !917, isLocal: false, isDefinition: true, variable: [37 x i16]* @ff_wma_hgain_huffcodes)
!916 = !DIFile(filename: "libavcodec/wmadata.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 592, align: 16, elements: !921)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !904, line: 49, baseType: !920)
!920 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!921 = !{!922}
!922 = !DISubrange(count: 37)
!923 = distinct !DIGlobalVariable(name: "ff_wma_hgain_huffbits", scope: !0, file: !916, line: 62, type: !924, isLocal: false, isDefinition: true, variable: [37 x i8]* @ff_wma_hgain_huffbits)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 296, align: 8, elements: !921)
!925 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!926 = distinct !DIGlobalVariable(name: "ff_wma_lsp_codebook", scope: !0, file: !916, line: 68, type: !927, isLocal: false, isDefinition: true, variable: [10 x [16 x float]]* @ff_wma_lsp_codebook)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 5120, align: 32, elements: !929)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!929 = !{!930, !931}
!930 = !DISubrange(count: 10)
!931 = !DISubrange(count: 16)
!932 = distinct !DIGlobalVariable(name: "exponent_band_44100", scope: !0, file: !916, line: 48, type: !933, isLocal: true, isDefinition: true, variable: [3 x [25 x i8]]* @exponent_band_44100)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 600, align: 8, elements: !934)
!934 = !{!935, !936}
!935 = !DISubrange(count: 3)
!936 = !DISubrange(count: 25)
!937 = distinct !DIGlobalVariable(name: "exponent_band_32000", scope: !0, file: !916, line: 42, type: !933, isLocal: true, isDefinition: true, variable: [3 x [25 x i8]]* @exponent_band_32000)
!938 = distinct !DIGlobalVariable(name: "exponent_band_22050", scope: !0, file: !916, line: 35, type: !933, isLocal: true, isDefinition: true, variable: [3 x [25 x i8]]* @exponent_band_22050)
!939 = distinct !DIGlobalVariable(name: "coef_vlcs", scope: !0, file: !916, line: 1375, type: !940, isLocal: true, isDefinition: true, variable: [6 x %struct.CoefVLCTable]* @coef_vlcs)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 1536, align: 64, elements: !953)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoefVLCTable", file: !943, line: 65, baseType: !944)
!943 = !DIFile(filename: "libavcodec/wma.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CoefVLCTable", file: !943, line: 59, size: 256, align: 64, elements: !945)
!945 = !{!946, !947, !948, !949, !951}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !944, file: !943, line: 60, baseType: !899, size: 32, align: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "max_level", scope: !944, file: !943, line: 61, baseType: !899, size: 32, align: 32, offset: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "huffcodes", scope: !944, file: !943, line: 62, baseType: !901, size: 64, align: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "huffbits", scope: !944, file: !943, line: 63, baseType: !950, size: 64, align: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "levels", scope: !944, file: !943, line: 64, baseType: !952, size: 64, align: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!953 = !{!954}
!954 = !DISubrange(count: 6)
!955 = distinct !DIGlobalVariable(name: "coef0_huffcodes", scope: !0, file: !916, line: 88, type: !956, isLocal: true, isDefinition: true, variable: [666 x i32]* @coef0_huffcodes)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 21312, align: 32, elements: !957)
!957 = !{!958}
!958 = !DISubrange(count: 666)
!959 = distinct !DIGlobalVariable(name: "coef0_huffbits", scope: !0, file: !916, line: 175, type: !960, isLocal: true, isDefinition: true, variable: [666 x i8]* @coef0_huffbits)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 5328, align: 8, elements: !957)
!961 = distinct !DIGlobalVariable(name: "levels0", scope: !0, file: !916, line: 1264, type: !962, isLocal: true, isDefinition: true, variable: [60 x i16]* @levels0)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 960, align: 16, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 60)
!965 = distinct !DIGlobalVariable(name: "coef1_huffcodes", scope: !0, file: !916, line: 262, type: !966, isLocal: true, isDefinition: true, variable: [555 x i32]* @coef1_huffcodes)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 17760, align: 32, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 555)
!969 = distinct !DIGlobalVariable(name: "coef1_huffbits", scope: !0, file: !916, line: 335, type: !970, isLocal: true, isDefinition: true, variable: [555 x i8]* @coef1_huffbits)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 4440, align: 8, elements: !967)
!971 = distinct !DIGlobalVariable(name: "levels1", scope: !0, file: !916, line: 1275, type: !972, isLocal: true, isDefinition: true, variable: [40 x i16]* @levels1)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 640, align: 16, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 40)
!975 = distinct !DIGlobalVariable(name: "coef2_huffcodes", scope: !0, file: !916, line: 408, type: !976, isLocal: true, isDefinition: true, variable: [1336 x i32]* @coef2_huffcodes)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 42752, align: 32, elements: !977)
!977 = !{!978}
!978 = !DISubrange(count: 1336)
!979 = distinct !DIGlobalVariable(name: "coef2_huffbits", scope: !0, file: !916, line: 578, type: !980, isLocal: true, isDefinition: true, variable: [1336 x i8]* @coef2_huffbits)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 10688, align: 8, elements: !977)
!981 = distinct !DIGlobalVariable(name: "levels2", scope: !0, file: !916, line: 1283, type: !982, isLocal: true, isDefinition: true, variable: [340 x i16]* @levels2)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 5440, align: 16, elements: !983)
!983 = !{!984}
!984 = !DISubrange(count: 340)
!985 = distinct !DIGlobalVariable(name: "coef3_huffcodes", scope: !0, file: !916, line: 748, type: !986, isLocal: true, isDefinition: true, variable: [1072 x i32]* @coef3_huffcodes)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 34304, align: 32, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 1072)
!989 = distinct !DIGlobalVariable(name: "coef3_huffbits", scope: !0, file: !916, line: 885, type: !990, isLocal: true, isDefinition: true, variable: [1072 x i8]* @coef3_huffbits)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 8576, align: 8, elements: !987)
!991 = distinct !DIGlobalVariable(name: "levels3", scope: !0, file: !916, line: 1329, type: !992, isLocal: true, isDefinition: true, variable: [180 x i16]* @levels3)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 2880, align: 16, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 180)
!995 = distinct !DIGlobalVariable(name: "coef4_huffcodes", scope: !0, file: !916, line: 1022, type: !996, isLocal: true, isDefinition: true, variable: [476 x i32]* @coef4_huffcodes)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 15232, align: 32, elements: !997)
!997 = !{!998}
!998 = !DISubrange(count: 476)
!999 = distinct !DIGlobalVariable(name: "coef4_huffbits", scope: !0, file: !916, line: 1085, type: !1000, isLocal: true, isDefinition: true, variable: [476 x i8]* @coef4_huffbits)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 3808, align: 8, elements: !997)
!1001 = distinct !DIGlobalVariable(name: "levels4", scope: !0, file: !916, line: 1355, type: !1002, isLocal: true, isDefinition: true, variable: [70 x i16]* @levels4)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 1120, align: 16, elements: !1003)
!1003 = !{!1004}
!1004 = !DISubrange(count: 70)
!1005 = distinct !DIGlobalVariable(name: "coef5_huffcodes", scope: !0, file: !916, line: 1148, type: !1006, isLocal: true, isDefinition: true, variable: [435 x i32]* @coef5_huffcodes)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 13920, align: 32, elements: !1007)
!1007 = !{!1008}
!1008 = !DISubrange(count: 435)
!1009 = distinct !DIGlobalVariable(name: "coef5_huffbits", scope: !0, file: !916, line: 1206, type: !1010, isLocal: true, isDefinition: true, variable: [435 x i8]* @coef5_huffbits)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 3480, align: 8, elements: !1007)
!1011 = distinct !DIGlobalVariable(name: "levels5", scope: !0, file: !916, line: 1367, type: !972, isLocal: true, isDefinition: true, variable: [40 x i16]* @levels5)
!1012 = !{i32 2, !"Dwarf Version", i32 4}
!1013 = !{i32 2, !"Debug Info Version", i32 3}
!1014 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1015 = distinct !DISubprogram(name: "ff_wma_init", scope: !1016, file: !1016, line: 81, type: !1017, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1740)
!1016 = !DIFile(filename: "libavcodec/wma.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!899, !1019, !899}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1022)
!1022 = !{!1023, !1068, !1069, !1070, !1339, !1340, !1341, !1342, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1495, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1678, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1021, file: !35, line: 1561, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1028)
!1028 = !{!1029, !1033, !1038, !1042, !1043, !1044, !1045, !1049, !1055, !1057, !1061}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1027, file: !4, line: 72, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1032 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1027, file: !4, line: 78, baseType: !1034, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1030, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1027, file: !4, line: 85, baseType: !1039, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1027, file: !4, line: 93, baseType: !899, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1027, file: !4, line: 99, baseType: !899, size: 32, align: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1027, file: !4, line: 108, baseType: !899, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1027, file: !4, line: 113, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1037, !1037, !1037}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1027, file: !4, line: 123, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1027, file: !4, line: 130, baseType: !1056, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1027, file: !4, line: 136, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1056, !1037}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1027, file: !4, line: 142, baseType: !1062, size: 64, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!899, !1065, !1037, !1030, !899}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1021, file: !35, line: 1562, baseType: !899, size: 32, align: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1021, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1021, file: !35, line: 1565, baseType: !1071, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080, !1089, !1092, !1095, !1098, !1103, !1104, !1105, !1113, !1114, !1115, !1117, !1121, !1127, !1136, !1140, !1141, !1189, !1310, !1314, !1315, !1319, !1323, !1328, !1332, !1333, !1334}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1073, file: !35, line: 3475, baseType: !1030, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1073, file: !35, line: 3480, baseType: !1030, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1073, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1073, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1073, file: !35, line: 3487, baseType: !899, size: 32, align: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1073, file: !35, line: 3488, baseType: !1081, size: 64, align: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1084, line: 61, baseType: !1085)
!1084 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1084, line: 58, size: 64, align: 32, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1085, file: !1084, line: 59, baseType: !899, size: 32, align: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1085, file: !1084, line: 60, baseType: !899, size: 32, align: 32, offset: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1073, file: !35, line: 3489, baseType: !1090, size: 64, align: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1073, file: !35, line: 3490, baseType: !1093, size: 64, align: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1073, file: !35, line: 3491, baseType: !1096, size: 64, align: 64, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1073, file: !35, line: 3492, baseType: !1099, size: 64, align: 64, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !904, line: 55, baseType: !1102)
!1102 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1073, file: !35, line: 3493, baseType: !912, size: 8, align: 8, offset: 576)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1073, file: !35, line: 3494, baseType: !1024, size: 64, align: 64, offset: 640)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1073, file: !35, line: 3495, baseType: !1106, size: 64, align: 64, offset: 704)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1108)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1109, file: !35, line: 3402, baseType: !899, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1109, file: !35, line: 3403, baseType: !1030, size: 64, align: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1073, file: !35, line: 3507, baseType: !1030, size: 64, align: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1073, file: !35, line: 3516, baseType: !899, size: 32, align: 32, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1073, file: !35, line: 3517, baseType: !1116, size: 64, align: 64, offset: 896)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1073, file: !35, line: 3527, baseType: !1118, size: 64, align: 64, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!899, !1019}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1073, file: !35, line: 3535, baseType: !1122, size: 64, align: 64, offset: 1024)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!899, !1019, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1073, file: !35, line: 3541, baseType: !1128, size: 64, align: 64, offset: 1088)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1132, line: 223, size: 128, align: 64, elements: !1133)
!1132 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1131, file: !1132, line: 224, baseType: !950, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1131, file: !1132, line: 225, baseType: !950, size: 64, align: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1073, file: !35, line: 3549, baseType: !1137, size: 64, align: 64, offset: 1152)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{null, !1116}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1073, file: !35, line: 3551, baseType: !1118, size: 64, align: 64, offset: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1073, file: !35, line: 3552, baseType: !1142, size: 64, align: 64, offset: 1280)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!899, !1019, !1145, !899, !1146}
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1186}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1148, file: !35, line: 3921, baseType: !919, size: 16, align: 16)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1148, file: !35, line: 3922, baseType: !903, size: 32, align: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1148, file: !35, line: 3923, baseType: !903, size: 32, align: 32, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1148, file: !35, line: 3924, baseType: !900, size: 32, align: 32, offset: 96)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1148, file: !35, line: 3925, baseType: !1155, size: 64, align: 64, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1164, !1165, !1175, !1179, !1181, !1182, !1184, !1185}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1158, file: !35, line: 3886, baseType: !899, size: 32, align: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1158, file: !35, line: 3887, baseType: !899, size: 32, align: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1158, file: !35, line: 3888, baseType: !899, size: 32, align: 32, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1158, file: !35, line: 3889, baseType: !899, size: 32, align: 32, offset: 96)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1158, file: !35, line: 3890, baseType: !899, size: 32, align: 32, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1158, file: !35, line: 3897, baseType: !1166, size: 768, align: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1168)
!1168 = !{!1169, !1173}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !35, line: 3855, baseType: !1170, size: 512, align: 64)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1145, size: 512, align: 64, elements: !1171)
!1171 = !{!1172}
!1172 = !DISubrange(count: 8)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1167, file: !35, line: 3857, baseType: !1174, size: 256, align: 32, offset: 512)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 256, align: 32, elements: !1171)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !35, line: 3903, baseType: !1176, size: 256, align: 64, offset: 960)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1145, size: 256, align: 64, elements: !1177)
!1177 = !{!1178}
!1178 = !DISubrange(count: 4)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1158, file: !35, line: 3904, baseType: !1180, size: 128, align: 32, offset: 1216)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 128, align: 32, elements: !1177)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1158, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1158, file: !35, line: 3908, baseType: !1183, size: 64, align: 64, offset: 1408)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1158, file: !35, line: 3915, baseType: !1183, size: 64, align: 64, offset: 1472)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1158, file: !35, line: 3917, baseType: !899, size: 32, align: 32, offset: 1536)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1148, file: !35, line: 3926, baseType: !1187, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !904, line: 40, baseType: !1188)
!1188 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1073, file: !35, line: 3564, baseType: !1190, size: 64, align: 64, offset: 1344)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!899, !1019, !1193, !1227, !1309}
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1196)
!1196 = !{!1197, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1223, !1224, !1225, !1226}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1195, file: !35, line: 1451, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1200, line: 94, baseType: !1201)
!1200 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1200, line: 81, size: 192, align: 64, elements: !1202)
!1202 = !{!1203, !1207, !1208}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1201, file: !1200, line: 82, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1200, line: 73, baseType: !1206)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1200, line: 73, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !1200, line: 89, baseType: !1145, size: 64, align: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1201, file: !1200, line: 93, baseType: !899, size: 32, align: 32, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1195, file: !35, line: 1461, baseType: !1187, size: 64, align: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1195, file: !35, line: 1467, baseType: !1187, size: 64, align: 64, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1195, file: !35, line: 1468, baseType: !1145, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1195, file: !35, line: 1469, baseType: !899, size: 32, align: 32, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1195, file: !35, line: 1470, baseType: !899, size: 32, align: 32, offset: 288)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1195, file: !35, line: 1474, baseType: !899, size: 32, align: 32, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1195, file: !35, line: 1479, baseType: !1216, size: 64, align: 64, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1218, file: !35, line: 1412, baseType: !1145, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1218, file: !35, line: 1413, baseType: !899, size: 32, align: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1218, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1195, file: !35, line: 1480, baseType: !899, size: 32, align: 32, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1195, file: !35, line: 1486, baseType: !1187, size: 64, align: 64, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1195, file: !35, line: 1488, baseType: !1187, size: 64, align: 64, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1195, file: !35, line: 1497, baseType: !1187, size: 64, align: 64, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1261, !1263, !1264, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1297, !1298, !1299, !1300, !1301, !1302, !1305, !1306, !1307, !1308}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1230, file: !758, line: 282, baseType: !1170, size: 512, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1230, file: !758, line: 299, baseType: !1174, size: 256, align: 32, offset: 512)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1230, file: !758, line: 315, baseType: !1235, size: 64, align: 64, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1230, file: !758, line: 326, baseType: !899, size: 32, align: 32, offset: 832)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1230, file: !758, line: 326, baseType: !899, size: 32, align: 32, offset: 864)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1230, file: !758, line: 334, baseType: !899, size: 32, align: 32, offset: 896)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1230, file: !758, line: 341, baseType: !899, size: 32, align: 32, offset: 928)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1230, file: !758, line: 346, baseType: !899, size: 32, align: 32, offset: 960)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1230, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1230, file: !758, line: 356, baseType: !1083, size: 64, align: 32, offset: 1024)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1230, file: !758, line: 361, baseType: !1187, size: 64, align: 64, offset: 1088)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1230, file: !758, line: 369, baseType: !1187, size: 64, align: 64, offset: 1152)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1230, file: !758, line: 377, baseType: !1187, size: 64, align: 64, offset: 1216)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1230, file: !758, line: 382, baseType: !899, size: 32, align: 32, offset: 1280)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1230, file: !758, line: 386, baseType: !899, size: 32, align: 32, offset: 1312)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1230, file: !758, line: 391, baseType: !899, size: 32, align: 32, offset: 1344)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1230, file: !758, line: 396, baseType: !1037, size: 64, align: 64, offset: 1408)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1230, file: !758, line: 403, baseType: !1251, size: 512, align: 64, offset: 1472)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 512, align: 64, elements: !1171)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1230, file: !758, line: 410, baseType: !899, size: 32, align: 32, offset: 1984)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1230, file: !758, line: 415, baseType: !899, size: 32, align: 32, offset: 2016)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1230, file: !758, line: 420, baseType: !899, size: 32, align: 32, offset: 2048)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1230, file: !758, line: 425, baseType: !899, size: 32, align: 32, offset: 2080)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1230, file: !758, line: 435, baseType: !1187, size: 64, align: 64, offset: 2112)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1230, file: !758, line: 440, baseType: !899, size: 32, align: 32, offset: 2176)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1230, file: !758, line: 445, baseType: !1101, size: 64, align: 64, offset: 2240)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1230, file: !758, line: 459, baseType: !1260, size: 512, align: 64, offset: 2304)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1198, size: 512, align: 64, elements: !1171)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1230, file: !758, line: 473, baseType: !1262, size: 64, align: 64, offset: 2816)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1230, file: !758, line: 477, baseType: !899, size: 32, align: 32, offset: 2880)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1230, file: !758, line: 479, baseType: !1265, size: 64, align: 64, offset: 2944)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1278}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1268, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !758, line: 203, baseType: !1145, size: 64, align: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !758, line: 204, baseType: !899, size: 32, align: 32, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1268, file: !758, line: 205, baseType: !1274, size: 64, align: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1276, line: 86, baseType: !1277)
!1276 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1276, line: 86, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1268, file: !758, line: 206, baseType: !1198, size: 64, align: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1230, file: !758, line: 480, baseType: !899, size: 32, align: 32, offset: 3008)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1230, file: !758, line: 505, baseType: !899, size: 32, align: 32, offset: 3040)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1230, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1230, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1230, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1230, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1230, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1230, file: !758, line: 532, baseType: !1187, size: 64, align: 64, offset: 3264)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1230, file: !758, line: 539, baseType: !1187, size: 64, align: 64, offset: 3328)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1230, file: !758, line: 547, baseType: !1187, size: 64, align: 64, offset: 3392)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1230, file: !758, line: 554, baseType: !1274, size: 64, align: 64, offset: 3456)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1230, file: !758, line: 563, baseType: !899, size: 32, align: 32, offset: 3520)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1230, file: !758, line: 572, baseType: !899, size: 32, align: 32, offset: 3552)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1230, file: !758, line: 581, baseType: !899, size: 32, align: 32, offset: 3584)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1230, file: !758, line: 588, baseType: !1294, size: 64, align: 64, offset: 3648)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !904, line: 36, baseType: !1296)
!1296 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1230, file: !758, line: 593, baseType: !899, size: 32, align: 32, offset: 3712)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1230, file: !758, line: 596, baseType: !899, size: 32, align: 32, offset: 3744)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1230, file: !758, line: 599, baseType: !1198, size: 64, align: 64, offset: 3776)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1230, file: !758, line: 605, baseType: !1198, size: 64, align: 64, offset: 3840)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1230, file: !758, line: 616, baseType: !1198, size: 64, align: 64, offset: 3904)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1230, file: !758, line: 626, baseType: !1303, size: 64, align: 64, offset: 3968)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1304, line: 216, baseType: !1102)
!1304 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1230, file: !758, line: 627, baseType: !1303, size: 64, align: 64, offset: 4032)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1230, file: !758, line: 628, baseType: !1303, size: 64, align: 64, offset: 4096)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1230, file: !758, line: 629, baseType: !1303, size: 64, align: 64, offset: 4160)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1230, file: !758, line: 645, baseType: !1198, size: 64, align: 64, offset: 4224)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1073, file: !35, line: 3566, baseType: !1311, size: 64, align: 64, offset: 1408)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!899, !1019, !1037, !1309, !1193}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1073, file: !35, line: 3567, baseType: !1118, size: 64, align: 64, offset: 1472)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1073, file: !35, line: 3576, baseType: !1316, size: 64, align: 64, offset: 1536)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!899, !1019, !1227}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1073, file: !35, line: 3577, baseType: !1320, size: 64, align: 64, offset: 1600)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!899, !1019, !1193}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1073, file: !35, line: 3584, baseType: !1324, size: 64, align: 64, offset: 1664)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!899, !1019, !1327}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1073, file: !35, line: 3589, baseType: !1329, size: 64, align: 64, offset: 1728)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{null, !1019}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1073, file: !35, line: 3594, baseType: !899, size: 32, align: 32, offset: 1792)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1073, file: !35, line: 3600, baseType: !1030, size: 64, align: 64, offset: 1856)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1073, file: !35, line: 3609, baseType: !1335, size: 64, align: 64, offset: 1920)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1338)
!1338 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1021, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1021, file: !35, line: 1581, baseType: !900, size: 32, align: 32, offset: 224)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1021, file: !35, line: 1583, baseType: !1037, size: 64, align: 64, offset: 256)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1021, file: !35, line: 1591, baseType: !1343, size: 64, align: 64, offset: 320)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1132, line: 129, size: 1664, align: 64, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1349, !1350, !1368, !1369, !1375, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1344, file: !1132, line: 136, baseType: !899, size: 32, align: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1344, file: !1132, line: 151, baseType: !899, size: 32, align: 32, offset: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1344, file: !1132, line: 157, baseType: !899, size: 32, align: 32, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1344, file: !1132, line: 159, baseType: !1327, size: 64, align: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1344, file: !1132, line: 161, baseType: !1351, size: 64, align: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1132, line: 117, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1132, line: 100, size: 832, align: 64, elements: !1354)
!1354 = !{!1355, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1353, file: !1132, line: 105, baseType: !1356, size: 256, align: 64)
!1356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1357, size: 256, align: 64, elements: !1177)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1200, line: 238, baseType: !1359)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1200, line: 238, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1353, file: !1132, line: 110, baseType: !899, size: 32, align: 32, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1353, file: !1132, line: 111, baseType: !899, size: 32, align: 32, offset: 288)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1353, file: !1132, line: 111, baseType: !899, size: 32, align: 32, offset: 320)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1353, file: !1132, line: 112, baseType: !1174, size: 256, align: 32, offset: 352)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1353, file: !1132, line: 113, baseType: !1180, size: 128, align: 32, offset: 608)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1353, file: !1132, line: 114, baseType: !899, size: 32, align: 32, offset: 736)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1353, file: !1132, line: 115, baseType: !899, size: 32, align: 32, offset: 768)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1353, file: !1132, line: 116, baseType: !899, size: 32, align: 32, offset: 800)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1344, file: !1132, line: 163, baseType: !1037, size: 64, align: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1344, file: !1132, line: 165, baseType: !1370, size: 128, align: 64, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1132, line: 122, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1132, line: 119, size: 128, align: 64, elements: !1372)
!1372 = !{!1373, !1374}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1371, file: !1132, line: 120, baseType: !1193, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1371, file: !1132, line: 121, baseType: !1327, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1344, file: !1132, line: 166, baseType: !1376, size: 128, align: 64, offset: 448)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1132, line: 127, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1132, line: 124, size: 128, align: 64, elements: !1378)
!1378 = !{!1379, !1452}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1377, file: !1132, line: 125, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1384)
!1384 = !{!1385, !1386, !1410, !1414, !1415, !1449, !1450, !1451}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1383, file: !35, line: 5751, baseType: !1024, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1383, file: !35, line: 5756, baseType: !1387, size: 64, align: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1390)
!1390 = !{!1391, !1392, !1395, !1396, !1397, !1401, !1405, !1409}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1389, file: !35, line: 5797, baseType: !1030, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1389, file: !35, line: 5804, baseType: !1393, size: 64, align: 64, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1389, file: !35, line: 5815, baseType: !1024, size: 64, align: 64, offset: 128)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1389, file: !35, line: 5825, baseType: !899, size: 32, align: 32, offset: 192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1389, file: !35, line: 5826, baseType: !1398, size: 64, align: 64, offset: 256)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DISubroutineType(types: !1400)
!1400 = !{!899, !1381}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1389, file: !35, line: 5827, baseType: !1402, size: 64, align: 64, offset: 320)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{!899, !1381, !1193}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1389, file: !35, line: 5828, baseType: !1406, size: 64, align: 64, offset: 384)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DISubroutineType(types: !1408)
!1408 = !{null, !1381}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1389, file: !35, line: 5829, baseType: !1406, size: 64, align: 64, offset: 448)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1383, file: !35, line: 5762, baseType: !1411, size: 64, align: 64, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1413)
!1413 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1383, file: !35, line: 5768, baseType: !1037, size: 64, align: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1383, file: !35, line: 5775, baseType: !1416, size: 64, align: 64, offset: 256)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1419)
!1419 = !{!1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1418, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1418, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1418, file: !35, line: 3948, baseType: !903, size: 32, align: 32, offset: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1418, file: !35, line: 3958, baseType: !1145, size: 64, align: 64, offset: 128)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1418, file: !35, line: 3962, baseType: !899, size: 32, align: 32, offset: 192)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1418, file: !35, line: 3968, baseType: !899, size: 32, align: 32, offset: 224)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1418, file: !35, line: 3973, baseType: !1187, size: 64, align: 64, offset: 256)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1418, file: !35, line: 3986, baseType: !899, size: 32, align: 32, offset: 320)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1418, file: !35, line: 3999, baseType: !899, size: 32, align: 32, offset: 352)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1418, file: !35, line: 4004, baseType: !899, size: 32, align: 32, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1418, file: !35, line: 4005, baseType: !899, size: 32, align: 32, offset: 416)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1418, file: !35, line: 4010, baseType: !899, size: 32, align: 32, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1418, file: !35, line: 4011, baseType: !899, size: 32, align: 32, offset: 480)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1418, file: !35, line: 4020, baseType: !1083, size: 64, align: 32, offset: 512)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1418, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1418, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1418, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1418, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1418, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1418, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1418, file: !35, line: 4039, baseType: !899, size: 32, align: 32, offset: 768)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1418, file: !35, line: 4046, baseType: !1101, size: 64, align: 64, offset: 832)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1418, file: !35, line: 4050, baseType: !899, size: 32, align: 32, offset: 896)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1418, file: !35, line: 4054, baseType: !899, size: 32, align: 32, offset: 928)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1418, file: !35, line: 4061, baseType: !899, size: 32, align: 32, offset: 960)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1418, file: !35, line: 4065, baseType: !899, size: 32, align: 32, offset: 992)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1418, file: !35, line: 4073, baseType: !899, size: 32, align: 32, offset: 1024)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1418, file: !35, line: 4080, baseType: !899, size: 32, align: 32, offset: 1056)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1418, file: !35, line: 4084, baseType: !899, size: 32, align: 32, offset: 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1383, file: !35, line: 5781, baseType: !1416, size: 64, align: 64, offset: 320)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1383, file: !35, line: 5787, baseType: !1083, size: 64, align: 32, offset: 384)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1383, file: !35, line: 5793, baseType: !1083, size: 64, align: 32, offset: 448)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1377, file: !1132, line: 126, baseType: !899, size: 32, align: 32, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1344, file: !1132, line: 172, baseType: !1193, size: 64, align: 64, offset: 576)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1344, file: !1132, line: 177, baseType: !1145, size: 64, align: 64, offset: 640)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1344, file: !1132, line: 178, baseType: !900, size: 32, align: 32, offset: 704)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1344, file: !1132, line: 180, baseType: !1037, size: 64, align: 64, offset: 768)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1344, file: !1132, line: 185, baseType: !899, size: 32, align: 32, offset: 832)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1344, file: !1132, line: 190, baseType: !1037, size: 64, align: 64, offset: 896)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1344, file: !1132, line: 195, baseType: !899, size: 32, align: 32, offset: 960)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1344, file: !1132, line: 200, baseType: !1193, size: 64, align: 64, offset: 1024)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1344, file: !1132, line: 201, baseType: !899, size: 32, align: 32, offset: 1088)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1344, file: !1132, line: 202, baseType: !1327, size: 64, align: 64, offset: 1152)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1344, file: !1132, line: 203, baseType: !899, size: 32, align: 32, offset: 1216)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1344, file: !1132, line: 205, baseType: !899, size: 32, align: 32, offset: 1248)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1344, file: !1132, line: 206, baseType: !899, size: 32, align: 32, offset: 1280)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1344, file: !1132, line: 209, baseType: !1303, size: 64, align: 64, offset: 1344)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1344, file: !1132, line: 212, baseType: !1303, size: 64, align: 64, offset: 1408)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1344, file: !1132, line: 213, baseType: !1327, size: 64, align: 64, offset: 1472)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1344, file: !1132, line: 215, baseType: !899, size: 32, align: 32, offset: 1536)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1344, file: !1132, line: 217, baseType: !899, size: 32, align: 32, offset: 1568)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1344, file: !1132, line: 220, baseType: !899, size: 32, align: 32, offset: 1600)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1021, file: !35, line: 1598, baseType: !1037, size: 64, align: 64, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1021, file: !35, line: 1606, baseType: !1187, size: 64, align: 64, offset: 448)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1021, file: !35, line: 1614, baseType: !899, size: 32, align: 32, offset: 512)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1021, file: !35, line: 1622, baseType: !899, size: 32, align: 32, offset: 544)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1021, file: !35, line: 1628, baseType: !899, size: 32, align: 32, offset: 576)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1021, file: !35, line: 1636, baseType: !899, size: 32, align: 32, offset: 608)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1021, file: !35, line: 1643, baseType: !899, size: 32, align: 32, offset: 640)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1021, file: !35, line: 1657, baseType: !1145, size: 64, align: 64, offset: 704)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1021, file: !35, line: 1658, baseType: !899, size: 32, align: 32, offset: 768)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1021, file: !35, line: 1679, baseType: !1083, size: 64, align: 32, offset: 800)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1021, file: !35, line: 1688, baseType: !899, size: 32, align: 32, offset: 864)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1021, file: !35, line: 1712, baseType: !899, size: 32, align: 32, offset: 896)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1021, file: !35, line: 1729, baseType: !899, size: 32, align: 32, offset: 928)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1021, file: !35, line: 1729, baseType: !899, size: 32, align: 32, offset: 960)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1021, file: !35, line: 1744, baseType: !899, size: 32, align: 32, offset: 992)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1021, file: !35, line: 1744, baseType: !899, size: 32, align: 32, offset: 1024)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1021, file: !35, line: 1751, baseType: !899, size: 32, align: 32, offset: 1056)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1021, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1021, file: !35, line: 1791, baseType: !1491, size: 64, align: 64, offset: 1152)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1494, !1227, !1309, !899, !899, !899}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1021, file: !35, line: 1808, baseType: !1496, size: 64, align: 64, offset: 1216)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!494, !1494, !1090}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1021, file: !35, line: 1816, baseType: !899, size: 32, align: 32, offset: 1280)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1021, file: !35, line: 1825, baseType: !898, size: 32, align: 32, offset: 1312)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1021, file: !35, line: 1830, baseType: !899, size: 32, align: 32, offset: 1344)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1021, file: !35, line: 1838, baseType: !898, size: 32, align: 32, offset: 1376)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1021, file: !35, line: 1846, baseType: !899, size: 32, align: 32, offset: 1408)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1021, file: !35, line: 1851, baseType: !899, size: 32, align: 32, offset: 1440)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1021, file: !35, line: 1861, baseType: !898, size: 32, align: 32, offset: 1472)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1021, file: !35, line: 1868, baseType: !898, size: 32, align: 32, offset: 1504)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1021, file: !35, line: 1875, baseType: !898, size: 32, align: 32, offset: 1536)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1021, file: !35, line: 1882, baseType: !898, size: 32, align: 32, offset: 1568)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1021, file: !35, line: 1889, baseType: !898, size: 32, align: 32, offset: 1600)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1021, file: !35, line: 1896, baseType: !898, size: 32, align: 32, offset: 1632)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1021, file: !35, line: 1903, baseType: !898, size: 32, align: 32, offset: 1664)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1021, file: !35, line: 1910, baseType: !899, size: 32, align: 32, offset: 1696)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1021, file: !35, line: 1915, baseType: !899, size: 32, align: 32, offset: 1728)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1021, file: !35, line: 1926, baseType: !1309, size: 64, align: 64, offset: 1792)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1021, file: !35, line: 1935, baseType: !1083, size: 64, align: 32, offset: 1856)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1021, file: !35, line: 1942, baseType: !899, size: 32, align: 32, offset: 1920)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1021, file: !35, line: 1948, baseType: !899, size: 32, align: 32, offset: 1952)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1021, file: !35, line: 1954, baseType: !899, size: 32, align: 32, offset: 1984)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1021, file: !35, line: 1960, baseType: !899, size: 32, align: 32, offset: 2016)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1021, file: !35, line: 1984, baseType: !899, size: 32, align: 32, offset: 2048)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1021, file: !35, line: 1991, baseType: !899, size: 32, align: 32, offset: 2080)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1021, file: !35, line: 1996, baseType: !899, size: 32, align: 32, offset: 2112)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1021, file: !35, line: 2004, baseType: !899, size: 32, align: 32, offset: 2144)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1021, file: !35, line: 2011, baseType: !899, size: 32, align: 32, offset: 2176)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1021, file: !35, line: 2018, baseType: !899, size: 32, align: 32, offset: 2208)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1021, file: !35, line: 2027, baseType: !899, size: 32, align: 32, offset: 2240)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1021, file: !35, line: 2034, baseType: !899, size: 32, align: 32, offset: 2272)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1021, file: !35, line: 2044, baseType: !899, size: 32, align: 32, offset: 2304)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1021, file: !35, line: 2054, baseType: !1530, size: 64, align: 64, offset: 2368)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1021, file: !35, line: 2061, baseType: !1530, size: 64, align: 64, offset: 2432)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1021, file: !35, line: 2066, baseType: !899, size: 32, align: 32, offset: 2496)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1021, file: !35, line: 2070, baseType: !899, size: 32, align: 32, offset: 2528)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1021, file: !35, line: 2078, baseType: !899, size: 32, align: 32, offset: 2560)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1021, file: !35, line: 2085, baseType: !899, size: 32, align: 32, offset: 2592)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1021, file: !35, line: 2092, baseType: !899, size: 32, align: 32, offset: 2624)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1021, file: !35, line: 2099, baseType: !899, size: 32, align: 32, offset: 2656)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1021, file: !35, line: 2106, baseType: !899, size: 32, align: 32, offset: 2688)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1021, file: !35, line: 2113, baseType: !899, size: 32, align: 32, offset: 2720)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1021, file: !35, line: 2120, baseType: !899, size: 32, align: 32, offset: 2752)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1021, file: !35, line: 2125, baseType: !899, size: 32, align: 32, offset: 2784)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1021, file: !35, line: 2133, baseType: !899, size: 32, align: 32, offset: 2816)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1021, file: !35, line: 2140, baseType: !899, size: 32, align: 32, offset: 2848)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1021, file: !35, line: 2145, baseType: !899, size: 32, align: 32, offset: 2880)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1021, file: !35, line: 2153, baseType: !899, size: 32, align: 32, offset: 2912)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1021, file: !35, line: 2158, baseType: !899, size: 32, align: 32, offset: 2944)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1021, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1021, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1021, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1021, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1021, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1021, file: !35, line: 2203, baseType: !899, size: 32, align: 32, offset: 3136)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1021, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1021, file: !35, line: 2212, baseType: !899, size: 32, align: 32, offset: 3200)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1021, file: !35, line: 2213, baseType: !899, size: 32, align: 32, offset: 3232)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1021, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1021, file: !35, line: 2232, baseType: !899, size: 32, align: 32, offset: 3296)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1021, file: !35, line: 2243, baseType: !899, size: 32, align: 32, offset: 3328)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1021, file: !35, line: 2249, baseType: !899, size: 32, align: 32, offset: 3360)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1021, file: !35, line: 2256, baseType: !899, size: 32, align: 32, offset: 3392)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1021, file: !35, line: 2263, baseType: !1101, size: 64, align: 64, offset: 3456)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1021, file: !35, line: 2270, baseType: !1101, size: 64, align: 64, offset: 3520)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1021, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1021, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1021, file: !35, line: 2367, baseType: !1566, size: 64, align: 64, offset: 3648)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!899, !1494, !1327, !899}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1021, file: !35, line: 2383, baseType: !899, size: 32, align: 32, offset: 3712)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1021, file: !35, line: 2386, baseType: !898, size: 32, align: 32, offset: 3744)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1021, file: !35, line: 2387, baseType: !898, size: 32, align: 32, offset: 3776)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1021, file: !35, line: 2394, baseType: !899, size: 32, align: 32, offset: 3808)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1021, file: !35, line: 2401, baseType: !899, size: 32, align: 32, offset: 3840)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1021, file: !35, line: 2408, baseType: !899, size: 32, align: 32, offset: 3872)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1021, file: !35, line: 2415, baseType: !899, size: 32, align: 32, offset: 3904)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1021, file: !35, line: 2422, baseType: !899, size: 32, align: 32, offset: 3936)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1021, file: !35, line: 2423, baseType: !1578, size: 64, align: 64, offset: 3968)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1580, file: !35, line: 827, baseType: !899, size: 32, align: 32)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1580, file: !35, line: 828, baseType: !899, size: 32, align: 32, offset: 32)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1580, file: !35, line: 829, baseType: !899, size: 32, align: 32, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1580, file: !35, line: 830, baseType: !898, size: 32, align: 32, offset: 96)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1021, file: !35, line: 2430, baseType: !1187, size: 64, align: 64, offset: 4032)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1021, file: !35, line: 2437, baseType: !1187, size: 64, align: 64, offset: 4096)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1021, file: !35, line: 2444, baseType: !898, size: 32, align: 32, offset: 4160)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1021, file: !35, line: 2451, baseType: !898, size: 32, align: 32, offset: 4192)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1021, file: !35, line: 2458, baseType: !899, size: 32, align: 32, offset: 4224)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1021, file: !35, line: 2469, baseType: !899, size: 32, align: 32, offset: 4256)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1021, file: !35, line: 2475, baseType: !899, size: 32, align: 32, offset: 4288)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1021, file: !35, line: 2481, baseType: !899, size: 32, align: 32, offset: 4320)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1021, file: !35, line: 2485, baseType: !899, size: 32, align: 32, offset: 4352)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1021, file: !35, line: 2489, baseType: !899, size: 32, align: 32, offset: 4384)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1021, file: !35, line: 2493, baseType: !899, size: 32, align: 32, offset: 4416)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1021, file: !35, line: 2501, baseType: !899, size: 32, align: 32, offset: 4448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1021, file: !35, line: 2506, baseType: !899, size: 32, align: 32, offset: 4480)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1021, file: !35, line: 2510, baseType: !899, size: 32, align: 32, offset: 4512)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1021, file: !35, line: 2514, baseType: !1187, size: 64, align: 64, offset: 4544)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1021, file: !35, line: 2528, baseType: !1602, size: 64, align: 64, offset: 4608)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DISubroutineType(types: !1604)
!1604 = !{null, !1494, !1037, !899, !899}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1021, file: !35, line: 2534, baseType: !899, size: 32, align: 32, offset: 4672)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1021, file: !35, line: 2545, baseType: !899, size: 32, align: 32, offset: 4704)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1021, file: !35, line: 2547, baseType: !899, size: 32, align: 32, offset: 4736)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1021, file: !35, line: 2549, baseType: !899, size: 32, align: 32, offset: 4768)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1021, file: !35, line: 2551, baseType: !899, size: 32, align: 32, offset: 4800)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1021, file: !35, line: 2553, baseType: !899, size: 32, align: 32, offset: 4832)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1021, file: !35, line: 2555, baseType: !899, size: 32, align: 32, offset: 4864)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1021, file: !35, line: 2557, baseType: !899, size: 32, align: 32, offset: 4896)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1021, file: !35, line: 2559, baseType: !899, size: 32, align: 32, offset: 4928)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1021, file: !35, line: 2563, baseType: !899, size: 32, align: 32, offset: 4960)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1021, file: !35, line: 2571, baseType: !1183, size: 64, align: 64, offset: 4992)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1021, file: !35, line: 2579, baseType: !1183, size: 64, align: 64, offset: 5056)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1021, file: !35, line: 2586, baseType: !899, size: 32, align: 32, offset: 5120)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1021, file: !35, line: 2615, baseType: !899, size: 32, align: 32, offset: 5152)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1021, file: !35, line: 2627, baseType: !899, size: 32, align: 32, offset: 5184)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1021, file: !35, line: 2637, baseType: !899, size: 32, align: 32, offset: 5216)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1021, file: !35, line: 2681, baseType: !899, size: 32, align: 32, offset: 5248)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1021, file: !35, line: 2709, baseType: !1187, size: 64, align: 64, offset: 5312)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1021, file: !35, line: 2716, baseType: !1624, size: 64, align: 64, offset: 5376)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631, !1632, !1633, !1634, !1638, !1642, !1643, !1644, !1645, !1651, !1652, !1653, !1654, !1655}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1626, file: !35, line: 3642, baseType: !1030, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1626, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1626, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1626, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1626, file: !35, line: 3669, baseType: !899, size: 32, align: 32, offset: 160)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1626, file: !35, line: 3682, baseType: !1324, size: 64, align: 64, offset: 192)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1626, file: !35, line: 3698, baseType: !1635, size: 64, align: 64, offset: 256)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!899, !1019, !950, !903}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1626, file: !35, line: 3712, baseType: !1639, size: 64, align: 64, offset: 320)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!899, !1019, !899, !950, !903}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1626, file: !35, line: 3726, baseType: !1635, size: 64, align: 64, offset: 384)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1626, file: !35, line: 3737, baseType: !1118, size: 64, align: 64, offset: 448)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1626, file: !35, line: 3746, baseType: !899, size: 32, align: 32, offset: 512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1626, file: !35, line: 3757, baseType: !1646, size: 64, align: 64, offset: 576)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{null, !1649}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1626, file: !35, line: 3766, baseType: !1118, size: 64, align: 64, offset: 640)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1626, file: !35, line: 3774, baseType: !1118, size: 64, align: 64, offset: 704)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1626, file: !35, line: 3780, baseType: !899, size: 32, align: 32, offset: 768)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1626, file: !35, line: 3785, baseType: !899, size: 32, align: 32, offset: 800)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1626, file: !35, line: 3795, baseType: !1656, size: 64, align: 64, offset: 832)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!899, !1019, !1198}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1021, file: !35, line: 2728, baseType: !1037, size: 64, align: 64, offset: 5440)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1021, file: !35, line: 2735, baseType: !1251, size: 512, align: 64, offset: 5504)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1021, file: !35, line: 2742, baseType: !899, size: 32, align: 32, offset: 6016)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1021, file: !35, line: 2755, baseType: !899, size: 32, align: 32, offset: 6048)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1021, file: !35, line: 2776, baseType: !899, size: 32, align: 32, offset: 6080)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1021, file: !35, line: 2783, baseType: !899, size: 32, align: 32, offset: 6112)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1021, file: !35, line: 2791, baseType: !899, size: 32, align: 32, offset: 6144)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1021, file: !35, line: 2802, baseType: !1327, size: 64, align: 64, offset: 6208)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1021, file: !35, line: 2811, baseType: !899, size: 32, align: 32, offset: 6272)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1021, file: !35, line: 2821, baseType: !899, size: 32, align: 32, offset: 6304)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1021, file: !35, line: 2830, baseType: !899, size: 32, align: 32, offset: 6336)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1021, file: !35, line: 2840, baseType: !899, size: 32, align: 32, offset: 6368)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1021, file: !35, line: 2851, baseType: !1672, size: 64, align: 64, offset: 6400)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!899, !1494, !1675, !1037, !1309, !899, !899}
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!899, !1494, !1037}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1021, file: !35, line: 2871, baseType: !1679, size: 64, align: 64, offset: 6464)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!899, !1494, !1682, !1037, !1309, !899}
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!899, !1494, !1037, !899, !899}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1021, file: !35, line: 2878, baseType: !899, size: 32, align: 32, offset: 6528)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1021, file: !35, line: 2885, baseType: !899, size: 32, align: 32, offset: 6560)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1021, file: !35, line: 3005, baseType: !899, size: 32, align: 32, offset: 6592)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1021, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1021, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1021, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1021, file: !35, line: 3037, baseType: !1145, size: 64, align: 64, offset: 6720)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1021, file: !35, line: 3038, baseType: !899, size: 32, align: 32, offset: 6784)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1021, file: !35, line: 3050, baseType: !1101, size: 64, align: 64, offset: 6848)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1021, file: !35, line: 3065, baseType: !899, size: 32, align: 32, offset: 6912)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1021, file: !35, line: 3083, baseType: !899, size: 32, align: 32, offset: 6944)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1021, file: !35, line: 3092, baseType: !1083, size: 64, align: 32, offset: 6976)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1021, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1021, file: !35, line: 3106, baseType: !1083, size: 64, align: 32, offset: 7072)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1021, file: !35, line: 3113, baseType: !1700, size: 64, align: 64, offset: 7168)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1702)
!1702 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1703)
!1703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1704)
!1704 = !{!1705, !1706, !1707, !1708, !1709, !1710, !1713}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1703, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1703, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
