; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aac_adtstoasc_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aac_adtstoasc_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !620, !621, !622, !628, !630, !631}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !614, line: 222, size: 16, align: 8, elements: !615)
!614 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !613, file: !614, line: 222, baseType: !617, size: 16, align: 16)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !618, line: 49, baseType: !619)
!618 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!619 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!620 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!621 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !614, line: 221, size: 32, align: 8, elements: !625)
!625 = !{!626}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !624, file: !614, line: 221, baseType: !627, size: 32, align: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !618, line: 51, baseType: !621)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !618, line: 48, baseType: !629)
!629 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!632 = !{!633, !796}
!633 = distinct !DIGlobalVariable(name: "ff_aac_adtstoasc_bsf", scope: !0, file: !634, line: 152, type: !635, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_aac_adtstoasc_bsf)
!634 = !DIFile(filename: "libavcodec/aac_adtstoasc_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !638)
!638 = !{!639, !643, !646, !687, !688, !753, !791, !795}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !4, line: 5797, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !637, file: !4, line: 5804, baseType: !644, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !637, file: !4, line: 5815, baseType: !647, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !651)
!651 = !{!652, !653, !657, !661, !662, !663, !664, !668, !674, !676, !680}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !650, file: !464, line: 72, baseType: !640, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !650, file: !464, line: 78, baseType: !654, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!640, !630}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !650, file: !464, line: 85, baseType: !658, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !650, file: !464, line: 93, baseType: !620, size: 32, align: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !650, file: !464, line: 99, baseType: !620, size: 32, align: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !650, file: !464, line: 108, baseType: !620, size: 32, align: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !650, file: !464, line: 113, baseType: !665, size: 64, align: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!630, !630, !630}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !650, file: !464, line: 123, baseType: !669, size: 64, align: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !650, file: !464, line: 130, baseType: !675, size: 32, align: 32, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !650, file: !464, line: 136, baseType: !677, size: 64, align: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!675, !630}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !650, file: !464, line: 142, baseType: !681, size: 64, align: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!620, !684, !630, !640, !620}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !637, file: !4, line: 5825, baseType: !620, size: 32, align: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !637, file: !4, line: 5826, baseType: !689, size: 64, align: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!620, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !695)
!695 = !{!696, !697, !700, !704, !705, !750, !751, !752}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !694, file: !4, line: 5751, baseType: !647, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !694, file: !4, line: 5756, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !694, file: !4, line: 5762, baseType: !701, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !703)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !694, file: !4, line: 5768, baseType: !630, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !694, file: !4, line: 5775, baseType: !706, size: 64, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !709)
!709 = !{!710, !711, !712, !713, !715, !716, !717, !720, !721, !722, !723, !724, !725, !726, !733, !734, !735, !736, !737, !738, !739, !740, !743, !744, !745, !746, !747, !748, !749}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !708, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !708, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !708, file: !4, line: 3948, baseType: !627, size: 32, align: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !708, file: !4, line: 3958, baseType: !714, size: 64, align: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !708, file: !4, line: 3962, baseType: !620, size: 32, align: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !708, file: !4, line: 3968, baseType: !620, size: 32, align: 32, offset: 224)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !708, file: !4, line: 3973, baseType: !718, size: 64, align: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !618, line: 40, baseType: !719)
!719 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !708, file: !4, line: 3986, baseType: !620, size: 32, align: 32, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !708, file: !4, line: 3999, baseType: !620, size: 32, align: 32, offset: 352)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !708, file: !4, line: 4004, baseType: !620, size: 32, align: 32, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !708, file: !4, line: 4005, baseType: !620, size: 32, align: 32, offset: 416)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !708, file: !4, line: 4010, baseType: !620, size: 32, align: 32, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !708, file: !4, line: 4011, baseType: !620, size: 32, align: 32, offset: 480)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !708, file: !4, line: 4020, baseType: !727, size: 64, align: 32, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !728, line: 61, baseType: !729)
!728 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !728, line: 58, size: 64, align: 32, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !729, file: !728, line: 59, baseType: !620, size: 32, align: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !729, file: !728, line: 60, baseType: !620, size: 32, align: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !708, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !708, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !708, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !708, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !708, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !708, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !708, file: !4, line: 4039, baseType: !620, size: 32, align: 32, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !708, file: !4, line: 4046, baseType: !741, size: 64, align: 64, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !618, line: 55, baseType: !742)
!742 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !708, file: !4, line: 4050, baseType: !620, size: 32, align: 32, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !708, file: !4, line: 4054, baseType: !620, size: 32, align: 32, offset: 928)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !708, file: !4, line: 4061, baseType: !620, size: 32, align: 32, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !708, file: !4, line: 4065, baseType: !620, size: 32, align: 32, offset: 992)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !708, file: !4, line: 4073, baseType: !620, size: 32, align: 32, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !708, file: !4, line: 4080, baseType: !620, size: 32, align: 32, offset: 1056)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !708, file: !4, line: 4084, baseType: !620, size: 32, align: 32, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !694, file: !4, line: 5781, baseType: !706, size: 64, align: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !694, file: !4, line: 5787, baseType: !727, size: 64, align: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !694, file: !4, line: 5793, baseType: !727, size: 64, align: 32, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !637, file: !4, line: 5827, baseType: !754, size: 64, align: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!620, !692, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !760)
!760 = !{!761, !773, !774, !775, !776, !777, !778, !779, !787, !788, !789, !790}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !759, file: !4, line: 1451, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !764, line: 94, baseType: !765)
!764 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !764, line: 81, size: 192, align: 64, elements: !766)
!766 = !{!767, !771, !772}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !765, file: !764, line: 82, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !764, line: 73, baseType: !770)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !764, line: 73, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !765, file: !764, line: 89, baseType: !714, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !765, file: !764, line: 93, baseType: !620, size: 32, align: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !759, file: !4, line: 1461, baseType: !718, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !759, file: !4, line: 1467, baseType: !718, size: 64, align: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !759, file: !4, line: 1468, baseType: !714, size: 64, align: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !4, line: 1469, baseType: !620, size: 32, align: 32, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !759, file: !4, line: 1470, baseType: !620, size: 32, align: 32, offset: 288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !4, line: 1474, baseType: !620, size: 32, align: 32, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !759, file: !4, line: 1479, baseType: !780, size: 64, align: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !782, file: !4, line: 1412, baseType: !714, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !782, file: !4, line: 1413, baseType: !620, size: 32, align: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !759, file: !4, line: 1480, baseType: !620, size: 32, align: 32, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !759, file: !4, line: 1486, baseType: !718, size: 64, align: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !759, file: !4, line: 1488, baseType: !718, size: 64, align: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !759, file: !4, line: 1497, baseType: !718, size: 64, align: 64, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !637, file: !4, line: 5828, baseType: !792, size: 64, align: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !692}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !637, file: !4, line: 5829, baseType: !792, size: 64, align: 64, offset: 448)
!796 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !634, line: 148, type: !797, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 64, align: 32, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 2)
!800 = !{i32 2, !"Dwarf Version", i32 4}
!801 = !{i32 2, !"Debug Info Version", i32 3}
!802 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!803 = distinct !DISubprogram(name: "aac_adtstoasc_init", scope: !634, file: !634, line: 132, type: !690, isLocal: true, isDefinition: true, scopeLine: 133, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !804)
!804 = !{}
!805 = !DILocalVariable(name: "ctx", arg: 1, scope: !803, file: !634, line: 132, type: !692)
!806 = !DIExpression()
!807 = !DILocation(line: 132, column: 45, scope: !803)
!808 = !DILocation(line: 135, column: 9, scope: !809)
!809 = distinct !DILexicalBlock(scope: !803, file: !634, line: 135, column: 9)
!810 = !DILocation(line: 135, column: 14, scope: !809)
!811 = !DILocation(line: 135, column: 22, scope: !809)
!812 = !DILocation(line: 135, column: 9, scope: !803)
!813 = !DILocalVariable(name: "mp4ac", scope: !814, file: !634, line: 136, type: !815)
!814 = distinct !DILexicalBlock(scope: !809, file: !634, line: 135, column: 33)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPEG4AudioConfig", file: !816, line: 46, baseType: !817)
!816 = !DIFile(filename: "libavcodec/mpeg4audio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MPEG4AudioConfig", file: !816, line: 33, size: 384, align: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !817, file: !816, line: 34, baseType: !620, size: 32, align: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_index", scope: !817, file: !816, line: 35, baseType: !620, size: 32, align: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !817, file: !816, line: 36, baseType: !620, size: 32, align: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chan_config", scope: !817, file: !816, line: 37, baseType: !620, size: 32, align: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sbr", scope: !817, file: !816, line: 38, baseType: !620, size: 32, align: 32, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ext_object_type", scope: !817, file: !816, line: 39, baseType: !620, size: 32, align: 32, offset: 160)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "ext_sampling_index", scope: !817, file: !816, line: 40, baseType: !620, size: 32, align: 32, offset: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ext_sample_rate", scope: !817, file: !816, line: 41, baseType: !620, size: 32, align: 32, offset: 224)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ext_chan_config", scope: !817, file: !816, line: 42, baseType: !620, size: 32, align: 32, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !817, file: !816, line: 43, baseType: !620, size: 32, align: 32, offset: 288)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ps", scope: !817, file: !816, line: 44, baseType: !620, size: 32, align: 32, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "frame_length_short", scope: !817, file: !816, line: 45, baseType: !620, size: 32, align: 32, offset: 352)
!831 = !DILocation(line: 136, column: 26, scope: !814)
!832 = !DILocalVariable(name: "ret", scope: !814, file: !634, line: 137, type: !620)
!833 = !DILocation(line: 137, column: 13, scope: !814)
!834 = !DILocation(line: 137, column: 56, scope: !814)
!835 = !DILocation(line: 137, column: 61, scope: !814)
!836 = !DILocation(line: 137, column: 69, scope: !814)
!837 = !DILocation(line: 138, column: 48, scope: !814)
!838 = !DILocation(line: 138, column: 53, scope: !814)
!839 = !DILocation(line: 138, column: 61, scope: !814)
!840 = !DILocation(line: 138, column: 76, scope: !814)
!841 = !DILocation(line: 137, column: 19, scope: !814)
!842 = !DILocation(line: 139, column: 13, scope: !843)
!843 = distinct !DILexicalBlock(scope: !814, file: !634, line: 139, column: 13)
!844 = !DILocation(line: 139, column: 17, scope: !843)
!845 = !DILocation(line: 139, column: 13, scope: !814)
!846 = !DILocation(line: 140, column: 20, scope: !847)
!847 = distinct !DILexicalBlock(scope: !843, file: !634, line: 139, column: 22)
!848 = !DILocation(line: 140, column: 13, scope: !847)
!849 = !DILocation(line: 141, column: 20, scope: !847)
!850 = !DILocation(line: 141, column: 13, scope: !847)
!851 = !DILocation(line: 143, column: 5, scope: !814)
!852 = !DILocation(line: 145, column: 5, scope: !803)
!853 = !DILocation(line: 146, column: 1, scope: !803)
!854 = distinct !DISubprogram(name: "aac_adtstoasc_filter", scope: !634, file: !634, line: 39, type: !755, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !804)
!855 = !DILocalVariable(name: "x", arg: 1, scope: !856, file: !857, line: 58, type: !617)
!856 = distinct !DISubprogram(name: "av_bswap16", scope: !857, file: !857, line: 58, type: !858, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !804)
!857 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!858 = !DISubroutineType(types: !859)
!859 = !{!617, !617}
!860 = !DILocation(line: 58, column: 98, scope: !856, inlinedAt: !861)
!861 = distinct !DILocation(line: 52, column: 55, scope: !862)
!862 = !DILexicalBlockFile(scope: !863, file: !634, discriminator: 2)
!863 = distinct !DILexicalBlock(scope: !854, file: !634, line: 52, column: 9)
!864 = !DILocalVariable(name: "bsfc", arg: 1, scope: !854, file: !634, line: 39, type: !692)
!865 = !DILocation(line: 39, column: 47, scope: !854)
!866 = !DILocalVariable(name: "pkt", arg: 2, scope: !854, file: !634, line: 39, type: !757)
!867 = !DILocation(line: 39, column: 63, scope: !854)
!868 = !DILocalVariable(name: "ctx", scope: !854, file: !634, line: 41, type: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACBSFContext", file: !634, line: 33, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACBSFContext", file: !634, line: 31, size: 32, align: 32, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "first_frame_done", scope: !871, file: !634, line: 32, baseType: !620, size: 32, align: 32)
!874 = !DILocation(line: 41, column: 20, scope: !854)
!875 = !DILocation(line: 41, column: 26, scope: !854)
!876 = !DILocation(line: 41, column: 32, scope: !854)
!877 = !DILocalVariable(name: "gb", scope: !854, file: !634, line: 43, type: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !879, line: 70, baseType: !880)
!879 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !879, line: 61, size: 256, align: 64, elements: !881)
!881 = !{!882, !885, !886, !887, !888}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !880, file: !879, line: 62, baseType: !883, size: 64, align: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !880, file: !879, line: 62, baseType: !883, size: 64, align: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !880, file: !879, line: 67, baseType: !620, size: 32, align: 32, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !880, file: !879, line: 68, baseType: !620, size: 32, align: 32, offset: 160)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !880, file: !879, line: 69, baseType: !620, size: 32, align: 32, offset: 192)
!889 = !DILocation(line: 43, column: 19, scope: !854)
!890 = !DILocalVariable(name: "pb", scope: !854, file: !634, line: 44, type: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !892, line: 40, baseType: !893)
!892 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !892, line: 35, size: 320, align: 64, elements: !894)
!894 = !{!895, !896, !897, !898, !899, !900}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !893, file: !892, line: 36, baseType: !627, size: 32, align: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !893, file: !892, line: 37, baseType: !620, size: 32, align: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !893, file: !892, line: 38, baseType: !714, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !893, file: !892, line: 38, baseType: !714, size: 64, align: 64, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !893, file: !892, line: 38, baseType: !714, size: 64, align: 64, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !893, file: !892, line: 39, baseType: !620, size: 32, align: 32, offset: 256)
!901 = !DILocation(line: 44, column: 19, scope: !854)
!902 = !DILocalVariable(name: "hdr", scope: !854, file: !634, line: 45, type: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "AACADTSHeaderInfo", file: !904, line: 37, baseType: !905)
!904 = !DIFile(filename: "libavcodec/adts_header.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AACADTSHeaderInfo", file: !904, line: 28, size: 160, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !905, file: !904, line: 29, baseType: !627, size: 32, align: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !905, file: !904, line: 30, baseType: !627, size: 32, align: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !905, file: !904, line: 31, baseType: !627, size: 32, align: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "crc_absent", scope: !905, file: !904, line: 32, baseType: !628, size: 8, align: 8, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "object_type", scope: !905, file: !904, line: 33, baseType: !628, size: 8, align: 8, offset: 104)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_index", scope: !905, file: !904, line: 34, baseType: !628, size: 8, align: 8, offset: 112)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chan_config", scope: !905, file: !904, line: 35, baseType: !628, size: 8, align: 8, offset: 120)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "num_aac_frames", scope: !905, file: !904, line: 36, baseType: !628, size: 8, align: 8, offset: 128)
!915 = !DILocation(line: 45, column: 23, scope: !854)
!916 = !DILocalVariable(name: "ret", scope: !854, file: !634, line: 46, type: !620)
!917 = !DILocation(line: 46, column: 9, scope: !854)
!918 = !DILocation(line: 48, column: 33, scope: !854)
!919 = !DILocation(line: 48, column: 39, scope: !854)
!920 = !DILocation(line: 48, column: 11, scope: !854)
!921 = !DILocation(line: 48, column: 9, scope: !854)
!922 = !DILocation(line: 49, column: 9, scope: !923)
!923 = distinct !DILexicalBlock(scope: !854, file: !634, line: 49, column: 9)
!924 = !DILocation(line: 49, column: 13, scope: !923)
!925 = !DILocation(line: 49, column: 9, scope: !854)
!926 = !DILocation(line: 50, column: 16, scope: !923)
!927 = !DILocation(line: 50, column: 9, scope: !923)
!928 = !DILocation(line: 52, column: 9, scope: !863)
!929 = !DILocation(line: 52, column: 15, scope: !863)
!930 = !DILocation(line: 52, column: 23, scope: !863)
!931 = !DILocation(line: 52, column: 33, scope: !863)
!932 = !DILocation(line: 52, column: 36, scope: !933)
!933 = !DILexicalBlockFile(scope: !863, file: !634, discriminator: 1)
!934 = !DILocation(line: 52, column: 41, scope: !933)
!935 = !DILocation(line: 52, column: 46, scope: !933)
!936 = !DILocation(line: 52, column: 51, scope: !933)
!937 = !DILocation(line: 52, column: 98, scope: !862)
!938 = !DILocation(line: 52, column: 103, scope: !862)
!939 = !DILocation(line: 52, column: 111, scope: !862)
!940 = !DILocation(line: 52, column: 55, scope: !862)
!941 = !DILocation(line: 60, column: 9, scope: !856, inlinedAt: !861)
!942 = !DILocation(line: 60, column: 10, scope: !856, inlinedAt: !861)
!943 = !DILocation(line: 60, column: 18, scope: !856, inlinedAt: !861)
!944 = !DILocation(line: 60, column: 19, scope: !856, inlinedAt: !861)
!945 = !DILocation(line: 60, column: 15, scope: !856, inlinedAt: !861)
!946 = !DILocation(line: 60, column: 8, scope: !856, inlinedAt: !861)
!947 = !DILocation(line: 60, column: 6, scope: !856, inlinedAt: !861)
!948 = !DILocation(line: 61, column: 12, scope: !856, inlinedAt: !861)
!949 = !DILocation(line: 52, column: 115, scope: !862)
!950 = !DILocation(line: 52, column: 121, scope: !862)
!951 = !DILocation(line: 52, column: 9, scope: !862)
!952 = !DILocation(line: 53, column: 9, scope: !863)
!953 = !DILocation(line: 55, column: 9, scope: !954)
!954 = distinct !DILexicalBlock(scope: !854, file: !634, line: 55, column: 9)
!955 = !DILocation(line: 55, column: 14, scope: !954)
!956 = !DILocation(line: 55, column: 19, scope: !954)
!957 = !DILocation(line: 55, column: 9, scope: !854)
!958 = !DILocation(line: 56, column: 9, scope: !954)
!959 = !DILocation(line: 58, column: 24, scope: !854)
!960 = !DILocation(line: 58, column: 29, scope: !854)
!961 = !DILocation(line: 58, column: 5, scope: !854)
!962 = !DILocation(line: 60, column: 9, scope: !963)
!963 = distinct !DILexicalBlock(scope: !854, file: !634, line: 60, column: 9)
!964 = !DILocation(line: 60, column: 41, scope: !963)
!965 = !DILocation(line: 60, column: 9, scope: !854)
!966 = !DILocation(line: 61, column: 16, scope: !967)
!967 = distinct !DILexicalBlock(scope: !963, file: !634, line: 60, column: 46)
!968 = !DILocation(line: 61, column: 9, scope: !967)
!969 = !DILocation(line: 62, column: 13, scope: !967)
!970 = !DILocation(line: 63, column: 9, scope: !967)
!971 = !DILocation(line: 66, column: 14, scope: !972)
!972 = distinct !DILexicalBlock(scope: !854, file: !634, line: 66, column: 9)
!973 = !DILocation(line: 66, column: 10, scope: !972)
!974 = !DILocation(line: 66, column: 25, scope: !972)
!975 = !DILocation(line: 66, column: 32, scope: !976)
!976 = !DILexicalBlockFile(scope: !972, file: !634, discriminator: 1)
!977 = !DILocation(line: 66, column: 28, scope: !976)
!978 = !DILocation(line: 66, column: 47, scope: !976)
!979 = !DILocation(line: 66, column: 9, scope: !976)
!980 = !DILocation(line: 67, column: 39, scope: !981)
