; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_mix.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_mix.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!114 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !575)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !536, !537, !538, !539, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !436, !437, !439, !441, !443, !444, !445, !446, !447, !487, !488, !494, !503, !504, !505, !507, !508, !509, !510, !511}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !404, !405, !406, !407, !411, !412, !417, !421, !422, !423, !424, !426, !431, !435}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!278 = !{!279, !280, !281, !388, !392, !396, !400, !401, !402, !403}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !386, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !296, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !338, !340, !341, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !294)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !207, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !297, size: 256, align: 32, offset: 512)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !294)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !315, size: 512, align: 64, offset: 1472)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 512, align: 64, elements: !294)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !207, line: 55, baseType: !317)
!317 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !316, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !326, size: 512, align: 64, offset: 2304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, align: 64, elements: !294)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !329, line: 94, baseType: !330)
!329 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !329, line: 81, size: 192, align: 64, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !330, file: !329, line: 82, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !329, line: 73, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !329, line: 73, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !329, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !339, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !342, size: 64, align: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !24, line: 205, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !353, line: 86, baseType: !354)
!353 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !353, line: 86, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !24, line: 206, baseType: !327, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !351, size: 64, align: 64, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !371, size: 64, align: 64, offset: 3648)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 36, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !327, size: 64, align: 64, offset: 3776)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !327, size: 64, align: 64, offset: 3840)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !327, size: 64, align: 64, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !380, size: 64, align: 64, offset: 3968)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 216, baseType: !317)
!381 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !380, size: 64, align: 64, offset: 4032)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !380, size: 64, align: 64, offset: 4096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !380, size: 64, align: 64, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !327, size: 64, align: 64, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!285, !386, !200}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!200, !386, !285}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !397, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!200, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !397, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !397, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !173}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !408, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !413, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!200, !173, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !418, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !173}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !408, size: 64, align: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !427, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!200, !173, !184, !184, !430, !200, !200}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !432, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!200, !173, !191}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !408, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !430, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !440, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !442, size: 32, align: 32, offset: 320)
!442 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !438, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !440, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !442, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !448, size: 64, align: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458, !459, !481, !482, !483, !484, !485, !486}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !449, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !449, file: !169, line: 842, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !449, file: !169, line: 843, baseType: !442, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !449, file: !169, line: 845, baseType: !430, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !449, file: !169, line: 847, baseType: !430, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !449, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !449, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !449, file: !169, line: 874, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !463)
!463 = !{!464, !465, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !462, file: !277, line: 150, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !468)
!468 = !DISubroutineType(types: !469)
!469 = !{!200, !173, !470, !191, !474, !200}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !472)
!472 = !DISubroutineType(types: !473)
!473 = !{!200, !173, !191, !200, !200}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !462, file: !277, line: 151, baseType: !476, size: 8, align: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !477, line: 48, baseType: !478)
!477 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !477, line: 46, size: 8, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !478, file: !477, line: 47, baseType: !186, size: 8, align: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !449, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !449, file: !169, line: 895, baseType: !466, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !449, file: !169, line: 897, baseType: !430, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !449, file: !169, line: 906, baseType: !440, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !449, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !449, file: !169, line: 909, baseType: !442, size: 32, align: 32, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !491, file: !277, line: 155, baseType: !466, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !495, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !496, file: !277, line: 40, baseType: !430, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !277, line: 41, baseType: !430, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !277, line: 43, baseType: !495, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !430, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !506, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !327, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !442, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !438, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !438, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !316, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !527, line: 64, size: 256, align: 64, elements: !528)
!527 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !526, file: !527, line: 65, baseType: !442, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !526, file: !527, line: 66, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !526, file: !527, line: 68, baseType: !442, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !526, file: !527, line: 69, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !524, size: 64, align: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !524, size: 64, align: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !524, size: 64, align: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !527, line: 85, size: 256, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !541, file: !527, line: 86, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !541, file: !527, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !541, file: !527, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !541, file: !527, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !541, file: !527, line: 91, baseType: !442, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !541, file: !527, line: 92, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !540, size: 64, align: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !448, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !442, size: 32, align: 32, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !327, size: 64, align: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !572, size: 491520, align: 8, offset: 1984)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 61440)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!577 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!578 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFFrameSyncExtMode", file: !580, line: 60, size: 32, align: 32, elements: !581)
!580 = !DIFile(filename: "libavfilter/framesync.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!581 = !{!582, !583, !584}
!582 = !DIEnumerator(name: "EXT_STOP", value: 0)
!583 = !DIEnumerator(name: "EXT_NULL", value: 1)
!584 = !DIEnumerator(name: "EXT_INFINITY", value: 2)
!585 = !{!200, !442, !586, !589}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, align: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !207, line: 49, baseType: !588)
!588 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !592, line: 222, size: 16, align: 8, elements: !593)
!592 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !591, file: !592, line: 222, baseType: !587, size: 16, align: 16)
!595 = !{!596, !598, !599, !603, !604, !608, !609, !610}
!596 = distinct !DIGlobalVariable(name: "ff_vf_mix", scope: !0, file: !597, line: 327, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_mix)
!597 = !DIFile(filename: "libavfilter/vf_mix.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!598 = distinct !DIGlobalVariable(name: "ff_vf_tmix", scope: !0, file: !597, line: 402, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_tmix)
!599 = distinct !DIGlobalVariable(name: "outputs", scope: !0, file: !597, line: 315, type: !600, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @outputs)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 2)
!603 = distinct !DIGlobalVariable(name: "mix_class", scope: !0, file: !597, line: 325, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @mix_class)
!604 = distinct !DIGlobalVariable(name: "mix_options", scope: !0, file: !597, line: 304, type: !605, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @mix_options)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 4096, align: 64, elements: !294)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !126, line: 301, baseType: !195)
!608 = distinct !DIGlobalVariable(name: "inputs", scope: !0, file: !597, line: 391, type: !600, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @inputs)
!609 = distinct !DIGlobalVariable(name: "tmix_class", scope: !0, file: !597, line: 400, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @tmix_class)
!610 = distinct !DIGlobalVariable(name: "tmix_options", scope: !0, file: !597, line: 384, type: !611, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption }>* @tmix_options)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !606, size: 2048, align: 64, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 4)
!614 = !{i32 2, !"Dwarf Version", i32 4}
!615 = !{i32 2, !"Debug Info Version", i32 3}
!616 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!617 = distinct !DISubprogram(name: "init", scope: !597, file: !597, line: 73, type: !409, isLocal: true, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !618)
!618 = !{}
!619 = !DILocalVariable(name: "ctx", arg: 1, scope: !617, file: !597, line: 73, type: !173)
!620 = !DIExpression()
!621 = !DILocation(line: 73, column: 56, scope: !617)
!622 = !DILocalVariable(name: "s", scope: !617, file: !597, line: 75, type: !623)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "MixContext", file: !597, line: 54, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MixContext", file: !597, line: 33, size: 1664, align: 64, elements: !626)
!626 = !{!627, !628, !654, !655, !656, !657, !660, !661, !662, !663, !664, !665, !666, !667, !669, !670, !672}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !625, file: !597, line: 34, baseType: !178, size: 64, align: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !625, file: !597, line: 35, baseType: !629, size: 64, align: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !632, line: 123, baseType: !633)
!632 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !632, line: 81, size: 1280, align: 64, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640, !653}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !633, file: !632, line: 82, baseType: !184, size: 64, align: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !633, file: !632, line: 83, baseType: !292, size: 8, align: 8, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !633, file: !632, line: 92, baseType: !292, size: 8, align: 8, offset: 72)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !633, file: !632, line: 101, baseType: !292, size: 8, align: 8, offset: 80)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !633, file: !632, line: 106, baseType: !316, size: 64, align: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !633, file: !632, line: 117, baseType: !641, size: 1024, align: 32, offset: 192)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 1024, align: 32, elements: !612)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !632, line: 70, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !632, line: 31, size: 256, align: 32, elements: !644)
!644 = !{!645, !646, !647, !648, !649, !650, !651, !652}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !643, file: !632, line: 35, baseType: !200, size: 32, align: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !643, file: !632, line: 41, baseType: !200, size: 32, align: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !643, file: !632, line: 47, baseType: !200, size: 32, align: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !643, file: !632, line: 53, baseType: !200, size: 32, align: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !643, file: !632, line: 58, baseType: !200, size: 32, align: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !643, file: !632, line: 62, baseType: !200, size: 32, align: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !643, file: !632, line: 65, baseType: !200, size: 32, align: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !643, file: !632, line: 68, baseType: !200, size: 32, align: 32, offset: 224)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !633, file: !632, line: 122, baseType: !184, size: 64, align: 64, offset: 1216)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "weights_str", scope: !625, file: !597, line: 36, baseType: !430, size: 64, align: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !625, file: !597, line: 37, baseType: !200, size: 32, align: 32, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !625, file: !597, line: 38, baseType: !200, size: 32, align: 32, offset: 224)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !625, file: !597, line: 39, baseType: !658, size: 64, align: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !625, file: !597, line: 40, baseType: !659, size: 32, align: 32, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "wfactor", scope: !625, file: !597, line: 41, baseType: !659, size: 32, align: 32, offset: 352)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tmix", scope: !625, file: !597, line: 43, baseType: !200, size: 32, align: 32, offset: 384)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "nb_frames", scope: !625, file: !597, line: 44, baseType: !200, size: 32, align: 32, offset: 416)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !625, file: !597, line: 46, baseType: !200, size: 32, align: 32, offset: 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !625, file: !597, line: 47, baseType: !200, size: 32, align: 32, offset: 480)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nb_planes", scope: !625, file: !597, line: 48, baseType: !200, size: 32, align: 32, offset: 512)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !625, file: !597, line: 49, baseType: !668, size: 128, align: 32, offset: 544)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, align: 32, elements: !612)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !625, file: !597, line: 50, baseType: !668, size: 128, align: 32, offset: 672)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !625, file: !597, line: 52, baseType: !671, size: 64, align: 64, offset: 832)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !625, file: !597, line: 53, baseType: !673, size: 768, align: 64, offset: 896)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameSync", file: !580, line: 209, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameSync", file: !580, line: 146, size: 768, align: 64, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !681, !686, !687, !688, !689, !690, !691, !706, !707, !708}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !674, file: !580, line: 147, baseType: !178, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !674, file: !580, line: 152, baseType: !173, size: 64, align: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nb_in", scope: !674, file: !580, line: 157, baseType: !442, size: 32, align: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !674, file: !580, line: 162, baseType: !213, size: 64, align: 32, offset: 160)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !674, file: !580, line: 167, baseType: !206, size: 64, align: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "on_event", scope: !674, file: !580, line: 172, baseType: !682, size: 64, align: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{!200, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64, align: 64)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !674, file: !580, line: 177, baseType: !191, size: 64, align: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "in_request", scope: !674, file: !580, line: 182, baseType: !442, size: 32, align: 32, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !674, file: !580, line: 188, baseType: !442, size: 32, align: 32, offset: 480)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ready", scope: !674, file: !580, line: 193, baseType: !292, size: 8, align: 8, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !674, file: !580, line: 198, baseType: !292, size: 8, align: 8, offset: 520)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !674, file: !580, line: 203, baseType: !692, size: 64, align: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameSyncIn", file: !580, line: 141, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameSyncIn", file: !580, line: 81, size: 448, align: 64, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703, !704, !705}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !694, file: !580, line: 86, baseType: !579, size: 32, align: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !694, file: !580, line: 91, baseType: !579, size: 32, align: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !694, file: !580, line: 96, baseType: !213, size: 64, align: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !694, file: !580, line: 101, baseType: !285, size: 64, align: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "frame_next", scope: !694, file: !580, line: 106, baseType: !285, size: 64, align: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !694, file: !580, line: 111, baseType: !206, size: 64, align: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "pts_next", scope: !694, file: !580, line: 116, baseType: !206, size: 64, align: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "have_next", scope: !694, file: !580, line: 121, baseType: !292, size: 8, align: 8, offset: 384)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !694, file: !580, line: 126, baseType: !292, size: 8, align: 8, offset: 392)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !694, file: !580, line: 139, baseType: !442, size: 32, align: 32, offset: 416)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "opt_repeatlast", scope: !674, file: !580, line: 205, baseType: !200, size: 32, align: 32, offset: 640)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "opt_shortest", scope: !674, file: !580, line: 206, baseType: !200, size: 32, align: 32, offset: 672)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "opt_eof_action", scope: !674, file: !580, line: 207, baseType: !200, size: 32, align: 32, offset: 704)
!709 = !DILocation(line: 75, column: 17, scope: !617)
!710 = !DILocation(line: 75, column: 21, scope: !617)
!711 = !DILocation(line: 75, column: 26, scope: !617)
!712 = !DILocalVariable(name: "p", scope: !617, file: !597, line: 76, type: !430)
!713 = !DILocation(line: 76, column: 11, scope: !617)
!714 = !DILocalVariable(name: "arg", scope: !617, file: !597, line: 76, type: !430)
!715 = !DILocation(line: 76, column: 15, scope: !617)
!716 = !DILocalVariable(name: "saveptr", scope: !617, file: !597, line: 76, type: !430)
!717 = !DILocation(line: 76, column: 21, scope: !617)
!718 = !DILocalVariable(name: "i", scope: !617, file: !597, line: 77, type: !200)
!719 = !DILocation(line: 77, column: 9, scope: !617)
!720 = !DILocalVariable(name: "ret", scope: !617, file: !597, line: 77, type: !200)
!721 = !DILocation(line: 77, column: 12, scope: !617)
!722 = !DILocalVariable(name: "last", scope: !617, file: !597, line: 77, type: !200)
!723 = !DILocation(line: 77, column: 17, scope: !617)
!724 = !DILocation(line: 79, column: 23, scope: !617)
!725 = !DILocation(line: 79, column: 28, scope: !617)
!726 = !DILocation(line: 79, column: 36, scope: !617)
!727 = !DILocation(line: 79, column: 16, scope: !617)
!728 = !DILocation(line: 79, column: 15, scope: !617)
!729 = !DILocation(line: 79, column: 5, scope: !617)
!730 = !DILocation(line: 79, column: 8, scope: !617)
!731 = !DILocation(line: 79, column: 13, scope: !617)
!732 = !DILocation(line: 81, column: 27, scope: !617)
!733 = !DILocation(line: 81, column: 30, scope: !617)
!734 = !DILocation(line: 81, column: 17, scope: !617)
!735 = !DILocation(line: 81, column: 5, scope: !617)
!736 = !DILocation(line: 81, column: 8, scope: !617)
!737 = !DILocation(line: 81, column: 15, scope: !617)
!738 = !DILocation(line: 82, column: 10, scope: !739)
!739 = distinct !DILexicalBlock(scope: !617, file: !597, line: 82, column: 9)
!740 = !DILocation(line: 82, column: 13, scope: !739)
!741 = !DILocation(line: 82, column: 9, scope: !617)
!742 = !DILocation(line: 83, column: 9, scope: !739)
!743 = !DILocation(line: 85, column: 28, scope: !617)
!744 = !DILocation(line: 85, column: 31, scope: !617)
!745 = !DILocation(line: 85, column: 18, scope: !617)
!746 = !DILocation(line: 85, column: 5, scope: !617)
!747 = !DILocation(line: 85, column: 8, scope: !617)
!748 = !DILocation(line: 85, column: 16, scope: !617)
!749 = !DILocation(line: 86, column: 10, scope: !750)
!750 = distinct !DILexicalBlock(scope: !617, file: !597, line: 86, column: 9)
!751 = !DILocation(line: 86, column: 13, scope: !750)
!752 = !DILocation(line: 86, column: 9, scope: !617)
!753 = !DILocation(line: 87, column: 9, scope: !750)
!754 = !DILocation(line: 89, column: 10, scope: !755)
!755 = distinct !DILexicalBlock(scope: !617, file: !597, line: 89, column: 9)
!756 = !DILocation(line: 89, column: 13, scope: !755)
!757 = !DILocation(line: 89, column: 9, scope: !617)
!758 = !DILocation(line: 90, column: 16, scope: !759)
!759 = distinct !DILexicalBlock(scope: !760, file: !597, line: 90, column: 9)
!760 = distinct !DILexicalBlock(scope: !755, file: !597, line: 89, column: 19)
!761 = !DILocation(line: 90, column: 14, scope: !759)
!762 = !DILocation(line: 90, column: 21, scope: !763)
!763 = !DILexicalBlockFile(scope: !764, file: !597, discriminator: 1)
!764 = distinct !DILexicalBlock(scope: !759, file: !597, line: 90, column: 9)
!765 = !DILocation(line: 90, column: 25, scope: !763)
!766 = !DILocation(line: 90, column: 28, scope: !763)
!767 = !DILocation(line: 90, column: 23, scope: !763)
!768 = !DILocation(line: 90, column: 9, scope: !763)
!769 = !DILocalVariable(name: "pad", scope: !770, file: !597, line: 91, type: !275)
!770 = distinct !DILexicalBlock(scope: !764, file: !597, line: 90, column: 44)
!771 = !DILocation(line: 91, column: 25, scope: !770)
!772 = !DILocation(line: 93, column: 17, scope: !770)
!773 = !DILocation(line: 93, column: 22, scope: !770)
!774 = !DILocation(line: 94, column: 47, scope: !770)
!775 = !DILocation(line: 94, column: 24, scope: !770)
!776 = !DILocation(line: 94, column: 17, scope: !770)
!777 = !DILocation(line: 94, column: 22, scope: !770)
!778 = !DILocation(line: 95, column: 22, scope: !779)
!779 = distinct !DILexicalBlock(scope: !770, file: !597, line: 95, column: 17)
!780 = !DILocation(line: 95, column: 18, scope: !779)
!781 = !DILocation(line: 95, column: 17, scope: !770)
!782 = !DILocation(line: 96, column: 17, scope: !779)
!783 = !DILocation(line: 98, column: 40, scope: !784)
!784 = distinct !DILexicalBlock(scope: !770, file: !597, line: 98, column: 17)
!785 = !DILocation(line: 98, column: 45, scope: !784)
!786 = !DILocation(line: 98, column: 24, scope: !784)
!787 = !DILocation(line: 98, column: 22, scope: !784)
!788 = !DILocation(line: 98, column: 55, scope: !784)
!789 = !DILocation(line: 98, column: 17, scope: !770)
!790 = !DILocation(line: 99, column: 31, scope: !791)
!791 = distinct !DILexicalBlock(scope: !784, file: !597, line: 98, column: 60)
!792 = !DILocation(line: 99, column: 26, scope: !791)
!793 = !DILocation(line: 99, column: 17, scope: !791)
!794 = !DILocation(line: 100, column: 24, scope: !791)
!795 = !DILocation(line: 100, column: 17, scope: !791)
!796 = !DILocation(line: 102, column: 9, scope: !770)
!797 = !DILocation(line: 90, column: 40, scope: !798)
!798 = !DILexicalBlockFile(scope: !764, file: !597, discriminator: 2)
!799 = !DILocation(line: 90, column: 9, scope: !798)
!800 = distinct !{!800, !801}
!801 = !DILocation(line: 90, column: 9, scope: !760)
!802 = !DILocation(line: 103, column: 5, scope: !760)
!803 = !DILocation(line: 105, column: 9, scope: !617)
!804 = !DILocation(line: 105, column: 12, scope: !617)
!805 = !DILocation(line: 105, column: 7, scope: !617)
!806 = !DILocation(line: 106, column: 12, scope: !807)
!807 = distinct !DILexicalBlock(scope: !617, file: !597, line: 106, column: 5)
!808 = !DILocation(line: 106, column: 10, scope: !807)
!809 = !DILocation(line: 106, column: 17, scope: !810)
!810 = !DILexicalBlockFile(scope: !811, file: !597, discriminator: 1)
!811 = distinct !DILexicalBlock(scope: !807, file: !597, line: 106, column: 5)
!812 = !DILocation(line: 106, column: 21, scope: !810)
!813 = !DILocation(line: 106, column: 24, scope: !810)
!814 = !DILocation(line: 106, column: 19, scope: !810)
!815 = !DILocation(line: 106, column: 5, scope: !810)
!816 = !DILocation(line: 107, column: 31, scope: !817)
!817 = distinct !DILexicalBlock(scope: !818, file: !597, line: 107, column: 13)
!818 = distinct !DILexicalBlock(scope: !811, file: !597, line: 106, column: 40)
!819 = !DILocation(line: 107, column: 21, scope: !817)
!820 = !DILocation(line: 107, column: 19, scope: !817)
!821 = !DILocation(line: 107, column: 13, scope: !818)
!822 = !DILocation(line: 108, column: 13, scope: !817)
!823 = !DILocation(line: 110, column: 11, scope: !818)
!824 = !DILocation(line: 111, column: 19, scope: !818)
!825 = !DILocation(line: 111, column: 42, scope: !818)
!826 = !DILocation(line: 111, column: 31, scope: !818)
!827 = !DILocation(line: 111, column: 34, scope: !818)
!828 = !DILocation(line: 111, column: 9, scope: !818)
!829 = !DILocation(line: 112, column: 34, scope: !818)
!830 = !DILocation(line: 112, column: 23, scope: !818)
!831 = !DILocation(line: 112, column: 26, scope: !818)
!832 = !DILocation(line: 112, column: 9, scope: !818)
!833 = !DILocation(line: 112, column: 12, scope: !818)
!834 = !DILocation(line: 112, column: 20, scope: !818)
!835 = !DILocation(line: 113, column: 16, scope: !818)
!836 = !DILocation(line: 113, column: 14, scope: !818)
!837 = !DILocation(line: 114, column: 5, scope: !818)
!838 = !DILocation(line: 106, column: 36, scope: !839)
!839 = !DILexicalBlockFile(scope: !811, file: !597, discriminator: 2)
!840 = !DILocation(line: 106, column: 5, scope: !839)
!841 = distinct !{!841, !842}
!842 = !DILocation(line: 106, column: 5, scope: !617)
!843 = !DILocation(line: 115, column: 5, scope: !617)
!844 = !DILocation(line: 115, column: 12, scope: !845)
!845 = !DILexicalBlockFile(scope: !846, file: !597, discriminator: 1)
!846 = distinct !DILexicalBlock(scope: !847, file: !597, line: 115, column: 5)
!847 = distinct !DILexicalBlock(scope: !617, file: !597, line: 115, column: 5)
!848 = !DILocation(line: 115, column: 16, scope: !845)
!849 = !DILocation(line: 115, column: 19, scope: !845)
!850 = !DILocation(line: 115, column: 14, scope: !845)
!851 = !DILocation(line: 115, column: 5, scope: !845)
!852 = !DILocation(line: 116, column: 36, scope: !853)
!853 = distinct !DILexicalBlock(scope: !846, file: !597, line: 115, column: 35)
!854 = !DILocation(line: 116, column: 25, scope: !853)
!855 = !DILocation(line: 116, column: 28, scope: !853)
!856 = !DILocation(line: 116, column: 20, scope: !853)
!857 = !DILocation(line: 116, column: 9, scope: !853)
!858 = !DILocation(line: 116, column: 12, scope: !853)
!859 = !DILocation(line: 116, column: 23, scope: !853)
!860 = !DILocation(line: 117, column: 34, scope: !853)
!861 = !DILocation(line: 117, column: 23, scope: !853)
!862 = !DILocation(line: 117, column: 26, scope: !853)
!863 = !DILocation(line: 117, column: 9, scope: !853)
!864 = !DILocation(line: 117, column: 12, scope: !853)
!865 = !DILocation(line: 117, column: 20, scope: !853)
!866 = !DILocation(line: 118, column: 5, scope: !853)
!867 = !DILocation(line: 115, column: 31, scope: !868)
!868 = !DILexicalBlockFile(scope: !846, file: !597, discriminator: 2)
!869 = !DILocation(line: 115, column: 5, scope: !868)
!870 = distinct !{!870, !843}
!871 = !DILocation(line: 119, column: 9, scope: !872)
!872 = distinct !DILexicalBlock(scope: !617, file: !597, line: 119, column: 9)
!873 = !DILocation(line: 119, column: 12, scope: !872)
!874 = !DILocation(line: 119, column: 18, scope: !872)
!875 = !DILocation(line: 119, column: 9, scope: !617)
!876 = !DILocation(line: 120, column: 26, scope: !877)
!877 = distinct !DILexicalBlock(scope: !872, file: !597, line: 119, column: 24)
!878 = !DILocation(line: 120, column: 29, scope: !877)
!879 = !DILocation(line: 120, column: 24, scope: !877)
!880 = !DILocation(line: 120, column: 9, scope: !877)
!881 = !DILocation(line: 120, column: 12, scope: !877)
!882 = !DILocation(line: 120, column: 20, scope: !877)
!883 = !DILocation(line: 121, column: 5, scope: !877)
!884 = !DILocation(line: 122, column: 22, scope: !885)
!885 = distinct !DILexicalBlock(scope: !872, file: !597, line: 121, column: 12)
!886 = !DILocation(line: 122, column: 25, scope: !885)
!887 = !DILocation(line: 122, column: 9, scope: !885)
!888 = !DILocation(line: 122, column: 12, scope: !885)
!889 = !DILocation(line: 122, column: 20, scope: !885)
!890 = !DILocation(line: 125, column: 5, scope: !617)
!891 = !DILocation(line: 126, column: 1, scope: !617)
!892 = distinct !DISubprogram(name: "uninit", scope: !597, file: !597, line: 277, type: !419, isLocal: true, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !618)
!893 = !DILocalVariable(name: "ctx", arg: 1, scope: !892, file: !597, line: 277, type: !173)
!894 = !DILocation(line: 277, column: 59, scope: !892)
!895 = !DILocalVariable(name: "s", scope: !892, file: !597, line: 279, type: !623)
!896 = !DILocation(line: 279, column: 17, scope: !892)
!897 = !DILocation(line: 279, column: 21, scope: !892)
!898 = !DILocation(line: 279, column: 26, scope: !892)
!899 = !DILocalVariable(name: "i", scope: !892, file: !597, line: 280, type: !200)
!900 = !DILocation(line: 280, column: 9, scope: !892)
!901 = !DILocation(line: 282, column: 26, scope: !892)
!902 = !DILocation(line: 282, column: 29, scope: !892)
!903 = !DILocation(line: 282, column: 5, scope: !892)
!904 = !DILocation(line: 283, column: 15, scope: !892)
!905 = !DILocation(line: 283, column: 18, scope: !892)
!906 = !DILocation(line: 283, column: 14, scope: !892)
!907 = !DILocation(line: 283, column: 5, scope: !892)
!908 = !DILocation(line: 285, column: 10, scope: !909)
!909 = distinct !DILexicalBlock(scope: !892, file: !597, line: 285, column: 9)
!910 = !DILocation(line: 285, column: 13, scope: !909)
!911 = !DILocation(line: 285, column: 9, scope: !892)
!912 = !DILocation(line: 286, column: 16, scope: !913)
!913 = distinct !DILexicalBlock(scope: !914, file: !597, line: 286, column: 9)
!914 = distinct !DILexicalBlock(scope: !909, file: !597, line: 285, column: 19)
!915 = !DILocation(line: 286, column: 14, scope: !913)
!916 = !DILocation(line: 286, column: 21, scope: !917)
!917 = !DILexicalBlockFile(scope: !918, file: !597, discriminator: 1)
!918 = distinct !DILexicalBlock(scope: !913, file: !597, line: 286, column: 9)
!919 = !DILocation(line: 286, column: 25, scope: !917)
!920 = !DILocation(line: 286, column: 30, scope: !917)
!921 = !DILocation(line: 286, column: 23, scope: !917)
!922 = !DILocation(line: 286, column: 9, scope: !917)
!923 = !DILocation(line: 287, column: 39, scope: !918)
!924 = !DILocation(line: 287, column: 23, scope: !918)
!925 = !DILocation(line: 287, column: 28, scope: !918)
!926 = !DILocation(line: 287, column: 42, scope: !918)
!927 = !DILocation(line: 287, column: 22, scope: !918)
!928 = !DILocation(line: 287, column: 13, scope: !918)
!929 = !DILocation(line: 286, column: 42, scope: !930)
!930 = !DILexicalBlockFile(scope: !918, file: !597, discriminator: 2)
!931 = !DILocation(line: 286, column: 9, scope: !930)
!932 = distinct !{!932, !933}
!933 = !DILocation(line: 286, column: 9, scope: !914)
!934 = !DILocation(line: 288, column: 5, scope: !914)
!935 = !DILocation(line: 289, column: 16, scope: !936)
!936 = distinct !DILexicalBlock(scope: !937, file: !597, line: 289, column: 9)
!937 = distinct !DILexicalBlock(scope: !909, file: !597, line: 288, column: 12)
!938 = !DILocation(line: 289, column: 14, scope: !936)
!939 = !DILocation(line: 289, column: 21, scope: !940)
!940 = !DILexicalBlockFile(scope: !941, file: !597, discriminator: 1)
!941 = distinct !DILexicalBlock(scope: !936, file: !597, line: 289, column: 9)
!942 = !DILocation(line: 289, column: 25, scope: !940)
!943 = !DILocation(line: 289, column: 28, scope: !940)
!944 = !DILocation(line: 289, column: 23, scope: !940)
!945 = !DILocation(line: 289, column: 9, scope: !940)
!946 = !DILocation(line: 290, column: 38, scope: !941)
!947 = !DILocation(line: 290, column: 28, scope: !941)
!948 = !DILocation(line: 290, column: 31, scope: !941)
!949 = !DILocation(line: 290, column: 13, scope: !941)
!950 = !DILocation(line: 289, column: 40, scope: !951)
!951 = !DILexicalBlockFile(scope: !941, file: !597, discriminator: 2)
!952 = !DILocation(line: 289, column: 9, scope: !951)
!953 = distinct !{!953, !954}
!954 = !DILocation(line: 289, column: 9, scope: !937)
!955 = !DILocation(line: 292, column: 15, scope: !892)
!956 = !DILocation(line: 292, column: 18, scope: !892)
!957 = !DILocation(line: 292, column: 14, scope: !892)
!958 = !DILocation(line: 292, column: 5, scope: !892)
!959 = !DILocation(line: 293, column: 1, scope: !892)
!960 = distinct !DISubprogram(name: "query_formats", scope: !597, file: !597, line: 56, type: !409, isLocal: true, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !618)
!961 = !DILocalVariable(name: "ctx", arg: 1, scope: !960, file: !597, line: 56, type: !173)
!962 = !DILocation(line: 56, column: 43, scope: !960)
!963 = !DILocalVariable(name: "pix_fmts", scope: !960, file: !597, line: 58, type: !524)
!964 = !DILocation(line: 58, column: 22, scope: !960)
!965 = !DILocalVariable(name: "fmt", scope: !960, file: !597, line: 59, type: !200)
!966 = !DILocation(line: 59, column: 9, scope: !960)
!967 = !DILocalVariable(name: "ret", scope: !960, file: !597, line: 59, type: !200)
!968 = !DILocation(line: 59, column: 14, scope: !960)
!969 = !DILocation(line: 61, column: 14, scope: !970)
!970 = distinct !DILexicalBlock(scope: !960, file: !597, line: 61, column: 5)
!971 = !DILocation(line: 61, column: 10, scope: !970)
!972 = !DILocation(line: 61, column: 39, scope: !973)
!973 = !DILexicalBlockFile(scope: !974, file: !597, discriminator: 1)
!974 = distinct !DILexicalBlock(scope: !970, file: !597, line: 61, column: 5)
!975 = !DILocation(line: 61, column: 19, scope: !973)
!976 = !DILocation(line: 61, column: 5, scope: !973)
!977 = !DILocalVariable(name: "desc", scope: !978, file: !597, line: 62, type: !629)
!978 = distinct !DILexicalBlock(scope: !974, file: !597, line: 61, column: 52)
!979 = !DILocation(line: 62, column: 35, scope: !978)
!980 = !DILocation(line: 62, column: 62, scope: !978)
!981 = !DILocation(line: 62, column: 42, scope: !978)
!982 = !DILocation(line: 63, column: 15, scope: !983)
!983 = distinct !DILexicalBlock(scope: !978, file: !597, line: 63, column: 13)
!984 = !DILocation(line: 63, column: 21, scope: !983)
!985 = !DILocation(line: 63, column: 27, scope: !983)
!986 = !DILocation(line: 63, column: 38, scope: !983)
!987 = !DILocation(line: 64, column: 15, scope: !983)
!988 = !DILocation(line: 64, column: 21, scope: !983)
!989 = !DILocation(line: 64, column: 27, scope: !983)
!990 = !DILocation(line: 64, column: 38, scope: !983)
!991 = !DILocation(line: 65, column: 15, scope: !983)
!992 = !DILocation(line: 65, column: 21, scope: !983)
!993 = !DILocation(line: 65, column: 27, scope: !983)
!994 = !DILocation(line: 65, column: 39, scope: !983)
!995 = !DILocation(line: 66, column: 45, scope: !983)
!996 = !DILocation(line: 66, column: 20, scope: !983)
!997 = !DILocation(line: 66, column: 18, scope: !983)
!998 = !DILocation(line: 66, column: 51, scope: !983)
!999 = !DILocation(line: 63, column: 13, scope: !1000)
!1000 = !DILexicalBlockFile(scope: !978, file: !597, discriminator: 1)
!1001 = !DILocation(line: 67, column: 20, scope: !983)
!1002 = !DILocation(line: 67, column: 13, scope: !983)
!1003 = !DILocation(line: 68, column: 5, scope: !978)
!1004 = !DILocation(line: 61, column: 48, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !974, file: !597, discriminator: 2)
!1006 = !DILocation(line: 61, column: 5, scope: !1005)
!1007 = distinct !{!1007, !1008}
!1008 = !DILocation(line: 61, column: 5, scope: !960)
!1009 = !DILocation(line: 70, column: 34, scope: !960)
!1010 = !DILocation(line: 70, column: 39, scope: !960)
!1011 = !DILocation(line: 70, column: 12, scope: !960)
!1012 = !DILocation(line: 70, column: 5, scope: !960)
!1013 = !DILocation(line: 71, column: 1, scope: !960)
!1014 = distinct !DISubprogram(name: "activate", scope: !597, file: !597, line: 295, type: !409, isLocal: true, isDefinition: true, scopeLine: 296, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !618)
!1015 = !DILocalVariable(name: "ctx", arg: 1, scope: !1014, file: !597, line: 295, type: !173)
!1016 = !DILocation(line: 295, column: 38, scope: !1014)
!1017 = !DILocalVariable(name: "s", scope: !1014, file: !597, line: 297, type: !623)
!1018 = !DILocation(line: 297, column: 17, scope: !1014)
!1019 = !DILocation(line: 297, column: 21, scope: !1014)
!1020 = !DILocation(line: 297, column: 26, scope: !1014)
!1021 = !DILocation(line: 298, column: 35, scope: !1014)
!1022 = !DILocation(line: 298, column: 38, scope: !1014)
!1023 = !DILocation(line: 298, column: 12, scope: !1014)
!1024 = !DILocation(line: 298, column: 5, scope: !1014)
!1025 = distinct !DISubprogram(name: "config_output", scope: !597, file: !597, line: 216, type: !398, isLocal: true, isDefinition: true, scopeLine: 217, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !618)
!1026 = !DILocalVariable(name: "outlink", arg: 1, scope: !1025, file: !597, line: 216, type: !386)
!1027 = !DILocation(line: 216, column: 40, scope: !1025)
!1028 = !DILocalVariable(name: "ctx", scope: !1025, file: !597, line: 218, type: !173)
!1029 = !DILocation(line: 218, column: 22, scope: !1025)
!1030 = !DILocation(line: 218, column: 28, scope: !1025)
!1031 = !DILocation(line: 218, column: 37, scope: !1025)
!1032 = !DILocalVariable(name: "s", scope: !1025, file: !597, line: 219, type: !623)
!1033 = !DILocation(line: 219, column: 17, scope: !1025)
!1034 = !DILocation(line: 219, column: 21, scope: !1025)
!1035 = !DILocation(line: 219, column: 26, scope: !1025)
!1036 = !DILocalVariable(name: "time_base", scope: !1025, file: !597, line: 220, type: !213)
!1037 = !DILocation(line: 220, column: 16, scope: !1025)
!1038 = !DILocation(line: 220, column: 28, scope: !1025)
!1039 = !DILocation(line: 220, column: 33, scope: !1025)
!1040 = !DILocation(line: 220, column: 44, scope: !1025)
!1041 = !DILocalVariable(name: "frame_rate", scope: !1025, file: !597, line: 221, type: !213)
!1042 = !DILocation(line: 221, column: 16, scope: !1025)
!1043 = !DILocation(line: 221, column: 29, scope: !1025)
!1044 = !DILocation(line: 221, column: 34, scope: !1025)
!1045 = !DILocation(line: 221, column: 45, scope: !1025)
!1046 = !DILocalVariable(name: "inlink", scope: !1025, file: !597, line: 222, type: !386)
!1047 = !DILocation(line: 222, column: 19, scope: !1025)
!1048 = !DILocation(line: 222, column: 28, scope: !1025)
!1049 = !DILocation(line: 222, column: 33, scope: !1025)
!1050 = !DILocalVariable(name: "height", scope: !1025, file: !597, line: 223, type: !200)
!1051 = !DILocation(line: 223, column: 9, scope: !1025)
!1052 = !DILocation(line: 223, column: 18, scope: !1025)
!1053 = !DILocation(line: 223, column: 23, scope: !1025)
!1054 = !DILocation(line: 223, column: 34, scope: !1025)
!1055 = !DILocalVariable(name: "width", scope: !1025, file: !597, line: 224, type: !200)
!1056 = !DILocation(line: 224, column: 9, scope: !1025)
!1057 = !DILocation(line: 224, column: 17, scope: !1025)
!1058 = !DILocation(line: 224, column: 22, scope: !1025)
!1059 = !DILocation(line: 224, column: 33, scope: !1025)
!1060 = !DILocalVariable(name: "in", scope: !1025, file: !597, line: 225, type: !692)
!1061 = !DILocation(line: 225, column: 20, scope: !1025)
!1062 = !DILocalVariable(name: "i", scope: !1025, file: !597, line: 226, type: !200)
!1063 = !DILocation(line: 226, column: 9, scope: !1025)
!1064 = !DILocalVariable(name: "ret", scope: !1025, file: !597, line: 226, type: !200)
!1065 = !DILocation(line: 226, column: 12, scope: !1025)
!1066 = !DILocation(line: 228, column: 10, scope: !1067)
!1067 = distinct !DILexicalBlock(scope: !1025, file: !597, line: 228, column: 9)
!1068 = !DILocation(line: 228, column: 13, scope: !1067)
!1069 = !DILocation(line: 228, column: 9, scope: !1025)
!1070 = !DILocation(line: 229, column: 16, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !597, line: 229, column: 9)
!1072 = distinct !DILexicalBlock(scope: !1067, file: !597, line: 228, column: 19)
!1073 = !DILocation(line: 229, column: 14, scope: !1071)
!1074 = !DILocation(line: 229, column: 21, scope: !1075)
!1075 = !DILexicalBlockFile(scope: !1076, file: !597, discriminator: 1)
!1076 = distinct !DILexicalBlock(scope: !1071, file: !597, line: 229, column: 9)
!1077 = !DILocation(line: 229, column: 25, scope: !1075)
!1078 = !DILocation(line: 229, column: 28, scope: !1075)
!1079 = !DILocation(line: 229, column: 23, scope: !1075)
!1080 = !DILocation(line: 229, column: 9, scope: !1075)
!1081 = !DILocation(line: 230, column: 29, scope: !1082)
!1082 = distinct !DILexicalBlock(scope: !1083, file: !597, line: 230, column: 17)
!1083 = distinct !DILexicalBlock(scope: !1076, file: !597, line: 229, column: 44)
!1084 = !DILocation(line: 230, column: 17, scope: !1082)
!1085 = !DILocation(line: 230, column: 22, scope: !1082)
!1086 = !DILocation(line: 230, column: 33, scope: !1082)
!1087 = !DILocation(line: 230, column: 38, scope: !1082)
!1088 = !DILocation(line: 230, column: 35, scope: !1082)
!1089 = !DILocation(line: 230, column: 45, scope: !1082)
!1090 = !DILocation(line: 230, column: 60, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1082, file: !597, discriminator: 1)
!1092 = !DILocation(line: 230, column: 48, scope: !1091)
!1093 = !DILocation(line: 230, column: 53, scope: !1091)
!1094 = !DILocation(line: 230, column: 64, scope: !1091)
!1095 = !DILocation(line: 230, column: 69, scope: !1091)
!1096 = !DILocation(line: 230, column: 66, scope: !1091)
!1097 = !DILocation(line: 230, column: 17, scope: !1091)
!1098 = !DILocation(line: 231, column: 24, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1082, file: !597, line: 230, column: 76)
!1100 = !DILocation(line: 231, column: 98, scope: !1099)
!1101 = !DILocation(line: 231, column: 113, scope: !1099)
!1102 = !DILocation(line: 231, column: 101, scope: !1099)
!1103 = !DILocation(line: 231, column: 106, scope: !1099)
!1104 = !DILocation(line: 231, column: 117, scope: !1099)
!1105 = !DILocation(line: 231, column: 132, scope: !1099)
!1106 = !DILocation(line: 231, column: 120, scope: !1099)
!1107 = !DILocation(line: 231, column: 125, scope: !1099)
!1108 = !DILocation(line: 231, column: 136, scope: !1099)
!1109 = !DILocation(line: 231, column: 142, scope: !1099)
!1110 = !DILocation(line: 231, column: 149, scope: !1099)
!1111 = !DILocation(line: 231, column: 17, scope: !1099)
!1112 = !DILocation(line: 232, column: 17, scope: !1099)
!1113 = !DILocation(line: 234, column: 9, scope: !1083)
!1114 = !DILocation(line: 229, column: 40, scope: !1115)
!1115 = !DILexicalBlockFile(scope: !1076, file: !597, discriminator: 2)
!1116 = !DILocation(line: 229, column: 9, scope: !1115)
!1117 = distinct !{!1117, !1118}
!1118 = !DILocation(line: 229, column: 9, scope: !1072)
!1119 = !DILocation(line: 235, column: 5, scope: !1072)
!1120 = !DILocation(line: 237, column: 35, scope: !1025)
!1121 = !DILocation(line: 237, column: 44, scope: !1025)
!1122 = !DILocation(line: 237, column: 15, scope: !1025)
!1123 = !DILocation(line: 237, column: 5, scope: !1025)
!1124 = !DILocation(line: 237, column: 8, scope: !1025)
!1125 = !DILocation(line: 237, column: 13, scope: !1025)
!1126 = !DILocation(line: 238, column: 10, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1025, file: !597, line: 238, column: 9)
!1128 = !DILocation(line: 238, column: 13, scope: !1127)
!1129 = !DILocation(line: 238, column: 9, scope: !1025)
!1130 = !DILocation(line: 239, column: 9, scope: !1127)
!1131 = !DILocation(line: 240, column: 44, scope: !1025)
!1132 = !DILocation(line: 240, column: 53, scope: !1025)
!1133 = !DILocation(line: 240, column: 20, scope: !1025)
!1134 = !DILocation(line: 240, column: 5, scope: !1025)
!1135 = !DILocation(line: 240, column: 8, scope: !1025)
!1136 = !DILocation(line: 240, column: 18, scope: !1025)
!1137 = !DILocation(line: 241, column: 16, scope: !1025)
!1138 = !DILocation(line: 241, column: 19, scope: !1025)
!1139 = !DILocation(line: 241, column: 25, scope: !1025)
!1140 = !DILocation(line: 241, column: 33, scope: !1025)
!1141 = !DILocation(line: 241, column: 5, scope: !1025)
!1142 = !DILocation(line: 241, column: 8, scope: !1025)
!1143 = !DILocation(line: 241, column: 14, scope: !1025)
!1144 = !DILocation(line: 242, column: 20, scope: !1025)
!1145 = !DILocation(line: 242, column: 23, scope: !1025)
!1146 = !DILocation(line: 242, column: 17, scope: !1025)
!1147 = !DILocation(line: 242, column: 30, scope: !1025)
!1148 = !DILocation(line: 242, column: 5, scope: !1025)
!1149 = !DILocation(line: 242, column: 8, scope: !1025)
!1150 = !DILocation(line: 242, column: 12, scope: !1025)
!1151 = !DILocation(line: 244, column: 40, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !1025, file: !597, line: 244, column: 9)
!1153 = !DILocation(line: 244, column: 43, scope: !1152)
!1154 = !DILocation(line: 244, column: 53, scope: !1152)
!1155 = !DILocation(line: 244, column: 61, scope: !1152)
!1156 = !DILocation(line: 244, column: 69, scope: !1152)
!1157 = !DILocation(line: 244, column: 77, scope: !1152)
!1158 = !DILocation(line: 244, column: 16, scope: !1152)
!1159 = !DILocation(line: 244, column: 14, scope: !1152)
!1160 = !DILocation(line: 244, column: 81, scope: !1152)
!1161 = !DILocation(line: 244, column: 9, scope: !1025)
!1162 = !DILocation(line: 245, column: 16, scope: !1152)
!1163 = !DILocation(line: 245, column: 9, scope: !1152)
!1164 = !DILocation(line: 247, column: 89, scope: !1025)
!1165 = !DILocation(line: 247, column: 97, scope: !1025)
!1166 = !DILocation(line: 247, column: 87, scope: !1025)
!1167 = !DILocation(line: 247, column: 105, scope: !1025)
!1168 = !DILocation(line: 247, column: 108, scope: !1025)
!1169 = !DILocation(line: 247, column: 114, scope: !1025)
!1170 = !DILocation(line: 247, column: 104, scope: !1025)
!1171 = !DILocation(line: 247, column: 101, scope: !1025)
!1172 = !DILocation(line: 247, column: 84, scope: !1025)
!1173 = !DILocation(line: 247, column: 20, scope: !1025)
!1174 = !DILocation(line: 247, column: 23, scope: !1025)
!1175 = !DILocation(line: 247, column: 33, scope: !1025)
!1176 = !DILocation(line: 247, column: 5, scope: !1025)
!1177 = !DILocation(line: 247, column: 8, scope: !1025)
!1178 = !DILocation(line: 247, column: 18, scope: !1025)
!1179 = !DILocation(line: 248, column: 35, scope: !1025)
!1180 = !DILocation(line: 248, column: 43, scope: !1025)
!1181 = !DILocation(line: 248, column: 20, scope: !1025)
!1182 = !DILocation(line: 248, column: 23, scope: !1025)
!1183 = !DILocation(line: 248, column: 33, scope: !1025)
!1184 = !DILocation(line: 248, column: 5, scope: !1025)
!1185 = !DILocation(line: 248, column: 8, scope: !1025)
!1186 = !DILocation(line: 248, column: 18, scope: !1025)
!1187 = !DILocation(line: 250, column: 9, scope: !1188)
!1188 = distinct !DILexicalBlock(scope: !1025, file: !597, line: 250, column: 9)
!1189 = !DILocation(line: 250, column: 12, scope: !1188)
!1190 = !DILocation(line: 250, column: 9, scope: !1025)
!1191 = !DILocation(line: 251, column: 9, scope: !1188)
!1192 = !DILocation(line: 253, column: 18, scope: !1025)
!1193 = !DILocation(line: 253, column: 5, scope: !1025)
!1194 = !DILocation(line: 253, column: 14, scope: !1025)
!1195 = !DILocation(line: 253, column: 16, scope: !1025)
!1196 = !DILocation(line: 254, column: 18, scope: !1025)
!1197 = !DILocation(line: 254, column: 5, scope: !1025)
!1198 = !DILocation(line: 254, column: 14, scope: !1025)
!1199 = !DILocation(line: 254, column: 16, scope: !1025)
!1200 = !DILocation(line: 255, column: 5, scope: !1025)
!1201 = !DILocation(line: 255, column: 14, scope: !1025)
!1202 = !DILocation(line: 255, column: 26, scope: !1025)
!1203 = !DILocation(line: 256, column: 5, scope: !1025)
!1204 = !DILocation(line: 256, column: 14, scope: !1025)
!1205 = !DILocation(line: 256, column: 27, scope: !1025)
!1206 = !DILocation(line: 258, column: 35, scope: !1207)
!1207 = distinct !DILexicalBlock(scope: !1025, file: !597, line: 258, column: 9)
!1208 = !DILocation(line: 258, column: 38, scope: !1207)
!1209 = !DILocation(line: 258, column: 42, scope: !1207)
!1210 = !DILocation(line: 258, column: 47, scope: !1207)
!1211 = !DILocation(line: 258, column: 50, scope: !1207)
!1212 = !DILocation(line: 258, column: 16, scope: !1207)
!1213 = !DILocation(line: 258, column: 14, scope: !1207)
!1214 = !DILocation(line: 258, column: 62, scope: !1207)
!1215 = !DILocation(line: 258, column: 9, scope: !1025)
!1216 = !DILocation(line: 259, column: 16, scope: !1207)
!1217 = !DILocation(line: 259, column: 9, scope: !1207)
!1218 = !DILocation(line: 261, column: 10, scope: !1025)
!1219 = !DILocation(line: 261, column: 13, scope: !1025)
!1220 = !DILocation(line: 261, column: 16, scope: !1025)
!1221 = !DILocation(line: 261, column: 8, scope: !1025)
!1222 = !DILocation(line: 262, column: 20, scope: !1025)
!1223 = !DILocation(line: 262, column: 5, scope: !1025)
!1224 = !DILocation(line: 262, column: 8, scope: !1025)
!1225 = !DILocation(line: 262, column: 11, scope: !1025)
!1226 = !DILocation(line: 262, column: 18, scope: !1025)
!1227 = !DILocation(line: 263, column: 5, scope: !1025)
!1228 = !DILocation(line: 263, column: 8, scope: !1025)
!1229 = !DILocation(line: 263, column: 11, scope: !1025)
!1230 = !DILocation(line: 263, column: 20, scope: !1025)
!1231 = !DILocation(line: 265, column: 12, scope: !1232)
