; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aacps_fixed.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aacps_fixed.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.anon = type { i8*, i8*, i32, i32 }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.SoftFloat = type { i32, i32 }

!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 58, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/aacps.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "huff_iid_df1", value: 0)
!891 = !DIEnumerator(name: "huff_iid_dt1", value: 1)
!892 = !DIEnumerator(name: "huff_iid_df0", value: 2)
!893 = !DIEnumerator(name: "huff_iid_dt0", value: 3)
!894 = !DIEnumerator(name: "huff_icc_df", value: 4)
!895 = !DIEnumerator(name: "huff_icc_dt", value: 5)
!896 = !DIEnumerator(name: "huff_ipd_df", value: 6)
!897 = !DIEnumerator(name: "huff_ipd_dt", value: 7)
!898 = !DIEnumerator(name: "huff_opd_df", value: 8)
!899 = !DIEnumerator(name: "huff_opd_dt", value: 9)
!900 = !{!901, !910, !919, !906, !918, !921, !925, !927, !904, !928, !931}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 2048, align: 32, elements: !907)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !905, line: 37, baseType: !906)
!905 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!906 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!907 = !{!908, !909}
!908 = !DISubrange(count: 32)
!909 = !DISubrange(count: 2)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !913, line: 221, size: 32, align: 8, elements: !914)
!913 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !912, file: !913, line: 221, baseType: !916, size: 32, align: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !917, line: 51, baseType: !918)
!917 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !917, line: 48, baseType: !920)
!920 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 512, align: 32, elements: !923)
!923 = !{!924, !909}
!924 = !DISubrange(count: 8)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !917, line: 40, baseType: !926)
!926 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT64FLOAT", file: !905, line: 39, baseType: !925)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 64, align: 32, elements: !930)
!930 = !{!909}
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !917, line: 38, baseType: !906)
!932 = !{!933, !951, !957, !961, !965, !969, !973, !974, !978, !979, !980, !981, !993, !1000, !1001, !1005, !1008, !1012, !1014, !1015, !1020, !1023, !1026, !1027, !1031, !1035, !1039, !1040, !1041, !1045, !1049, !1050, !1054, !1055, !1056, !1059, !1060, !1065, !1068, !1073, !1074, !1078, !1080, !1081, !1082, !1086, !1088, !1089, !1090, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1103, !1104, !1108, !1109, !1112, !1113, !1114, !1118, !1121, !1129, !1130, !1135, !1137, !1141, !1142, !1143, !1144, !1145, !1149, !1150, !1151, !1152, !1153, !1154, !1157, !1158, !1160, !1161, !1162}
!933 = distinct !DIGlobalVariable(name: "ps_tmp", scope: !934, file: !888, line: 1016, type: !938, isLocal: true, isDefinition: true, variable: [10 x %struct.anon]* @ff_ps_init_fixed.ps_tmp)
!934 = distinct !DISubprogram(name: "ff_ps_init_fixed", scope: !888, file: !888, line: 1011, type: !935, isLocal: false, isDefinition: true, scopeLine: 1011, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !937)
!935 = !DISubroutineType(types: !936)
!936 = !{null}
!937 = !{}
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 1920, align: 64, elements: !949)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !934, file: !888, line: 1013, size: 192, align: 64, elements: !941)
!941 = !{!942, !945, !946, !948}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ps_codes", scope: !940, file: !888, line: 1014, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ps_bits", scope: !940, file: !888, line: 1014, baseType: !943, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !940, file: !888, line: 1015, baseType: !947, size: 32, align: 32, offset: 128)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "elem_size", scope: !940, file: !888, line: 1015, baseType: !947, size: 32, align: 32, offset: 160)
!949 = !{!950}
!950 = !DISubrange(count: 10)
!951 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1029, type: !952, isLocal: true, isDefinition: true, variable: [1544 x [2 x i16]]* @ff_ps_init_fixed.table)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 49408, align: 16, elements: !955)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !917, line: 37, baseType: !954)
!954 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!955 = !{!956, !909}
!956 = !DISubrange(count: 1544)
!957 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1030, type: !958, isLocal: true, isDefinition: true, variable: [832 x [2 x i16]]* @ff_ps_init_fixed.table.7)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 26624, align: 16, elements: !959)
!959 = !{!960, !909}
!960 = !DISubrange(count: 832)
!961 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1031, type: !962, isLocal: true, isDefinition: true, variable: [1024 x [2 x i16]]* @ff_ps_init_fixed.table.8)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 32768, align: 16, elements: !963)
!963 = !{!964, !909}
!964 = !DISubrange(count: 1024)
!965 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1032, type: !966, isLocal: true, isDefinition: true, variable: [1036 x [2 x i16]]* @ff_ps_init_fixed.table.9)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 33152, align: 16, elements: !967)
!967 = !{!968, !909}
!968 = !DISubrange(count: 1036)
!969 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1033, type: !970, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_ps_init_fixed.table.10)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 17408, align: 16, elements: !971)
!971 = !{!972, !909}
!972 = !DISubrange(count: 544)
!973 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1034, type: !970, isLocal: true, isDefinition: true, variable: [544 x [2 x i16]]* @ff_ps_init_fixed.table.11)
!974 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1035, type: !975, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init_fixed.table.12)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 16384, align: 16, elements: !976)
!976 = !{!977, !909}
!977 = !DISubrange(count: 512)
!978 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1036, type: !975, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init_fixed.table.13)
!979 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1037, type: !975, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init_fixed.table.14)
!980 = distinct !DIGlobalVariable(name: "table", scope: !934, file: !888, line: 1038, type: !975, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_ps_init_fixed.table.15)
!981 = distinct !DIGlobalVariable(name: "vlc_ps", scope: !0, file: !888, line: 78, type: !982, isLocal: true, isDefinition: true, variable: [10 x %struct.VLC]* @vlc_ps)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 1920, align: 64, elements: !949)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !984, line: 30, baseType: !985)
!984 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !984, line: 26, size: 192, align: 64, elements: !986)
!986 = !{!987, !988, !991, !992}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !985, file: !984, line: 27, baseType: !906, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !985, file: !984, line: 28, baseType: !989, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 32, align: 16, elements: !930)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !985, file: !984, line: 29, baseType: !906, size: 32, align: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !985, file: !984, line: 29, baseType: !906, size: 32, align: 32, offset: 160)
!993 = distinct !DIGlobalVariable(name: "nr_iidicc_par_tab", scope: !0, file: !888, line: 50, type: !994, isLocal: true, isDefinition: true, variable: [6 x i8]* @nr_iidicc_par_tab)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 48, align: 8, elements: !998)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !917, line: 36, baseType: !997)
!997 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!998 = !{!999}
!999 = !DISubrange(count: 6)
!1000 = distinct !DIGlobalVariable(name: "nr_iidopd_par_tab", scope: !0, file: !888, line: 54, type: !994, isLocal: true, isDefinition: true, variable: [6 x i8]* @nr_iidopd_par_tab)
!1001 = distinct !DIGlobalVariable(name: "num_env_tab", scope: !0, file: !888, line: 45, type: !1002, isLocal: true, isDefinition: true, variable: [2 x [4 x i8]]* @num_env_tab)
!1002 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 64, align: 8, elements: !1003)
!1003 = !{!909, !1004}
!1004 = !DISubrange(count: 4)
!1005 = distinct !DIGlobalVariable(name: "huff_offset", scope: !0, file: !1006, line: 136, type: !1007, isLocal: true, isDefinition: true, variable: [10 x i8]* @huff_offset)
!1006 = !DIFile(filename: "libavcodec/aacpsdata.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 80, align: 8, elements: !949)
!1008 = distinct !DIGlobalVariable(name: "huff_iid", scope: !0, file: !888, line: 71, type: !1009, isLocal: true, isDefinition: true, variable: [4 x i32]* @huff_iid)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 128, align: 32, elements: !1011)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!1011 = !{!1004}
!1012 = distinct !DIGlobalVariable(name: "NR_BANDS", scope: !0, file: !888, line: 455, type: !1013, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_BANDS)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 64, align: 32, elements: !930)
!1014 = distinct !DIGlobalVariable(name: "NR_ALLPASS_BANDS", scope: !0, file: !888, line: 459, type: !1013, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_ALLPASS_BANDS)
!1015 = distinct !DIGlobalVariable(name: "f34_0_12", scope: !0, file: !1016, line: 52, type: !1017, isLocal: true, isDefinition: true, variable: [12 x [8 x [2 x i32]]]* @f34_0_12)
!1016 = !DIFile(filename: "libavcodec/aacps_fixed_tablegen.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 6144, align: 32, elements: !1018)
!1018 = !{!1019, !924, !909}
!1019 = !DISubrange(count: 12)
!1020 = distinct !DIGlobalVariable(name: "f34_1_8", scope: !0, file: !1016, line: 53, type: !1021, isLocal: true, isDefinition: true, variable: [8 x [8 x [2 x i32]]]* @f34_1_8)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 4096, align: 32, elements: !1022)
!1022 = !{!924, !924, !909}
!1023 = distinct !DIGlobalVariable(name: "f34_2_4", scope: !0, file: !1016, line: 54, type: !1024, isLocal: true, isDefinition: true, variable: [4 x [8 x [2 x i32]]]* @f34_2_4)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 2048, align: 32, elements: !1025)
!1025 = !{!1004, !924, !909}
!1026 = distinct !DIGlobalVariable(name: "f20_0_8", scope: !0, file: !1016, line: 51, type: !1021, isLocal: true, isDefinition: true, variable: [8 x [8 x [2 x i32]]]* @f20_0_8)
!1027 = distinct !DIGlobalVariable(name: "g1_Q2", scope: !0, file: !1006, line: 160, type: !1028, isLocal: true, isDefinition: true, variable: [7 x i32]* @g1_Q2)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 224, align: 32, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 7)
!1031 = distinct !DIGlobalVariable(name: "k_to_i_34", scope: !0, file: !1006, line: 152, type: !1032, isLocal: true, isDefinition: true, variable: [91 x i8]* @k_to_i_34)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 728, align: 8, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 91)
!1035 = distinct !DIGlobalVariable(name: "k_to_i_20", scope: !0, file: !1006, line: 145, type: !1036, isLocal: true, isDefinition: true, variable: [71 x i8]* @k_to_i_20)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !995, size: 568, align: 8, elements: !1037)
!1037 = !{!1038}
!1038 = !DISubrange(count: 71)
!1039 = distinct !DIGlobalVariable(name: "NR_PAR_BANDS", scope: !0, file: !888, line: 452, type: !1013, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_PAR_BANDS)
!1040 = distinct !DIGlobalVariable(name: "DECAY_CUTOFF", scope: !0, file: !888, line: 457, type: !1013, isLocal: true, isDefinition: true, variable: [2 x i32]* @DECAY_CUTOFF)
!1041 = distinct !DIGlobalVariable(name: "phi_fract", scope: !0, file: !1016, line: 56, type: !1042, isLocal: true, isDefinition: true, variable: [2 x [50 x [2 x i32]]]* @phi_fract)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 6400, align: 32, elements: !1043)
!1043 = !{!909, !1044, !909}
!1044 = !DISubrange(count: 50)
!1045 = distinct !DIGlobalVariable(name: "Q_fract_allpass", scope: !0, file: !1016, line: 55, type: !1046, isLocal: true, isDefinition: true, variable: [2 x [50 x [3 x [2 x i32]]]]* @Q_fract_allpass)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 19200, align: 32, elements: !1047)
!1047 = !{!909, !1044, !1048, !909}
!1048 = !DISubrange(count: 3)
!1049 = distinct !DIGlobalVariable(name: "SHORT_DELAY_BAND", scope: !0, file: !888, line: 461, type: !1013, isLocal: true, isDefinition: true, variable: [2 x i32]* @SHORT_DELAY_BAND)
!1050 = distinct !DIGlobalVariable(name: "HA", scope: !0, file: !1016, line: 49, type: !1051, isLocal: true, isDefinition: true, variable: [46 x [8 x [4 x i32]]]* @HA)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 47104, align: 32, elements: !1052)
!1052 = !{!1053, !924, !1004}
!1053 = !DISubrange(count: 46)
!1054 = distinct !DIGlobalVariable(name: "HB", scope: !0, file: !1016, line: 50, type: !1051, isLocal: true, isDefinition: true, variable: [46 x [8 x [4 x i32]]]* @HB)
!1055 = distinct !DIGlobalVariable(name: "NR_IPDOPD_BANDS", scope: !0, file: !888, line: 453, type: !1013, isLocal: true, isDefinition: true, variable: [2 x i32]* @NR_IPDOPD_BANDS)
!1056 = distinct !DIGlobalVariable(name: "pd_re_smooth", scope: !0, file: !1016, line: 47, type: !1057, isLocal: true, isDefinition: true, variable: [512 x i32]* @pd_re_smooth)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 16384, align: 32, elements: !1058)
!1058 = !{!977}
!1059 = distinct !DIGlobalVariable(name: "pd_im_smooth", scope: !0, file: !1016, line: 48, type: !1057, isLocal: true, isDefinition: true, variable: [512 x i32]* @pd_im_smooth)
!1060 = distinct !DIGlobalVariable(name: "huff_iid_df1_codes", scope: !0, file: !1006, line: 29, type: !1061, isLocal: true, isDefinition: true, variable: [61 x i32]* @huff_iid_df1_codes)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 1952, align: 32, elements: !1063)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1063 = !{!1064}
!1064 = !DISubrange(count: 61)
!1065 = distinct !DIGlobalVariable(name: "huff_iid_df1_bits", scope: !0, file: !1006, line: 22, type: !1066, isLocal: true, isDefinition: true, variable: [61 x i8]* @huff_iid_df1_bits)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 488, align: 8, elements: !1063)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!1068 = distinct !DIGlobalVariable(name: "huff_iid_dt1_codes", scope: !0, file: !1006, line: 48, type: !1069, isLocal: true, isDefinition: true, variable: [61 x i16]* @huff_iid_dt1_codes)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 976, align: 16, elements: !1063)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !917, line: 49, baseType: !1072)
!1072 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1073 = distinct !DIGlobalVariable(name: "huff_iid_dt1_bits", scope: !0, file: !1006, line: 41, type: !1066, isLocal: true, isDefinition: true, variable: [61 x i8]* @huff_iid_dt1_bits)
!1074 = distinct !DIGlobalVariable(name: "huff_iid_df0_codes", scope: !0, file: !1006, line: 65, type: !1075, isLocal: true, isDefinition: true, variable: [29 x i32]* @huff_iid_df0_codes)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 928, align: 32, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 29)
!1078 = distinct !DIGlobalVariable(name: "huff_iid_df0_bits", scope: !0, file: !1006, line: 60, type: !1079, isLocal: true, isDefinition: true, variable: [29 x i8]* @huff_iid_df0_bits)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 232, align: 8, elements: !1076)
!1080 = distinct !DIGlobalVariable(name: "huff_iid_dt0_codes", scope: !0, file: !1006, line: 78, type: !1075, isLocal: true, isDefinition: true, variable: [29 x i32]* @huff_iid_dt0_codes)
!1081 = distinct !DIGlobalVariable(name: "huff_iid_dt0_bits", scope: !0, file: !1006, line: 73, type: !1079, isLocal: true, isDefinition: true, variable: [29 x i8]* @huff_iid_dt0_bits)
!1082 = distinct !DIGlobalVariable(name: "huff_icc_df_codes", scope: !0, file: !1006, line: 90, type: !1083, isLocal: true, isDefinition: true, variable: [15 x i16]* @huff_icc_df_codes)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 240, align: 16, elements: !1084)
!1084 = !{!1085}
!1085 = !DISubrange(count: 15)
!1086 = distinct !DIGlobalVariable(name: "huff_icc_df_bits", scope: !0, file: !1006, line: 86, type: !1087, isLocal: true, isDefinition: true, variable: [15 x i8]* @huff_icc_df_bits)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 120, align: 8, elements: !1084)
!1088 = distinct !DIGlobalVariable(name: "huff_icc_dt_codes", scope: !0, file: !1006, line: 99, type: !1083, isLocal: true, isDefinition: true, variable: [15 x i16]* @huff_icc_dt_codes)
!1089 = distinct !DIGlobalVariable(name: "huff_icc_dt_bits", scope: !0, file: !1006, line: 95, type: !1087, isLocal: true, isDefinition: true, variable: [15 x i8]* @huff_icc_dt_bits)
!1090 = distinct !DIGlobalVariable(name: "huff_ipd_df_codes", scope: !0, file: !1006, line: 108, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_df_codes)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1067, size: 64, align: 8, elements: !1092)
!1092 = !{!924}
!1093 = distinct !DIGlobalVariable(name: "huff_ipd_df_bits", scope: !0, file: !1006, line: 104, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_df_bits)
!1094 = distinct !DIGlobalVariable(name: "huff_ipd_dt_codes", scope: !0, file: !1006, line: 116, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_dt_codes)
!1095 = distinct !DIGlobalVariable(name: "huff_ipd_dt_bits", scope: !0, file: !1006, line: 112, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_ipd_dt_bits)
!1096 = distinct !DIGlobalVariable(name: "huff_opd_df_codes", scope: !0, file: !1006, line: 124, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_df_codes)
!1097 = distinct !DIGlobalVariable(name: "huff_opd_df_bits", scope: !0, file: !1006, line: 120, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_df_bits)
!1098 = distinct !DIGlobalVariable(name: "huff_opd_dt_codes", scope: !0, file: !1006, line: 132, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_dt_codes)
!1099 = distinct !DIGlobalVariable(name: "huff_opd_dt_bits", scope: !0, file: !1006, line: 128, type: !1091, isLocal: true, isDefinition: true, variable: [8 x i8]* @huff_opd_dt_bits)
!1100 = distinct !DIGlobalVariable(name: "ipdopd_sin", scope: !1101, file: !1016, line: 137, type: !1102, isLocal: true, isDefinition: true, variable: [8 x i32]* @ps_tableinit.ipdopd_sin)
!1101 = distinct !DISubprogram(name: "ps_tableinit", scope: !1016, file: !1016, line: 135, type: !935, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !937)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 256, align: 32, elements: !1092)
!1103 = distinct !DIGlobalVariable(name: "ipdopd_cos", scope: !1101, file: !1016, line: 138, type: !1102, isLocal: true, isDefinition: true, variable: [8 x i32]* @ps_tableinit.ipdopd_cos)
!1104 = distinct !DIGlobalVariable(name: "alpha_tab", scope: !1101, file: !1016, line: 142, type: !1105, isLocal: true, isDefinition: true, variable: [276 x i32]* @ps_tableinit.alpha_tab)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 8832, align: 32, elements: !1106)
!1106 = !{!1107}
!1107 = !DISubrange(count: 276)
!1108 = distinct !DIGlobalVariable(name: "gamma_tab", scope: !1101, file: !1016, line: 192, type: !1105, isLocal: true, isDefinition: true, variable: [276 x i32]* @ps_tableinit.gamma_tab)
!1109 = distinct !DIGlobalVariable(name: "iid_par_dequant_c1", scope: !1101, file: !1016, line: 242, type: !1110, isLocal: true, isDefinition: true, variable: [46 x i32]* @ps_tableinit.iid_par_dequant_c1)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 1472, align: 32, elements: !1111)
!1111 = !{!1053}
!1112 = distinct !DIGlobalVariable(name: "acos_icc_invq", scope: !1101, file: !1016, line: 259, type: !1102, isLocal: true, isDefinition: true, variable: [8 x i32]* @ps_tableinit.acos_icc_invq)
!1113 = distinct !DIGlobalVariable(name: "f_center_20", scope: !1101, file: !1016, line: 265, type: !1007, isLocal: true, isDefinition: true, variable: [10 x i8]* @ps_tableinit.f_center_20)
!1114 = distinct !DIGlobalVariable(name: "f_center_34", scope: !1101, file: !1016, line: 268, type: !1115, isLocal: true, isDefinition: true, variable: [32 x i32]* @ps_tableinit.f_center_34)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 1024, align: 32, elements: !1117)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1117 = !{!908}
!1118 = distinct !DIGlobalVariable(name: "fractional_delay_links", scope: !1101, file: !1016, line: 274, type: !1119, isLocal: true, isDefinition: true, variable: [3 x i32]* @ps_tableinit.fractional_delay_links)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 96, align: 32, elements: !1120)
!1120 = !{!1048}
!1121 = distinct !DIGlobalVariable(name: "FLOAT_0", scope: !0, file: !1122, line: 39, type: !1123, isLocal: true, isDefinition: true, variable: %struct.SoftFloat* @FLOAT_0)
!1122 = !DIFile(filename: "./libavutil/softfloat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "SoftFloat", file: !1122, line: 37, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SoftFloat", file: !1122, line: 34, size: 64, align: 32, elements: !1126)
!1126 = !{!1127, !1128}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mant", scope: !1125, file: !1122, line: 35, baseType: !931, size: 32, align: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !1125, file: !1122, line: 36, baseType: !931, size: 32, align: 32, offset: 32)
!1129 = distinct !DIGlobalVariable(name: "FLOAT_1", scope: !0, file: !1122, line: 41, type: !1123, isLocal: true, isDefinition: true, variable: %struct.SoftFloat* @FLOAT_1)
!1130 = distinct !DIGlobalVariable(name: "av_sqrttbl_sf", scope: !0, file: !1131, line: 52, type: !1132, isLocal: true, isDefinition: true, variable: [513 x i32]* @av_sqrttbl_sf)
!1131 = !DIFile(filename: "./libavutil/softfloat_tables.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 16416, align: 32, elements: !1133)
!1133 = !{!1134}
!1134 = !DISubrange(count: 513)
!1135 = distinct !DIGlobalVariable(name: "av_sqr_exp_multbl_sf", scope: !0, file: !1131, line: 184, type: !1136, isLocal: true, isDefinition: true, variable: [2 x i32]* @av_sqr_exp_multbl_sf)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 64, align: 32, elements: !930)
!1137 = distinct !DIGlobalVariable(name: "av_costbl_1_sf", scope: !0, file: !1131, line: 188, type: !1138, isLocal: true, isDefinition: true, variable: [16 x i32]* @av_costbl_1_sf)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 512, align: 32, elements: !1139)
!1139 = !{!1140}
!1140 = !DISubrange(count: 16)
!1141 = distinct !DIGlobalVariable(name: "av_costbl_2_sf", scope: !0, file: !1131, line: 195, type: !1115, isLocal: true, isDefinition: true, variable: [32 x i32]* @av_costbl_2_sf)
!1142 = distinct !DIGlobalVariable(name: "av_sintbl_2_sf", scope: !0, file: !1131, line: 206, type: !1115, isLocal: true, isDefinition: true, variable: [32 x i32]* @av_sintbl_2_sf)
!1143 = distinct !DIGlobalVariable(name: "av_costbl_3_sf", scope: !0, file: !1131, line: 217, type: !1115, isLocal: true, isDefinition: true, variable: [32 x i32]* @av_costbl_3_sf)
!1144 = distinct !DIGlobalVariable(name: "av_sintbl_3_sf", scope: !0, file: !1131, line: 228, type: !1115, isLocal: true, isDefinition: true, variable: [32 x i32]* @av_sintbl_3_sf)
!1145 = distinct !DIGlobalVariable(name: "av_costbl_4_sf", scope: !0, file: !1131, line: 239, type: !1146, isLocal: true, isDefinition: true, variable: [33 x i32]* @av_costbl_4_sf)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 1056, align: 32, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 33)
!1149 = distinct !DIGlobalVariable(name: "av_sintbl_4_sf", scope: !0, file: !1131, line: 251, type: !1146, isLocal: true, isDefinition: true, variable: [33 x i32]* @av_sintbl_4_sf)
!1150 = distinct !DIGlobalVariable(name: "sintbl_4", scope: !0, file: !1016, line: 78, type: !1009, isLocal: true, isDefinition: true, variable: [4 x i32]* @sintbl_4)
!1151 = distinct !DIGlobalVariable(name: "costbl_4", scope: !0, file: !1016, line: 79, type: !1009, isLocal: true, isDefinition: true, variable: [4 x i32]* @costbl_4)
!1152 = distinct !DIGlobalVariable(name: "sintbl_8", scope: !0, file: !1016, line: 80, type: !1102, isLocal: true, isDefinition: true, variable: [8 x i32]* @sintbl_8)
!1153 = distinct !DIGlobalVariable(name: "costbl_8", scope: !0, file: !1016, line: 82, type: !1102, isLocal: true, isDefinition: true, variable: [8 x i32]* @costbl_8)
!1154 = distinct !DIGlobalVariable(name: "sintbl_12", scope: !0, file: !1016, line: 84, type: !1155, isLocal: true, isDefinition: true, variable: [12 x i32]* @sintbl_12)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 384, align: 32, elements: !1156)
!1156 = !{!1019}
!1157 = distinct !DIGlobalVariable(name: "costbl_12", scope: !0, file: !1016, line: 87, type: !1155, isLocal: true, isDefinition: true, variable: [12 x i32]* @costbl_12)
!1158 = distinct !DIGlobalVariable(name: "g0_Q8", scope: !0, file: !1016, line: 58, type: !1159, isLocal: true, isDefinition: true, variable: [7 x i32]* @g0_Q8)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 224, align: 32, elements: !1029)
!1160 = distinct !DIGlobalVariable(name: "g0_Q12", scope: !0, file: !1016, line: 63, type: !1159, isLocal: true, isDefinition: true, variable: [7 x i32]* @g0_Q12)
!1161 = distinct !DIGlobalVariable(name: "g1_Q8", scope: !0, file: !1016, line: 68, type: !1159, isLocal: true, isDefinition: true, variable: [7 x i32]* @g1_Q8)
!1162 = distinct !DIGlobalVariable(name: "g2_Q4", scope: !0, file: !1016, line: 73, type: !1159, isLocal: true, isDefinition: true, variable: [7 x i32]* @g2_Q4)
!1163 = !{i32 2, !"Dwarf Version", i32 4}
!1164 = !{i32 2, !"Debug Info Version", i32 3}
!1165 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1166 = distinct !DISubprogram(name: "ff_ps_read_data_fixed", scope: !888, file: !888, line: 158, type: !1167, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !937)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!906, !1169, !1752, !1762, !906}
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1172)
!1172 = !{!1173, !1218, !1219, !1220, !1476, !1477, !1478, !1479, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1505, !1509, !1510, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1690, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1171, file: !35, line: 1561, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1178)
!1178 = !{!1179, !1183, !1188, !1192, !1193, !1194, !1195, !1199, !1205, !1207, !1211}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1177, file: !4, line: 72, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1182 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1177, file: !4, line: 78, baseType: !1184, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!1180, !1187}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1177, file: !4, line: 85, baseType: !1189, size: 64, align: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1191)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1177, file: !4, line: 93, baseType: !906, size: 32, align: 32, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1177, file: !4, line: 99, baseType: !906, size: 32, align: 32, offset: 224)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1177, file: !4, line: 108, baseType: !906, size: 32, align: 32, offset: 256)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1177, file: !4, line: 113, baseType: !1196, size: 64, align: 64, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!1187, !1187, !1187}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1177, file: !4, line: 123, baseType: !1200, size: 64, align: 64, offset: 384)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1203, !1203}
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1177, file: !4, line: 130, baseType: !1206, size: 32, align: 32, offset: 448)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1177, file: !4, line: 136, baseType: !1208, size: 64, align: 64, offset: 512)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!1206, !1187}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1177, file: !4, line: 142, baseType: !1212, size: 64, align: 64, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!906, !1215, !1187, !1180, !906}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1171, file: !35, line: 1562, baseType: !906, size: 32, align: 32, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1171, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1171, file: !35, line: 1565, baseType: !1221, size: 64, align: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229, !1230, !1239, !1242, !1244, !1247, !1252, !1253, !1254, !1262, !1263, !1264, !1266, !1270, !1276, !1281, !1285, !1286, !1328, !1447, !1451, !1452, !1456, !1460, !1465, !1469, !1470, !1471}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1223, file: !35, line: 3475, baseType: !1180, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1223, file: !35, line: 3480, baseType: !1180, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1223, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1223, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1223, file: !35, line: 3487, baseType: !906, size: 32, align: 32, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1223, file: !35, line: 3488, baseType: !1231, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1234, line: 61, baseType: !1235)
!1234 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1234, line: 58, size: 64, align: 32, elements: !1236)
!1236 = !{!1237, !1238}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1235, file: !1234, line: 59, baseType: !906, size: 32, align: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1235, file: !1234, line: 60, baseType: !906, size: 32, align: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1223, file: !35, line: 3489, baseType: !1240, size: 64, align: 64, offset: 320)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1223, file: !35, line: 3490, baseType: !1243, size: 64, align: 64, offset: 384)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1223, file: !35, line: 3491, baseType: !1245, size: 64, align: 64, offset: 448)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1223, file: !35, line: 3492, baseType: !1248, size: 64, align: 64, offset: 512)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !917, line: 55, baseType: !1251)
!1251 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1223, file: !35, line: 3493, baseType: !919, size: 8, align: 8, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1223, file: !35, line: 3494, baseType: !1174, size: 64, align: 64, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1223, file: !35, line: 3495, baseType: !1255, size: 64, align: 64, offset: 704)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1258)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1259)
!1259 = !{!1260, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1258, file: !35, line: 3402, baseType: !906, size: 32, align: 32)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1258, file: !35, line: 3403, baseType: !1180, size: 64, align: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1223, file: !35, line: 3507, baseType: !1180, size: 64, align: 64, offset: 768)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1223, file: !35, line: 3516, baseType: !906, size: 32, align: 32, offset: 832)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1223, file: !35, line: 3517, baseType: !1265, size: 64, align: 64, offset: 896)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1223, file: !35, line: 3527, baseType: !1267, size: 64, align: 64, offset: 960)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{!906, !1169}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1223, file: !35, line: 3535, baseType: !1271, size: 64, align: 64, offset: 1024)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!906, !1169, !1274}
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1223, file: !35, line: 3541, baseType: !1277, size: 64, align: 64, offset: 1088)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1280)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1223, file: !35, line: 3549, baseType: !1282, size: 64, align: 64, offset: 1152)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !1265}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1223, file: !35, line: 3551, baseType: !1267, size: 64, align: 64, offset: 1216)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1223, file: !35, line: 3552, baseType: !1287, size: 64, align: 64, offset: 1280)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!906, !1169, !1290, !906, !1291}
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1327}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1293, file: !35, line: 3921, baseType: !1071, size: 16, align: 16)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1293, file: !35, line: 3922, baseType: !916, size: 32, align: 32, offset: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1293, file: !35, line: 3923, baseType: !916, size: 32, align: 32, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1293, file: !35, line: 3924, baseType: !918, size: 32, align: 32, offset: 96)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1293, file: !35, line: 3925, baseType: !1300, size: 64, align: 64, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1318, !1320, !1322, !1323, !1325, !1326}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1303, file: !35, line: 3886, baseType: !906, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1303, file: !35, line: 3887, baseType: !906, size: 32, align: 32, offset: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1303, file: !35, line: 3888, baseType: !906, size: 32, align: 32, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1303, file: !35, line: 3889, baseType: !906, size: 32, align: 32, offset: 96)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1303, file: !35, line: 3890, baseType: !906, size: 32, align: 32, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1303, file: !35, line: 3897, baseType: !1311, size: 768, align: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1313)
!1313 = !{!1314, !1316}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1312, file: !35, line: 3855, baseType: !1315, size: 512, align: 64)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1290, size: 512, align: 64, elements: !1092)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1312, file: !35, line: 3857, baseType: !1317, size: 256, align: 32, offset: 512)
!1317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 256, align: 32, elements: !1092)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1303, file: !35, line: 3903, baseType: !1319, size: 256, align: 64, offset: 960)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1290, size: 256, align: 64, elements: !1011)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1303, file: !35, line: 3904, baseType: !1321, size: 128, align: 32, offset: 1216)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 128, align: 32, elements: !1011)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1303, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1303, file: !35, line: 3908, baseType: !1324, size: 64, align: 64, offset: 1408)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1303, file: !35, line: 3915, baseType: !1324, size: 64, align: 64, offset: 1472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1303, file: !35, line: 3917, baseType: !906, size: 32, align: 32, offset: 1536)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1293, file: !35, line: 3926, baseType: !925, size: 64, align: 64, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1223, file: !35, line: 3564, baseType: !1329, size: 64, align: 64, offset: 1344)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!906, !1169, !1332, !1366, !1446}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1335)
!1335 = !{!1336, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1362, !1363, !1364, !1365}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1334, file: !35, line: 1451, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1339, line: 94, baseType: !1340)
!1339 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1339, line: 81, size: 192, align: 64, elements: !1341)
!1341 = !{!1342, !1346, !1347}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1340, file: !1339, line: 82, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1339, line: 73, baseType: !1345)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1339, line: 73, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1340, file: !1339, line: 89, baseType: !1290, size: 64, align: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1340, file: !1339, line: 93, baseType: !906, size: 32, align: 32, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1334, file: !35, line: 1461, baseType: !925, size: 64, align: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1334, file: !35, line: 1467, baseType: !925, size: 64, align: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1334, file: !35, line: 1468, baseType: !1290, size: 64, align: 64, offset: 192)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1334, file: !35, line: 1469, baseType: !906, size: 32, align: 32, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1334, file: !35, line: 1470, baseType: !906, size: 32, align: 32, offset: 288)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1334, file: !35, line: 1474, baseType: !906, size: 32, align: 32, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1334, file: !35, line: 1479, baseType: !1355, size: 64, align: 64, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1357, file: !35, line: 1412, baseType: !1290, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1357, file: !35, line: 1413, baseType: !906, size: 32, align: 32, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1357, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1334, file: !35, line: 1480, baseType: !906, size: 32, align: 32, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1334, file: !35, line: 1486, baseType: !925, size: 64, align: 64, offset: 512)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1334, file: !35, line: 1488, baseType: !925, size: 64, align: 64, offset: 576)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1334, file: !35, line: 1497, baseType: !925, size: 64, align: 64, offset: 640)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1368)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1400, !1402, !1403, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1434, !1435, !1436, !1437, !1438, !1439, !1442, !1443, !1444, !1445}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1369, file: !758, line: 282, baseType: !1315, size: 512, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1369, file: !758, line: 299, baseType: !1317, size: 256, align: 32, offset: 512)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1369, file: !758, line: 315, baseType: !1374, size: 64, align: 64, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1369, file: !758, line: 326, baseType: !906, size: 32, align: 32, offset: 832)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1369, file: !758, line: 326, baseType: !906, size: 32, align: 32, offset: 864)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1369, file: !758, line: 334, baseType: !906, size: 32, align: 32, offset: 896)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1369, file: !758, line: 341, baseType: !906, size: 32, align: 32, offset: 928)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1369, file: !758, line: 346, baseType: !906, size: 32, align: 32, offset: 960)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1369, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1369, file: !758, line: 356, baseType: !1233, size: 64, align: 32, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1369, file: !758, line: 361, baseType: !925, size: 64, align: 64, offset: 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1369, file: !758, line: 369, baseType: !925, size: 64, align: 64, offset: 1152)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1369, file: !758, line: 377, baseType: !925, size: 64, align: 64, offset: 1216)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1369, file: !758, line: 382, baseType: !906, size: 32, align: 32, offset: 1280)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1369, file: !758, line: 386, baseType: !906, size: 32, align: 32, offset: 1312)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1369, file: !758, line: 391, baseType: !906, size: 32, align: 32, offset: 1344)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1369, file: !758, line: 396, baseType: !1187, size: 64, align: 64, offset: 1408)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1369, file: !758, line: 403, baseType: !1390, size: 512, align: 64, offset: 1472)
!1390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1250, size: 512, align: 64, elements: !1092)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1369, file: !758, line: 410, baseType: !906, size: 32, align: 32, offset: 1984)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1369, file: !758, line: 415, baseType: !906, size: 32, align: 32, offset: 2016)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1369, file: !758, line: 420, baseType: !906, size: 32, align: 32, offset: 2048)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1369, file: !758, line: 425, baseType: !906, size: 32, align: 32, offset: 2080)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1369, file: !758, line: 435, baseType: !925, size: 64, align: 64, offset: 2112)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1369, file: !758, line: 440, baseType: !906, size: 32, align: 32, offset: 2176)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1369, file: !758, line: 445, baseType: !1250, size: 64, align: 64, offset: 2240)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1369, file: !758, line: 459, baseType: !1399, size: 512, align: 64, offset: 2304)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1337, size: 512, align: 64, elements: !1092)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1369, file: !758, line: 473, baseType: !1401, size: 64, align: 64, offset: 2816)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1369, file: !758, line: 477, baseType: !906, size: 32, align: 32, offset: 2880)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1369, file: !758, line: 479, baseType: !1404, size: 64, align: 64, offset: 2944)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1407)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1408)
!1408 = !{!1409, !1410, !1411, !1412, !1417}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1407, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1407, file: !758, line: 203, baseType: !1290, size: 64, align: 64, offset: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1407, file: !758, line: 204, baseType: !906, size: 32, align: 32, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1407, file: !758, line: 205, baseType: !1413, size: 64, align: 64, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1415, line: 86, baseType: !1416)
!1415 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1415, line: 86, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1407, file: !758, line: 206, baseType: !1337, size: 64, align: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1369, file: !758, line: 480, baseType: !906, size: 32, align: 32, offset: 3008)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1369, file: !758, line: 505, baseType: !906, size: 32, align: 32, offset: 3040)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1369, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1369, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1369, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1369, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1369, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1369, file: !758, line: 532, baseType: !925, size: 64, align: 64, offset: 3264)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1369, file: !758, line: 539, baseType: !925, size: 64, align: 64, offset: 3328)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1369, file: !758, line: 547, baseType: !925, size: 64, align: 64, offset: 3392)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1369, file: !758, line: 554, baseType: !1413, size: 64, align: 64, offset: 3456)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1369, file: !758, line: 563, baseType: !906, size: 32, align: 32, offset: 3520)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1369, file: !758, line: 572, baseType: !906, size: 32, align: 32, offset: 3552)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1369, file: !758, line: 581, baseType: !906, size: 32, align: 32, offset: 3584)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1369, file: !758, line: 588, baseType: !1433, size: 64, align: 64, offset: 3648)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1369, file: !758, line: 593, baseType: !906, size: 32, align: 32, offset: 3712)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1369, file: !758, line: 596, baseType: !906, size: 32, align: 32, offset: 3744)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1369, file: !758, line: 599, baseType: !1337, size: 64, align: 64, offset: 3776)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1369, file: !758, line: 605, baseType: !1337, size: 64, align: 64, offset: 3840)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1369, file: !758, line: 616, baseType: !1337, size: 64, align: 64, offset: 3904)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1369, file: !758, line: 626, baseType: !1440, size: 64, align: 64, offset: 3968)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1441, line: 216, baseType: !1251)
!1441 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1369, file: !758, line: 627, baseType: !1440, size: 64, align: 64, offset: 4032)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1369, file: !758, line: 628, baseType: !1440, size: 64, align: 64, offset: 4096)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1369, file: !758, line: 629, baseType: !1440, size: 64, align: 64, offset: 4160)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1369, file: !758, line: 645, baseType: !1337, size: 64, align: 64, offset: 4224)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1223, file: !35, line: 3566, baseType: !1448, size: 64, align: 64, offset: 1408)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!906, !1169, !1187, !1446, !1332}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1223, file: !35, line: 3567, baseType: !1267, size: 64, align: 64, offset: 1472)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1223, file: !35, line: 3576, baseType: !1453, size: 64, align: 64, offset: 1536)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!906, !1169, !1366}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1223, file: !35, line: 3577, baseType: !1457, size: 64, align: 64, offset: 1600)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!906, !1169, !1332}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1223, file: !35, line: 3584, baseType: !1461, size: 64, align: 64, offset: 1664)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!906, !1169, !1464}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1223, file: !35, line: 3589, baseType: !1466, size: 64, align: 64, offset: 1728)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{null, !1169}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1223, file: !35, line: 3594, baseType: !906, size: 32, align: 32, offset: 1792)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1223, file: !35, line: 3600, baseType: !1180, size: 64, align: 64, offset: 1856)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1223, file: !35, line: 3609, baseType: !1472, size: 64, align: 64, offset: 1920)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1475)
!1475 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1171, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1171, file: !35, line: 1581, baseType: !918, size: 32, align: 32, offset: 224)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1171, file: !35, line: 1583, baseType: !1187, size: 64, align: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1171, file: !35, line: 1591, baseType: !1480, size: 64, align: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1171, file: !35, line: 1598, baseType: !1187, size: 64, align: 64, offset: 384)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1171, file: !35, line: 1606, baseType: !925, size: 64, align: 64, offset: 448)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1171, file: !35, line: 1614, baseType: !906, size: 32, align: 32, offset: 512)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1171, file: !35, line: 1622, baseType: !906, size: 32, align: 32, offset: 544)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1171, file: !35, line: 1628, baseType: !906, size: 32, align: 32, offset: 576)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1171, file: !35, line: 1636, baseType: !906, size: 32, align: 32, offset: 608)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1171, file: !35, line: 1643, baseType: !906, size: 32, align: 32, offset: 640)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1171, file: !35, line: 1657, baseType: !1290, size: 64, align: 64, offset: 704)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1171, file: !35, line: 1658, baseType: !906, size: 32, align: 32, offset: 768)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1171, file: !35, line: 1679, baseType: !1233, size: 64, align: 32, offset: 800)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1171, file: !35, line: 1688, baseType: !906, size: 32, align: 32, offset: 864)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1171, file: !35, line: 1712, baseType: !906, size: 32, align: 32, offset: 896)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1171, file: !35, line: 1729, baseType: !906, size: 32, align: 32, offset: 928)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1171, file: !35, line: 1729, baseType: !906, size: 32, align: 32, offset: 960)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1171, file: !35, line: 1744, baseType: !906, size: 32, align: 32, offset: 992)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1171, file: !35, line: 1744, baseType: !906, size: 32, align: 32, offset: 1024)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1171, file: !35, line: 1751, baseType: !906, size: 32, align: 32, offset: 1056)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1171, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1171, file: !35, line: 1791, baseType: !1501, size: 64, align: 64, offset: 1152)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1504, !1366, !1446, !906, !906, !906}
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1171, file: !35, line: 1808, baseType: !1506, size: 64, align: 64, offset: 1216)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!494, !1504, !1240}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1171, file: !35, line: 1816, baseType: !906, size: 32, align: 32, offset: 1280)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1171, file: !35, line: 1825, baseType: !1511, size: 32, align: 32, offset: 1312)
!1511 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1171, file: !35, line: 1830, baseType: !906, size: 32, align: 32, offset: 1344)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1171, file: !35, line: 1838, baseType: !1511, size: 32, align: 32, offset: 1376)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1171, file: !35, line: 1846, baseType: !906, size: 32, align: 32, offset: 1408)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1171, file: !35, line: 1851, baseType: !906, size: 32, align: 32, offset: 1440)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1171, file: !35, line: 1861, baseType: !1511, size: 32, align: 32, offset: 1472)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1171, file: !35, line: 1868, baseType: !1511, size: 32, align: 32, offset: 1504)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1171, file: !35, line: 1875, baseType: !1511, size: 32, align: 32, offset: 1536)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1171, file: !35, line: 1882, baseType: !1511, size: 32, align: 32, offset: 1568)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1171, file: !35, line: 1889, baseType: !1511, size: 32, align: 32, offset: 1600)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1171, file: !35, line: 1896, baseType: !1511, size: 32, align: 32, offset: 1632)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1171, file: !35, line: 1903, baseType: !1511, size: 32, align: 32, offset: 1664)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1171, file: !35, line: 1910, baseType: !906, size: 32, align: 32, offset: 1696)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1171, file: !35, line: 1915, baseType: !906, size: 32, align: 32, offset: 1728)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1171, file: !35, line: 1926, baseType: !1446, size: 64, align: 64, offset: 1792)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1171, file: !35, line: 1935, baseType: !1233, size: 64, align: 32, offset: 1856)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1171, file: !35, line: 1942, baseType: !906, size: 32, align: 32, offset: 1920)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1171, file: !35, line: 1948, baseType: !906, size: 32, align: 32, offset: 1952)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1171, file: !35, line: 1954, baseType: !906, size: 32, align: 32, offset: 1984)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1171, file: !35, line: 1960, baseType: !906, size: 32, align: 32, offset: 2016)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1171, file: !35, line: 1984, baseType: !906, size: 32, align: 32, offset: 2048)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1171, file: !35, line: 1991, baseType: !906, size: 32, align: 32, offset: 2080)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1171, file: !35, line: 1996, baseType: !906, size: 32, align: 32, offset: 2112)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1171, file: !35, line: 2004, baseType: !906, size: 32, align: 32, offset: 2144)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1171, file: !35, line: 2011, baseType: !906, size: 32, align: 32, offset: 2176)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1171, file: !35, line: 2018, baseType: !906, size: 32, align: 32, offset: 2208)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1171, file: !35, line: 2027, baseType: !906, size: 32, align: 32, offset: 2240)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1171, file: !35, line: 2034, baseType: !906, size: 32, align: 32, offset: 2272)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1171, file: !35, line: 2044, baseType: !906, size: 32, align: 32, offset: 2304)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1171, file: !35, line: 2054, baseType: !1541, size: 64, align: 64, offset: 2368)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1171, file: !35, line: 2061, baseType: !1541, size: 64, align: 64, offset: 2432)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1171, file: !35, line: 2066, baseType: !906, size: 32, align: 32, offset: 2496)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1171, file: !35, line: 2070, baseType: !906, size: 32, align: 32, offset: 2528)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1171, file: !35, line: 2078, baseType: !906, size: 32, align: 32, offset: 2560)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1171, file: !35, line: 2085, baseType: !906, size: 32, align: 32, offset: 2592)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1171, file: !35, line: 2092, baseType: !906, size: 32, align: 32, offset: 2624)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1171, file: !35, line: 2099, baseType: !906, size: 32, align: 32, offset: 2656)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1171, file: !35, line: 2106, baseType: !906, size: 32, align: 32, offset: 2688)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1171, file: !35, line: 2113, baseType: !906, size: 32, align: 32, offset: 2720)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1171, file: !35, line: 2120, baseType: !906, size: 32, align: 32, offset: 2752)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1171, file: !35, line: 2125, baseType: !906, size: 32, align: 32, offset: 2784)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1171, file: !35, line: 2133, baseType: !906, size: 32, align: 32, offset: 2816)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1171, file: !35, line: 2140, baseType: !906, size: 32, align: 32, offset: 2848)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1171, file: !35, line: 2145, baseType: !906, size: 32, align: 32, offset: 2880)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1171, file: !35, line: 2153, baseType: !906, size: 32, align: 32, offset: 2912)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1171, file: !35, line: 2158, baseType: !906, size: 32, align: 32, offset: 2944)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1171, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1171, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1171, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1171, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1171, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1171, file: !35, line: 2203, baseType: !906, size: 32, align: 32, offset: 3136)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1171, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1171, file: !35, line: 2212, baseType: !906, size: 32, align: 32, offset: 3200)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1171, file: !35, line: 2213, baseType: !906, size: 32, align: 32, offset: 3232)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1171, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1171, file: !35, line: 2232, baseType: !906, size: 32, align: 32, offset: 3296)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1171, file: !35, line: 2243, baseType: !906, size: 32, align: 32, offset: 3328)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1171, file: !35, line: 2249, baseType: !906, size: 32, align: 32, offset: 3360)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1171, file: !35, line: 2256, baseType: !906, size: 32, align: 32, offset: 3392)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1171, file: !35, line: 2263, baseType: !1250, size: 64, align: 64, offset: 3456)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1171, file: !35, line: 2270, baseType: !1250, size: 64, align: 64, offset: 3520)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1171, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1171, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1171, file: !35, line: 2367, baseType: !1577, size: 64, align: 64, offset: 3648)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!906, !1504, !1464, !906}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1171, file: !35, line: 2383, baseType: !906, size: 32, align: 32, offset: 3712)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1171, file: !35, line: 2386, baseType: !1511, size: 32, align: 32, offset: 3744)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1171, file: !35, line: 2387, baseType: !1511, size: 32, align: 32, offset: 3776)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1171, file: !35, line: 2394, baseType: !906, size: 32, align: 32, offset: 3808)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1171, file: !35, line: 2401, baseType: !906, size: 32, align: 32, offset: 3840)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1171, file: !35, line: 2408, baseType: !906, size: 32, align: 32, offset: 3872)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1171, file: !35, line: 2415, baseType: !906, size: 32, align: 32, offset: 3904)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1171, file: !35, line: 2422, baseType: !906, size: 32, align: 32, offset: 3936)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1171, file: !35, line: 2423, baseType: !1589, size: 64, align: 64, offset: 3968)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1591, file: !35, line: 827, baseType: !906, size: 32, align: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1591, file: !35, line: 828, baseType: !906, size: 32, align: 32, offset: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1591, file: !35, line: 829, baseType: !906, size: 32, align: 32, offset: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1591, file: !35, line: 830, baseType: !1511, size: 32, align: 32, offset: 96)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1171, file: !35, line: 2430, baseType: !925, size: 64, align: 64, offset: 4032)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1171, file: !35, line: 2437, baseType: !925, size: 64, align: 64, offset: 4096)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1171, file: !35, line: 2444, baseType: !1511, size: 32, align: 32, offset: 4160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1171, file: !35, line: 2451, baseType: !1511, size: 32, align: 32, offset: 4192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1171, file: !35, line: 2458, baseType: !906, size: 32, align: 32, offset: 4224)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1171, file: !35, line: 2469, baseType: !906, size: 32, align: 32, offset: 4256)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1171, file: !35, line: 2475, baseType: !906, size: 32, align: 32, offset: 4288)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1171, file: !35, line: 2481, baseType: !906, size: 32, align: 32, offset: 4320)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1171, file: !35, line: 2485, baseType: !906, size: 32, align: 32, offset: 4352)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1171, file: !35, line: 2489, baseType: !906, size: 32, align: 32, offset: 4384)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1171, file: !35, line: 2493, baseType: !906, size: 32, align: 32, offset: 4416)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1171, file: !35, line: 2501, baseType: !906, size: 32, align: 32, offset: 4448)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1171, file: !35, line: 2506, baseType: !906, size: 32, align: 32, offset: 4480)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1171, file: !35, line: 2510, baseType: !906, size: 32, align: 32, offset: 4512)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1171, file: !35, line: 2514, baseType: !925, size: 64, align: 64, offset: 4544)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1171, file: !35, line: 2528, baseType: !1613, size: 64, align: 64, offset: 4608)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{null, !1504, !1187, !906, !906}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1171, file: !35, line: 2534, baseType: !906, size: 32, align: 32, offset: 4672)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1171, file: !35, line: 2545, baseType: !906, size: 32, align: 32, offset: 4704)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1171, file: !35, line: 2547, baseType: !906, size: 32, align: 32, offset: 4736)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1171, file: !35, line: 2549, baseType: !906, size: 32, align: 32, offset: 4768)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1171, file: !35, line: 2551, baseType: !906, size: 32, align: 32, offset: 4800)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1171, file: !35, line: 2553, baseType: !906, size: 32, align: 32, offset: 4832)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1171, file: !35, line: 2555, baseType: !906, size: 32, align: 32, offset: 4864)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1171, file: !35, line: 2557, baseType: !906, size: 32, align: 32, offset: 4896)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1171, file: !35, line: 2559, baseType: !906, size: 32, align: 32, offset: 4928)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1171, file: !35, line: 2563, baseType: !906, size: 32, align: 32, offset: 4960)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1171, file: !35, line: 2571, baseType: !1324, size: 64, align: 64, offset: 4992)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1171, file: !35, line: 2579, baseType: !1324, size: 64, align: 64, offset: 5056)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1171, file: !35, line: 2586, baseType: !906, size: 32, align: 32, offset: 5120)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1171, file: !35, line: 2615, baseType: !906, size: 32, align: 32, offset: 5152)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1171, file: !35, line: 2627, baseType: !906, size: 32, align: 32, offset: 5184)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1171, file: !35, line: 2637, baseType: !906, size: 32, align: 32, offset: 5216)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1171, file: !35, line: 2681, baseType: !906, size: 32, align: 32, offset: 5248)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1171, file: !35, line: 2709, baseType: !925, size: 64, align: 64, offset: 5312)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1171, file: !35, line: 2716, baseType: !1635, size: 64, align: 64, offset: 5376)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642, !1643, !1644, !1645, !1650, !1654, !1655, !1656, !1657, !1663, !1664, !1665, !1666, !1667}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1637, file: !35, line: 3642, baseType: !1180, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1637, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1637, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1637, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1637, file: !35, line: 3669, baseType: !906, size: 32, align: 32, offset: 160)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1637, file: !35, line: 3682, baseType: !1461, size: 64, align: 64, offset: 192)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1637, file: !35, line: 3698, baseType: !1646, size: 64, align: 64, offset: 256)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!906, !1169, !1649, !916}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1637, file: !35, line: 3712, baseType: !1651, size: 64, align: 64, offset: 320)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{!906, !1169, !906, !1649, !916}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1637, file: !35, line: 3726, baseType: !1646, size: 64, align: 64, offset: 384)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1637, file: !35, line: 3737, baseType: !1267, size: 64, align: 64, offset: 448)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1637, file: !35, line: 3746, baseType: !906, size: 32, align: 32, offset: 512)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1637, file: !35, line: 3757, baseType: !1658, size: 64, align: 64, offset: 576)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{null, !1661}
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1637, file: !35, line: 3766, baseType: !1267, size: 64, align: 64, offset: 640)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1637, file: !35, line: 3774, baseType: !1267, size: 64, align: 64, offset: 704)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1637, file: !35, line: 3780, baseType: !906, size: 32, align: 32, offset: 768)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1637, file: !35, line: 3785, baseType: !906, size: 32, align: 32, offset: 800)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1637, file: !35, line: 3795, baseType: !1668, size: 64, align: 64, offset: 832)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!906, !1169, !1337}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1171, file: !35, line: 2728, baseType: !1187, size: 64, align: 64, offset: 5440)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1171, file: !35, line: 2735, baseType: !1390, size: 512, align: 64, offset: 5504)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1171, file: !35, line: 2742, baseType: !906, size: 32, align: 32, offset: 6016)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1171, file: !35, line: 2755, baseType: !906, size: 32, align: 32, offset: 6048)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1171, file: !35, line: 2776, baseType: !906, size: 32, align: 32, offset: 6080)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1171, file: !35, line: 2783, baseType: !906, size: 32, align: 32, offset: 6112)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1171, file: !35, line: 2791, baseType: !906, size: 32, align: 32, offset: 6144)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1171, file: !35, line: 2802, baseType: !1464, size: 64, align: 64, offset: 6208)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1171, file: !35, line: 2811, baseType: !906, size: 32, align: 32, offset: 6272)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1171, file: !35, line: 2821, baseType: !906, size: 32, align: 32, offset: 6304)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1171, file: !35, line: 2830, baseType: !906, size: 32, align: 32, offset: 6336)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1171, file: !35, line: 2840, baseType: !906, size: 32, align: 32, offset: 6368)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1171, file: !35, line: 2851, baseType: !1684, size: 64, align: 64, offset: 6400)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!906, !1504, !1687, !1187, !1446, !906, !906}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!906, !1504, !1187}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1171, file: !35, line: 2871, baseType: !1691, size: 64, align: 64, offset: 6464)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!906, !1504, !1694, !1187, !1446, !906}
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!906, !1504, !1187, !906, !906}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1171, file: !35, line: 2878, baseType: !906, size: 32, align: 32, offset: 6528)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1171, file: !35, line: 2885, baseType: !906, size: 32, align: 32, offset: 6560)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1171, file: !35, line: 3005, baseType: !906, size: 32, align: 32, offset: 6592)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1171, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1171, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1171, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1171, file: !35, line: 3037, baseType: !1290, size: 64, align: 64, offset: 6720)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1171, file: !35, line: 3038, baseType: !906, size: 32, align: 32, offset: 6784)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1171, file: !35, line: 3050, baseType: !1250, size: 64, align: 64, offset: 6848)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1171, file: !35, line: 3065, baseType: !906, size: 32, align: 32, offset: 6912)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1171, file: !35, line: 3083, baseType: !906, size: 32, align: 32, offset: 6944)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1171, file: !35, line: 3092, baseType: !1233, size: 64, align: 32, offset: 6976)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1171, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
