; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--v4l2_m2m_dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--v4l2_m2m_dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!868 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!869 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!870 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!871 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!872 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!875 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!876 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!877 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!878 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!879 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!880 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!881 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!882 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!883 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!884 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!885 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!886 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!887 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!888 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!889 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!890 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!891 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!892 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!893 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!894 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!895 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!896 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!897 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!898 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!899 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!900 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!901 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!902 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "v4l2_buf_type", file: !910, line: 131, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "/usr/include/linux/videodev2.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!912 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_CAPTURE", value: 1)
!913 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OUTPUT", value: 2)
!914 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OVERLAY", value: 3)
!915 = !DIEnumerator(name: "V4L2_BUF_TYPE_VBI_CAPTURE", value: 4)
!916 = !DIEnumerator(name: "V4L2_BUF_TYPE_VBI_OUTPUT", value: 5)
!917 = !DIEnumerator(name: "V4L2_BUF_TYPE_SLICED_VBI_CAPTURE", value: 6)
!918 = !DIEnumerator(name: "V4L2_BUF_TYPE_SLICED_VBI_OUTPUT", value: 7)
!919 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OUTPUT_OVERLAY", value: 8)
!920 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_CAPTURE_MPLANE", value: 9)
!921 = !DIEnumerator(name: "V4L2_BUF_TYPE_VIDEO_OUTPUT_MPLANE", value: 10)
!922 = !DIEnumerator(name: "V4L2_BUF_TYPE_SDR_CAPTURE", value: 11)
!923 = !DIEnumerator(name: "V4L2_BUF_TYPE_SDR_OUTPUT", value: 12)
!924 = !DIEnumerator(name: "V4L2_BUF_TYPE_PRIVATE", value: 128)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "V4L2Buffer_status", file: !926, line: 32, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "libavcodec/v4l2_buffers.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928, !929, !930}
!928 = !DIEnumerator(name: "V4L2BUF_AVAILABLE", value: 0)
!929 = !DIEnumerator(name: "V4L2BUF_IN_DRIVER", value: 1)
!930 = !DIEnumerator(name: "V4L2BUF_RET_USER", value: 2)
!931 = !{!932, !959, !1048}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2m2mPriv", file: !934, line: 73, baseType: !935)
!934 = !DIFile(filename: "libavcodec/v4l2_m2m.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2m2mPriv", file: !934, line: 64, size: 256, align: 64, elements: !936)
!936 = !{!937, !1023, !1803, !1804, !1805}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !935, file: !934, line: 66, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !941)
!941 = !{!942, !946, !951, !982, !983, !984, !985, !989, !995, !997, !1001}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !940, file: !713, line: 72, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !940, file: !713, line: 78, baseType: !947, size: 64, align: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!943, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !940, file: !713, line: 85, baseType: !952, size: 64, align: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !955)
!955 = !{!956, !957, !958, !960, !961, !978, !979, !980, !981}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !691, line: 247, baseType: !943, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !954, file: !691, line: 253, baseType: !943, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !954, file: !691, line: 259, baseType: !959, size: 32, align: 32, offset: 128)
!959 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !954, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !954, file: !691, line: 271, baseType: !962, size: 64, align: 64, offset: 192)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !954, file: !691, line: 265, size: 64, align: 64, elements: !963)
!963 = !{!964, !968, !970, !971}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !962, file: !691, line: 266, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !966, line: 40, baseType: !967)
!966 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !962, file: !691, line: 267, baseType: !969, size: 64, align: 64)
!969 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !962, file: !691, line: 268, baseType: !943, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !962, file: !691, line: 270, baseType: !972, size: 64, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !973, line: 61, baseType: !974)
!973 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !973, line: 58, size: 64, align: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !974, file: !973, line: 59, baseType: !959, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !974, file: !973, line: 60, baseType: !959, size: 32, align: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !954, file: !691, line: 272, baseType: !969, size: 64, align: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !954, file: !691, line: 273, baseType: !969, size: 64, align: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !954, file: !691, line: 275, baseType: !959, size: 32, align: 32, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !954, file: !691, line: 300, baseType: !943, size: 64, align: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !940, file: !713, line: 93, baseType: !959, size: 32, align: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !940, file: !713, line: 99, baseType: !959, size: 32, align: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !940, file: !713, line: 108, baseType: !959, size: 32, align: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !940, file: !713, line: 113, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!950, !950, !950}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !940, file: !713, line: 123, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!993, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !940, file: !713, line: 130, baseType: !996, size: 32, align: 32, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !940, file: !713, line: 136, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!996, !950}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !940, file: !713, line: 142, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!959, !1005, !950, !943, !959}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1008)
!1008 = !{!1009, !1021, !1022}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1007, file: !691, line: 360, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1013, file: !691, line: 307, baseType: !943, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1013, file: !691, line: 313, baseType: !969, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1013, file: !691, line: 313, baseType: !969, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1013, file: !691, line: 318, baseType: !969, size: 64, align: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1013, file: !691, line: 318, baseType: !969, size: 64, align: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1013, file: !691, line: 323, baseType: !959, size: 32, align: 32, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1007, file: !691, line: 364, baseType: !959, size: 32, align: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1007, file: !691, line: 368, baseType: !959, size: 32, align: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !935, file: !934, line: 68, baseType: !1024, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2m2mContext", file: !934, line: 62, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2m2mContext", file: !934, line: 43, size: 37568, align: 64, elements: !1027)
!1027 = !{!1028, !1032, !1033, !1261, !1262, !1789, !1799, !1800, !1801, !1802}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "devname", scope: !1026, file: !934, line: 44, baseType: !1029, size: 32768, align: 8)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 32768, align: 8, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 4096)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1026, file: !934, line: 45, baseType: !959, size: 32, align: 32, offset: 32768)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "capture", scope: !1026, file: !934, line: 48, baseType: !1034, size: 2112, align: 64, offset: 32832)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2Context", file: !1035, line: 94, baseType: !1036)
!1035 = !DIFile(filename: "libavcodec/v4l2_context.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Context", file: !1035, line: 36, size: 2112, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1159, !1160, !1161, !1258, !1259, !1260}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1036, file: !1035, line: 40, baseType: !943, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1036, file: !1035, line: 47, baseType: !909, size: 32, align: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "av_pix_fmt", scope: !1036, file: !1035, line: 53, baseType: !473, size: 32, align: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "av_codec_id", scope: !1036, file: !1035, line: 59, baseType: !13, size: 32, align: 32, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1036, file: !1035, line: 65, baseType: !1043, size: 1664, align: 64, offset: 192)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_format", file: !910, line: 2003, size: 1664, align: 64, elements: !1044)
!1044 = !{!1045, !1049}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1043, file: !910, line: 2004, baseType: !1046, size: 32, align: 32)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !1047, line: 26, baseType: !1048)
!1047 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1048 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !1043, file: !910, line: 2013, baseType: !1050, size: 1600, align: 64, offset: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1043, file: !910, line: 2005, size: 1600, align: 64, elements: !1051)
!1051 = !{!1052, !1067, !1100, !1122, !1137, !1147, !1155}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pix", scope: !1050, file: !910, line: 2006, baseType: !1053, size: 384, align: 32)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_pix_format", file: !910, line: 449, size: 384, align: 32, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1053, file: !910, line: 450, baseType: !1046, size: 32, align: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1053, file: !910, line: 451, baseType: !1046, size: 32, align: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !1053, file: !910, line: 452, baseType: !1046, size: 32, align: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1053, file: !910, line: 453, baseType: !1046, size: 32, align: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !1053, file: !910, line: 454, baseType: !1046, size: 32, align: 32, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "sizeimage", scope: !1053, file: !910, line: 455, baseType: !1046, size: 32, align: 32, offset: 160)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1053, file: !910, line: 456, baseType: !1046, size: 32, align: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !1053, file: !910, line: 457, baseType: !1046, size: 32, align: 32, offset: 224)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !910, line: 458, baseType: !1046, size: 32, align: 32, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ycbcr_enc", scope: !1053, file: !910, line: 459, baseType: !1046, size: 32, align: 32, offset: 288)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "quantization", scope: !1053, file: !910, line: 460, baseType: !1046, size: 32, align: 32, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_func", scope: !1053, file: !910, line: 461, baseType: !1046, size: 32, align: 32, offset: 352)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pix_mp", scope: !1050, file: !910, line: 2007, baseType: !1068, size: 1536, align: 8)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_pix_format_mplane", file: !910, line: 1966, size: 1536, align: 8, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1089, !1092, !1093, !1094, !1095, !1096}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1068, file: !910, line: 1967, baseType: !1046, size: 32, align: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1068, file: !910, line: 1968, baseType: !1046, size: 32, align: 32, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !1068, file: !910, line: 1969, baseType: !1046, size: 32, align: 32, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1068, file: !910, line: 1970, baseType: !1046, size: 32, align: 32, offset: 96)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1068, file: !910, line: 1971, baseType: !1046, size: 32, align: 32, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "plane_fmt", scope: !1068, file: !910, line: 1973, baseType: !1076, size: 1280, align: 8, offset: 160)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 1280, align: 8, elements: !1087)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_plane_pix_format", file: !910, line: 1946, size: 160, align: 8, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "sizeimage", scope: !1077, file: !910, line: 1947, baseType: !1046, size: 32, align: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !1077, file: !910, line: 1948, baseType: !1046, size: 32, align: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1077, file: !910, line: 1949, baseType: !1082, size: 96, align: 16, offset: 64)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 96, align: 16, elements: !1085)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !1047, line: 23, baseType: !1084)
!1084 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1085 = !{!1086}
!1086 = !DISubrange(count: 6)
!1087 = !{!1088}
!1088 = !DISubrange(count: 8)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "num_planes", scope: !1068, file: !910, line: 1974, baseType: !1090, size: 8, align: 8, offset: 1440)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !1047, line: 20, baseType: !1091)
!1091 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1068, file: !910, line: 1975, baseType: !1090, size: 8, align: 8, offset: 1448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ycbcr_enc", scope: !1068, file: !910, line: 1976, baseType: !1090, size: 8, align: 8, offset: 1456)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "quantization", scope: !1068, file: !910, line: 1977, baseType: !1090, size: 8, align: 8, offset: 1464)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "xfer_func", scope: !1068, file: !910, line: 1978, baseType: !1090, size: 8, align: 8, offset: 1472)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1068, file: !910, line: 1979, baseType: !1097, size: 56, align: 8, offset: 1480)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 56, align: 8, elements: !1098)
!1098 = !{!1099}
!1099 = !DISubrange(count: 7)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "win", scope: !1050, file: !910, line: 2008, baseType: !1101, size: 448, align: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_window", file: !910, line: 979, size: 448, align: 64, elements: !1102)
!1102 = !{!1103, !1111, !1112, !1113, !1119, !1120, !1121}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1101, file: !910, line: 980, baseType: !1104, size: 128, align: 32)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_rect", file: !910, line: 376, size: 128, align: 32, elements: !1105)
!1105 = !{!1106, !1108, !1109, !1110}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !1104, file: !910, line: 377, baseType: !1107, size: 32, align: 32)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !1047, line: 25, baseType: !959)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !1104, file: !910, line: 378, baseType: !1107, size: 32, align: 32, offset: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1104, file: !910, line: 379, baseType: !1046, size: 32, align: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1104, file: !910, line: 380, baseType: !1046, size: 32, align: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1101, file: !910, line: 981, baseType: !1046, size: 32, align: 32, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "chromakey", scope: !1101, file: !910, line: 982, baseType: !1046, size: 32, align: 32, offset: 160)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "clips", scope: !1101, file: !910, line: 983, baseType: !1114, size: 64, align: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_clip", file: !910, line: 974, size: 192, align: 64, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1115, file: !910, line: 975, baseType: !1104, size: 128, align: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1115, file: !910, line: 976, baseType: !1114, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "clipcount", scope: !1101, file: !910, line: 984, baseType: !1046, size: 32, align: 32, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "bitmap", scope: !1101, file: !910, line: 985, baseType: !950, size: 64, align: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "global_alpha", scope: !1101, file: !910, line: 986, baseType: !1090, size: 8, align: 8, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "vbi", scope: !1050, file: !910, line: 2009, baseType: !1123, size: 352, align: 32)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_vbi_format", file: !910, line: 1817, size: 352, align: 32, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1133, !1135, !1136}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "sampling_rate", scope: !1123, file: !910, line: 1818, baseType: !1046, size: 32, align: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1123, file: !910, line: 1819, baseType: !1046, size: 32, align: 32, offset: 32)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "samples_per_line", scope: !1123, file: !910, line: 1820, baseType: !1046, size: 32, align: 32, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1123, file: !910, line: 1821, baseType: !1046, size: 32, align: 32, offset: 96)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1123, file: !910, line: 1822, baseType: !1130, size: 64, align: 32, offset: 128)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 64, align: 32, elements: !1131)
!1131 = !{!1132}
!1132 = !DISubrange(count: 2)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1123, file: !910, line: 1823, baseType: !1134, size: 64, align: 32, offset: 192)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 64, align: 32, elements: !1131)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1123, file: !910, line: 1824, baseType: !1046, size: 32, align: 32, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1123, file: !910, line: 1825, baseType: !1134, size: 64, align: 32, offset: 288)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sliced", scope: !1050, file: !910, line: 2010, baseType: !1138, size: 896, align: 32)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_sliced_vbi_format", file: !910, line: 1845, size: 896, align: 32, elements: !1139)
!1139 = !{!1140, !1141, !1145, !1146}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "service_set", scope: !1138, file: !910, line: 1846, baseType: !1083, size: 16, align: 16)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "service_lines", scope: !1138, file: !910, line: 1851, baseType: !1142, size: 768, align: 16, offset: 16)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 768, align: 16, elements: !1143)
!1143 = !{!1132, !1144}
!1144 = !DISubrange(count: 24)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "io_size", scope: !1138, file: !910, line: 1852, baseType: !1046, size: 32, align: 32, offset: 800)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1138, file: !910, line: 1853, baseType: !1134, size: 64, align: 32, offset: 832)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sdr", scope: !1050, file: !910, line: 2011, baseType: !1148, size: 256, align: 8)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_sdr_format", file: !910, line: 1987, size: 256, align: 8, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pixelformat", scope: !1148, file: !910, line: 1988, baseType: !1046, size: 32, align: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "buffersize", scope: !1148, file: !910, line: 1989, baseType: !1046, size: 32, align: 32, offset: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1148, file: !910, line: 1990, baseType: !1153, size: 192, align: 8, offset: 64)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 192, align: 8, elements: !1154)
!1154 = !{!1144}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !1050, file: !910, line: 2012, baseType: !1156, size: 1600, align: 8)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 1600, align: 8, elements: !1157)
!1157 = !{!1158}
!1158 = !DISubrange(count: 200)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1036, file: !1035, line: 71, baseType: !959, size: 32, align: 32, offset: 1856)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1036, file: !1035, line: 71, baseType: !959, size: 32, align: 32, offset: 1888)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buffers", scope: !1036, file: !1035, line: 76, baseType: !1162, size: 64, align: 64, offset: 1920)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "V4L2Buffer", file: !926, line: 66, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Buffer", file: !926, line: 41, size: 6656, align: 64, elements: !1165)
!1165 = !{!1166, !1168, !1182, !1185, !1195, !1196, !1254, !1256, !1257}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1164, file: !926, line: 43, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "context_ref", scope: !1164, file: !926, line: 47, baseType: !1169, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1171, line: 94, baseType: !1172)
!1171 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1171, line: 81, size: 192, align: 64, elements: !1173)
!1173 = !{!1174, !1178, !1181}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1172, file: !1171, line: 82, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1171, line: 73, baseType: !1177)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1171, line: 73, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1172, file: !1171, line: 89, baseType: !1179, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !966, line: 48, baseType: !1091)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1172, file: !1171, line: 93, baseType: !959, size: 32, align: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "context_refcount", scope: !1164, file: !926, line: 48, baseType: !1183, size: 32, align: 32, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_uint", file: !1184, line: 47, baseType: !1048)
!1184 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stdatomic.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "plane_info", scope: !1164, file: !926, line: 55, baseType: !1186, size: 1536, align: 64, offset: 192)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1187, size: 1536, align: 64, elements: !1087)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "V4L2Plane_info", file: !926, line: 51, size: 192, align: 64, elements: !1188)
!1188 = !{!1189, !1190, !1191}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "bytesperline", scope: !1187, file: !926, line: 52, baseType: !959, size: 32, align: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "mm_addr", scope: !1187, file: !926, line: 53, baseType: !950, size: 64, align: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1187, file: !926, line: 54, baseType: !1192, size: 64, align: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1193, line: 216, baseType: !1194)
!1193 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1194 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "num_planes", scope: !1164, file: !926, line: 57, baseType: !959, size: 32, align: 32, offset: 1728)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1164, file: !926, line: 60, baseType: !1197, size: 704, align: 64, offset: 1792)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_buffer", file: !910, line: 852, size: 704, align: 64, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1213, !1226, !1227, !1228, !1251, !1252, !1253}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1197, file: !910, line: 853, baseType: !1046, size: 32, align: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1197, file: !910, line: 854, baseType: !1046, size: 32, align: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "bytesused", scope: !1197, file: !910, line: 855, baseType: !1046, size: 32, align: 32, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1197, file: !910, line: 856, baseType: !1046, size: 32, align: 32, offset: 96)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "field", scope: !1197, file: !910, line: 857, baseType: !1046, size: 32, align: 32, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !1197, file: !910, line: 858, baseType: !1205, size: 128, align: 64, offset: 192)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !1206, line: 30, size: 128, align: 64, elements: !1207)
!1206 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/time.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1207 = !{!1208, !1211}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1205, file: !1206, line: 32, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !1210, line: 139, baseType: !967)
!1210 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !1205, file: !1206, line: 33, baseType: !1212, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !1210, line: 141, baseType: !967)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "timecode", scope: !1197, file: !910, line: 859, baseType: !1214, size: 128, align: 32, offset: 320)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_timecode", file: !910, line: 726, size: 128, align: 32, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1221, !1222}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1214, file: !910, line: 727, baseType: !1046, size: 32, align: 32)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1214, file: !910, line: 728, baseType: !1046, size: 32, align: 32, offset: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !1214, file: !910, line: 729, baseType: !1090, size: 8, align: 8, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "seconds", scope: !1214, file: !910, line: 730, baseType: !1090, size: 8, align: 8, offset: 72)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "minutes", scope: !1214, file: !910, line: 731, baseType: !1090, size: 8, align: 8, offset: 80)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hours", scope: !1214, file: !910, line: 732, baseType: !1090, size: 8, align: 8, offset: 88)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "userbits", scope: !1214, file: !910, line: 733, baseType: !1223, size: 32, align: 8, offset: 96)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 32, align: 8, elements: !1224)
!1224 = !{!1225}
!1225 = !DISubrange(count: 4)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !1197, file: !910, line: 860, baseType: !1046, size: 32, align: 32, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !1197, file: !910, line: 863, baseType: !1046, size: 32, align: 32, offset: 480)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1197, file: !910, line: 869, baseType: !1229, size: 64, align: 64, offset: 512)
!1229 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1197, file: !910, line: 864, size: 64, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1250}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1229, file: !910, line: 865, baseType: !1046, size: 32, align: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !1229, file: !910, line: 866, baseType: !1194, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1229, file: !910, line: 867, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "v4l2_plane", file: !910, line: 810, size: 512, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1245, !1246}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "bytesused", scope: !1235, file: !910, line: 811, baseType: !1046, size: 32, align: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1235, file: !910, line: 812, baseType: !1046, size: 32, align: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !1235, file: !910, line: 817, baseType: !1240, size: 64, align: 64, offset: 64)
!1240 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1235, file: !910, line: 813, size: 64, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "mem_offset", scope: !1240, file: !910, line: 814, baseType: !1046, size: 32, align: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "userptr", scope: !1240, file: !910, line: 815, baseType: !1194, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1240, file: !910, line: 816, baseType: !1107, size: 32, align: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "data_offset", scope: !1235, file: !910, line: 818, baseType: !1046, size: 32, align: 32, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1235, file: !910, line: 819, baseType: !1247, size: 352, align: 32, offset: 160)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 352, align: 32, elements: !1248)
!1248 = !{!1249}
!1249 = !DISubrange(count: 11)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1229, file: !910, line: 868, baseType: !1107, size: 32, align: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1197, file: !910, line: 870, baseType: !1046, size: 32, align: 32, offset: 576)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "reserved2", scope: !1197, file: !910, line: 871, baseType: !1046, size: 32, align: 32, offset: 608)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !1197, file: !910, line: 872, baseType: !1046, size: 32, align: 32, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1164, file: !926, line: 61, baseType: !1255, size: 4096, align: 64, offset: 2496)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1235, size: 4096, align: 64, elements: !1087)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1164, file: !926, line: 63, baseType: !959, size: 32, align: 32, offset: 6592)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1164, file: !926, line: 64, baseType: !925, size: 32, align: 32, offset: 6624)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "num_buffers", scope: !1036, file: !1035, line: 81, baseType: !959, size: 32, align: 32, offset: 1984)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "streamon", scope: !1036, file: !1035, line: 86, baseType: !959, size: 32, align: 32, offset: 2016)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !1036, file: !1035, line: 92, baseType: !959, size: 32, align: 32, offset: 2048)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !1026, file: !934, line: 49, baseType: !1034, size: 2112, align: 64, offset: 34944)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1026, file: !934, line: 52, baseType: !1263, size: 64, align: 64, offset: 37056)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1266)
!1266 = !{!1267, !1270, !1271, !1272, !1512, !1513, !1514, !1515, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1541, !1545, !1546, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1727, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1265, file: !14, line: 1561, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1265, file: !14, line: 1562, baseType: !959, size: 32, align: 32, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1265, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1265, file: !14, line: 1565, baseType: !1273, size: 64, align: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1281, !1282, !1285, !1288, !1291, !1294, !1298, !1299, !1300, !1308, !1309, !1310, !1312, !1316, !1322, !1327, !1331, !1332, !1375, !1483, !1487, !1488, !1492, !1496, !1501, !1505, !1506, !1507}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1275, file: !14, line: 3475, baseType: !943, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1275, file: !14, line: 3480, baseType: !943, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1275, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1275, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1275, file: !14, line: 3487, baseType: !959, size: 32, align: 32, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1275, file: !14, line: 3488, baseType: !1283, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1275, file: !14, line: 3489, baseType: !1286, size: 64, align: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1275, file: !14, line: 3490, baseType: !1289, size: 64, align: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1275, file: !14, line: 3491, baseType: !1292, size: 64, align: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1275, file: !14, line: 3492, baseType: !1295, size: 64, align: 64, offset: 512)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1297)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !966, line: 55, baseType: !1194)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1275, file: !14, line: 3493, baseType: !1180, size: 8, align: 8, offset: 576)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1275, file: !14, line: 3494, baseType: !1268, size: 64, align: 64, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1275, file: !14, line: 3495, baseType: !1301, size: 64, align: 64, offset: 704)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1303)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1305)
!1305 = !{!1306, !1307}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1304, file: !14, line: 3402, baseType: !959, size: 32, align: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1304, file: !14, line: 3403, baseType: !943, size: 64, align: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1275, file: !14, line: 3507, baseType: !943, size: 64, align: 64, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1275, file: !14, line: 3516, baseType: !959, size: 32, align: 32, offset: 832)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1275, file: !14, line: 3517, baseType: !1311, size: 64, align: 64, offset: 896)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1275, file: !14, line: 3527, baseType: !1313, size: 64, align: 64, offset: 960)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!959, !1263}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1275, file: !14, line: 3535, baseType: !1317, size: 64, align: 64, offset: 1024)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!959, !1263, !1320}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1264)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1275, file: !14, line: 3541, baseType: !1323, size: 64, align: 64, offset: 1088)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1326)
!1326 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1275, file: !14, line: 3549, baseType: !1328, size: 64, align: 64, offset: 1152)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{null, !1311}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1275, file: !14, line: 3551, baseType: !1313, size: 64, align: 64, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1275, file: !14, line: 3552, baseType: !1333, size: 64, align: 64, offset: 1280)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!959, !1263, !1179, !959, !1336}
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1339)
!1339 = !{!1340, !1342, !1344, !1345, !1346, !1374}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1338, file: !14, line: 3921, baseType: !1341, size: 16, align: 16)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !966, line: 49, baseType: !1084)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1338, file: !14, line: 3922, baseType: !1343, size: 32, align: 32, offset: 32)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !966, line: 51, baseType: !1048)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1338, file: !14, line: 3923, baseType: !1343, size: 32, align: 32, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1338, file: !14, line: 3924, baseType: !1048, size: 32, align: 32, offset: 96)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1338, file: !14, line: 3925, baseType: !1347, size: 64, align: 64, offset: 128)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1350)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1351)
!1351 = !{!1352, !1353, !1354, !1355, !1356, !1357, !1365, !1367, !1369, !1370, !1372, !1373}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1350, file: !14, line: 3886, baseType: !959, size: 32, align: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1350, file: !14, line: 3887, baseType: !959, size: 32, align: 32, offset: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1350, file: !14, line: 3888, baseType: !959, size: 32, align: 32, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1350, file: !14, line: 3889, baseType: !959, size: 32, align: 32, offset: 96)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1350, file: !14, line: 3890, baseType: !959, size: 32, align: 32, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1350, file: !14, line: 3897, baseType: !1358, size: 768, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1359)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1360)
!1360 = !{!1361, !1363}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1359, file: !14, line: 3855, baseType: !1362, size: 512, align: 64)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 512, align: 64, elements: !1087)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1359, file: !14, line: 3857, baseType: !1364, size: 256, align: 32, offset: 512)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 256, align: 32, elements: !1087)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1350, file: !14, line: 3903, baseType: !1366, size: 256, align: 64, offset: 960)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 256, align: 64, elements: !1224)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1350, file: !14, line: 3904, baseType: !1368, size: 128, align: 32, offset: 1216)
!1368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 128, align: 32, elements: !1224)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1350, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1350, file: !14, line: 3908, baseType: !1371, size: 64, align: 64, offset: 1408)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1350, file: !14, line: 3915, baseType: !1371, size: 64, align: 64, offset: 1472)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1350, file: !14, line: 3917, baseType: !959, size: 32, align: 32, offset: 1536)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1338, file: !14, line: 3926, baseType: !965, size: 64, align: 64, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1275, file: !14, line: 3564, baseType: !1376, size: 64, align: 64, offset: 1344)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DISubroutineType(types: !1378)
!1378 = !{!959, !1263, !1379, !1402, !1482}
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1382)
!1382 = !{!1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1398, !1399, !1400, !1401}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1381, file: !14, line: 1451, baseType: !1169, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1381, file: !14, line: 1461, baseType: !965, size: 64, align: 64, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1381, file: !14, line: 1467, baseType: !965, size: 64, align: 64, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1381, file: !14, line: 1468, baseType: !1179, size: 64, align: 64, offset: 192)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1381, file: !14, line: 1469, baseType: !959, size: 32, align: 32, offset: 256)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1381, file: !14, line: 1470, baseType: !959, size: 32, align: 32, offset: 288)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1381, file: !14, line: 1474, baseType: !959, size: 32, align: 32, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1381, file: !14, line: 1479, baseType: !1391, size: 64, align: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1396, !1397}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1393, file: !14, line: 1412, baseType: !1179, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1393, file: !14, line: 1413, baseType: !959, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1393, file: !14, line: 1414, baseType: !873, size: 32, align: 32, offset: 96)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1381, file: !14, line: 1480, baseType: !959, size: 32, align: 32, offset: 448)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1381, file: !14, line: 1486, baseType: !965, size: 64, align: 64, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1381, file: !14, line: 1488, baseType: !965, size: 64, align: 64, offset: 576)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1381, file: !14, line: 1497, baseType: !965, size: 64, align: 64, offset: 640)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1404)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1436, !1438, !1439, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1405, file: !744, line: 282, baseType: !1362, size: 512, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1405, file: !744, line: 299, baseType: !1364, size: 256, align: 32, offset: 512)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1405, file: !744, line: 315, baseType: !1410, size: 64, align: 64, offset: 768)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1405, file: !744, line: 326, baseType: !959, size: 32, align: 32, offset: 832)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1405, file: !744, line: 326, baseType: !959, size: 32, align: 32, offset: 864)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1405, file: !744, line: 334, baseType: !959, size: 32, align: 32, offset: 896)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1405, file: !744, line: 341, baseType: !959, size: 32, align: 32, offset: 928)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1405, file: !744, line: 346, baseType: !959, size: 32, align: 32, offset: 960)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1405, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1405, file: !744, line: 356, baseType: !972, size: 64, align: 32, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1405, file: !744, line: 361, baseType: !965, size: 64, align: 64, offset: 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1405, file: !744, line: 369, baseType: !965, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1405, file: !744, line: 377, baseType: !965, size: 64, align: 64, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1405, file: !744, line: 382, baseType: !959, size: 32, align: 32, offset: 1280)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1405, file: !744, line: 386, baseType: !959, size: 32, align: 32, offset: 1312)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1405, file: !744, line: 391, baseType: !959, size: 32, align: 32, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1405, file: !744, line: 396, baseType: !950, size: 64, align: 64, offset: 1408)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1405, file: !744, line: 403, baseType: !1426, size: 512, align: 64, offset: 1472)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1297, size: 512, align: 64, elements: !1087)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1405, file: !744, line: 410, baseType: !959, size: 32, align: 32, offset: 1984)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1405, file: !744, line: 415, baseType: !959, size: 32, align: 32, offset: 2016)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1405, file: !744, line: 420, baseType: !959, size: 32, align: 32, offset: 2048)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1405, file: !744, line: 425, baseType: !959, size: 32, align: 32, offset: 2080)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1405, file: !744, line: 435, baseType: !965, size: 64, align: 64, offset: 2112)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1405, file: !744, line: 440, baseType: !959, size: 32, align: 32, offset: 2176)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1405, file: !744, line: 445, baseType: !1297, size: 64, align: 64, offset: 2240)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1405, file: !744, line: 459, baseType: !1435, size: 512, align: 64, offset: 2304)
!1435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1169, size: 512, align: 64, elements: !1087)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1405, file: !744, line: 473, baseType: !1437, size: 64, align: 64, offset: 2816)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1405, file: !744, line: 477, baseType: !959, size: 32, align: 32, offset: 2880)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1405, file: !744, line: 479, baseType: !1440, size: 64, align: 64, offset: 2944)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1444)
!1444 = !{!1445, !1446, !1447, !1448, !1453}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1443, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1443, file: !744, line: 203, baseType: !1179, size: 64, align: 64, offset: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1443, file: !744, line: 204, baseType: !959, size: 32, align: 32, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1443, file: !744, line: 205, baseType: !1449, size: 64, align: 64, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1451, line: 86, baseType: !1452)
!1451 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1452 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1451, line: 86, flags: DIFlagFwdDecl)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1443, file: !744, line: 206, baseType: !1169, size: 64, align: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1405, file: !744, line: 480, baseType: !959, size: 32, align: 32, offset: 3008)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1405, file: !744, line: 505, baseType: !959, size: 32, align: 32, offset: 3040)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1405, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1405, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1405, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1405, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1405, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1405, file: !744, line: 532, baseType: !965, size: 64, align: 64, offset: 3264)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1405, file: !744, line: 539, baseType: !965, size: 64, align: 64, offset: 3328)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1405, file: !744, line: 547, baseType: !965, size: 64, align: 64, offset: 3392)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1405, file: !744, line: 554, baseType: !1449, size: 64, align: 64, offset: 3456)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1405, file: !744, line: 563, baseType: !959, size: 32, align: 32, offset: 3520)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1405, file: !744, line: 572, baseType: !959, size: 32, align: 32, offset: 3552)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1405, file: !744, line: 581, baseType: !959, size: 32, align: 32, offset: 3584)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1405, file: !744, line: 588, baseType: !1469, size: 64, align: 64, offset: 3648)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !966, line: 36, baseType: !1471)
!1471 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1405, file: !744, line: 593, baseType: !959, size: 32, align: 32, offset: 3712)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1405, file: !744, line: 596, baseType: !959, size: 32, align: 32, offset: 3744)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1405, file: !744, line: 599, baseType: !1169, size: 64, align: 64, offset: 3776)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1405, file: !744, line: 605, baseType: !1169, size: 64, align: 64, offset: 3840)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1405, file: !744, line: 616, baseType: !1169, size: 64, align: 64, offset: 3904)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1405, file: !744, line: 626, baseType: !1192, size: 64, align: 64, offset: 3968)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1405, file: !744, line: 627, baseType: !1192, size: 64, align: 64, offset: 4032)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1405, file: !744, line: 628, baseType: !1192, size: 64, align: 64, offset: 4096)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1405, file: !744, line: 629, baseType: !1192, size: 64, align: 64, offset: 4160)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1405, file: !744, line: 645, baseType: !1169, size: 64, align: 64, offset: 4224)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1275, file: !14, line: 3566, baseType: !1484, size: 64, align: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!959, !1263, !950, !1482, !1379}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1275, file: !14, line: 3567, baseType: !1313, size: 64, align: 64, offset: 1472)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1275, file: !14, line: 3576, baseType: !1489, size: 64, align: 64, offset: 1536)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!959, !1263, !1402}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1275, file: !14, line: 3577, baseType: !1493, size: 64, align: 64, offset: 1600)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!959, !1263, !1379}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1275, file: !14, line: 3584, baseType: !1497, size: 64, align: 64, offset: 1664)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!959, !1263, !1500}
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1275, file: !14, line: 3589, baseType: !1502, size: 64, align: 64, offset: 1728)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{null, !1263}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1275, file: !14, line: 3594, baseType: !959, size: 32, align: 32, offset: 1792)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1275, file: !14, line: 3600, baseType: !943, size: 64, align: 64, offset: 1856)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1275, file: !14, line: 3609, baseType: !1508, size: 64, align: 64, offset: 1920)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1511)
!1511 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1265, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1265, file: !14, line: 1581, baseType: !1048, size: 32, align: 32, offset: 224)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1265, file: !14, line: 1583, baseType: !950, size: 64, align: 64, offset: 256)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1265, file: !14, line: 1591, baseType: !1516, size: 64, align: 64, offset: 320)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1265, file: !14, line: 1598, baseType: !950, size: 64, align: 64, offset: 384)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1265, file: !14, line: 1606, baseType: !965, size: 64, align: 64, offset: 448)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1265, file: !14, line: 1614, baseType: !959, size: 32, align: 32, offset: 512)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1265, file: !14, line: 1622, baseType: !959, size: 32, align: 32, offset: 544)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1265, file: !14, line: 1628, baseType: !959, size: 32, align: 32, offset: 576)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1265, file: !14, line: 1636, baseType: !959, size: 32, align: 32, offset: 608)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1265, file: !14, line: 1643, baseType: !959, size: 32, align: 32, offset: 640)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1265, file: !14, line: 1657, baseType: !1179, size: 64, align: 64, offset: 704)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1265, file: !14, line: 1658, baseType: !959, size: 32, align: 32, offset: 768)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1265, file: !14, line: 1679, baseType: !972, size: 64, align: 32, offset: 800)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1265, file: !14, line: 1688, baseType: !959, size: 32, align: 32, offset: 864)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1265, file: !14, line: 1712, baseType: !959, size: 32, align: 32, offset: 896)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1265, file: !14, line: 1729, baseType: !959, size: 32, align: 32, offset: 928)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1265, file: !14, line: 1729, baseType: !959, size: 32, align: 32, offset: 960)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1265, file: !14, line: 1744, baseType: !959, size: 32, align: 32, offset: 992)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1265, file: !14, line: 1744, baseType: !959, size: 32, align: 32, offset: 1024)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1265, file: !14, line: 1751, baseType: !959, size: 32, align: 32, offset: 1056)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1265, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1265, file: !14, line: 1791, baseType: !1537, size: 64, align: 64, offset: 1152)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DISubroutineType(types: !1539)
!1539 = !{null, !1540, !1402, !1482, !959, !959, !959}
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1265, file: !14, line: 1808, baseType: !1542, size: 64, align: 64, offset: 1216)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!473, !1540, !1286}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1265, file: !14, line: 1816, baseType: !959, size: 32, align: 32, offset: 1280)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1265, file: !14, line: 1825, baseType: !1547, size: 32, align: 32, offset: 1312)
!1547 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1265, file: !14, line: 1830, baseType: !959, size: 32, align: 32, offset: 1344)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1265, file: !14, line: 1838, baseType: !1547, size: 32, align: 32, offset: 1376)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1265, file: !14, line: 1846, baseType: !959, size: 32, align: 32, offset: 1408)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1265, file: !14, line: 1851, baseType: !959, size: 32, align: 32, offset: 1440)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1265, file: !14, line: 1861, baseType: !1547, size: 32, align: 32, offset: 1472)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1265, file: !14, line: 1868, baseType: !1547, size: 32, align: 32, offset: 1504)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1265, file: !14, line: 1875, baseType: !1547, size: 32, align: 32, offset: 1536)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1265, file: !14, line: 1882, baseType: !1547, size: 32, align: 32, offset: 1568)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1265, file: !14, line: 1889, baseType: !1547, size: 32, align: 32, offset: 1600)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1265, file: !14, line: 1896, baseType: !1547, size: 32, align: 32, offset: 1632)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1265, file: !14, line: 1903, baseType: !1547, size: 32, align: 32, offset: 1664)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1265, file: !14, line: 1910, baseType: !959, size: 32, align: 32, offset: 1696)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1265, file: !14, line: 1915, baseType: !959, size: 32, align: 32, offset: 1728)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1265, file: !14, line: 1926, baseType: !1482, size: 64, align: 64, offset: 1792)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1265, file: !14, line: 1935, baseType: !972, size: 64, align: 32, offset: 1856)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1265, file: !14, line: 1942, baseType: !959, size: 32, align: 32, offset: 1920)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1265, file: !14, line: 1948, baseType: !959, size: 32, align: 32, offset: 1952)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1265, file: !14, line: 1954, baseType: !959, size: 32, align: 32, offset: 1984)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1265, file: !14, line: 1960, baseType: !959, size: 32, align: 32, offset: 2016)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1265, file: !14, line: 1984, baseType: !959, size: 32, align: 32, offset: 2048)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1265, file: !14, line: 1991, baseType: !959, size: 32, align: 32, offset: 2080)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1265, file: !14, line: 1996, baseType: !959, size: 32, align: 32, offset: 2112)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1265, file: !14, line: 2004, baseType: !959, size: 32, align: 32, offset: 2144)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1265, file: !14, line: 2011, baseType: !959, size: 32, align: 32, offset: 2176)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1265, file: !14, line: 2018, baseType: !959, size: 32, align: 32, offset: 2208)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1265, file: !14, line: 2027, baseType: !959, size: 32, align: 32, offset: 2240)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1265, file: !14, line: 2034, baseType: !959, size: 32, align: 32, offset: 2272)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1265, file: !14, line: 2044, baseType: !959, size: 32, align: 32, offset: 2304)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1265, file: !14, line: 2054, baseType: !1577, size: 64, align: 64, offset: 2368)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1265, file: !14, line: 2061, baseType: !1577, size: 64, align: 64, offset: 2432)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1265, file: !14, line: 2066, baseType: !959, size: 32, align: 32, offset: 2496)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1265, file: !14, line: 2070, baseType: !959, size: 32, align: 32, offset: 2528)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1265, file: !14, line: 2078, baseType: !959, size: 32, align: 32, offset: 2560)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1265, file: !14, line: 2085, baseType: !959, size: 32, align: 32, offset: 2592)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1265, file: !14, line: 2092, baseType: !959, size: 32, align: 32, offset: 2624)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1265, file: !14, line: 2099, baseType: !959, size: 32, align: 32, offset: 2656)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1265, file: !14, line: 2106, baseType: !959, size: 32, align: 32, offset: 2688)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1265, file: !14, line: 2113, baseType: !959, size: 32, align: 32, offset: 2720)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1265, file: !14, line: 2120, baseType: !959, size: 32, align: 32, offset: 2752)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1265, file: !14, line: 2125, baseType: !959, size: 32, align: 32, offset: 2784)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1265, file: !14, line: 2133, baseType: !959, size: 32, align: 32, offset: 2816)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1265, file: !14, line: 2140, baseType: !959, size: 32, align: 32, offset: 2848)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1265, file: !14, line: 2145, baseType: !959, size: 32, align: 32, offset: 2880)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1265, file: !14, line: 2153, baseType: !959, size: 32, align: 32, offset: 2912)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1265, file: !14, line: 2158, baseType: !959, size: 32, align: 32, offset: 2944)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1265, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1265, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1265, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1265, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1265, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1265, file: !14, line: 2203, baseType: !959, size: 32, align: 32, offset: 3136)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1265, file: !14, line: 2209, baseType: !844, size: 32, align: 32, offset: 3168)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1265, file: !14, line: 2212, baseType: !959, size: 32, align: 32, offset: 3200)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1265, file: !14, line: 2213, baseType: !959, size: 32, align: 32, offset: 3232)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1265, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1265, file: !14, line: 2232, baseType: !959, size: 32, align: 32, offset: 3296)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1265, file: !14, line: 2243, baseType: !959, size: 32, align: 32, offset: 3328)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1265, file: !14, line: 2249, baseType: !959, size: 32, align: 32, offset: 3360)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1265, file: !14, line: 2256, baseType: !959, size: 32, align: 32, offset: 3392)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1265, file: !14, line: 2263, baseType: !1297, size: 64, align: 64, offset: 3456)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1265, file: !14, line: 2270, baseType: !1297, size: 64, align: 64, offset: 3520)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1265, file: !14, line: 2277, baseType: !852, size: 32, align: 32, offset: 3584)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1265, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1265, file: !14, line: 2367, baseType: !1613, size: 64, align: 64, offset: 3648)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!959, !1540, !1500, !959}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1265, file: !14, line: 2383, baseType: !959, size: 32, align: 32, offset: 3712)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1265, file: !14, line: 2386, baseType: !1547, size: 32, align: 32, offset: 3744)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1265, file: !14, line: 2387, baseType: !1547, size: 32, align: 32, offset: 3776)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1265, file: !14, line: 2394, baseType: !959, size: 32, align: 32, offset: 3808)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1265, file: !14, line: 2401, baseType: !959, size: 32, align: 32, offset: 3840)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1265, file: !14, line: 2408, baseType: !959, size: 32, align: 32, offset: 3872)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1265, file: !14, line: 2415, baseType: !959, size: 32, align: 32, offset: 3904)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1265, file: !14, line: 2422, baseType: !959, size: 32, align: 32, offset: 3936)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1265, file: !14, line: 2423, baseType: !1625, size: 64, align: 64, offset: 3968)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1627)
!1627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1628)
!1628 = !{!1629, !1630, !1631, !1632}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1627, file: !14, line: 827, baseType: !959, size: 32, align: 32)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1627, file: !14, line: 828, baseType: !959, size: 32, align: 32, offset: 32)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1627, file: !14, line: 829, baseType: !959, size: 32, align: 32, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1627, file: !14, line: 830, baseType: !1547, size: 32, align: 32, offset: 96)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1265, file: !14, line: 2430, baseType: !965, size: 64, align: 64, offset: 4032)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1265, file: !14, line: 2437, baseType: !965, size: 64, align: 64, offset: 4096)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1265, file: !14, line: 2444, baseType: !1547, size: 32, align: 32, offset: 4160)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1265, file: !14, line: 2451, baseType: !1547, size: 32, align: 32, offset: 4192)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1265, file: !14, line: 2458, baseType: !959, size: 32, align: 32, offset: 4224)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1265, file: !14, line: 2469, baseType: !959, size: 32, align: 32, offset: 4256)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1265, file: !14, line: 2475, baseType: !959, size: 32, align: 32, offset: 4288)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1265, file: !14, line: 2481, baseType: !959, size: 32, align: 32, offset: 4320)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1265, file: !14, line: 2485, baseType: !959, size: 32, align: 32, offset: 4352)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1265, file: !14, line: 2489, baseType: !959, size: 32, align: 32, offset: 4384)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1265, file: !14, line: 2493, baseType: !959, size: 32, align: 32, offset: 4416)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1265, file: !14, line: 2501, baseType: !959, size: 32, align: 32, offset: 4448)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1265, file: !14, line: 2506, baseType: !959, size: 32, align: 32, offset: 4480)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1265, file: !14, line: 2510, baseType: !959, size: 32, align: 32, offset: 4512)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1265, file: !14, line: 2514, baseType: !965, size: 64, align: 64, offset: 4544)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1265, file: !14, line: 2528, baseType: !1649, size: 64, align: 64, offset: 4608)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{null, !1540, !950, !959, !959}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1265, file: !14, line: 2534, baseType: !959, size: 32, align: 32, offset: 4672)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1265, file: !14, line: 2545, baseType: !959, size: 32, align: 32, offset: 4704)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1265, file: !14, line: 2547, baseType: !959, size: 32, align: 32, offset: 4736)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1265, file: !14, line: 2549, baseType: !959, size: 32, align: 32, offset: 4768)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1265, file: !14, line: 2551, baseType: !959, size: 32, align: 32, offset: 4800)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1265, file: !14, line: 2553, baseType: !959, size: 32, align: 32, offset: 4832)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1265, file: !14, line: 2555, baseType: !959, size: 32, align: 32, offset: 4864)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1265, file: !14, line: 2557, baseType: !959, size: 32, align: 32, offset: 4896)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1265, file: !14, line: 2559, baseType: !959, size: 32, align: 32, offset: 4928)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1265, file: !14, line: 2563, baseType: !959, size: 32, align: 32, offset: 4960)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1265, file: !14, line: 2571, baseType: !1371, size: 64, align: 64, offset: 4992)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1265, file: !14, line: 2579, baseType: !1371, size: 64, align: 64, offset: 5056)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1265, file: !14, line: 2586, baseType: !959, size: 32, align: 32, offset: 5120)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1265, file: !14, line: 2615, baseType: !959, size: 32, align: 32, offset: 5152)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1265, file: !14, line: 2627, baseType: !959, size: 32, align: 32, offset: 5184)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1265, file: !14, line: 2637, baseType: !959, size: 32, align: 32, offset: 5216)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1265, file: !14, line: 2681, baseType: !959, size: 32, align: 32, offset: 5248)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1265, file: !14, line: 2709, baseType: !965, size: 64, align: 64, offset: 5312)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1265, file: !14, line: 2716, baseType: !1671, size: 64, align: 64, offset: 5376)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1673)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1674)
!1674 = !{!1675, !1676, !1677, !1678, !1679, !1680, !1681, !1687, !1691, !1692, !1693, !1694, !1700, !1701, !1702, !1703, !1704}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1673, file: !14, line: 3642, baseType: !943, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1673, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1673, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1673, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1673, file: !14, line: 3669, baseType: !959, size: 32, align: 32, offset: 160)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1673, file: !14, line: 3682, baseType: !1497, size: 64, align: 64, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1673, file: !14, line: 3698, baseType: !1682, size: 64, align: 64, offset: 256)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!959, !1263, !1685, !1343}
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1673, file: !14, line: 3712, baseType: !1688, size: 64, align: 64, offset: 320)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!959, !1263, !959, !1685, !1343}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1673, file: !14, line: 3726, baseType: !1682, size: 64, align: 64, offset: 384)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1673, file: !14, line: 3737, baseType: !1313, size: 64, align: 64, offset: 448)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1673, file: !14, line: 3746, baseType: !959, size: 32, align: 32, offset: 512)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1673, file: !14, line: 3757, baseType: !1695, size: 64, align: 64, offset: 576)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{null, !1698}
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
