; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_mp4toannexb_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_mp4toannexb_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !611, line: 33, size: 32, align: 32, elements: !612)
!611 = !DIFile(filename: "libavcodec/h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!613 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED", value: 0)
!614 = !DIEnumerator(name: "H264_NAL_SLICE", value: 1)
!615 = !DIEnumerator(name: "H264_NAL_DPA", value: 2)
!616 = !DIEnumerator(name: "H264_NAL_DPB", value: 3)
!617 = !DIEnumerator(name: "H264_NAL_DPC", value: 4)
!618 = !DIEnumerator(name: "H264_NAL_IDR_SLICE", value: 5)
!619 = !DIEnumerator(name: "H264_NAL_SEI", value: 6)
!620 = !DIEnumerator(name: "H264_NAL_SPS", value: 7)
!621 = !DIEnumerator(name: "H264_NAL_PPS", value: 8)
!622 = !DIEnumerator(name: "H264_NAL_AUD", value: 9)
!623 = !DIEnumerator(name: "H264_NAL_END_SEQUENCE", value: 10)
!624 = !DIEnumerator(name: "H264_NAL_END_STREAM", value: 11)
!625 = !DIEnumerator(name: "H264_NAL_FILLER_DATA", value: 12)
!626 = !DIEnumerator(name: "H264_NAL_SPS_EXT", value: 13)
!627 = !DIEnumerator(name: "H264_NAL_PREFIX", value: 14)
!628 = !DIEnumerator(name: "H264_NAL_SUB_SPS", value: 15)
!629 = !DIEnumerator(name: "H264_NAL_DPS", value: 16)
!630 = !DIEnumerator(name: "H264_NAL_RESERVED17", value: 17)
!631 = !DIEnumerator(name: "H264_NAL_RESERVED18", value: 18)
!632 = !DIEnumerator(name: "H264_NAL_AUXILIARY_SLICE", value: 19)
!633 = !DIEnumerator(name: "H264_NAL_EXTEN_SLICE", value: 20)
!634 = !DIEnumerator(name: "H264_NAL_DEPTH_EXTEN_SLICE", value: 21)
!635 = !DIEnumerator(name: "H264_NAL_RESERVED22", value: 22)
!636 = !DIEnumerator(name: "H264_NAL_RESERVED23", value: 23)
!637 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED24", value: 24)
!638 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED25", value: 25)
!639 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED26", value: 26)
!640 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED27", value: 27)
!641 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED28", value: 28)
!642 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED29", value: 29)
!643 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED30", value: 30)
!644 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED31", value: 31)
!645 = !{!646, !651, !659, !658, !660, !667}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !649, line: 48, baseType: !650)
!649 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!650 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !654, line: 221, size: 32, align: 8, elements: !655)
!654 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !653, file: !654, line: 221, baseType: !657, size: 32, align: 32)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !649, line: 51, baseType: !658)
!658 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!659 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !654, line: 222, size: 16, align: 8, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !662, file: !654, line: 222, baseType: !665, size: 16, align: 16)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !649, line: 49, baseType: !666)
!666 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64, align: 64)
!668 = !{!669, !833, !837}
!669 = distinct !DIGlobalVariable(name: "ff_h264_mp4toannexb_bsf", scope: !0, file: !670, line: 296, type: !671, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_h264_mp4toannexb_bsf)
!670 = !DIFile(filename: "libavcodec/h264_mp4toannexb_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !674)
!674 = !{!675, !679, !682, !724, !725, !790, !828, !832}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !673, file: !4, line: 5797, baseType: !676, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !673, file: !4, line: 5804, baseType: !680, size: 64, align: 64, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !673, file: !4, line: 5815, baseType: !683, size: 64, align: 64, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !687)
!687 = !{!688, !689, !694, !698, !699, !700, !701, !705, !711, !713, !717}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !686, file: !464, line: 72, baseType: !676, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !686, file: !464, line: 78, baseType: !690, size: 64, align: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64, align: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!676, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !686, file: !464, line: 85, baseType: !695, size: 64, align: 64, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64, align: 64)
!696 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !697)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !686, file: !464, line: 93, baseType: !659, size: 32, align: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !686, file: !464, line: 99, baseType: !659, size: 32, align: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !686, file: !464, line: 108, baseType: !659, size: 32, align: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !686, file: !464, line: 113, baseType: !702, size: 64, align: 64, offset: 320)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64, align: 64)
!703 = !DISubroutineType(types: !704)
!704 = !{!693, !693, !693}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !686, file: !464, line: 123, baseType: !706, size: 64, align: 64, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !686, file: !464, line: 130, baseType: !712, size: 32, align: 32, offset: 448)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !686, file: !464, line: 136, baseType: !714, size: 64, align: 64, offset: 512)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{!712, !693}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !686, file: !464, line: 142, baseType: !718, size: 64, align: 64, offset: 576)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!659, !721, !693, !676, !659}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !673, file: !4, line: 5825, baseType: !659, size: 32, align: 32, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !673, file: !4, line: 5826, baseType: !726, size: 64, align: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!659, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !732)
!732 = !{!733, !734, !737, !741, !742, !787, !788, !789}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !731, file: !4, line: 5751, baseType: !683, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !731, file: !4, line: 5756, baseType: !735, size: 64, align: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !731, file: !4, line: 5762, baseType: !738, size: 64, align: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !740)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !731, file: !4, line: 5768, baseType: !693, size: 64, align: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !731, file: !4, line: 5775, baseType: !743, size: 64, align: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !746)
!746 = !{!747, !748, !749, !750, !752, !753, !754, !757, !758, !759, !760, !761, !762, !763, !770, !771, !772, !773, !774, !775, !776, !777, !780, !781, !782, !783, !784, !785, !786}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !745, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !745, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !745, file: !4, line: 3948, baseType: !657, size: 32, align: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !745, file: !4, line: 3958, baseType: !751, size: 64, align: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !745, file: !4, line: 3962, baseType: !659, size: 32, align: 32, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !745, file: !4, line: 3968, baseType: !659, size: 32, align: 32, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !745, file: !4, line: 3973, baseType: !755, size: 64, align: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !649, line: 40, baseType: !756)
!756 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !745, file: !4, line: 3986, baseType: !659, size: 32, align: 32, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !745, file: !4, line: 3999, baseType: !659, size: 32, align: 32, offset: 352)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !745, file: !4, line: 4004, baseType: !659, size: 32, align: 32, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !745, file: !4, line: 4005, baseType: !659, size: 32, align: 32, offset: 416)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !745, file: !4, line: 4010, baseType: !659, size: 32, align: 32, offset: 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !745, file: !4, line: 4011, baseType: !659, size: 32, align: 32, offset: 480)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !745, file: !4, line: 4020, baseType: !764, size: 64, align: 32, offset: 512)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !765, line: 61, baseType: !766)
!765 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !765, line: 58, size: 64, align: 32, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !766, file: !765, line: 59, baseType: !659, size: 32, align: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !766, file: !765, line: 60, baseType: !659, size: 32, align: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !745, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !745, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !745, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !745, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !745, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !745, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !745, file: !4, line: 4039, baseType: !659, size: 32, align: 32, offset: 768)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !745, file: !4, line: 4046, baseType: !778, size: 64, align: 64, offset: 832)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !649, line: 55, baseType: !779)
!779 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !745, file: !4, line: 4050, baseType: !659, size: 32, align: 32, offset: 896)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !745, file: !4, line: 4054, baseType: !659, size: 32, align: 32, offset: 928)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !745, file: !4, line: 4061, baseType: !659, size: 32, align: 32, offset: 960)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !745, file: !4, line: 4065, baseType: !659, size: 32, align: 32, offset: 992)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !745, file: !4, line: 4073, baseType: !659, size: 32, align: 32, offset: 1024)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !745, file: !4, line: 4080, baseType: !659, size: 32, align: 32, offset: 1056)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !745, file: !4, line: 4084, baseType: !659, size: 32, align: 32, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !731, file: !4, line: 5781, baseType: !743, size: 64, align: 64, offset: 320)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !731, file: !4, line: 5787, baseType: !764, size: 64, align: 32, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !731, file: !4, line: 5793, baseType: !764, size: 64, align: 32, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !673, file: !4, line: 5827, baseType: !791, size: 64, align: 64, offset: 320)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!659, !729, !794}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !797)
!797 = !{!798, !810, !811, !812, !813, !814, !815, !816, !824, !825, !826, !827}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !796, file: !4, line: 1451, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !801, line: 94, baseType: !802)
!801 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !801, line: 81, size: 192, align: 64, elements: !803)
!803 = !{!804, !808, !809}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !802, file: !801, line: 82, baseType: !805, size: 64, align: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !801, line: 73, baseType: !807)
!807 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !801, line: 73, flags: DIFlagFwdDecl)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !802, file: !801, line: 89, baseType: !751, size: 64, align: 64, offset: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !802, file: !801, line: 93, baseType: !659, size: 32, align: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !796, file: !4, line: 1461, baseType: !755, size: 64, align: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !796, file: !4, line: 1467, baseType: !755, size: 64, align: 64, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !796, file: !4, line: 1468, baseType: !751, size: 64, align: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !796, file: !4, line: 1469, baseType: !659, size: 32, align: 32, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !796, file: !4, line: 1470, baseType: !659, size: 32, align: 32, offset: 288)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !796, file: !4, line: 1474, baseType: !659, size: 32, align: 32, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !796, file: !4, line: 1479, baseType: !817, size: 64, align: 64, offset: 384)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !819, file: !4, line: 1412, baseType: !751, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !819, file: !4, line: 1413, baseType: !659, size: 32, align: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !819, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !796, file: !4, line: 1480, baseType: !659, size: 32, align: 32, offset: 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !796, file: !4, line: 1486, baseType: !755, size: 64, align: 64, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !796, file: !4, line: 1488, baseType: !755, size: 64, align: 64, offset: 576)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !796, file: !4, line: 1497, baseType: !755, size: 64, align: 64, offset: 640)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !673, file: !4, line: 5828, baseType: !829, size: 64, align: 64, offset: 384)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64, align: 64)
!830 = !DISubroutineType(types: !831)
!831 = !{null, !729}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !673, file: !4, line: 5829, baseType: !829, size: 64, align: 64, offset: 448)
!833 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !670, line: 292, type: !834, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!834 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 64, align: 32, elements: !835)
!835 = !{!836}
!836 = !DISubrange(count: 2)
!837 = distinct !DIGlobalVariable(name: "nalu_header", scope: !838, file: !670, line: 75, type: !843, isLocal: true, isDefinition: true, variable: [4 x i8]* @h264_extradata_to_annexb.nalu_header)
!838 = distinct !DISubprogram(name: "h264_extradata_to_annexb", scope: !670, file: !670, line: 67, type: !839, isLocal: true, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !842)
!839 = !DISubroutineType(types: !840)
!840 = !{!659, !729, !841}
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!842 = !{}
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 32, align: 8, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 4)
!846 = !{i32 2, !"Dwarf Version", i32 4}
!847 = !{i32 2, !"Debug Info Version", i32 3}
!848 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!849 = distinct !DISubprogram(name: "h264_mp4toannexb_init", scope: !670, file: !670, line: 141, type: !727, isLocal: true, isDefinition: true, scopeLine: 142, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !842)
!850 = !DILocalVariable(name: "x", arg: 1, scope: !851, file: !852, line: 66, type: !657)
!851 = distinct !DISubprogram(name: "av_bswap32", scope: !852, file: !852, line: 66, type: !853, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !842)
!852 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!853 = !DISubroutineType(types: !854)
!854 = !{!657, !657}
!855 = !DIExpression()
!856 = !DILocation(line: 66, column: 98, scope: !851, inlinedAt: !857)
!857 = distinct !DILocation(line: 150, column: 29, scope: !858)
!858 = !DILexicalBlockFile(scope: !859, file: !670, discriminator: 1)
!859 = distinct !DILexicalBlock(scope: !849, file: !670, line: 148, column: 9)
!860 = !DILocalVariable(name: "ctx", arg: 1, scope: !849, file: !670, line: 141, type: !729)
!861 = !DILocation(line: 141, column: 48, scope: !849)
!862 = !DILocalVariable(name: "s", scope: !849, file: !670, line: 143, type: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264BSFContext", file: !670, line: 39, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264BSFContext", file: !670, line: 31, size: 128, align: 32, elements: !866)
!866 = !{!867, !869, !870, !871, !872, !873, !874}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "sps_offset", scope: !865, file: !670, line: 32, baseType: !868, size: 32, align: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !649, line: 38, baseType: !659)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "pps_offset", scope: !865, file: !670, line: 33, baseType: !868, size: 32, align: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "length_size", scope: !865, file: !670, line: 34, baseType: !648, size: 8, align: 8, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "new_idr", scope: !865, file: !670, line: 35, baseType: !648, size: 8, align: 8, offset: 72)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "idr_sps_seen", scope: !865, file: !670, line: 36, baseType: !648, size: 8, align: 8, offset: 80)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "idr_pps_seen", scope: !865, file: !670, line: 37, baseType: !648, size: 8, align: 8, offset: 88)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_parsed", scope: !865, file: !670, line: 38, baseType: !659, size: 32, align: 32, offset: 96)
!875 = !DILocation(line: 143, column: 21, scope: !849)
!876 = !DILocation(line: 143, column: 25, scope: !849)
!877 = !DILocation(line: 143, column: 30, scope: !849)
!878 = !DILocalVariable(name: "extra_size", scope: !849, file: !670, line: 144, type: !659)
!879 = !DILocation(line: 144, column: 9, scope: !849)
!880 = !DILocation(line: 144, column: 22, scope: !849)
!881 = !DILocation(line: 144, column: 27, scope: !849)
!882 = !DILocation(line: 144, column: 35, scope: !849)
!883 = !DILocalVariable(name: "ret", scope: !849, file: !670, line: 145, type: !659)
!884 = !DILocation(line: 145, column: 9, scope: !849)
!885 = !DILocation(line: 148, column: 10, scope: !859)
!886 = !DILocation(line: 148, column: 21, scope: !859)
!887 = !DILocation(line: 149, column: 10, scope: !859)
!888 = !DILocation(line: 149, column: 21, scope: !859)
!889 = !DILocation(line: 149, column: 26, scope: !859)
!890 = !DILocation(line: 149, column: 49, scope: !858)
!891 = !DILocation(line: 149, column: 54, scope: !858)
!892 = !DILocation(line: 149, column: 62, scope: !858)
!893 = !DILocation(line: 149, column: 31, scope: !858)
!894 = !DILocation(line: 149, column: 77, scope: !858)
!895 = !DILocation(line: 149, column: 105, scope: !858)
!896 = !DILocation(line: 149, column: 110, scope: !858)
!897 = !DILocation(line: 149, column: 118, scope: !858)
!898 = !DILocation(line: 149, column: 87, scope: !858)
!899 = !DILocation(line: 149, column: 133, scope: !858)
!900 = !DILocation(line: 149, column: 84, scope: !858)
!901 = !DILocation(line: 149, column: 159, scope: !858)
!902 = !DILocation(line: 149, column: 164, scope: !858)
!903 = !DILocation(line: 149, column: 172, scope: !858)
!904 = !DILocation(line: 149, column: 141, scope: !858)
!905 = !DILocation(line: 149, column: 139, scope: !858)
!906 = !DILocation(line: 149, column: 188, scope: !858)
!907 = !DILocation(line: 149, column: 194, scope: !858)
!908 = !DILocation(line: 150, column: 10, scope: !859)
!909 = !DILocation(line: 150, column: 21, scope: !859)
!910 = !DILocation(line: 150, column: 26, scope: !859)
!911 = !DILocation(line: 150, column: 72, scope: !858)
!912 = !DILocation(line: 150, column: 77, scope: !858)
!913 = !DILocation(line: 150, column: 85, scope: !858)
!914 = !DILocation(line: 150, column: 98, scope: !858)
!915 = !DILocation(line: 150, column: 29, scope: !858)
!916 = !DILocation(line: 68, column: 16, scope: !851, inlinedAt: !857)
!917 = !DILocation(line: 68, column: 19, scope: !851, inlinedAt: !857)
!918 = !DILocation(line: 68, column: 24, scope: !851, inlinedAt: !857)
!919 = !DILocation(line: 68, column: 38, scope: !851, inlinedAt: !857)
!920 = !DILocation(line: 68, column: 41, scope: !851, inlinedAt: !857)
!921 = !DILocation(line: 68, column: 46, scope: !851, inlinedAt: !857)
!922 = !DILocation(line: 68, column: 34, scope: !851, inlinedAt: !857)
!923 = !DILocation(line: 68, column: 57, scope: !851, inlinedAt: !857)
!924 = !DILocation(line: 68, column: 69, scope: !851, inlinedAt: !857)
!925 = !DILocation(line: 68, column: 72, scope: !851, inlinedAt: !857)
!926 = !DILocation(line: 68, column: 79, scope: !851, inlinedAt: !857)
!927 = !DILocation(line: 68, column: 84, scope: !851, inlinedAt: !857)
!928 = !DILocation(line: 68, column: 99, scope: !851, inlinedAt: !857)
!929 = !DILocation(line: 68, column: 102, scope: !851, inlinedAt: !857)
!930 = !DILocation(line: 68, column: 109, scope: !851, inlinedAt: !857)
!931 = !DILocation(line: 68, column: 114, scope: !851, inlinedAt: !857)
!932 = !DILocation(line: 68, column: 94, scope: !851, inlinedAt: !857)
!933 = !DILocation(line: 68, column: 63, scope: !851, inlinedAt: !857)
!934 = !DILocation(line: 150, column: 102, scope: !858)
!935 = !DILocation(line: 148, column: 9, scope: !936)
!936 = !DILexicalBlockFile(scope: !849, file: !670, discriminator: 1)
!937 = !DILocation(line: 151, column: 16, scope: !938)
