; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--utils.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--utils.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }

!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !867, line: 58, size: 32, align: 32, elements: !868)
!867 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!869 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!870 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!871 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!872 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!873 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!874 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!875 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!876 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!877 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!878 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!879 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!880 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!881 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!882 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !47, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !953}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !944)
!944 = !{!945, !949, !954, !985, !986, !987, !988, !992, !998, !1000, !1004}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !943, file: !26, line: 72, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !943, file: !26, line: 78, baseType: !950, size: 64, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!946, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !943, file: !26, line: 85, baseType: !955, size: 64, align: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !958)
!958 = !{!959, !960, !961, !963, !964, !981, !982, !983, !984}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !957, file: !4, line: 247, baseType: !946, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !957, file: !4, line: 253, baseType: !946, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !957, file: !4, line: 259, baseType: !962, size: 32, align: 32, offset: 128)
!962 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !957, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !957, file: !4, line: 271, baseType: !965, size: 64, align: 64, offset: 192)
!965 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !957, file: !4, line: 265, size: 64, align: 64, elements: !966)
!966 = !{!967, !971, !973, !974}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !965, file: !4, line: 266, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !969, line: 40, baseType: !970)
!969 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!970 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !965, file: !4, line: 267, baseType: !972, size: 64, align: 64)
!972 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !965, file: !4, line: 268, baseType: !946, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !965, file: !4, line: 270, baseType: !975, size: 64, align: 32)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !976, line: 61, baseType: !977)
!976 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !976, line: 58, size: 64, align: 32, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !977, file: !976, line: 59, baseType: !962, size: 32, align: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !977, file: !976, line: 60, baseType: !962, size: 32, align: 32, offset: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !957, file: !4, line: 272, baseType: !972, size: 64, align: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !957, file: !4, line: 273, baseType: !972, size: 64, align: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !957, file: !4, line: 275, baseType: !962, size: 32, align: 32, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !957, file: !4, line: 300, baseType: !946, size: 64, align: 64, offset: 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !943, file: !26, line: 93, baseType: !962, size: 32, align: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !943, file: !26, line: 99, baseType: !962, size: 32, align: 32, offset: 224)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !943, file: !26, line: 108, baseType: !962, size: 32, align: 32, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !943, file: !26, line: 113, baseType: !989, size: 64, align: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!953, !953, !953}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !943, file: !26, line: 123, baseType: !993, size: 64, align: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!996, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !943, file: !26, line: 130, baseType: !999, size: 32, align: 32, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !943, file: !26, line: 136, baseType: !1001, size: 64, align: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!999, !953}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !943, file: !26, line: 142, baseType: !1005, size: 64, align: 64, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!962, !1008, !953, !946, !962}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1011)
!1011 = !{!1012, !1024, !1025}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1010, file: !4, line: 360, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1016, file: !4, line: 307, baseType: !946, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1016, file: !4, line: 313, baseType: !972, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1016, file: !4, line: 313, baseType: !972, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1016, file: !4, line: 318, baseType: !972, size: 64, align: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1016, file: !4, line: 318, baseType: !972, size: 64, align: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1016, file: !4, line: 323, baseType: !962, size: 32, align: 32, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1010, file: !4, line: 364, baseType: !962, size: 32, align: 32, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1010, file: !4, line: 368, baseType: !962, size: 32, align: 32, offset: 96)
!1026 = !{i32 2, !"Dwarf Version", i32 4}
!1027 = !{i32 2, !"Debug Info Version", i32 3}
!1028 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1029 = distinct !DISubprogram(name: "ff_alloc_input_device_context", scope: !1030, file: !1030, line: 23, type: !1031, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2113)
!1030 = !DIFile(filename: "libavdevice/utils.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!962, !1033, !2111, !946}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1146, !1289, !1290, !1355, !1356, !1357, !1988, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2042, !2043, !2044, !2045, !2046, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2077, !2078, !2081, !2082, !2083, !2084, !2085, !2086, !2088, !2089, !2090, !2091, !2099, !2100, !2104, !2108, !2109, !2110}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1036, file: !919, line: 1342, baseType: !940, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1036, file: !919, line: 1349, baseType: !1040, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1053, !1054, !1055, !1056, !1057, !1058, !1072, !1077, !1117, !1118, !1122, !1127, !1128, !1129, !1133, !1139, !1145}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1041, file: !919, line: 638, baseType: !946, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1041, file: !919, line: 645, baseType: !946, size: 64, align: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1041, file: !919, line: 652, baseType: !962, size: 32, align: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1041, file: !919, line: 659, baseType: !946, size: 64, align: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1041, file: !919, line: 661, baseType: !1048, size: 64, align: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1041, file: !919, line: 663, baseType: !940, size: 64, align: 64, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1041, file: !919, line: 670, baseType: !946, size: 64, align: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1041, file: !919, line: 679, baseType: !1040, size: 64, align: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1041, file: !919, line: 684, baseType: !962, size: 32, align: 32, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1041, file: !919, line: 689, baseType: !962, size: 32, align: 32, offset: 544)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1041, file: !919, line: 696, baseType: !1059, size: 64, align: 64, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!962, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1070, !1071}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1064, file: !919, line: 449, baseType: !946, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1064, file: !919, line: 450, baseType: !1068, size: 64, align: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1064, file: !919, line: 451, baseType: !962, size: 32, align: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1064, file: !919, line: 452, baseType: !946, size: 64, align: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1041, file: !919, line: 703, baseType: !1073, size: 64, align: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!962, !1076}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1041, file: !919, line: 714, baseType: !1078, size: 64, align: 64, offset: 704)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!962, !1076, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1084)
!1084 = !{!1085, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1113, !1114, !1115, !1116}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1083, file: !47, line: 1451, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1088, line: 94, baseType: !1089)
!1088 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1088, line: 81, size: 192, align: 64, elements: !1090)
!1090 = !{!1091, !1095, !1098}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1089, file: !1088, line: 82, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1088, line: 73, baseType: !1094)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1088, line: 73, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !1088, line: 89, baseType: !1096, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !969, line: 48, baseType: !1069)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !1088, line: 93, baseType: !962, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1083, file: !47, line: 1461, baseType: !968, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1083, file: !47, line: 1467, baseType: !968, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !47, line: 1468, baseType: !1096, size: 64, align: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !47, line: 1469, baseType: !962, size: 32, align: 32, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1083, file: !47, line: 1470, baseType: !962, size: 32, align: 32, offset: 288)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1083, file: !47, line: 1474, baseType: !962, size: 32, align: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1083, file: !47, line: 1479, baseType: !1106, size: 64, align: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !47, line: 1412, baseType: !1096, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !47, line: 1413, baseType: !962, size: 32, align: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1108, file: !47, line: 1414, baseType: !46, size: 32, align: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1083, file: !47, line: 1480, baseType: !962, size: 32, align: 32, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1083, file: !47, line: 1486, baseType: !968, size: 64, align: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1083, file: !47, line: 1488, baseType: !968, size: 64, align: 64, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1083, file: !47, line: 1497, baseType: !968, size: 64, align: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1041, file: !919, line: 720, baseType: !1073, size: 64, align: 64, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1041, file: !919, line: 730, baseType: !1119, size: 64, align: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!962, !1076, !962, !968, !962}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1041, file: !919, line: 737, baseType: !1123, size: 64, align: 64, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!968, !1076, !962, !1126, !968}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1041, file: !919, line: 744, baseType: !1073, size: 64, align: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1041, file: !919, line: 750, baseType: !1073, size: 64, align: 64, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1041, file: !919, line: 758, baseType: !1130, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!962, !1076, !962, !968, !968, !968, !962}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1041, file: !919, line: 764, baseType: !1134, size: 64, align: 64, offset: 1152)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!962, !1076, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1041, file: !919, line: 770, baseType: !1140, size: 64, align: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!962, !1076, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1041, file: !919, line: 776, baseType: !1140, size: 64, align: 64, offset: 1280)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1036, file: !919, line: 1356, baseType: !1147, size: 64, align: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1169, !1173, !1177, !1184, !1274, !1275, !1276, !1277, !1278, !1279, !1283}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1148, file: !919, line: 498, baseType: !946, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1148, file: !919, line: 504, baseType: !946, size: 64, align: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1148, file: !919, line: 505, baseType: !946, size: 64, align: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1148, file: !919, line: 506, baseType: !946, size: 64, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1148, file: !919, line: 508, baseType: !77, size: 32, align: 32, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1148, file: !919, line: 509, baseType: !77, size: 32, align: 32, offset: 288)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1148, file: !919, line: 510, baseType: !77, size: 32, align: 32, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !919, line: 517, baseType: !962, size: 32, align: 32, offset: 352)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1148, file: !919, line: 523, baseType: !1048, size: 64, align: 64, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1148, file: !919, line: 526, baseType: !940, size: 64, align: 64, offset: 448)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1148, file: !919, line: 535, baseType: !1147, size: 64, align: 64, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1148, file: !919, line: 539, baseType: !962, size: 32, align: 32, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1148, file: !919, line: 541, baseType: !1073, size: 64, align: 64, offset: 640)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1148, file: !919, line: 549, baseType: !1078, size: 64, align: 64, offset: 704)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1148, file: !919, line: 550, baseType: !1073, size: 64, align: 64, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1148, file: !919, line: 554, baseType: !1166, size: 64, align: 64, offset: 832)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!962, !1076, !1081, !1081, !962}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1148, file: !919, line: 563, baseType: !1170, size: 64, align: 64, offset: 896)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!962, !77, !962}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1148, file: !919, line: 565, baseType: !1174, size: 64, align: 64, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{null, !1076, !962, !1126, !1126}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1148, file: !919, line: 570, baseType: !1178, size: 64, align: 64, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!962, !1076, !962, !953, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1182, line: 216, baseType: !1183)
!1182 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1183 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1148, file: !919, line: 581, baseType: !1185, size: 64, align: 64, offset: 1088)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!962, !1076, !962, !1188, !1273}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1192)
!1192 = !{!1193, !1197, !1199, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1227, !1229, !1230, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !548, line: 282, baseType: !1194, size: 512, align: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 512, align: 64, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 8)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1191, file: !548, line: 299, baseType: !1198, size: 256, align: 32, offset: 512)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 256, align: 32, elements: !1195)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1191, file: !548, line: 315, baseType: !1200, size: 64, align: 64, offset: 768)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1191, file: !548, line: 326, baseType: !962, size: 32, align: 32, offset: 832)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1191, file: !548, line: 326, baseType: !962, size: 32, align: 32, offset: 864)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1191, file: !548, line: 334, baseType: !962, size: 32, align: 32, offset: 896)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1191, file: !548, line: 341, baseType: !962, size: 32, align: 32, offset: 928)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1191, file: !548, line: 346, baseType: !962, size: 32, align: 32, offset: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1191, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1191, file: !548, line: 356, baseType: !975, size: 64, align: 32, offset: 1024)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1191, file: !548, line: 361, baseType: !968, size: 64, align: 64, offset: 1088)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1191, file: !548, line: 369, baseType: !968, size: 64, align: 64, offset: 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1191, file: !548, line: 377, baseType: !968, size: 64, align: 64, offset: 1216)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1191, file: !548, line: 382, baseType: !962, size: 32, align: 32, offset: 1280)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1191, file: !548, line: 386, baseType: !962, size: 32, align: 32, offset: 1312)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1191, file: !548, line: 391, baseType: !962, size: 32, align: 32, offset: 1344)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1191, file: !548, line: 396, baseType: !953, size: 64, align: 64, offset: 1408)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1191, file: !548, line: 403, baseType: !1216, size: 512, align: 64, offset: 1472)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1217, size: 512, align: 64, elements: !1195)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !969, line: 55, baseType: !1183)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1191, file: !548, line: 410, baseType: !962, size: 32, align: 32, offset: 1984)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1191, file: !548, line: 415, baseType: !962, size: 32, align: 32, offset: 2016)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1191, file: !548, line: 420, baseType: !962, size: 32, align: 32, offset: 2048)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1191, file: !548, line: 425, baseType: !962, size: 32, align: 32, offset: 2080)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1191, file: !548, line: 435, baseType: !968, size: 64, align: 64, offset: 2112)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1191, file: !548, line: 440, baseType: !962, size: 32, align: 32, offset: 2176)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1191, file: !548, line: 445, baseType: !1217, size: 64, align: 64, offset: 2240)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1191, file: !548, line: 459, baseType: !1226, size: 512, align: 64, offset: 2304)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 512, align: 64, elements: !1195)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1191, file: !548, line: 473, baseType: !1228, size: 64, align: 64, offset: 2816)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1191, file: !548, line: 477, baseType: !962, size: 32, align: 32, offset: 2880)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1191, file: !548, line: 479, baseType: !1231, size: 64, align: 64, offset: 2944)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1244}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1234, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !548, line: 203, baseType: !1096, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !548, line: 204, baseType: !962, size: 32, align: 32, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1234, file: !548, line: 205, baseType: !1240, size: 64, align: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1242, line: 86, baseType: !1243)
!1242 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1242, line: 86, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1234, file: !548, line: 206, baseType: !1086, size: 64, align: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1191, file: !548, line: 480, baseType: !962, size: 32, align: 32, offset: 3008)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1191, file: !548, line: 505, baseType: !962, size: 32, align: 32, offset: 3040)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1191, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1191, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1191, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1191, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1191, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1191, file: !548, line: 532, baseType: !968, size: 64, align: 64, offset: 3264)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1191, file: !548, line: 539, baseType: !968, size: 64, align: 64, offset: 3328)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1191, file: !548, line: 547, baseType: !968, size: 64, align: 64, offset: 3392)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1191, file: !548, line: 554, baseType: !1240, size: 64, align: 64, offset: 3456)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1191, file: !548, line: 563, baseType: !962, size: 32, align: 32, offset: 3520)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1191, file: !548, line: 572, baseType: !962, size: 32, align: 32, offset: 3552)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1191, file: !548, line: 581, baseType: !962, size: 32, align: 32, offset: 3584)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1191, file: !548, line: 588, baseType: !1260, size: 64, align: 64, offset: 3648)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !969, line: 36, baseType: !1262)
!1262 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1191, file: !548, line: 593, baseType: !962, size: 32, align: 32, offset: 3712)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1191, file: !548, line: 596, baseType: !962, size: 32, align: 32, offset: 3744)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1191, file: !548, line: 599, baseType: !1086, size: 64, align: 64, offset: 3776)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1191, file: !548, line: 605, baseType: !1086, size: 64, align: 64, offset: 3840)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1191, file: !548, line: 616, baseType: !1086, size: 64, align: 64, offset: 3904)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1191, file: !548, line: 626, baseType: !1181, size: 64, align: 64, offset: 3968)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1191, file: !548, line: 627, baseType: !1181, size: 64, align: 64, offset: 4032)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1191, file: !548, line: 628, baseType: !1181, size: 64, align: 64, offset: 4096)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1191, file: !548, line: 629, baseType: !1181, size: 64, align: 64, offset: 4160)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1191, file: !548, line: 645, baseType: !1086, size: 64, align: 64, offset: 4224)
!1273 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1148, file: !919, line: 587, baseType: !1134, size: 64, align: 64, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1148, file: !919, line: 592, baseType: !1140, size: 64, align: 64, offset: 1216)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1148, file: !919, line: 597, baseType: !1140, size: 64, align: 64, offset: 1280)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1148, file: !919, line: 598, baseType: !77, size: 32, align: 32, offset: 1344)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1148, file: !919, line: 608, baseType: !1073, size: 64, align: 64, offset: 1408)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1148, file: !919, line: 617, baseType: !1280, size: 64, align: 64, offset: 1472)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !1076}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1148, file: !919, line: 623, baseType: !1284, size: 64, align: 64, offset: 1536)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!962, !1076, !1287}
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1036, file: !919, line: 1365, baseType: !953, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1036, file: !919, line: 1379, baseType: !1291, size: 64, align: 64, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1293)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1300, !1301, !1305, !1306, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1322, !1323, !1327, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1345, !1346, !1347, !1348, !1352, !1353, !1354}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1293, file: !650, line: 174, baseType: !940, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1293, file: !650, line: 226, baseType: !1068, size: 64, align: 64, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1293, file: !650, line: 227, baseType: !962, size: 32, align: 32, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1293, file: !650, line: 228, baseType: !1068, size: 64, align: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1293, file: !650, line: 229, baseType: !1068, size: 64, align: 64, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1293, file: !650, line: 233, baseType: !953, size: 64, align: 64, offset: 320)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1293, file: !650, line: 235, baseType: !1302, size: 64, align: 64, offset: 384)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!962, !953, !1096, !962}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1293, file: !650, line: 236, baseType: !1302, size: 64, align: 64, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1293, file: !650, line: 237, baseType: !1307, size: 64, align: 64, offset: 512)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!968, !953, !968, !962}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1293, file: !650, line: 238, baseType: !968, size: 64, align: 64, offset: 576)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1293, file: !650, line: 239, baseType: !962, size: 32, align: 32, offset: 640)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1293, file: !650, line: 240, baseType: !962, size: 32, align: 32, offset: 672)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1293, file: !650, line: 241, baseType: !962, size: 32, align: 32, offset: 704)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1293, file: !650, line: 242, baseType: !1183, size: 64, align: 64, offset: 768)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1293, file: !650, line: 243, baseType: !1068, size: 64, align: 64, offset: 832)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1293, file: !650, line: 244, baseType: !1317, size: 64, align: 64, offset: 896)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!1183, !1183, !1320, !1273}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1293, file: !650, line: 245, baseType: !962, size: 32, align: 32, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1293, file: !650, line: 249, baseType: !1324, size: 64, align: 64, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!962, !953, !962}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1293, file: !650, line: 255, baseType: !1328, size: 64, align: 64, offset: 1088)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!968, !953, !962, !968, !962}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1293, file: !650, line: 260, baseType: !962, size: 32, align: 32, offset: 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1293, file: !650, line: 266, baseType: !968, size: 64, align: 64, offset: 1216)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1293, file: !650, line: 273, baseType: !962, size: 32, align: 32, offset: 1280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1293, file: !650, line: 279, baseType: !968, size: 64, align: 64, offset: 1344)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1293, file: !650, line: 285, baseType: !962, size: 32, align: 32, offset: 1408)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1293, file: !650, line: 291, baseType: !962, size: 32, align: 32, offset: 1440)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1293, file: !650, line: 298, baseType: !962, size: 32, align: 32, offset: 1472)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1293, file: !650, line: 304, baseType: !962, size: 32, align: 32, offset: 1504)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1293, file: !650, line: 309, baseType: !946, size: 64, align: 64, offset: 1536)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1293, file: !650, line: 314, baseType: !946, size: 64, align: 64, offset: 1600)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1293, file: !650, line: 319, baseType: !1342, size: 64, align: 64, offset: 1664)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!962, !953, !1096, !962, !649, !968}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1293, file: !650, line: 326, baseType: !962, size: 32, align: 32, offset: 1728)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1293, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1293, file: !650, line: 332, baseType: !968, size: 64, align: 64, offset: 1792)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1293, file: !650, line: 338, baseType: !1349, size: 64, align: 64, offset: 1856)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!962, !953}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1293, file: !650, line: 340, baseType: !968, size: 64, align: 64, offset: 1920)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1293, file: !650, line: 346, baseType: !1068, size: 64, align: 64, offset: 1984)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1293, file: !650, line: 351, baseType: !962, size: 32, align: 32, offset: 2048)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1036, file: !919, line: 1386, baseType: !962, size: 32, align: 32, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1036, file: !919, line: 1393, baseType: !1273, size: 32, align: 32, offset: 352)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1036, file: !919, line: 1405, baseType: !1358, size: 64, align: 64, offset: 384)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1836, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1936, !1942, !1943, !1947, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1979, !1980, !1981, !1982, !1983, !1984}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1361, file: !919, line: 866, baseType: !962, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1361, file: !919, line: 872, baseType: !962, size: 32, align: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1361, file: !919, line: 878, baseType: !1366, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1369)
!1369 = !{!1370, !1371, !1372, !1373, !1511, !1512, !1513, !1514, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1540, !1544, !1545, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1724, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1368, file: !47, line: 1561, baseType: !940, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1368, file: !47, line: 1562, baseType: !962, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1368, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1368, file: !47, line: 1565, baseType: !1374, size: 64, align: 64, offset: 128)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1386, !1389, !1392, !1395, !1398, !1399, !1400, !1408, !1409, !1410, !1412, !1416, !1422, !1427, !1431, !1432, !1476, !1483, !1487, !1488, !1492, !1496, !1500, !1504, !1505, !1506}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1376, file: !47, line: 3475, baseType: !946, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1376, file: !47, line: 3480, baseType: !946, size: 64, align: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1376, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1376, file: !47, line: 3482, baseType: !77, size: 32, align: 32, offset: 160)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1376, file: !47, line: 3487, baseType: !962, size: 32, align: 32, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1376, file: !47, line: 3488, baseType: !1384, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1376, file: !47, line: 3489, baseType: !1387, size: 64, align: 64, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1376, file: !47, line: 3490, baseType: !1390, size: 64, align: 64, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1376, file: !47, line: 3491, baseType: !1393, size: 64, align: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1376, file: !47, line: 3492, baseType: !1396, size: 64, align: 64, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1217)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1376, file: !47, line: 3493, baseType: !1097, size: 8, align: 8, offset: 576)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1376, file: !47, line: 3494, baseType: !940, size: 64, align: 64, offset: 640)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1376, file: !47, line: 3495, baseType: !1401, size: 64, align: 64, offset: 704)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1403)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1404)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1405)
!1405 = !{!1406, !1407}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1404, file: !47, line: 3402, baseType: !962, size: 32, align: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1404, file: !47, line: 3403, baseType: !946, size: 64, align: 64, offset: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1376, file: !47, line: 3507, baseType: !946, size: 64, align: 64, offset: 768)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1376, file: !47, line: 3516, baseType: !962, size: 32, align: 32, offset: 832)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1376, file: !47, line: 3517, baseType: !1411, size: 64, align: 64, offset: 896)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1376, file: !47, line: 3527, baseType: !1413, size: 64, align: 64, offset: 960)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!962, !1366}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1376, file: !47, line: 3535, baseType: !1417, size: 64, align: 64, offset: 1024)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!962, !1366, !1420}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1367)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1376, file: !47, line: 3541, baseType: !1423, size: 64, align: 64, offset: 1088)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1425)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1426)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1376, file: !47, line: 3549, baseType: !1428, size: 64, align: 64, offset: 1152)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1411}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1376, file: !47, line: 3551, baseType: !1413, size: 64, align: 64, offset: 1216)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1376, file: !47, line: 3552, baseType: !1433, size: 64, align: 64, offset: 1280)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!962, !1366, !1096, !962, !1436}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1439)
!1439 = !{!1440, !1443, !1445, !1446, !1447, !1475}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1438, file: !47, line: 3921, baseType: !1441, size: 16, align: 16)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !969, line: 49, baseType: !1442)
!1442 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1438, file: !47, line: 3922, baseType: !1444, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !969, line: 51, baseType: !1273)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1438, file: !47, line: 3923, baseType: !1444, size: 32, align: 32, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1438, file: !47, line: 3924, baseType: !1273, size: 32, align: 32, offset: 96)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1438, file: !47, line: 3925, baseType: !1448, size: 64, align: 64, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457, !1458, !1464, !1468, !1470, !1471, !1473, !1474}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1451, file: !47, line: 3886, baseType: !962, size: 32, align: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1451, file: !47, line: 3887, baseType: !962, size: 32, align: 32, offset: 32)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1451, file: !47, line: 3888, baseType: !962, size: 32, align: 32, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1451, file: !47, line: 3889, baseType: !962, size: 32, align: 32, offset: 96)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1451, file: !47, line: 3890, baseType: !962, size: 32, align: 32, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1451, file: !47, line: 3897, baseType: !1459, size: 768, align: 64, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1461)
!1461 = !{!1462, !1463}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1460, file: !47, line: 3855, baseType: !1194, size: 512, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1460, file: !47, line: 3857, baseType: !1198, size: 256, align: 32, offset: 512)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1451, file: !47, line: 3903, baseType: !1465, size: 256, align: 64, offset: 960)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 256, align: 64, elements: !1466)
!1466 = !{!1467}
!1467 = !DISubrange(count: 4)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1451, file: !47, line: 3904, baseType: !1469, size: 128, align: 32, offset: 1216)
!1469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 128, align: 32, elements: !1466)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1451, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1451, file: !47, line: 3908, baseType: !1472, size: 64, align: 64, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1451, file: !47, line: 3915, baseType: !1472, size: 64, align: 64, offset: 1472)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1451, file: !47, line: 3917, baseType: !962, size: 32, align: 32, offset: 1536)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1438, file: !47, line: 3926, baseType: !968, size: 64, align: 64, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1376, file: !47, line: 3564, baseType: !1477, size: 64, align: 64, offset: 1344)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!962, !1366, !1081, !1480, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1376, file: !47, line: 3566, baseType: !1484, size: 64, align: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!962, !1366, !953, !1482, !1081}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1376, file: !47, line: 3567, baseType: !1413, size: 64, align: 64, offset: 1472)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1376, file: !47, line: 3576, baseType: !1489, size: 64, align: 64, offset: 1536)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!962, !1366, !1480}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1376, file: !47, line: 3577, baseType: !1493, size: 64, align: 64, offset: 1600)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!962, !1366, !1081}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1376, file: !47, line: 3584, baseType: !1497, size: 64, align: 64, offset: 1664)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!962, !1366, !1189}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1376, file: !47, line: 3589, baseType: !1501, size: 64, align: 64, offset: 1728)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1366}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1376, file: !47, line: 3594, baseType: !962, size: 32, align: 32, offset: 1792)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1376, file: !47, line: 3600, baseType: !946, size: 64, align: 64, offset: 1856)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1376, file: !47, line: 3609, baseType: !1507, size: 64, align: 64, offset: 1920)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1368, file: !47, line: 1566, baseType: !77, size: 32, align: 32, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1368, file: !47, line: 1581, baseType: !1273, size: 32, align: 32, offset: 224)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1368, file: !47, line: 1583, baseType: !953, size: 64, align: 64, offset: 256)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1368, file: !47, line: 1591, baseType: !1515, size: 64, align: 64, offset: 320)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1368, file: !47, line: 1598, baseType: !953, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1368, file: !47, line: 1606, baseType: !968, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1368, file: !47, line: 1614, baseType: !962, size: 32, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1368, file: !47, line: 1622, baseType: !962, size: 32, align: 32, offset: 544)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1368, file: !47, line: 1628, baseType: !962, size: 32, align: 32, offset: 576)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1368, file: !47, line: 1636, baseType: !962, size: 32, align: 32, offset: 608)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1368, file: !47, line: 1643, baseType: !962, size: 32, align: 32, offset: 640)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1368, file: !47, line: 1657, baseType: !1096, size: 64, align: 64, offset: 704)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1368, file: !47, line: 1658, baseType: !962, size: 32, align: 32, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1368, file: !47, line: 1679, baseType: !975, size: 64, align: 32, offset: 800)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1368, file: !47, line: 1688, baseType: !962, size: 32, align: 32, offset: 864)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1368, file: !47, line: 1712, baseType: !962, size: 32, align: 32, offset: 896)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1368, file: !47, line: 1729, baseType: !962, size: 32, align: 32, offset: 928)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1368, file: !47, line: 1729, baseType: !962, size: 32, align: 32, offset: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1368, file: !47, line: 1744, baseType: !962, size: 32, align: 32, offset: 992)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1368, file: !47, line: 1744, baseType: !962, size: 32, align: 32, offset: 1024)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1368, file: !47, line: 1751, baseType: !962, size: 32, align: 32, offset: 1056)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1368, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1368, file: !47, line: 1791, baseType: !1536, size: 64, align: 64, offset: 1152)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{null, !1539, !1480, !1482, !962, !962, !962}
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1368, file: !47, line: 1808, baseType: !1541, size: 64, align: 64, offset: 1216)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!667, !1539, !1387}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1368, file: !47, line: 1816, baseType: !962, size: 32, align: 32, offset: 1280)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1368, file: !47, line: 1825, baseType: !1546, size: 32, align: 32, offset: 1312)
!1546 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1368, file: !47, line: 1830, baseType: !962, size: 32, align: 32, offset: 1344)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1368, file: !47, line: 1838, baseType: !1546, size: 32, align: 32, offset: 1376)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1368, file: !47, line: 1846, baseType: !962, size: 32, align: 32, offset: 1408)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1368, file: !47, line: 1851, baseType: !962, size: 32, align: 32, offset: 1440)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1368, file: !47, line: 1861, baseType: !1546, size: 32, align: 32, offset: 1472)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1368, file: !47, line: 1868, baseType: !1546, size: 32, align: 32, offset: 1504)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1368, file: !47, line: 1875, baseType: !1546, size: 32, align: 32, offset: 1536)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1368, file: !47, line: 1882, baseType: !1546, size: 32, align: 32, offset: 1568)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1368, file: !47, line: 1889, baseType: !1546, size: 32, align: 32, offset: 1600)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1368, file: !47, line: 1896, baseType: !1546, size: 32, align: 32, offset: 1632)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1368, file: !47, line: 1903, baseType: !1546, size: 32, align: 32, offset: 1664)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1368, file: !47, line: 1910, baseType: !962, size: 32, align: 32, offset: 1696)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1368, file: !47, line: 1915, baseType: !962, size: 32, align: 32, offset: 1728)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1368, file: !47, line: 1926, baseType: !1482, size: 64, align: 64, offset: 1792)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1368, file: !47, line: 1935, baseType: !975, size: 64, align: 32, offset: 1856)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1368, file: !47, line: 1942, baseType: !962, size: 32, align: 32, offset: 1920)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1368, file: !47, line: 1948, baseType: !962, size: 32, align: 32, offset: 1952)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1368, file: !47, line: 1954, baseType: !962, size: 32, align: 32, offset: 1984)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1368, file: !47, line: 1960, baseType: !962, size: 32, align: 32, offset: 2016)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1368, file: !47, line: 1984, baseType: !962, size: 32, align: 32, offset: 2048)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1368, file: !47, line: 1991, baseType: !962, size: 32, align: 32, offset: 2080)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1368, file: !47, line: 1996, baseType: !962, size: 32, align: 32, offset: 2112)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1368, file: !47, line: 2004, baseType: !962, size: 32, align: 32, offset: 2144)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1368, file: !47, line: 2011, baseType: !962, size: 32, align: 32, offset: 2176)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1368, file: !47, line: 2018, baseType: !962, size: 32, align: 32, offset: 2208)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1368, file: !47, line: 2027, baseType: !962, size: 32, align: 32, offset: 2240)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1368, file: !47, line: 2034, baseType: !962, size: 32, align: 32, offset: 2272)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1368, file: !47, line: 2044, baseType: !962, size: 32, align: 32, offset: 2304)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1368, file: !47, line: 2054, baseType: !1576, size: 64, align: 64, offset: 2368)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1368, file: !47, line: 2061, baseType: !1576, size: 64, align: 64, offset: 2432)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1368, file: !47, line: 2066, baseType: !962, size: 32, align: 32, offset: 2496)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1368, file: !47, line: 2070, baseType: !962, size: 32, align: 32, offset: 2528)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1368, file: !47, line: 2078, baseType: !962, size: 32, align: 32, offset: 2560)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1368, file: !47, line: 2085, baseType: !962, size: 32, align: 32, offset: 2592)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1368, file: !47, line: 2092, baseType: !962, size: 32, align: 32, offset: 2624)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1368, file: !47, line: 2099, baseType: !962, size: 32, align: 32, offset: 2656)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1368, file: !47, line: 2106, baseType: !962, size: 32, align: 32, offset: 2688)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1368, file: !47, line: 2113, baseType: !962, size: 32, align: 32, offset: 2720)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1368, file: !47, line: 2120, baseType: !962, size: 32, align: 32, offset: 2752)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1368, file: !47, line: 2125, baseType: !962, size: 32, align: 32, offset: 2784)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1368, file: !47, line: 2133, baseType: !962, size: 32, align: 32, offset: 2816)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1368, file: !47, line: 2140, baseType: !962, size: 32, align: 32, offset: 2848)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1368, file: !47, line: 2145, baseType: !962, size: 32, align: 32, offset: 2880)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1368, file: !47, line: 2153, baseType: !962, size: 32, align: 32, offset: 2912)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1368, file: !47, line: 2158, baseType: !962, size: 32, align: 32, offset: 2944)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1368, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1368, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1368, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1368, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1368, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1368, file: !47, line: 2203, baseType: !962, size: 32, align: 32, offset: 3136)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1368, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1368, file: !47, line: 2212, baseType: !962, size: 32, align: 32, offset: 3200)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1368, file: !47, line: 2213, baseType: !962, size: 32, align: 32, offset: 3232)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1368, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1368, file: !47, line: 2232, baseType: !962, size: 32, align: 32, offset: 3296)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1368, file: !47, line: 2243, baseType: !962, size: 32, align: 32, offset: 3328)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1368, file: !47, line: 2249, baseType: !962, size: 32, align: 32, offset: 3360)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1368, file: !47, line: 2256, baseType: !962, size: 32, align: 32, offset: 3392)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1368, file: !47, line: 2263, baseType: !1217, size: 64, align: 64, offset: 3456)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1368, file: !47, line: 2270, baseType: !1217, size: 64, align: 64, offset: 3520)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1368, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1368, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1368, file: !47, line: 2367, baseType: !1612, size: 64, align: 64, offset: 3648)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!962, !1539, !1189, !962}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1368, file: !47, line: 2383, baseType: !962, size: 32, align: 32, offset: 3712)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1368, file: !47, line: 2386, baseType: !1546, size: 32, align: 32, offset: 3744)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1368, file: !47, line: 2387, baseType: !1546, size: 32, align: 32, offset: 3776)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1368, file: !47, line: 2394, baseType: !962, size: 32, align: 32, offset: 3808)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1368, file: !47, line: 2401, baseType: !962, size: 32, align: 32, offset: 3840)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1368, file: !47, line: 2408, baseType: !962, size: 32, align: 32, offset: 3872)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1368, file: !47, line: 2415, baseType: !962, size: 32, align: 32, offset: 3904)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1368, file: !47, line: 2422, baseType: !962, size: 32, align: 32, offset: 3936)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1368, file: !47, line: 2423, baseType: !1624, size: 64, align: 64, offset: 3968)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1626, file: !47, line: 827, baseType: !962, size: 32, align: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1626, file: !47, line: 828, baseType: !962, size: 32, align: 32, offset: 32)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1626, file: !47, line: 829, baseType: !962, size: 32, align: 32, offset: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1626, file: !47, line: 830, baseType: !1546, size: 32, align: 32, offset: 96)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1368, file: !47, line: 2430, baseType: !968, size: 64, align: 64, offset: 4032)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1368, file: !47, line: 2437, baseType: !968, size: 64, align: 64, offset: 4096)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1368, file: !47, line: 2444, baseType: !1546, size: 32, align: 32, offset: 4160)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1368, file: !47, line: 2451, baseType: !1546, size: 32, align: 32, offset: 4192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1368, file: !47, line: 2458, baseType: !962, size: 32, align: 32, offset: 4224)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1368, file: !47, line: 2469, baseType: !962, size: 32, align: 32, offset: 4256)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1368, file: !47, line: 2475, baseType: !962, size: 32, align: 32, offset: 4288)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1368, file: !47, line: 2481, baseType: !962, size: 32, align: 32, offset: 4320)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1368, file: !47, line: 2485, baseType: !962, size: 32, align: 32, offset: 4352)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1368, file: !47, line: 2489, baseType: !962, size: 32, align: 32, offset: 4384)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1368, file: !47, line: 2493, baseType: !962, size: 32, align: 32, offset: 4416)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1368, file: !47, line: 2501, baseType: !962, size: 32, align: 32, offset: 4448)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1368, file: !47, line: 2506, baseType: !962, size: 32, align: 32, offset: 4480)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1368, file: !47, line: 2510, baseType: !962, size: 32, align: 32, offset: 4512)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1368, file: !47, line: 2514, baseType: !968, size: 64, align: 64, offset: 4544)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1368, file: !47, line: 2528, baseType: !1648, size: 64, align: 64, offset: 4608)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1539, !953, !962, !962}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1368, file: !47, line: 2534, baseType: !962, size: 32, align: 32, offset: 4672)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1368, file: !47, line: 2545, baseType: !962, size: 32, align: 32, offset: 4704)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1368, file: !47, line: 2547, baseType: !962, size: 32, align: 32, offset: 4736)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1368, file: !47, line: 2549, baseType: !962, size: 32, align: 32, offset: 4768)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1368, file: !47, line: 2551, baseType: !962, size: 32, align: 32, offset: 4800)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1368, file: !47, line: 2553, baseType: !962, size: 32, align: 32, offset: 4832)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1368, file: !47, line: 2555, baseType: !962, size: 32, align: 32, offset: 4864)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1368, file: !47, line: 2557, baseType: !962, size: 32, align: 32, offset: 4896)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1368, file: !47, line: 2559, baseType: !962, size: 32, align: 32, offset: 4928)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1368, file: !47, line: 2563, baseType: !962, size: 32, align: 32, offset: 4960)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1368, file: !47, line: 2571, baseType: !1472, size: 64, align: 64, offset: 4992)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1368, file: !47, line: 2579, baseType: !1472, size: 64, align: 64, offset: 5056)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1368, file: !47, line: 2586, baseType: !962, size: 32, align: 32, offset: 5120)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1368, file: !47, line: 2615, baseType: !962, size: 32, align: 32, offset: 5152)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1368, file: !47, line: 2627, baseType: !962, size: 32, align: 32, offset: 5184)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1368, file: !47, line: 2637, baseType: !962, size: 32, align: 32, offset: 5216)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1368, file: !47, line: 2681, baseType: !962, size: 32, align: 32, offset: 5248)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1368, file: !47, line: 2709, baseType: !968, size: 64, align: 64, offset: 5312)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1368, file: !47, line: 2716, baseType: !1670, size: 64, align: 64, offset: 5376)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1680, !1684, !1688, !1689, !1690, !1691, !1697, !1698, !1699, !1700, !1701}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1672, file: !47, line: 3642, baseType: !946, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1672, file: !47, line: 3656, baseType: !77, size: 32, align: 32, offset: 96)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1672, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1672, file: !47, line: 3669, baseType: !962, size: 32, align: 32, offset: 160)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1672, file: !47, line: 3682, baseType: !1497, size: 64, align: 64, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1672, file: !47, line: 3698, baseType: !1681, size: 64, align: 64, offset: 256)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!962, !1366, !1320, !1444}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1672, file: !47, line: 3712, baseType: !1685, size: 64, align: 64, offset: 320)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!962, !1366, !962, !1320, !1444}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1672, file: !47, line: 3726, baseType: !1681, size: 64, align: 64, offset: 384)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1672, file: !47, line: 3737, baseType: !1413, size: 64, align: 64, offset: 448)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1672, file: !47, line: 3746, baseType: !962, size: 32, align: 32, offset: 512)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1672, file: !47, line: 3757, baseType: !1692, size: 64, align: 64, offset: 576)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{null, !1695}
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1672, file: !47, line: 3766, baseType: !1413, size: 64, align: 64, offset: 640)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1672, file: !47, line: 3774, baseType: !1413, size: 64, align: 64, offset: 704)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1672, file: !47, line: 3780, baseType: !962, size: 32, align: 32, offset: 768)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1672, file: !47, line: 3785, baseType: !962, size: 32, align: 32, offset: 800)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1672, file: !47, line: 3795, baseType: !1702, size: 64, align: 64, offset: 832)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!962, !1366, !1086}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1368, file: !47, line: 2728, baseType: !953, size: 64, align: 64, offset: 5440)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1368, file: !47, line: 2735, baseType: !1216, size: 512, align: 64, offset: 5504)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1368, file: !47, line: 2742, baseType: !962, size: 32, align: 32, offset: 6016)
