; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h265_metadata_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h265_metadata_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!634 = !{!635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!635 = !DIEnumerator(name: "HEVC_NAL_TRAIL_N", value: 0)
!636 = !DIEnumerator(name: "HEVC_NAL_TRAIL_R", value: 1)
!637 = !DIEnumerator(name: "HEVC_NAL_TSA_N", value: 2)
!638 = !DIEnumerator(name: "HEVC_NAL_TSA_R", value: 3)
!639 = !DIEnumerator(name: "HEVC_NAL_STSA_N", value: 4)
!640 = !DIEnumerator(name: "HEVC_NAL_STSA_R", value: 5)
!641 = !DIEnumerator(name: "HEVC_NAL_RADL_N", value: 6)
!642 = !DIEnumerator(name: "HEVC_NAL_RADL_R", value: 7)
!643 = !DIEnumerator(name: "HEVC_NAL_RASL_N", value: 8)
!644 = !DIEnumerator(name: "HEVC_NAL_RASL_R", value: 9)
!645 = !DIEnumerator(name: "HEVC_NAL_VCL_N10", value: 10)
!646 = !DIEnumerator(name: "HEVC_NAL_VCL_R11", value: 11)
!647 = !DIEnumerator(name: "HEVC_NAL_VCL_N12", value: 12)
!648 = !DIEnumerator(name: "HEVC_NAL_VCL_R13", value: 13)
!649 = !DIEnumerator(name: "HEVC_NAL_VCL_N14", value: 14)
!650 = !DIEnumerator(name: "HEVC_NAL_VCL_R15", value: 15)
!651 = !DIEnumerator(name: "HEVC_NAL_BLA_W_LP", value: 16)
!652 = !DIEnumerator(name: "HEVC_NAL_BLA_W_RADL", value: 17)
!653 = !DIEnumerator(name: "HEVC_NAL_BLA_N_LP", value: 18)
!654 = !DIEnumerator(name: "HEVC_NAL_IDR_W_RADL", value: 19)
!655 = !DIEnumerator(name: "HEVC_NAL_IDR_N_LP", value: 20)
!656 = !DIEnumerator(name: "HEVC_NAL_CRA_NUT", value: 21)
!657 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL22", value: 22)
!658 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL23", value: 23)
!659 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL24", value: 24)
!660 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL25", value: 25)
!661 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL26", value: 26)
!662 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL27", value: 27)
!663 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL28", value: 28)
!664 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL29", value: 29)
!665 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL30", value: 30)
!666 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL31", value: 31)
!667 = !DIEnumerator(name: "HEVC_NAL_VPS", value: 32)
!668 = !DIEnumerator(name: "HEVC_NAL_SPS", value: 33)
!669 = !DIEnumerator(name: "HEVC_NAL_PPS", value: 34)
!670 = !DIEnumerator(name: "HEVC_NAL_AUD", value: 35)
!671 = !DIEnumerator(name: "HEVC_NAL_EOS_NUT", value: 36)
!672 = !DIEnumerator(name: "HEVC_NAL_EOB_NUT", value: 37)
!673 = !DIEnumerator(name: "HEVC_NAL_FD_NUT", value: 38)
!674 = !DIEnumerator(name: "HEVC_NAL_SEI_PREFIX", value: 39)
!675 = !DIEnumerator(name: "HEVC_NAL_SEI_SUFFIX", value: 40)
!676 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL41", value: 41)
!677 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL42", value: 42)
!678 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL43", value: 43)
!679 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL44", value: 44)
!680 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL45", value: 45)
!681 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL46", value: 46)
!682 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL47", value: 47)
!683 = !DIEnumerator(name: "HEVC_NAL_UNSPEC48", value: 48)
!684 = !DIEnumerator(name: "HEVC_NAL_UNSPEC49", value: 49)
!685 = !DIEnumerator(name: "HEVC_NAL_UNSPEC50", value: 50)
!686 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!687 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!688 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!689 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!690 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!691 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!692 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!693 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!694 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!695 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!696 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!697 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!698 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !700, line: 27, size: 32, align: 32, elements: !701)
!700 = !DIFile(filename: "libavcodec/h265_metadata_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!701 = !{!702, !703, !704}
!702 = !DIEnumerator(name: "PASS", value: 0)
!703 = !DIEnumerator(name: "INSERT", value: 1)
!704 = !DIEnumerator(name: "REMOVE", value: 2)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HEVCSliceType", file: !633, line: 95, size: 32, align: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIEnumerator(name: "HEVC_SLICE_B", value: 0)
!708 = !DIEnumerator(name: "HEVC_SLICE_P", value: 1)
!709 = !DIEnumerator(name: "HEVC_SLICE_I", value: 2)
!710 = !{!711, !712}
!711 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!712 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!713 = !{!714, !913, !917, !918, !924}
!714 = distinct !DIGlobalVariable(name: "ff_hevc_metadata_bsf", scope: !0, file: !700, line: 456, type: !715, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_hevc_metadata_bsf)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !718)
!718 = !{!719, !723, !726, !809, !810, !870, !908, !912}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !4, line: 5797, baseType: !720, size: 64, align: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64, align: 64)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !717, file: !4, line: 5804, baseType: !724, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !717, file: !4, line: 5815, baseType: !727, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !731)
!731 = !{!732, !733, !738, !768, !769, !770, !771, !775, !781, !783, !787}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !730, file: !486, line: 72, baseType: !720, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !730, file: !486, line: 78, baseType: !734, size: 64, align: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!720, !737}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !730, file: !486, line: 85, baseType: !739, size: 64, align: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !764, !765, !766, !767}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !741, file: !464, line: 247, baseType: !720, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !741, file: !464, line: 253, baseType: !720, size: 64, align: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !741, file: !464, line: 259, baseType: !711, size: 32, align: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !741, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !741, file: !464, line: 271, baseType: !748, size: 64, align: 64, offset: 192)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !741, file: !464, line: 265, size: 64, align: 64, elements: !749)
!749 = !{!750, !754, !756, !757}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !748, file: !464, line: 266, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !752, line: 40, baseType: !753)
!752 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!753 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !748, file: !464, line: 267, baseType: !755, size: 64, align: 64)
!755 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !748, file: !464, line: 268, baseType: !720, size: 64, align: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !748, file: !464, line: 270, baseType: !758, size: 64, align: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !759, line: 61, baseType: !760)
!759 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !759, line: 58, size: 64, align: 32, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !760, file: !759, line: 59, baseType: !711, size: 32, align: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !760, file: !759, line: 60, baseType: !711, size: 32, align: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !741, file: !464, line: 272, baseType: !755, size: 64, align: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !741, file: !464, line: 273, baseType: !755, size: 64, align: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !741, file: !464, line: 275, baseType: !711, size: 32, align: 32, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !741, file: !464, line: 300, baseType: !720, size: 64, align: 64, offset: 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !730, file: !486, line: 93, baseType: !711, size: 32, align: 32, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !730, file: !486, line: 99, baseType: !711, size: 32, align: 32, offset: 224)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !730, file: !486, line: 108, baseType: !711, size: 32, align: 32, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !730, file: !486, line: 113, baseType: !772, size: 64, align: 64, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64, align: 64)
!773 = !DISubroutineType(types: !774)
!774 = !{!737, !737, !737}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !730, file: !486, line: 123, baseType: !776, size: 64, align: 64, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64, align: 64)
!777 = !DISubroutineType(types: !778)
!778 = !{!779, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !730, file: !486, line: 130, baseType: !782, size: 32, align: 32, offset: 448)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !730, file: !486, line: 136, baseType: !784, size: 64, align: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64, align: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{!782, !737}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !730, file: !486, line: 142, baseType: !788, size: 64, align: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64, align: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!711, !791, !737, !720, !711}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !794)
!794 = !{!795, !807, !808}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !793, file: !464, line: 360, baseType: !796, size: 64, align: 64)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !799, file: !464, line: 307, baseType: !720, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !799, file: !464, line: 313, baseType: !755, size: 64, align: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !799, file: !464, line: 313, baseType: !755, size: 64, align: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !799, file: !464, line: 318, baseType: !755, size: 64, align: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !799, file: !464, line: 318, baseType: !755, size: 64, align: 64, offset: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !799, file: !464, line: 323, baseType: !711, size: 32, align: 32, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !793, file: !464, line: 364, baseType: !711, size: 32, align: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !793, file: !464, line: 368, baseType: !711, size: 32, align: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !717, file: !4, line: 5825, baseType: !711, size: 32, align: 32, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !717, file: !4, line: 5826, baseType: !811, size: 64, align: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DISubroutineType(types: !813)
!813 = !{!711, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64, align: 64)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !817)
!817 = !{!818, !819, !822, !826, !827, !867, !868, !869}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !816, file: !4, line: 5751, baseType: !727, size: 64, align: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !816, file: !4, line: 5756, baseType: !820, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64, align: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !816, file: !4, line: 5762, baseType: !823, size: 64, align: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !825)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !816, file: !4, line: 5768, baseType: !737, size: 64, align: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !816, file: !4, line: 5775, baseType: !828, size: 64, align: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !831)
!831 = !{!832, !833, !834, !836, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !860, !861, !862, !863, !864, !865, !866}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !830, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !830, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !830, file: !4, line: 3948, baseType: !835, size: 32, align: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !752, line: 51, baseType: !712)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !830, file: !4, line: 3958, baseType: !837, size: 64, align: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !752, line: 48, baseType: !839)
!839 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !830, file: !4, line: 3962, baseType: !711, size: 32, align: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !830, file: !4, line: 3968, baseType: !711, size: 32, align: 32, offset: 224)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !830, file: !4, line: 3973, baseType: !751, size: 64, align: 64, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !830, file: !4, line: 3986, baseType: !711, size: 32, align: 32, offset: 320)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !830, file: !4, line: 3999, baseType: !711, size: 32, align: 32, offset: 352)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !830, file: !4, line: 4004, baseType: !711, size: 32, align: 32, offset: 384)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !830, file: !4, line: 4005, baseType: !711, size: 32, align: 32, offset: 416)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !830, file: !4, line: 4010, baseType: !711, size: 32, align: 32, offset: 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !830, file: !4, line: 4011, baseType: !711, size: 32, align: 32, offset: 480)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !830, file: !4, line: 4020, baseType: !758, size: 64, align: 32, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !830, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !830, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !830, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !830, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !830, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !830, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !830, file: !4, line: 4039, baseType: !711, size: 32, align: 32, offset: 768)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !830, file: !4, line: 4046, baseType: !858, size: 64, align: 64, offset: 832)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !752, line: 55, baseType: !859)
!859 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !830, file: !4, line: 4050, baseType: !711, size: 32, align: 32, offset: 896)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !830, file: !4, line: 4054, baseType: !711, size: 32, align: 32, offset: 928)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !830, file: !4, line: 4061, baseType: !711, size: 32, align: 32, offset: 960)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !830, file: !4, line: 4065, baseType: !711, size: 32, align: 32, offset: 992)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !830, file: !4, line: 4073, baseType: !711, size: 32, align: 32, offset: 1024)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !830, file: !4, line: 4080, baseType: !711, size: 32, align: 32, offset: 1056)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !830, file: !4, line: 4084, baseType: !711, size: 32, align: 32, offset: 1088)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !816, file: !4, line: 5781, baseType: !828, size: 64, align: 64, offset: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !816, file: !4, line: 5787, baseType: !758, size: 64, align: 32, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !816, file: !4, line: 5793, baseType: !758, size: 64, align: 32, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !717, file: !4, line: 5827, baseType: !871, size: 64, align: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64, align: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!711, !814, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64, align: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !877)
!877 = !{!878, !890, !891, !892, !893, !894, !895, !896, !904, !905, !906, !907}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !876, file: !4, line: 1451, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64, align: 64)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !881, line: 94, baseType: !882)
!881 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !881, line: 81, size: 192, align: 64, elements: !883)
!883 = !{!884, !888, !889}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !882, file: !881, line: 82, baseType: !885, size: 64, align: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64, align: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !881, line: 73, baseType: !887)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !881, line: 73, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !882, file: !881, line: 89, baseType: !837, size: 64, align: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !882, file: !881, line: 93, baseType: !711, size: 32, align: 32, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !876, file: !4, line: 1461, baseType: !751, size: 64, align: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !876, file: !4, line: 1467, baseType: !751, size: 64, align: 64, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !876, file: !4, line: 1468, baseType: !837, size: 64, align: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !876, file: !4, line: 1469, baseType: !711, size: 32, align: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !876, file: !4, line: 1470, baseType: !711, size: 32, align: 32, offset: 288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !876, file: !4, line: 1474, baseType: !711, size: 32, align: 32, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !876, file: !4, line: 1479, baseType: !897, size: 64, align: 64, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !900)
!900 = !{!901, !902, !903}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !899, file: !4, line: 1412, baseType: !837, size: 64, align: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !899, file: !4, line: 1413, baseType: !711, size: 32, align: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !899, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !876, file: !4, line: 1480, baseType: !711, size: 32, align: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !876, file: !4, line: 1486, baseType: !751, size: 64, align: 64, offset: 512)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !876, file: !4, line: 1488, baseType: !751, size: 64, align: 64, offset: 576)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !876, file: !4, line: 1497, baseType: !751, size: 64, align: 64, offset: 640)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !717, file: !4, line: 5828, baseType: !909, size: 64, align: 64, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !814}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !717, file: !4, line: 5829, baseType: !909, size: 64, align: 64, offset: 448)
!913 = distinct !DIGlobalVariable(name: "h265_metadata_codec_ids", scope: !0, file: !700, line: 452, type: !914, isLocal: true, isDefinition: true, variable: [2 x i32]* @h265_metadata_codec_ids)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 64, align: 32, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 2)
!917 = distinct !DIGlobalVariable(name: "h265_metadata_class", scope: !0, file: !700, line: 445, type: !728, isLocal: true, isDefinition: true, variable: %struct.AVClass* @h265_metadata_class)
!918 = distinct !DIGlobalVariable(name: "h265_metadata_options", scope: !0, file: !700, line: 385, type: !919, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @h265_metadata_options)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 9216, align: 64, elements: !922)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !464, line: 301, baseType: !741)
!922 = !{!923}
!923 = !DISubrange(count: 18)
!924 = distinct !DIGlobalVariable(name: "sar_idc", scope: !925, file: !700, line: 101, type: !1201, isLocal: true, isDefinition: true, variable: [17 x %struct.AVRational]* @h265_metadata_update_sps.sar_idc)
!925 = distinct !DISubprogram(name: "h265_metadata_update_sps", scope: !700, file: !700, line: 92, type: !926, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1200)
!926 = !DISubroutineType(types: !927)
!927 = !{!711, !814, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawSPS", file: !930, line: 353, baseType: !931)
!930 = !DIFile(filename: "libavcodec/cbs_h265.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawSPS", file: !930, line: 253, size: 156096, align: 64, elements: !932)
!932 = !{!933, !941, !942, !943, !944, !998, !999, !1000, !1001, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1077, !1078, !1079, !1081, !1082, !1083, !1084, !1085, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1198, !1199}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !931, file: !930, line: 254, baseType: !934, size: 32, align: 8)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawNALUnitHeader", file: !930, line: 42, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawNALUnitHeader", file: !930, line: 37, size: 32, align: 8, elements: !936)
!936 = !{!937, !938, !939, !940}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "forbidden_zero_bit", scope: !935, file: !930, line: 38, baseType: !838, size: 8, align: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_type", scope: !935, file: !930, line: 39, baseType: !838, size: 8, align: 8, offset: 8)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "nuh_layer_id", scope: !935, file: !930, line: 40, baseType: !838, size: 8, align: 8, offset: 16)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "nuh_temporal_id_plus1", scope: !935, file: !930, line: 41, baseType: !838, size: 8, align: 8, offset: 24)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sps_video_parameter_set_id", scope: !931, file: !930, line: 256, baseType: !838, size: 8, align: 8, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sps_max_sub_layers_minus1", scope: !931, file: !930, line: 258, baseType: !838, size: 8, align: 8, offset: 40)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "sps_temporal_id_nesting_flag", scope: !931, file: !930, line: 259, baseType: !838, size: 8, align: 8, offset: 48)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "profile_tier_level", scope: !931, file: !930, line: 261, baseType: !945, size: 3376, align: 8, offset: 56)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawProfileTierLevel", file: !930, line: 99, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawProfileTierLevel", file: !930, line: 44, size: 3376, align: 8, elements: !947)
!947 = !{!948, !949, !950, !951, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !975, !976, !977, !978, !979, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "general_profile_space", scope: !946, file: !930, line: 45, baseType: !838, size: 8, align: 8)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "general_tier_flag", scope: !946, file: !930, line: 46, baseType: !838, size: 8, align: 8, offset: 8)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "general_profile_idc", scope: !946, file: !930, line: 47, baseType: !838, size: 8, align: 8, offset: 16)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "general_profile_compatibility_flag", scope: !946, file: !930, line: 49, baseType: !952, size: 256, align: 8, offset: 24)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 256, align: 8, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "general_progressive_source_flag", scope: !946, file: !930, line: 51, baseType: !838, size: 8, align: 8, offset: 280)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "general_interlaced_source_flag", scope: !946, file: !930, line: 52, baseType: !838, size: 8, align: 8, offset: 288)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "general_non_packed_constraint_flag", scope: !946, file: !930, line: 53, baseType: !838, size: 8, align: 8, offset: 296)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "general_frame_only_constraint_flag", scope: !946, file: !930, line: 54, baseType: !838, size: 8, align: 8, offset: 304)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "general_max_12bit_constraint_flag", scope: !946, file: !930, line: 56, baseType: !838, size: 8, align: 8, offset: 312)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "general_max_10bit_constraint_flag", scope: !946, file: !930, line: 57, baseType: !838, size: 8, align: 8, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "general_max_8bit_constraint_flag", scope: !946, file: !930, line: 58, baseType: !838, size: 8, align: 8, offset: 328)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "general_max_422chroma_constraint_flag", scope: !946, file: !930, line: 59, baseType: !838, size: 8, align: 8, offset: 336)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "general_max_420chroma_constraint_flag", scope: !946, file: !930, line: 60, baseType: !838, size: 8, align: 8, offset: 344)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "general_max_monochrome_constraint_flag", scope: !946, file: !930, line: 61, baseType: !838, size: 8, align: 8, offset: 352)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "general_intra_constraint_flag", scope: !946, file: !930, line: 62, baseType: !838, size: 8, align: 8, offset: 360)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "general_one_picture_only_constraint_flag", scope: !946, file: !930, line: 63, baseType: !838, size: 8, align: 8, offset: 368)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "general_lower_bit_rate_constraint_flag", scope: !946, file: !930, line: 64, baseType: !838, size: 8, align: 8, offset: 376)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "general_max_14bit_constraint_flag", scope: !946, file: !930, line: 65, baseType: !838, size: 8, align: 8, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "general_inbld_flag", scope: !946, file: !930, line: 67, baseType: !838, size: 8, align: 8, offset: 392)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "general_level_idc", scope: !946, file: !930, line: 69, baseType: !838, size: 8, align: 8, offset: 400)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_present_flag", scope: !946, file: !930, line: 71, baseType: !972, size: 56, align: 8, offset: 408)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 56, align: 8, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 7)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_level_present_flag", scope: !946, file: !930, line: 72, baseType: !972, size: 56, align: 8, offset: 464)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_space", scope: !946, file: !930, line: 74, baseType: !972, size: 56, align: 8, offset: 520)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_tier_flag", scope: !946, file: !930, line: 75, baseType: !972, size: 56, align: 8, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_idc", scope: !946, file: !930, line: 76, baseType: !972, size: 56, align: 8, offset: 632)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_compatibility_flag", scope: !946, file: !930, line: 78, baseType: !980, size: 1792, align: 8, offset: 688)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 1792, align: 8, elements: !981)
!981 = !{!974, !954}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_progressive_source_flag", scope: !946, file: !930, line: 80, baseType: !972, size: 56, align: 8, offset: 2480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_interlaced_source_flag", scope: !946, file: !930, line: 81, baseType: !972, size: 56, align: 8, offset: 2536)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_non_packed_constraint_flag", scope: !946, file: !930, line: 82, baseType: !972, size: 56, align: 8, offset: 2592)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_frame_only_constraint_flag", scope: !946, file: !930, line: 83, baseType: !972, size: 56, align: 8, offset: 2648)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_max_12bit_constraint_flag", scope: !946, file: !930, line: 85, baseType: !972, size: 56, align: 8, offset: 2704)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_max_10bit_constraint_flag", scope: !946, file: !930, line: 86, baseType: !972, size: 56, align: 8, offset: 2760)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_max_8bit_constraint_flag", scope: !946, file: !930, line: 87, baseType: !972, size: 56, align: 8, offset: 2816)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_max_422chroma_constraint_flag", scope: !946, file: !930, line: 88, baseType: !972, size: 56, align: 8, offset: 2872)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_max_420chroma_constraint_flag", scope: !946, file: !930, line: 89, baseType: !972, size: 56, align: 8, offset: 2928)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_max_monochrome_constraint_flag", scope: !946, file: !930, line: 90, baseType: !972, size: 56, align: 8, offset: 2984)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_intra_constraint_flag", scope: !946, file: !930, line: 91, baseType: !972, size: 56, align: 8, offset: 3040)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_one_picture_only_constraint_flag", scope: !946, file: !930, line: 92, baseType: !972, size: 56, align: 8, offset: 3096)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_lower_bit_rate_constraint_flag", scope: !946, file: !930, line: 93, baseType: !972, size: 56, align: 8, offset: 3152)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_max_14bit_constraint_flag", scope: !946, file: !930, line: 94, baseType: !972, size: 56, align: 8, offset: 3208)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_inbld_flag", scope: !946, file: !930, line: 96, baseType: !972, size: 56, align: 8, offset: 3264)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_level_idc", scope: !946, file: !930, line: 98, baseType: !972, size: 56, align: 8, offset: 3320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "sps_seq_parameter_set_id", scope: !931, file: !930, line: 263, baseType: !838, size: 8, align: 8, offset: 3432)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !931, file: !930, line: 265, baseType: !838, size: 8, align: 8, offset: 3440)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !931, file: !930, line: 266, baseType: !838, size: 8, align: 8, offset: 3448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "pic_width_in_luma_samples", scope: !931, file: !930, line: 268, baseType: !1002, size: 16, align: 16, offset: 3456)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !752, line: 49, baseType: !1003)
!1003 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "pic_height_in_luma_samples", scope: !931, file: !930, line: 269, baseType: !1002, size: 16, align: 16, offset: 3472)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "conformance_window_flag", scope: !931, file: !930, line: 271, baseType: !838, size: 8, align: 8, offset: 3488)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "conf_win_left_offset", scope: !931, file: !930, line: 272, baseType: !1002, size: 16, align: 16, offset: 3504)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "conf_win_right_offset", scope: !931, file: !930, line: 273, baseType: !1002, size: 16, align: 16, offset: 3520)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "conf_win_top_offset", scope: !931, file: !930, line: 274, baseType: !1002, size: 16, align: 16, offset: 3536)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "conf_win_bottom_offset", scope: !931, file: !930, line: 275, baseType: !1002, size: 16, align: 16, offset: 3552)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma_minus8", scope: !931, file: !930, line: 277, baseType: !838, size: 8, align: 8, offset: 3568)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma_minus8", scope: !931, file: !930, line: 278, baseType: !838, size: 8, align: 8, offset: 3576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pic_order_cnt_lsb_minus4", scope: !931, file: !930, line: 280, baseType: !838, size: 8, align: 8, offset: 3584)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sps_sub_layer_ordering_info_present_flag", scope: !931, file: !930, line: 282, baseType: !838, size: 8, align: 8, offset: 3592)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sps_max_dec_pic_buffering_minus1", scope: !931, file: !930, line: 283, baseType: !972, size: 56, align: 8, offset: 3600)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "sps_max_num_reorder_pics", scope: !931, file: !930, line: 284, baseType: !972, size: 56, align: 8, offset: 3656)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sps_max_latency_increase_plus1", scope: !931, file: !930, line: 285, baseType: !1017, size: 224, align: 32, offset: 3712)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 224, align: 32, elements: !973)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_luma_coding_block_size_minus3", scope: !931, file: !930, line: 287, baseType: !838, size: 8, align: 8, offset: 3936)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "log2_diff_max_min_luma_coding_block_size", scope: !931, file: !930, line: 288, baseType: !838, size: 8, align: 8, offset: 3944)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_luma_transform_block_size_minus2", scope: !931, file: !930, line: 289, baseType: !838, size: 8, align: 8, offset: 3952)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "log2_diff_max_min_luma_transform_block_size", scope: !931, file: !930, line: 290, baseType: !838, size: 8, align: 8, offset: 3960)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_inter", scope: !931, file: !930, line: 291, baseType: !838, size: 8, align: 8, offset: 3968)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_intra", scope: !931, file: !930, line: 292, baseType: !838, size: 8, align: 8, offset: 3976)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_enabled_flag", scope: !931, file: !930, line: 294, baseType: !838, size: 8, align: 8, offset: 3984)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "sps_scaling_list_data_present_flag", scope: !931, file: !930, line: 295, baseType: !838, size: 8, align: 8, offset: 3992)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !931, file: !930, line: 296, baseType: !1027, size: 13056, align: 16, offset: 4000)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawScalingList", file: !930, line: 251, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawScalingList", file: !930, line: 246, size: 13056, align: 16, elements: !1029)
!1029 = !{!1030, !1035, !1036, !1040}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_pred_mode_flag", scope: !1028, file: !930, line: 247, baseType: !1031, size: 192, align: 8)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 192, align: 8, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DISubrange(count: 4)
!1034 = !DISubrange(count: 6)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_pred_matrix_id_delta", scope: !1028, file: !930, line: 248, baseType: !1031, size: 192, align: 8, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_dc_coef_minus8", scope: !1028, file: !930, line: 249, baseType: !1037, size: 384, align: 16, offset: 384)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 384, align: 16, elements: !1032)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !752, line: 37, baseType: !1039)
!1039 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_delta_coeff", scope: !1028, file: !930, line: 250, baseType: !1041, size: 12288, align: 8, offset: 768)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 12288, align: 8, elements: !1044)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !752, line: 36, baseType: !1043)
!1043 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1044 = !{!1033, !1034, !1045}
!1045 = !DISubrange(count: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "amp_enabled_flag", scope: !931, file: !930, line: 298, baseType: !838, size: 8, align: 8, offset: 17056)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "sample_adaptive_offset_enabled_flag", scope: !931, file: !930, line: 299, baseType: !838, size: 8, align: 8, offset: 17064)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_enabled_flag", scope: !931, file: !930, line: 301, baseType: !838, size: 8, align: 8, offset: 17072)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_sample_bit_depth_luma_minus1", scope: !931, file: !930, line: 302, baseType: !838, size: 8, align: 8, offset: 17080)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_sample_bit_depth_chroma_minus1", scope: !931, file: !930, line: 303, baseType: !838, size: 8, align: 8, offset: 17088)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pcm_luma_coding_block_size_minus3", scope: !931, file: !930, line: 304, baseType: !838, size: 8, align: 8, offset: 17096)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "log2_diff_max_min_pcm_luma_coding_block_size", scope: !931, file: !930, line: 305, baseType: !838, size: 8, align: 8, offset: 17104)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_loop_filter_disabled_flag", scope: !931, file: !930, line: 306, baseType: !838, size: 8, align: 8, offset: 17112)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "num_short_term_ref_pic_sets", scope: !931, file: !930, line: 308, baseType: !838, size: 8, align: 8, offset: 17120)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "st_ref_pic_set", scope: !931, file: !930, line: 309, baseType: !1056, size: 69632, align: 16, offset: 17136)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 69632, align: 16, elements: !1076)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawSTRefPicSet", file: !930, line: 244, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawSTRefPicSet", file: !930, line: 228, size: 1088, align: 16, elements: !1059)
!1059 = !{!1060, !1061, !1062, !1063, !1064, !1068, !1069, !1070, !1071, !1073, !1074, !1075}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "inter_ref_pic_set_prediction_flag", scope: !1058, file: !930, line: 229, baseType: !838, size: 8, align: 8)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "delta_idx_minus1", scope: !1058, file: !930, line: 231, baseType: !838, size: 8, align: 8, offset: 8)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "delta_rps_sign", scope: !1058, file: !930, line: 232, baseType: !838, size: 8, align: 8, offset: 16)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "abs_delta_rps_minus1", scope: !1058, file: !930, line: 233, baseType: !1002, size: 16, align: 16, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_flag", scope: !1058, file: !930, line: 235, baseType: !1065, size: 128, align: 8, offset: 48)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 128, align: 8, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 16)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "use_delta_flag", scope: !1058, file: !930, line: 236, baseType: !1065, size: 128, align: 8, offset: 176)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "num_negative_pics", scope: !1058, file: !930, line: 238, baseType: !838, size: 8, align: 8, offset: 304)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "num_positive_pics", scope: !1058, file: !930, line: 239, baseType: !838, size: 8, align: 8, offset: 312)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "delta_poc_s0_minus1", scope: !1058, file: !930, line: 240, baseType: !1072, size: 256, align: 16, offset: 320)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 256, align: 16, elements: !1066)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_s0_flag", scope: !1058, file: !930, line: 241, baseType: !1065, size: 128, align: 8, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "delta_poc_s1_minus1", scope: !1058, file: !930, line: 242, baseType: !1072, size: 256, align: 16, offset: 704)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_s1_flag", scope: !1058, file: !930, line: 243, baseType: !1065, size: 128, align: 8, offset: 960)
!1076 = !{!1045}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_ref_pics_present_flag", scope: !931, file: !930, line: 311, baseType: !838, size: 8, align: 8, offset: 86768)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "num_long_term_ref_pics_sps", scope: !931, file: !930, line: 312, baseType: !838, size: 8, align: 8, offset: 86776)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "lt_ref_pic_poc_lsb_sps", scope: !931, file: !930, line: 313, baseType: !1080, size: 512, align: 16, offset: 86784)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 512, align: 16, elements: !953)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_lt_sps_flag", scope: !931, file: !930, line: 314, baseType: !952, size: 256, align: 8, offset: 87296)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "sps_temporal_mvp_enabled_flag", scope: !931, file: !930, line: 316, baseType: !838, size: 8, align: 8, offset: 87552)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "strong_intra_smoothing_enabled_flag", scope: !931, file: !930, line: 317, baseType: !838, size: 8, align: 8, offset: 87560)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !931, file: !930, line: 319, baseType: !838, size: 8, align: 8, offset: 87568)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !931, file: !930, line: 320, baseType: !1086, size: 61888, align: 32, offset: 87584)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawVUI", file: !930, line: 184, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawVUI", file: !930, line: 136, size: 61888, align: 32, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_info_present_flag", scope: !1087, file: !930, line: 137, baseType: !838, size: 8, align: 8)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "aspect_ratio_idc", scope: !1087, file: !930, line: 138, baseType: !838, size: 8, align: 8, offset: 8)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "sar_width", scope: !1087, file: !930, line: 139, baseType: !1002, size: 16, align: 16, offset: 16)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "sar_height", scope: !1087, file: !930, line: 140, baseType: !1002, size: 16, align: 16, offset: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !1087, file: !930, line: 142, baseType: !838, size: 8, align: 8, offset: 48)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !1087, file: !930, line: 143, baseType: !838, size: 8, align: 8, offset: 56)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !1087, file: !930, line: 145, baseType: !838, size: 8, align: 8, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !1087, file: !930, line: 146, baseType: !838, size: 8, align: 8, offset: 72)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !1087, file: !930, line: 147, baseType: !838, size: 8, align: 8, offset: 80)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !1087, file: !930, line: 148, baseType: !838, size: 8, align: 8, offset: 88)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !1087, file: !930, line: 149, baseType: !838, size: 8, align: 8, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !1087, file: !930, line: 150, baseType: !838, size: 8, align: 8, offset: 104)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !1087, file: !930, line: 151, baseType: !838, size: 8, align: 8, offset: 112)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_loc_info_present_flag", scope: !1087, file: !930, line: 153, baseType: !838, size: 8, align: 8, offset: 120)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !1087, file: !930, line: 154, baseType: !838, size: 8, align: 8, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !1087, file: !930, line: 155, baseType: !838, size: 8, align: 8, offset: 136)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "neutral_chroma_indication_flag", scope: !1087, file: !930, line: 157, baseType: !838, size: 8, align: 8, offset: 144)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "field_seq_flag", scope: !1087, file: !930, line: 158, baseType: !838, size: 8, align: 8, offset: 152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "frame_field_info_present_flag", scope: !1087, file: !930, line: 159, baseType: !838, size: 8, align: 8, offset: 160)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "default_display_window_flag", scope: !1087, file: !930, line: 161, baseType: !838, size: 8, align: 8, offset: 168)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win_left_offset", scope: !1087, file: !930, line: 162, baseType: !1002, size: 16, align: 16, offset: 176)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win_right_offset", scope: !1087, file: !930, line: 163, baseType: !1002, size: 16, align: 16, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win_top_offset", scope: !1087, file: !930, line: 164, baseType: !1002, size: 16, align: 16, offset: 208)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win_bottom_offset", scope: !1087, file: !930, line: 165, baseType: !1002, size: 16, align: 16, offset: 224)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vui_timing_info_present_flag", scope: !1087, file: !930, line: 167, baseType: !838, size: 8, align: 8, offset: 240)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_units_in_tick", scope: !1087, file: !930, line: 168, baseType: !835, size: 32, align: 32, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "vui_time_scale", scope: !1087, file: !930, line: 169, baseType: !835, size: 32, align: 32, offset: 288)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "vui_poc_proportional_to_timing_flag", scope: !1087, file: !930, line: 170, baseType: !838, size: 8, align: 8, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_ticks_poc_diff_one_minus1", scope: !1087, file: !930, line: 171, baseType: !835, size: 32, align: 32, offset: 352)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vui_hrd_parameters_present_flag", scope: !1087, file: !930, line: 172, baseType: !838, size: 8, align: 8, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "hrd_parameters", scope: !1087, file: !930, line: 173, baseType: !1120, size: 61376, align: 32, offset: 416)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawHRDParameters", file: !930, line: 134, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawHRDParameters", file: !930, line: 109, size: 61376, align: 32, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1140, !1141, !1142, !1153}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !1121, file: !930, line: 110, baseType: !838, size: 8, align: 8)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !1121, file: !930, line: 111, baseType: !838, size: 8, align: 8, offset: 8)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "sub_pic_hrd_params_present_flag", scope: !1121, file: !930, line: 113, baseType: !838, size: 8, align: 8, offset: 16)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "tick_divisor_minus2", scope: !1121, file: !930, line: 114, baseType: !838, size: 8, align: 8, offset: 24)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "du_cpb_removal_delay_increment_length_minus1", scope: !1121, file: !930, line: 115, baseType: !838, size: 8, align: 8, offset: 32)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sub_pic_cpb_params_in_pic_timing_sei_flag", scope: !1121, file: !930, line: 116, baseType: !838, size: 8, align: 8, offset: 40)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_du_length_minus1", scope: !1121, file: !930, line: 117, baseType: !838, size: 8, align: 8, offset: 48)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scale", scope: !1121, file: !930, line: 119, baseType: !838, size: 8, align: 8, offset: 56)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_scale", scope: !1121, file: !930, line: 120, baseType: !838, size: 8, align: 8, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_du_scale", scope: !1121, file: !930, line: 121, baseType: !838, size: 8, align: 8, offset: 72)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length_minus1", scope: !1121, file: !930, line: 123, baseType: !838, size: 8, align: 8, offset: 80)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "au_cpb_removal_delay_length_minus1", scope: !1121, file: !930, line: 124, baseType: !838, size: 8, align: 8, offset: 88)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length_minus1", scope: !1121, file: !930, line: 125, baseType: !838, size: 8, align: 8, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_pic_rate_general_flag", scope: !1121, file: !930, line: 127, baseType: !972, size: 56, align: 8, offset: 104)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_pic_rate_within_cvs_flag", scope: !1121, file: !930, line: 128, baseType: !972, size: 56, align: 8, offset: 160)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "elemental_duration_in_tc_minus1", scope: !1121, file: !930, line: 129, baseType: !1139, size: 112, align: 16, offset: 224)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 112, align: 16, elements: !973)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "low_delay_hrd_flag", scope: !1121, file: !930, line: 130, baseType: !972, size: 56, align: 8, offset: 336)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt_minus1", scope: !1121, file: !930, line: 131, baseType: !972, size: 56, align: 8, offset: 392)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nal_sub_layer_hrd_parameters", scope: !1121, file: !930, line: 132, baseType: !1143, size: 30464, align: 32, offset: 448)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1144, size: 30464, align: 32, elements: !973)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawSubLayerHRDParameters", file: !930, line: 107, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawSubLayerHRDParameters", file: !930, line: 101, size: 4352, align: 32, elements: !1146)
!1146 = !{!1147, !1149, !1150, !1151, !1152}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_value_minus1", scope: !1145, file: !930, line: 102, baseType: !1148, size: 1024, align: 32)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 1024, align: 32, elements: !953)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_value_minus1", scope: !1145, file: !930, line: 103, baseType: !1148, size: 1024, align: 32, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_size_du_value_minus1", scope: !1145, file: !930, line: 104, baseType: !1148, size: 1024, align: 32, offset: 2048)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_du_value_minus1", scope: !1145, file: !930, line: 105, baseType: !1148, size: 1024, align: 32, offset: 3072)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "cbr_flag", scope: !1145, file: !930, line: 106, baseType: !952, size: 256, align: 8, offset: 4096)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_sub_layer_hrd_parameters", scope: !1121, file: !930, line: 133, baseType: !1143, size: 30464, align: 32, offset: 30912)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !1087, file: !930, line: 175, baseType: !838, size: 8, align: 8, offset: 61792)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_fixed_structure_flag", scope: !1087, file: !930, line: 176, baseType: !838, size: 8, align: 8, offset: 61800)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !1087, file: !930, line: 177, baseType: !838, size: 8, align: 8, offset: 61808)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "restricted_ref_pic_lists_flag", scope: !1087, file: !930, line: 178, baseType: !838, size: 8, align: 8, offset: 61816)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "min_spatial_segmentation_idc", scope: !1087, file: !930, line: 179, baseType: !1002, size: 16, align: 16, offset: 61824)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !1087, file: !930, line: 180, baseType: !838, size: 8, align: 8, offset: 61840)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_min_cu_denom", scope: !1087, file: !930, line: 181, baseType: !838, size: 8, align: 8, offset: 61848)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !1087, file: !930, line: 182, baseType: !838, size: 8, align: 8, offset: 61856)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !1087, file: !930, line: 183, baseType: !838, size: 8, align: 8, offset: 61864)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sps_extension_present_flag", scope: !931, file: !930, line: 322, baseType: !838, size: 8, align: 8, offset: 149472)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sps_range_extension_flag", scope: !931, file: !930, line: 323, baseType: !838, size: 8, align: 8, offset: 149480)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "sps_multilayer_extension_flag", scope: !931, file: !930, line: 324, baseType: !838, size: 8, align: 8, offset: 149488)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sps_3d_extension_flag", scope: !931, file: !930, line: 325, baseType: !838, size: 8, align: 8, offset: 149496)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "sps_scc_extension_flag", scope: !931, file: !930, line: 326, baseType: !838, size: 8, align: 8, offset: 149504)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sps_extension_4bits", scope: !931, file: !930, line: 327, baseType: !838, size: 8, align: 8, offset: 149512)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "extension_data", scope: !931, file: !930, line: 329, baseType: !1170, size: 192, align: 64, offset: 149568)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawPSExtensionData", file: !930, line: 190, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawPSExtensionData", file: !930, line: 186, size: 192, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1177}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !930, line: 187, baseType: !837, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "bit_length", scope: !1171, file: !930, line: 188, baseType: !1175, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1176, line: 216, baseType: !859)
!1176 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1171, file: !930, line: 189, baseType: !879, size: 64, align: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_rotation_enabled_flag", scope: !931, file: !930, line: 332, baseType: !838, size: 8, align: 8, offset: 149760)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_context_enabled_flag", scope: !931, file: !930, line: 333, baseType: !838, size: 8, align: 8, offset: 149768)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_rdpcm_enabled_flag", scope: !931, file: !930, line: 334, baseType: !838, size: 8, align: 8, offset: 149776)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_rdpcm_enabled_flag", scope: !931, file: !930, line: 335, baseType: !838, size: 8, align: 8, offset: 149784)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "extended_precision_processing_flag", scope: !931, file: !930, line: 336, baseType: !838, size: 8, align: 8, offset: 149792)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "intra_smoothing_disabled_flag", scope: !931, file: !930, line: 337, baseType: !838, size: 8, align: 8, offset: 149800)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_offsets_enabled_flag", scope: !931, file: !930, line: 338, baseType: !838, size: 8, align: 8, offset: 149808)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_rice_adaptation_enabled_flag", scope: !931, file: !930, line: 339, baseType: !838, size: 8, align: 8, offset: 149816)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_bypass_alignment_enabled_flag", scope: !931, file: !930, line: 340, baseType: !838, size: 8, align: 8, offset: 149824)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sps_curr_pic_ref_enabled_flag", scope: !931, file: !930, line: 343, baseType: !838, size: 8, align: 8, offset: 149832)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "palette_mode_enabled_flag", scope: !931, file: !930, line: 344, baseType: !838, size: 8, align: 8, offset: 149840)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "palette_max_size", scope: !931, file: !930, line: 345, baseType: !838, size: 8, align: 8, offset: 149848)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "delta_palette_max_predictor_size", scope: !931, file: !930, line: 346, baseType: !838, size: 8, align: 8, offset: 149856)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sps_palette_predictor_initializer_present_flag", scope: !931, file: !930, line: 347, baseType: !838, size: 8, align: 8, offset: 149864)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "sps_num_palette_predictor_initializer_minus1", scope: !931, file: !930, line: 348, baseType: !838, size: 8, align: 8, offset: 149872)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "sps_palette_predictor_initializers", scope: !931, file: !930, line: 349, baseType: !1194, size: 6144, align: 16, offset: 149888)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 6144, align: 16, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DISubrange(count: 3)
!1197 = !DISubrange(count: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vector_resolution_control_idc", scope: !931, file: !930, line: 351, baseType: !838, size: 8, align: 8, offset: 156032)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "intra_boundary_filtering_disable_flag", scope: !931, file: !930, line: 352, baseType: !838, size: 8, align: 8, offset: 156040)
!1200 = !{}
!1201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1202, size: 1088, align: 32, elements: !1203)
!1202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !758)
!1203 = !{!1204}
!1204 = !DISubrange(count: 17)
!1205 = !{i32 2, !"Dwarf Version", i32 4}
!1206 = !{i32 2, !"Debug Info Version", i32 3}
!1207 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1208 = distinct !DISubprogram(name: "h265_metadata_init", scope: !700, file: !700, line: 334, type: !812, isLocal: true, isDefinition: true, scopeLine: 335, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1200)
!1209 = !DILocalVariable(name: "bsf", arg: 1, scope: !1208, file: !700, line: 334, type: !814)
!1210 = !DIExpression()
!1211 = !DILocation(line: 334, column: 45, scope: !1208)
!1212 = !DILocalVariable(name: "ctx", scope: !1208, file: !700, line: 336, type: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265MetadataContext", file: !700, line: 61, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265MetadataContext", file: !700, line: 33, size: 1152, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1236, !1257, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1215, file: !700, line: 34, baseType: !727, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "cbc", scope: !1215, file: !700, line: 36, baseType: !1219, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamContext", file: !1221, line: 204, baseType: !1222)
!1221 = !DIFile(filename: "libavcodec/cbs.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamContext", file: !1221, line: 159, size: 384, align: 64, elements: !1223)
!1223 = !{!1224, !1225, !1229, !1230, !1233, !1234, !1235}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "log_ctx", scope: !1222, file: !1221, line: 164, baseType: !737, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1222, file: !1221, line: 169, baseType: !1226, size: 64, align: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamType", file: !1221, line: 43, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1222, file: !1221, line: 180, baseType: !737, size: 64, align: 64, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "decompose_unit_types", scope: !1222, file: !1221, line: 188, baseType: !1231, size: 64, align: 64, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnitType", file: !1221, line: 53, baseType: !835)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_decompose_unit_types", scope: !1222, file: !1221, line: 192, baseType: !711, size: 32, align: 32, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "trace_enable", scope: !1222, file: !1221, line: 197, baseType: !711, size: 32, align: 32, offset: 288)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "trace_level", scope: !1222, file: !1221, line: 203, baseType: !711, size: 32, align: 32, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "access_unit", scope: !1215, file: !700, line: 37, baseType: !1237, size: 384, align: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamFragment", file: !1221, line: 154, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamFragment", file: !1221, line: 116, size: 384, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1238, file: !1221, line: 122, baseType: !837, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1238, file: !1221, line: 129, baseType: !1175, size: 64, align: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !1238, file: !1221, line: 133, baseType: !1175, size: 64, align: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1238, file: !1221, line: 139, baseType: !879, size: 64, align: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_units", scope: !1238, file: !1221, line: 147, baseType: !711, size: 32, align: 32, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "units", scope: !1238, file: !1221, line: 153, baseType: !1246, size: 64, align: 64, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "CodedBitstreamUnit", file: !1221, line: 107, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CodedBitstreamUnit", file: !1221, line: 64, size: 448, align: 64, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1254, !1255, !1256}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1248, file: !1221, line: 68, baseType: !1232, size: 32, align: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1248, file: !1221, line: 75, baseType: !837, size: 64, align: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1248, file: !1221, line: 80, baseType: !1175, size: 64, align: 64, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "data_bit_padding", scope: !1248, file: !1221, line: 86, baseType: !1175, size: 64, align: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data_ref", scope: !1248, file: !1221, line: 92, baseType: !879, size: 64, align: 64, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "content", scope: !1248, file: !1221, line: 101, baseType: !737, size: 64, align: 64, offset: 320)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "content_ref", scope: !1248, file: !1221, line: 106, baseType: !879, size: 64, align: 64, offset: 384)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "aud_nal", scope: !1215, file: !700, line: 39, baseType: !1258, size: 40, align: 8, offset: 512)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawAUD", file: !930, line: 450, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawAUD", file: !930, line: 446, size: 40, align: 8, elements: !1260)
!1260 = !{!1261, !1262}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !1259, file: !930, line: 447, baseType: !934, size: 32, align: 8)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "pic_type", scope: !1259, file: !930, line: 449, baseType: !838, size: 8, align: 8, offset: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "aud", scope: !1215, file: !700, line: 41, baseType: !711, size: 32, align: 32, offset: 576)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1215, file: !700, line: 43, baseType: !758, size: 64, align: 32, offset: 608)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !1215, file: !700, line: 45, baseType: !711, size: 32, align: 32, offset: 672)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !1215, file: !700, line: 46, baseType: !711, size: 32, align: 32, offset: 704)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !1215, file: !700, line: 47, baseType: !711, size: 32, align: 32, offset: 736)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristics", scope: !1215, file: !700, line: 48, baseType: !711, size: 32, align: 32, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coefficients", scope: !1215, file: !700, line: 49, baseType: !711, size: 32, align: 32, offset: 800)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type", scope: !1215, file: !700, line: 51, baseType: !711, size: 32, align: 32, offset: 832)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "tick_rate", scope: !1215, file: !700, line: 53, baseType: !758, size: 64, align: 32, offset: 864)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "poc_proportional_to_timing_flag", scope: !1215, file: !700, line: 54, baseType: !711, size: 32, align: 32, offset: 928)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "num_ticks_poc_diff_one", scope: !1215, file: !700, line: 55, baseType: !711, size: 32, align: 32, offset: 960)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1215, file: !700, line: 57, baseType: !711, size: 32, align: 32, offset: 992)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1215, file: !700, line: 58, baseType: !711, size: 32, align: 32, offset: 1024)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1215, file: !700, line: 59, baseType: !711, size: 32, align: 32, offset: 1056)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1215, file: !700, line: 60, baseType: !711, size: 32, align: 32, offset: 1088)
!1278 = !DILocation(line: 336, column: 26, scope: !1208)
!1279 = !DILocation(line: 336, column: 32, scope: !1208)
!1280 = !DILocation(line: 336, column: 37, scope: !1208)
!1281 = !DILocalVariable(name: "au", scope: !1208, file: !700, line: 337, type: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1283 = !DILocation(line: 337, column: 29, scope: !1208)
!1284 = !DILocation(line: 337, column: 35, scope: !1208)
!1285 = !DILocation(line: 337, column: 40, scope: !1208)
!1286 = !DILocalVariable(name: "err", scope: !1208, file: !700, line: 338, type: !711)
!1287 = !DILocation(line: 338, column: 9, scope: !1208)
!1288 = !DILocalVariable(name: "i", scope: !1208, file: !700, line: 338, type: !711)
!1289 = !DILocation(line: 338, column: 14, scope: !1208)
!1290 = !DILocation(line: 340, column: 24, scope: !1208)
!1291 = !DILocation(line: 340, column: 29, scope: !1208)
!1292 = !DILocation(line: 340, column: 52, scope: !1208)
!1293 = !DILocation(line: 340, column: 11, scope: !1208)
!1294 = !DILocation(line: 340, column: 9, scope: !1208)
!1295 = !DILocation(line: 341, column: 9, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1208, file: !700, line: 341, column: 9)
!1297 = !DILocation(line: 341, column: 13, scope: !1296)
!1298 = !DILocation(line: 341, column: 9, scope: !1208)
!1299 = !DILocation(line: 342, column: 16, scope: !1296)
!1300 = !DILocation(line: 342, column: 9, scope: !1296)
!1301 = !DILocation(line: 344, column: 9, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1208, file: !700, line: 344, column: 9)
!1303 = !DILocation(line: 344, column: 14, scope: !1302)
!1304 = !DILocation(line: 344, column: 22, scope: !1302)
!1305 = !DILocation(line: 344, column: 9, scope: !1208)
!1306 = !DILocation(line: 345, column: 37, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1302, file: !700, line: 344, column: 33)
!1308 = !DILocation(line: 345, column: 42, scope: !1307)
!1309 = !DILocation(line: 345, column: 47, scope: !1307)
!1310 = !DILocation(line: 345, column: 51, scope: !1307)
!1311 = !DILocation(line: 345, column: 56, scope: !1307)
!1312 = !DILocation(line: 345, column: 15, scope: !1307)
!1313 = !DILocation(line: 345, column: 13, scope: !1307)
!1314 = !DILocation(line: 346, column: 13, scope: !1315)
!1315 = distinct !DILexicalBlock(scope: !1307, file: !700, line: 346, column: 13)
!1316 = !DILocation(line: 346, column: 17, scope: !1315)
!1317 = !DILocation(line: 346, column: 13, scope: !1307)
!1318 = !DILocation(line: 347, column: 20, scope: !1319)
!1319 = distinct !DILexicalBlock(scope: !1315, file: !700, line: 346, column: 22)
!1320 = !DILocation(line: 347, column: 13, scope: !1319)
!1321 = !DILocation(line: 348, column: 13, scope: !1319)
!1322 = !DILocation(line: 351, column: 16, scope: !1323)
!1323 = distinct !DILexicalBlock(scope: !1307, file: !700, line: 351, column: 9)
!1324 = !DILocation(line: 351, column: 14, scope: !1323)
!1325 = !DILocation(line: 351, column: 21, scope: !1326)
!1326 = !DILexicalBlockFile(scope: !1327, file: !700, discriminator: 1)
!1327 = distinct !DILexicalBlock(scope: !1323, file: !700, line: 351, column: 9)
!1328 = !DILocation(line: 351, column: 25, scope: !1326)
!1329 = !DILocation(line: 351, column: 29, scope: !1326)
!1330 = !DILocation(line: 351, column: 23, scope: !1326)
!1331 = !DILocation(line: 351, column: 9, scope: !1326)
!1332 = !DILocation(line: 352, column: 27, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1334, file: !700, line: 352, column: 17)
!1334 = distinct !DILexicalBlock(scope: !1327, file: !700, line: 351, column: 44)
!1335 = !DILocation(line: 352, column: 17, scope: !1333)
!1336 = !DILocation(line: 352, column: 21, scope: !1333)
!1337 = !DILocation(line: 352, column: 30, scope: !1333)
!1338 = !DILocation(line: 352, column: 35, scope: !1333)
!1339 = !DILocation(line: 352, column: 17, scope: !1334)
!1340 = !DILocation(line: 353, column: 48, scope: !1341)
!1341 = distinct !DILexicalBlock(scope: !1333, file: !700, line: 352, column: 52)
!1342 = !DILocation(line: 353, column: 63, scope: !1341)
!1343 = !DILocation(line: 353, column: 53, scope: !1341)
!1344 = !DILocation(line: 353, column: 57, scope: !1341)
!1345 = !DILocation(line: 353, column: 66, scope: !1341)
!1346 = !DILocation(line: 353, column: 23, scope: !1341)
!1347 = !DILocation(line: 353, column: 21, scope: !1341)
!1348 = !DILocation(line: 354, column: 21, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !1341, file: !700, line: 354, column: 21)
!1350 = !DILocation(line: 354, column: 25, scope: !1349)
!1351 = !DILocation(line: 354, column: 21, scope: !1341)
!1352 = !DILocation(line: 355, column: 21, scope: !1349)
!1353 = !DILocation(line: 356, column: 13, scope: !1341)
!1354 = !DILocation(line: 357, column: 27, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1334, file: !700, line: 357, column: 17)
!1356 = !DILocation(line: 357, column: 17, scope: !1355)
!1357 = !DILocation(line: 357, column: 21, scope: !1355)
!1358 = !DILocation(line: 357, column: 30, scope: !1355)
!1359 = !DILocation(line: 357, column: 35, scope: !1355)
!1360 = !DILocation(line: 357, column: 17, scope: !1334)
!1361 = !DILocation(line: 358, column: 48, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1355, file: !700, line: 357, column: 52)
!1363 = !DILocation(line: 358, column: 63, scope: !1362)
!1364 = !DILocation(line: 358, column: 53, scope: !1362)
!1365 = !DILocation(line: 358, column: 57, scope: !1362)
!1366 = !DILocation(line: 358, column: 66, scope: !1362)
!1367 = !DILocation(line: 358, column: 23, scope: !1362)
!1368 = !DILocation(line: 358, column: 21, scope: !1362)
!1369 = !DILocation(line: 359, column: 21, scope: !1370)
!1370 = distinct !DILexicalBlock(scope: !1362, file: !700, line: 359, column: 21)
!1371 = !DILocation(line: 359, column: 25, scope: !1370)
!1372 = !DILocation(line: 359, column: 21, scope: !1362)
!1373 = !DILocation(line: 360, column: 21, scope: !1370)
!1374 = !DILocation(line: 361, column: 13, scope: !1362)
!1375 = !DILocation(line: 362, column: 9, scope: !1334)
!1376 = !DILocation(line: 351, column: 40, scope: !1377)
!1377 = !DILexicalBlockFile(scope: !1327, file: !700, discriminator: 2)
!1378 = !DILocation(line: 351, column: 9, scope: !1377)
!1379 = distinct !{!1379, !1380}
!1380 = !DILocation(line: 351, column: 9, scope: !1307)
!1381 = !DILocation(line: 364, column: 38, scope: !1307)
!1382 = !DILocation(line: 364, column: 43, scope: !1307)
!1383 = !DILocation(line: 364, column: 48, scope: !1307)
!1384 = !DILocation(line: 364, column: 53, scope: !1307)
!1385 = !DILocation(line: 364, column: 62, scope: !1307)
!1386 = !DILocation(line: 364, column: 15, scope: !1307)
!1387 = !DILocation(line: 364, column: 13, scope: !1307)
!1388 = !DILocation(line: 365, column: 13, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1307, file: !700, line: 365, column: 13)
!1390 = !DILocation(line: 365, column: 17, scope: !1389)
!1391 = !DILocation(line: 365, column: 13, scope: !1307)
!1392 = !DILocation(line: 366, column: 20, scope: !1393)
!1393 = distinct !DILexicalBlock(scope: !1389, file: !700, line: 365, column: 22)
!1394 = !DILocation(line: 366, column: 13, scope: !1393)
!1395 = !DILocation(line: 367, column: 13, scope: !1393)
!1396 = !DILocation(line: 369, column: 5, scope: !1307)
!1397 = !DILocation(line: 371, column: 9, scope: !1208)
!1398 = !DILocation(line: 371, column: 5, scope: !1208)
!1399 = !DILocation(line: 373, column: 28, scope: !1208)
!1400 = !DILocation(line: 373, column: 33, scope: !1208)
!1401 = !DILocation(line: 373, column: 38, scope: !1208)
!1402 = !DILocation(line: 373, column: 5, scope: !1208)
!1403 = !DILocation(line: 374, column: 12, scope: !1208)
!1404 = !DILocation(line: 374, column: 5, scope: !1208)
!1405 = !DILocation(line: 375, column: 1, scope: !1208)
!1406 = distinct !DISubprogram(name: "h265_metadata_filter", scope: !700, file: !700, line: 233, type: !872, isLocal: true, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1200)
!1407 = !DILocalVariable(name: "bsf", arg: 1, scope: !1406, file: !700, line: 233, type: !814)
!1408 = !DILocation(line: 233, column: 47, scope: !1406)
!1409 = !DILocalVariable(name: "out", arg: 2, scope: !1406, file: !700, line: 233, type: !874)
!1410 = !DILocation(line: 233, column: 62, scope: !1406)
!1411 = !DILocalVariable(name: "ctx", scope: !1406, file: !700, line: 235, type: !1213)
!1412 = !DILocation(line: 235, column: 26, scope: !1406)
!1413 = !DILocation(line: 235, column: 32, scope: !1406)
!1414 = !DILocation(line: 235, column: 37, scope: !1406)
!1415 = !DILocalVariable(name: "in", scope: !1406, file: !700, line: 236, type: !874)
!1416 = !DILocation(line: 236, column: 15, scope: !1406)
!1417 = !DILocalVariable(name: "au", scope: !1406, file: !700, line: 237, type: !1282)
!1418 = !DILocation(line: 237, column: 29, scope: !1406)
!1419 = !DILocation(line: 237, column: 35, scope: !1406)
!1420 = !DILocation(line: 237, column: 40, scope: !1406)
!1421 = !DILocalVariable(name: "err", scope: !1406, file: !700, line: 238, type: !711)
!1422 = !DILocation(line: 238, column: 9, scope: !1406)
!1423 = !DILocalVariable(name: "i", scope: !1406, file: !700, line: 238, type: !711)
!1424 = !DILocation(line: 238, column: 14, scope: !1406)
!1425 = !DILocation(line: 240, column: 29, scope: !1406)
!1426 = !DILocation(line: 240, column: 11, scope: !1406)
!1427 = !DILocation(line: 240, column: 9, scope: !1406)
!1428 = !DILocation(line: 241, column: 9, scope: !1429)
!1429 = distinct !DILexicalBlock(scope: !1406, file: !700, line: 241, column: 9)
!1430 = !DILocation(line: 241, column: 13, scope: !1429)
!1431 = !DILocation(line: 241, column: 9, scope: !1406)
!1432 = !DILocation(line: 242, column: 16, scope: !1429)
!1433 = !DILocation(line: 242, column: 9, scope: !1429)
!1434 = !DILocation(line: 244, column: 30, scope: !1406)
!1435 = !DILocation(line: 244, column: 35, scope: !1406)
!1436 = !DILocation(line: 244, column: 40, scope: !1406)
!1437 = !DILocation(line: 244, column: 44, scope: !1406)
!1438 = !DILocation(line: 244, column: 11, scope: !1406)
!1439 = !DILocation(line: 244, column: 9, scope: !1406)
!1440 = !DILocation(line: 245, column: 9, scope: !1441)
!1441 = distinct !DILexicalBlock(scope: !1406, file: !700, line: 245, column: 9)
!1442 = !DILocation(line: 245, column: 13, scope: !1441)
!1443 = !DILocation(line: 245, column: 9, scope: !1406)
!1444 = !DILocation(line: 246, column: 16, scope: !1445)
!1445 = distinct !DILexicalBlock(scope: !1441, file: !700, line: 245, column: 18)
!1446 = !DILocation(line: 246, column: 9, scope: !1445)
!1447 = !DILocation(line: 247, column: 9, scope: !1445)
!1448 = !DILocation(line: 250, column: 9, scope: !1449)
!1449 = distinct !DILexicalBlock(scope: !1406, file: !700, line: 250, column: 9)
!1450 = !DILocation(line: 250, column: 13, scope: !1449)
!1451 = !DILocation(line: 250, column: 22, scope: !1449)
!1452 = !DILocation(line: 250, column: 9, scope: !1406)
!1453 = !DILocation(line: 251, column: 16, scope: !1454)
!1454 = distinct !DILexicalBlock(scope: !1449, file: !700, line: 250, column: 28)
!1455 = !DILocation(line: 251, column: 9, scope: !1454)
!1456 = !DILocation(line: 252, column: 13, scope: !1454)
!1457 = !DILocation(line: 253, column: 9, scope: !1454)
!1458 = !DILocation(line: 257, column: 9, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1406, file: !700, line: 257, column: 9)
!1460 = !DILocation(line: 257, column: 13, scope: !1459)
!1461 = !DILocation(line: 257, column: 22, scope: !1459)
!1462 = !DILocation(line: 257, column: 27, scope: !1459)
!1463 = !DILocation(line: 257, column: 9, scope: !1406)
!1464 = !DILocation(line: 258, column: 13, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1466, file: !700, line: 258, column: 13)
!1466 = distinct !DILexicalBlock(scope: !1459, file: !700, line: 257, column: 44)
!1467 = !DILocation(line: 258, column: 18, scope: !1465)
!1468 = !DILocation(line: 258, column: 22, scope: !1465)
!1469 = !DILocation(line: 258, column: 13, scope: !1466)
!1470 = !DILocation(line: 259, column: 32, scope: !1465)
!1471 = !DILocation(line: 259, column: 37, scope: !1465)
!1472 = !DILocation(line: 259, column: 42, scope: !1465)
!1473 = !DILocation(line: 259, column: 13, scope: !1465)
!1474 = !DILocation(line: 260, column: 5, scope: !1466)
!1475 = !DILocation(line: 261, column: 13, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1477, file: !700, line: 261, column: 13)
!1477 = distinct !DILexicalBlock(scope: !1459, file: !700, line: 260, column: 12)
!1478 = !DILocation(line: 261, column: 18, scope: !1476)
!1479 = !DILocation(line: 261, column: 22, scope: !1476)
!1480 = !DILocation(line: 261, column: 13, scope: !1477)
!1481 = !DILocalVariable(name: "aud", scope: !1482, file: !700, line: 262, type: !1483)
!1482 = distinct !DILexicalBlock(scope: !1476, file: !700, line: 261, column: 33)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1484 = !DILocation(line: 262, column: 25, scope: !1482)
!1485 = !DILocation(line: 262, column: 32, scope: !1482)
!1486 = !DILocation(line: 262, column: 37, scope: !1482)
!1487 = !DILocalVariable(name: "pic_type", scope: !1482, file: !700, line: 263, type: !711)
!1488 = !DILocation(line: 263, column: 17, scope: !1482)
!1489 = !DILocalVariable(name: "temporal_id", scope: !1482, file: !700, line: 263, type: !711)
!1490 = !DILocation(line: 263, column: 31, scope: !1482)
!1491 = !DILocalVariable(name: "layer_id", scope: !1482, file: !700, line: 263, type: !711)
!1492 = !DILocation(line: 263, column: 48, scope: !1482)
!1493 = !DILocation(line: 265, column: 20, scope: !1494)
!1494 = distinct !DILexicalBlock(scope: !1482, file: !700, line: 265, column: 13)
!1495 = !DILocation(line: 265, column: 18, scope: !1494)
!1496 = !DILocation(line: 265, column: 25, scope: !1497)
!1497 = !DILexicalBlockFile(scope: !1498, file: !700, discriminator: 1)
!1498 = distinct !DILexicalBlock(scope: !1494, file: !700, line: 265, column: 13)
!1499 = !DILocation(line: 265, column: 29, scope: !1497)
!1500 = !DILocation(line: 265, column: 33, scope: !1497)
!1501 = !DILocation(line: 265, column: 27, scope: !1497)
!1502 = !DILocation(line: 265, column: 13, scope: !1497)
!1503 = !DILocalVariable(name: "nal", scope: !1504, file: !700, line: 266, type: !1505)
!1504 = distinct !DILexicalBlock(scope: !1498, file: !700, line: 265, column: 48)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!1507 = !DILocation(line: 266, column: 45, scope: !1504)
!1508 = !DILocation(line: 266, column: 61, scope: !1504)
!1509 = !DILocation(line: 266, column: 51, scope: !1504)
!1510 = !DILocation(line: 266, column: 55, scope: !1504)
!1511 = !DILocation(line: 266, column: 64, scope: !1504)
!1512 = !DILocation(line: 267, column: 22, scope: !1513)
!1513 = distinct !DILexicalBlock(scope: !1504, file: !700, line: 267, column: 21)
!1514 = !DILocation(line: 267, column: 21, scope: !1504)
!1515 = !DILocation(line: 268, column: 21, scope: !1513)
!1516 = !DILocation(line: 269, column: 21, scope: !1517)
!1517 = distinct !DILexicalBlock(scope: !1504, file: !700, line: 269, column: 21)
!1518 = !DILocation(line: 269, column: 26, scope: !1517)
!1519 = !DILocation(line: 269, column: 50, scope: !1517)
!1520 = !DILocation(line: 269, column: 62, scope: !1517)
!1521 = !DILocation(line: 269, column: 48, scope: !1517)
!1522 = !DILocation(line: 269, column: 21, scope: !1504)
!1523 = !DILocation(line: 270, column: 35, scope: !1517)
!1524 = !DILocation(line: 270, column: 40, scope: !1517)
!1525 = !DILocation(line: 270, column: 62, scope: !1517)
!1526 = !DILocation(line: 270, column: 33, scope: !1517)
!1527 = !DILocation(line: 270, column: 21, scope: !1517)
!1528 = !DILocation(line: 272, column: 31, scope: !1529)
!1529 = distinct !DILexicalBlock(scope: !1504, file: !700, line: 272, column: 21)
!1530 = !DILocation(line: 272, column: 21, scope: !1529)
!1531 = !DILocation(line: 272, column: 25, scope: !1529)
!1532 = !DILocation(line: 272, column: 34, scope: !1529)
!1533 = !DILocation(line: 272, column: 39, scope: !1529)
!1534 = !DILocation(line: 272, column: 21, scope: !1504)
!1535 = !DILocalVariable(name: "slice", scope: !1536, file: !700, line: 273, type: !1537)
!1536 = distinct !DILexicalBlock(scope: !1529, file: !700, line: 272, column: 62)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1539)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawSlice", file: !930, line: 549, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawSlice", file: !930, line: 542, size: 94464, align: 64, elements: !1541)
!1541 = !{!1542, !1629, !1630, !1631, !1632}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1540, file: !930, line: 543, baseType: !1543, size: 94176, align: 32)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "H265RawSliceHeader", file: !930, line: 539, baseType: !1544)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H265RawSliceHeader", file: !930, line: 452, size: 94176, align: 32, elements: !1545)
!1545 = !{!1546, !1547, !1548, !1549, !1550, !1551, !1552, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1591, !1593, !1596, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1624, !1625}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "nal_unit_header", scope: !1544, file: !930, line: 453, baseType: !934, size: 32, align: 8)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "first_slice_segment_in_pic_flag", scope: !1544, file: !930, line: 455, baseType: !838, size: 8, align: 8, offset: 32)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "no_output_of_prior_pics_flag", scope: !1544, file: !930, line: 456, baseType: !838, size: 8, align: 8, offset: 40)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "slice_pic_parameter_set_id", scope: !1544, file: !930, line: 457, baseType: !838, size: 8, align: 8, offset: 48)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "dependent_slice_segment_flag", scope: !1544, file: !930, line: 459, baseType: !838, size: 8, align: 8, offset: 56)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "slice_segment_address", scope: !1544, file: !930, line: 460, baseType: !1002, size: 16, align: 16, offset: 64)
