; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_mp4toannexb_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_mp4toannexb_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!632 = !DIEnumerator(name: "HEVC_NAL_IDR_W_RADL", value: 19)
!633 = !DIEnumerator(name: "HEVC_NAL_IDR_N_LP", value: 20)
!634 = !DIEnumerator(name: "HEVC_NAL_CRA_NUT", value: 21)
!635 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL22", value: 22)
!636 = !DIEnumerator(name: "HEVC_NAL_IRAP_VCL23", value: 23)
!637 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL24", value: 24)
!638 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL25", value: 25)
!639 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL26", value: 26)
!640 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL27", value: 27)
!641 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL28", value: 28)
!642 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL29", value: 29)
!643 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL30", value: 30)
!644 = !DIEnumerator(name: "HEVC_NAL_RSV_VCL31", value: 31)
!645 = !DIEnumerator(name: "HEVC_NAL_VPS", value: 32)
!646 = !DIEnumerator(name: "HEVC_NAL_SPS", value: 33)
!647 = !DIEnumerator(name: "HEVC_NAL_PPS", value: 34)
!648 = !DIEnumerator(name: "HEVC_NAL_AUD", value: 35)
!649 = !DIEnumerator(name: "HEVC_NAL_EOS_NUT", value: 36)
!650 = !DIEnumerator(name: "HEVC_NAL_EOB_NUT", value: 37)
!651 = !DIEnumerator(name: "HEVC_NAL_FD_NUT", value: 38)
!652 = !DIEnumerator(name: "HEVC_NAL_SEI_PREFIX", value: 39)
!653 = !DIEnumerator(name: "HEVC_NAL_SEI_SUFFIX", value: 40)
!654 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL41", value: 41)
!655 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL42", value: 42)
!656 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL43", value: 43)
!657 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL44", value: 44)
!658 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL45", value: 45)
!659 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL46", value: 46)
!660 = !DIEnumerator(name: "HEVC_NAL_RSV_NVCL47", value: 47)
!661 = !DIEnumerator(name: "HEVC_NAL_UNSPEC48", value: 48)
!662 = !DIEnumerator(name: "HEVC_NAL_UNSPEC49", value: 49)
!663 = !DIEnumerator(name: "HEVC_NAL_UNSPEC50", value: 50)
!664 = !DIEnumerator(name: "HEVC_NAL_UNSPEC51", value: 51)
!665 = !DIEnumerator(name: "HEVC_NAL_UNSPEC52", value: 52)
!666 = !DIEnumerator(name: "HEVC_NAL_UNSPEC53", value: 53)
!667 = !DIEnumerator(name: "HEVC_NAL_UNSPEC54", value: 54)
!668 = !DIEnumerator(name: "HEVC_NAL_UNSPEC55", value: 55)
!669 = !DIEnumerator(name: "HEVC_NAL_UNSPEC56", value: 56)
!670 = !DIEnumerator(name: "HEVC_NAL_UNSPEC57", value: 57)
!671 = !DIEnumerator(name: "HEVC_NAL_UNSPEC58", value: 58)
!672 = !DIEnumerator(name: "HEVC_NAL_UNSPEC59", value: 59)
!673 = !DIEnumerator(name: "HEVC_NAL_UNSPEC60", value: 60)
!674 = !DIEnumerator(name: "HEVC_NAL_UNSPEC61", value: 61)
!675 = !DIEnumerator(name: "HEVC_NAL_UNSPEC62", value: 62)
!676 = !DIEnumerator(name: "HEVC_NAL_UNSPEC63", value: 63)
!677 = !{!678, !683, !691, !690, !692, !693, !694}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !681, line: 48, baseType: !682)
!681 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!682 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !686, line: 221, size: 32, align: 8, elements: !687)
!686 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !685, file: !686, line: 221, baseType: !689, size: 32, align: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !681, line: 51, baseType: !690)
!690 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!691 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !686, line: 222, size: 16, align: 8, elements: !697)
!697 = !{!698}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !696, file: !686, line: 222, baseType: !699, size: 16, align: 16)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !681, line: 49, baseType: !700)
!700 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!701 = !{!702, !865}
!702 = distinct !DIGlobalVariable(name: "ff_hevc_mp4toannexb_bsf", scope: !0, file: !703, line: 189, type: !704, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_hevc_mp4toannexb_bsf)
!703 = !DIFile(filename: "libavcodec/hevc_mp4toannexb_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !707)
!707 = !{!708, !712, !715, !756, !757, !822, !860, !864}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !4, line: 5797, baseType: !709, size: 64, align: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!711 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !706, file: !4, line: 5804, baseType: !713, size: 64, align: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !706, file: !4, line: 5815, baseType: !716, size: 64, align: 64, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !720)
!720 = !{!721, !722, !726, !730, !731, !732, !733, !737, !743, !745, !749}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !719, file: !464, line: 72, baseType: !709, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !719, file: !464, line: 78, baseType: !723, size: 64, align: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DISubroutineType(types: !725)
!725 = !{!709, !693}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !719, file: !464, line: 85, baseType: !727, size: 64, align: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !719, file: !464, line: 93, baseType: !691, size: 32, align: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !719, file: !464, line: 99, baseType: !691, size: 32, align: 32, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !719, file: !464, line: 108, baseType: !691, size: 32, align: 32, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !719, file: !464, line: 113, baseType: !734, size: 64, align: 64, offset: 320)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64, align: 64)
!735 = !DISubroutineType(types: !736)
!736 = !{!693, !693, !693}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !719, file: !464, line: 123, baseType: !738, size: 64, align: 64, offset: 384)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!739 = !DISubroutineType(types: !740)
!740 = !{!741, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !719, file: !464, line: 130, baseType: !744, size: 32, align: 32, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !719, file: !464, line: 136, baseType: !746, size: 64, align: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64, align: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{!744, !693}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !719, file: !464, line: 142, baseType: !750, size: 64, align: 64, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!691, !753, !693, !709, !691}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64, align: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !706, file: !4, line: 5825, baseType: !691, size: 32, align: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !706, file: !4, line: 5826, baseType: !758, size: 64, align: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64, align: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!691, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !764)
!764 = !{!765, !766, !769, !773, !774, !819, !820, !821}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !763, file: !4, line: 5751, baseType: !716, size: 64, align: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !763, file: !4, line: 5756, baseType: !767, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !763, file: !4, line: 5762, baseType: !770, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !772)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !763, file: !4, line: 5768, baseType: !693, size: 64, align: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !763, file: !4, line: 5775, baseType: !775, size: 64, align: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !784, !785, !786, !789, !790, !791, !792, !793, !794, !795, !802, !803, !804, !805, !806, !807, !808, !809, !812, !813, !814, !815, !816, !817, !818}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !777, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !777, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !777, file: !4, line: 3948, baseType: !689, size: 32, align: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !777, file: !4, line: 3958, baseType: !783, size: 64, align: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !777, file: !4, line: 3962, baseType: !691, size: 32, align: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !777, file: !4, line: 3968, baseType: !691, size: 32, align: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !777, file: !4, line: 3973, baseType: !787, size: 64, align: 64, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !681, line: 40, baseType: !788)
!788 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !777, file: !4, line: 3986, baseType: !691, size: 32, align: 32, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !777, file: !4, line: 3999, baseType: !691, size: 32, align: 32, offset: 352)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !777, file: !4, line: 4004, baseType: !691, size: 32, align: 32, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !777, file: !4, line: 4005, baseType: !691, size: 32, align: 32, offset: 416)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !777, file: !4, line: 4010, baseType: !691, size: 32, align: 32, offset: 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !777, file: !4, line: 4011, baseType: !691, size: 32, align: 32, offset: 480)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !777, file: !4, line: 4020, baseType: !796, size: 64, align: 32, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !797, line: 61, baseType: !798)
!797 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !797, line: 58, size: 64, align: 32, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !798, file: !797, line: 59, baseType: !691, size: 32, align: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !798, file: !797, line: 60, baseType: !691, size: 32, align: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !777, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !777, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !777, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !777, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !777, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !777, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !777, file: !4, line: 4039, baseType: !691, size: 32, align: 32, offset: 768)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !777, file: !4, line: 4046, baseType: !810, size: 64, align: 64, offset: 832)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !681, line: 55, baseType: !811)
!811 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !777, file: !4, line: 4050, baseType: !691, size: 32, align: 32, offset: 896)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !777, file: !4, line: 4054, baseType: !691, size: 32, align: 32, offset: 928)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !777, file: !4, line: 4061, baseType: !691, size: 32, align: 32, offset: 960)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !777, file: !4, line: 4065, baseType: !691, size: 32, align: 32, offset: 992)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !777, file: !4, line: 4073, baseType: !691, size: 32, align: 32, offset: 1024)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !777, file: !4, line: 4080, baseType: !691, size: 32, align: 32, offset: 1056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !777, file: !4, line: 4084, baseType: !691, size: 32, align: 32, offset: 1088)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !763, file: !4, line: 5781, baseType: !775, size: 64, align: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !763, file: !4, line: 5787, baseType: !796, size: 64, align: 32, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !763, file: !4, line: 5793, baseType: !796, size: 64, align: 32, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !706, file: !4, line: 5827, baseType: !823, size: 64, align: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64, align: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!691, !761, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64, align: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !829)
!829 = !{!830, !842, !843, !844, !845, !846, !847, !848, !856, !857, !858, !859}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !828, file: !4, line: 1451, baseType: !831, size: 64, align: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !833, line: 94, baseType: !834)
!833 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !833, line: 81, size: 192, align: 64, elements: !835)
!835 = !{!836, !840, !841}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !834, file: !833, line: 82, baseType: !837, size: 64, align: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64, align: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !833, line: 73, baseType: !839)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !833, line: 73, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !834, file: !833, line: 89, baseType: !783, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !834, file: !833, line: 93, baseType: !691, size: 32, align: 32, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !828, file: !4, line: 1461, baseType: !787, size: 64, align: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !828, file: !4, line: 1467, baseType: !787, size: 64, align: 64, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !828, file: !4, line: 1468, baseType: !783, size: 64, align: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !828, file: !4, line: 1469, baseType: !691, size: 32, align: 32, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !828, file: !4, line: 1470, baseType: !691, size: 32, align: 32, offset: 288)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !828, file: !4, line: 1474, baseType: !691, size: 32, align: 32, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !828, file: !4, line: 1479, baseType: !849, size: 64, align: 64, offset: 384)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !851, file: !4, line: 1412, baseType: !783, size: 64, align: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !851, file: !4, line: 1413, baseType: !691, size: 32, align: 32, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !851, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !828, file: !4, line: 1480, baseType: !691, size: 32, align: 32, offset: 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !828, file: !4, line: 1486, baseType: !787, size: 64, align: 64, offset: 512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !828, file: !4, line: 1488, baseType: !787, size: 64, align: 64, offset: 576)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !828, file: !4, line: 1497, baseType: !787, size: 64, align: 64, offset: 640)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !706, file: !4, line: 5828, baseType: !861, size: 64, align: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !761}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !706, file: !4, line: 5829, baseType: !861, size: 64, align: 64, offset: 448)
!865 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !703, line: 185, type: !866, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 64, align: 32, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 2)
!869 = !{i32 2, !"Dwarf Version", i32 4}
!870 = !{i32 2, !"Debug Info Version", i32 3}
!871 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!872 = distinct !DISubprogram(name: "hevc_mp4toannexb_init", scope: !703, file: !703, line: 97, type: !759, isLocal: true, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!873 = !{}
!874 = !DILocalVariable(name: "x", arg: 1, scope: !875, file: !876, line: 66, type: !689)
!875 = distinct !DISubprogram(name: "av_bswap32", scope: !876, file: !876, line: 66, type: !877, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!876 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!877 = !DISubroutineType(types: !878)
!878 = !{!689, !689}
!879 = !DIExpression()
!880 = !DILocation(line: 66, column: 98, scope: !875, inlinedAt: !881)
!881 = distinct !DILocation(line: 104, column: 9, scope: !882)
!882 = distinct !DILexicalBlock(scope: !872, file: !703, line: 102, column: 9)
!883 = !DILocalVariable(name: "ctx", arg: 1, scope: !872, file: !703, line: 97, type: !761)
!884 = !DILocation(line: 97, column: 48, scope: !872)
!885 = !DILocalVariable(name: "s", scope: !872, file: !703, line: 99, type: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64, align: 64)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCBSFContext", file: !703, line: 37, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCBSFContext", file: !703, line: 34, size: 64, align: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "length_size", scope: !888, file: !703, line: 35, baseType: !680, size: 8, align: 8)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_parsed", scope: !888, file: !703, line: 36, baseType: !691, size: 32, align: 32, offset: 32)
!892 = !DILocation(line: 99, column: 21, scope: !872)
!893 = !DILocation(line: 99, column: 25, scope: !872)
!894 = !DILocation(line: 99, column: 30, scope: !872)
!895 = !DILocalVariable(name: "ret", scope: !872, file: !703, line: 100, type: !691)
!896 = !DILocation(line: 100, column: 9, scope: !872)
!897 = !DILocation(line: 102, column: 9, scope: !882)
!898 = !DILocation(line: 102, column: 14, scope: !882)
!899 = !DILocation(line: 102, column: 22, scope: !882)
!900 = !DILocation(line: 102, column: 37, scope: !882)
!901 = !DILocation(line: 102, column: 42, scope: !882)
!902 = !DILocation(line: 103, column: 29, scope: !882)
!903 = !DILocation(line: 103, column: 34, scope: !882)
!904 = !DILocation(line: 103, column: 42, scope: !882)
!905 = !DILocation(line: 103, column: 11, scope: !882)
!906 = !DILocation(line: 103, column: 57, scope: !882)
!907 = !DILocation(line: 103, column: 85, scope: !882)
!908 = !DILocation(line: 103, column: 90, scope: !882)
!909 = !DILocation(line: 103, column: 98, scope: !882)
!910 = !DILocation(line: 103, column: 67, scope: !882)
!911 = !DILocation(line: 103, column: 113, scope: !882)
!912 = !DILocation(line: 103, column: 64, scope: !882)
!913 = !DILocation(line: 103, column: 139, scope: !882)
!914 = !DILocation(line: 103, column: 144, scope: !882)
!915 = !DILocation(line: 103, column: 152, scope: !882)
!916 = !DILocation(line: 103, column: 121, scope: !882)
!917 = !DILocation(line: 103, column: 119, scope: !882)
!918 = !DILocation(line: 103, column: 168, scope: !882)
!919 = !DILocation(line: 103, column: 173, scope: !882)
!920 = !DILocation(line: 104, column: 52, scope: !882)
!921 = !DILocation(line: 104, column: 57, scope: !882)
!922 = !DILocation(line: 104, column: 65, scope: !882)
!923 = !DILocation(line: 104, column: 78, scope: !882)
!924 = !DILocation(line: 104, column: 9, scope: !882)
!925 = !DILocation(line: 68, column: 16, scope: !875, inlinedAt: !881)
!926 = !DILocation(line: 68, column: 19, scope: !875, inlinedAt: !881)
!927 = !DILocation(line: 68, column: 24, scope: !875, inlinedAt: !881)
!928 = !DILocation(line: 68, column: 38, scope: !875, inlinedAt: !881)
!929 = !DILocation(line: 68, column: 41, scope: !875, inlinedAt: !881)
!930 = !DILocation(line: 68, column: 46, scope: !875, inlinedAt: !881)
!931 = !DILocation(line: 68, column: 34, scope: !875, inlinedAt: !881)
!932 = !DILocation(line: 68, column: 57, scope: !875, inlinedAt: !881)
!933 = !DILocation(line: 68, column: 69, scope: !875, inlinedAt: !881)
!934 = !DILocation(line: 68, column: 72, scope: !875, inlinedAt: !881)
!935 = !DILocation(line: 68, column: 79, scope: !875, inlinedAt: !881)
!936 = !DILocation(line: 68, column: 84, scope: !875, inlinedAt: !881)
!937 = !DILocation(line: 68, column: 99, scope: !875, inlinedAt: !881)
!938 = !DILocation(line: 68, column: 102, scope: !875, inlinedAt: !881)
!939 = !DILocation(line: 68, column: 109, scope: !875, inlinedAt: !881)
!940 = !DILocation(line: 68, column: 114, scope: !875, inlinedAt: !881)
!941 = !DILocation(line: 68, column: 94, scope: !875, inlinedAt: !881)
!942 = !DILocation(line: 68, column: 63, scope: !875, inlinedAt: !881)
!943 = !DILocation(line: 104, column: 82, scope: !882)
!944 = !DILocation(line: 102, column: 9, scope: !945)
!945 = !DILexicalBlockFile(scope: !872, file: !703, discriminator: 1)
!946 = !DILocation(line: 105, column: 16, scope: !947)
!947 = distinct !DILexicalBlock(scope: !882, file: !703, line: 104, column: 88)
!948 = !DILocation(line: 105, column: 9, scope: !947)
!949 = !DILocation(line: 107, column: 5, scope: !947)
!950 = !DILocation(line: 108, column: 40, scope: !951)
!951 = distinct !DILexicalBlock(scope: !882, file: !703, line: 107, column: 12)
!952 = !DILocation(line: 108, column: 15, scope: !951)
!953 = !DILocation(line: 108, column: 13, scope: !951)
!954 = !DILocation(line: 109, column: 13, scope: !955)
!955 = distinct !DILexicalBlock(scope: !951, file: !703, line: 109, column: 13)
!956 = !DILocation(line: 109, column: 17, scope: !955)
!957 = !DILocation(line: 109, column: 13, scope: !951)
!958 = !DILocation(line: 110, column: 20, scope: !955)
!959 = !DILocation(line: 110, column: 13, scope: !955)
!960 = !DILocation(line: 111, column: 26, scope: !951)
!961 = !DILocation(line: 111, column: 9, scope: !951)
!962 = !DILocation(line: 111, column: 12, scope: !951)
!963 = !DILocation(line: 111, column: 24, scope: !951)
!964 = !DILocation(line: 112, column: 9, scope: !951)
!965 = !DILocation(line: 112, column: 12, scope: !951)
!966 = !DILocation(line: 112, column: 29, scope: !951)
!967 = !DILocation(line: 115, column: 5, scope: !872)
!968 = !DILocation(line: 116, column: 1, scope: !872)
!969 = distinct !DISubprogram(name: "hevc_mp4toannexb_filter", scope: !703, file: !703, line: 118, type: !824, isLocal: true, isDefinition: true, scopeLine: 119, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!970 = !DILocalVariable(name: "g", arg: 1, scope: !971, file: !972, line: 95, type: !975)
!971 = distinct !DISubprogram(name: "bytestream2_peek_byte", scope: !972, file: !972, line: 95, type: !973, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!972 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!973 = !DISubroutineType(types: !974)
!974 = !{!690, !975}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !972, line: 35, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !972, line: 33, size: 192, align: 64, elements: !978)
!978 = !{!979, !980, !981}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !977, file: !972, line: 34, baseType: !678, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !977, file: !972, line: 34, baseType: !678, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !977, file: !972, line: 34, baseType: !678, size: 64, align: 64, offset: 128)
!982 = !DILocation(line: 95, column: 1197, scope: !971, inlinedAt: !983)
!983 = distinct !DILocation(line: 147, column: 22, scope: !984)
!984 = distinct !DILexicalBlock(scope: !969, file: !703, line: 139, column: 45)
!985 = !DILocation(line: 66, column: 98, scope: !875, inlinedAt: !986)
!986 = distinct !DILocation(line: 169, column: 80, scope: !984)
!987 = !DILocalVariable(name: "g", arg: 1, scope: !988, file: !972, line: 263, type: !975)
!988 = distinct !DISubprogram(name: "bytestream2_get_buffer", scope: !972, file: !972, line: 263, type: !989, isLocal: true, isDefinition: true, scopeLine: 266, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!989 = !DISubroutineType(types: !990)
!990 = !{!690, !975, !783, !690}
!991 = !DILocation(line: 263, column: 98, scope: !988, inlinedAt: !992)
!992 = distinct !DILocation(line: 170, column: 9, scope: !984)
!993 = !DILocalVariable(name: "dst", arg: 2, scope: !988, file: !972, line: 264, type: !783)
!994 = !DILocation(line: 264, column: 70, scope: !988, inlinedAt: !992)
!995 = !DILocalVariable(name: "size", arg: 3, scope: !988, file: !972, line: 265, type: !690)
!996 = !DILocation(line: 265, column: 74, scope: !988, inlinedAt: !992)
!997 = !DILocalVariable(name: "size2", scope: !988, file: !972, line: 267, type: !691)
!998 = !DILocation(line: 267, column: 9, scope: !988, inlinedAt: !992)
!999 = !DILocalVariable(name: "b", arg: 1, scope: !1000, file: !972, line: 95, type: !1003)
!1000 = distinct !DISubprogram(name: "bytestream_get_byte", scope: !972, file: !972, line: 95, type: !1001, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!690, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!1004 = !DILocation(line: 95, column: 95, scope: !1000, inlinedAt: !1005)
!1005 = distinct !DILocation(line: 95, column: 855, scope: !1006, inlinedAt: !1007)
!1006 = distinct !DISubprogram(name: "bytestream2_get_byteu", scope: !972, file: !972, line: 95, type: !973, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!1007 = distinct !DILocation(line: 95, column: 1073, scope: !1008, inlinedAt: !1010)
!1008 = !DILexicalBlockFile(scope: !1009, file: !972, discriminator: 2)
!1009 = distinct !DISubprogram(name: "bytestream2_get_byte", scope: !972, file: !972, line: 95, type: !973, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!1010 = distinct !DILocation(line: 145, column: 44, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !703, line: 144, column: 9)
!1012 = distinct !DILexicalBlock(scope: !984, file: !703, line: 144, column: 9)
!1013 = !DILocalVariable(name: "g", arg: 1, scope: !1006, file: !972, line: 95, type: !975)
!1014 = !DILocation(line: 95, column: 843, scope: !1006, inlinedAt: !1007)
!1015 = !DILocalVariable(name: "g", arg: 1, scope: !1009, file: !972, line: 95, type: !975)
!1016 = !DILocation(line: 95, column: 985, scope: !1009, inlinedAt: !1010)
!1017 = !DILocalVariable(name: "g", arg: 1, scope: !1018, file: !972, line: 154, type: !975)
!1018 = distinct !DISubprogram(name: "bytestream2_get_bytes_left", scope: !972, file: !972, line: 154, type: !973, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !873)
!1019 = !DILocation(line: 154, column: 102, scope: !1018, inlinedAt: !1020)
!1020 = distinct !DILocation(line: 139, column: 12, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !969, file: !703, discriminator: 1)
!1022 = !DILocalVariable(name: "g", arg: 1, scope: !1023, file: !972, line: 133, type: !975)
