; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--x86--vf_noise.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--x86--vf_noise.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.NoiseContext = type { %struct.AVClass*, i32, [4 x i32], [4 x i32], %struct.FilterParams, [4 x %struct.FilterParams], void (i8*, i8*, i8*, i32, i32)*, void (i8*, i8*, i32, i8**)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.FilterParams = type { i32, i32, %struct.AVLFG, i32, i8*, [4096 x [3 x i8*]], [4096 x i32], i32 }
%struct.AVLFG = type { [64 x i32], i32 }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_noise_init_x86(%struct.NoiseContext* %n) #0 !dbg !27 {
entry:
  %n.addr = alloca %struct.NoiseContext*, align 8
  %cpu_flags = alloca i32, align 4
  store %struct.NoiseContext* %n, %struct.NoiseContext** %n.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.NoiseContext** %n.addr, metadata !140, metadata !141), !dbg !142
  call void @llvm.dbg.declare(metadata i32* %cpu_flags, metadata !143, metadata !141), !dbg !144
  %call = call i32 @av_get_cpu_flags(), !dbg !145

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--x86--vf_noise.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !{i32 2, !"Dwarf Version", i32 4}
!25 = !{i32 2, !"Debug Info Version", i32 3}
!26 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!27 = distinct !DISubprogram(name: "ff_noise_init_x86", scope: !28, file: !28, line: 129, type: !29, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!28 = !DIFile(filename: "libavfilter/x86/vf_noise.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "NoiseContext", file: !33, line: 57, baseType: !34)
!33 = !DIFile(filename: "./libavfilter/vf_noise.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NoiseContext", file: !33, line: 48, size: 4599552, align: 64, elements: !35)
!35 = !{!36, !82, !83, !87, !88, !120, !122, !133}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !34, file: !33, line: 49, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !41)
!41 = !{!42, !46, !51, !55, !57, !58, !59, !63, !69, !71, !75}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !40, file: !4, line: 72, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !45)
!45 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !40, file: !4, line: 78, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DISubroutineType(types: !49)
!49 = !{!43, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !40, file: !4, line: 85, baseType: !52, size: 64, align: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !40, file: !4, line: 93, baseType: !56, size: 32, align: 32, offset: 192)
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !40, file: !4, line: 99, baseType: !56, size: 32, align: 32, offset: 224)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !40, file: !4, line: 108, baseType: !56, size: 32, align: 32, offset: 256)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !40, file: !4, line: 113, baseType: !60, size: 64, align: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!50, !50, !50}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !40, file: !4, line: 123, baseType: !64, size: 64, align: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!67, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !40, file: !4, line: 130, baseType: !70, size: 32, align: 32, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !40, file: !4, line: 136, baseType: !72, size: 64, align: 64, offset: 512)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!70, !50}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !40, file: !4, line: 142, baseType: !76, size: 64, align: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64, align: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!56, !79, !50, !43, !56}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "nb_planes", scope: !34, file: !33, line: 50, baseType: !56, size: 32, align: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "bytewidth", scope: !34, file: !33, line: 51, baseType: !84, size: 128, align: 32, offset: 96)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 128, align: 32, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 4)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !34, file: !33, line: 52, baseType: !84, size: 128, align: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "all", scope: !34, file: !33, line: 53, baseType: !89, size: 919808, align: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterParams", file: !33, line: 46, baseType: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FilterParams", file: !33, line: 37, size: 919808, align: 64, elements: !91)
!91 = !{!92, !93, !95, !105, !106, !111, !116, !119}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "strength", scope: !90, file: !33, line: 38, baseType: !56, size: 32, align: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !33, line: 39, baseType: !94, size: 32, align: 32, offset: 32)
!94 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "lfg", scope: !90, file: !33, line: 40, baseType: !96, size: 2080, align: 32, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVLFG", file: !97, line: 30, baseType: !98)
!97 = !DIFile(filename: "./libavutil/lfg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVLFG", file: !97, line: 27, size: 2080, align: 32, elements: !99)
!99 = !{!100, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !98, file: !97, line: 28, baseType: !101, size: 2048, align: 32)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 2048, align: 32, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !98, file: !97, line: 29, baseType: !56, size: 32, align: 32, offset: 2048)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !90, file: !33, line: 41, baseType: !56, size: 32, align: 32, offset: 2144)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "noise", scope: !90, file: !33, line: 42, baseType: !107, size: 64, align: 64, offset: 2176)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !109, line: 36, baseType: !110)
!109 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!110 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "prev_shift", scope: !90, file: !33, line: 43, baseType: !112, size: 786432, align: 64, offset: 2240)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 786432, align: 64, elements: !113)
!113 = !{!114, !115}
!114 = !DISubrange(count: 4096)
!115 = !DISubrange(count: 3)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "rand_shift", scope: !90, file: !33, line: 44, baseType: !117, size: 131072, align: 32, offset: 788672)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 131072, align: 32, elements: !118)
!118 = !{!114}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "rand_shift_init", scope: !90, file: !33, line: 45, baseType: !56, size: 32, align: 32, offset: 919744)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !34, file: !33, line: 54, baseType: !121, size: 3679232, align: 64, offset: 920192)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 3679232, align: 64, elements: !85)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "line_noise", scope: !34, file: !33, line: 55, baseType: !123, size: 64, align: 64, offset: 4599424)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{null, !126, !129, !131, !56, !56}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !109, line: 48, baseType: !128)
!128 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "line_noise_avg", scope: !34, file: !33, line: 56, baseType: !134, size: 64, align: 64, offset: 4599488)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{null, !126, !129, !56, !137}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!139 = !{}
!140 = !DILocalVariable(name: "n", arg: 1, scope: !27, file: !28, line: 129, type: !31)
!141 = !DIExpression()
!142 = !DILocation(line: 129, column: 60, scope: !27)
!143 = !DILocalVariable(name: "cpu_flags", scope: !27, file: !28, line: 132, type: !56)
!144 = !DILocation(line: 132, column: 9, scope: !27)
!145 = !DILocation(line: 132, column: 21, scope: !27)
!146 = !DILocation(line: 134, column: 17, scope: !147)
!147 = distinct !DILexicalBlock(scope: !27, file: !28, line: 134, column: 9)
!148 = !DILocation(line: 134, column: 28, scope: !147)
!149 = !DILocation(line: 134, column: 9, scope: !27)
!150 = !DILocation(line: 135, column: 9, scope: !151)
!151 = distinct !DILexicalBlock(scope: !147, file: !28, line: 134, column: 40)
!152 = !DILocation(line: 135, column: 12, scope: !151)
!153 = !DILocation(line: 135, column: 23, scope: !151)
!154 = !DILocation(line: 137, column: 9, scope: !151)
!155 = !DILocation(line: 137, column: 12, scope: !151)
!156 = !DILocation(line: 137, column: 27, scope: !151)
!157 = !DILocation(line: 139, column: 5, scope: !151)
!158 = !DILocation(line: 140, column: 17, scope: !159)
!159 = distinct !DILexicalBlock(scope: !27, file: !28, line: 140, column: 9)
!160 = !DILocation(line: 140, column: 28, scope: !159)
!161 = !DILocation(line: 140, column: 9, scope: !27)
!162 = !DILocation(line: 141, column: 9, scope: !163)
!163 = distinct !DILexicalBlock(scope: !159, file: !28, line: 140, column: 40)
!164 = !DILocation(line: 141, column: 12, scope: !163)
!165 = !DILocation(line: 141, column: 23, scope: !163)
!166 = !DILocation(line: 142, column: 5, scope: !163)
!167 = !DILocation(line: 144, column: 1, scope: !27)
!168 = distinct !DISubprogram(name: "line_noise_mmx", scope: !28, file: !28, line: 28, type: !124, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !139)
!169 = !DILocalVariable(name: "dst", arg: 1, scope: !168, file: !28, line: 28, type: !126)
!170 = !DILocation(line: 28, column: 37, scope: !168)
!171 = !DILocalVariable(name: "src", arg: 2, scope: !168, file: !28, line: 28, type: !129)
!172 = !DILocation(line: 28, column: 57, scope: !168)
!173 = !DILocalVariable(name: "noise", arg: 3, scope: !168, file: !28, line: 29, type: !131)
!174 = !DILocation(line: 29, column: 42, scope: !168)
!175 = !DILocalVariable(name: "len", arg: 4, scope: !168, file: !28, line: 29, type: !56)
!176 = !DILocation(line: 29, column: 53, scope: !168)
!177 = !DILocalVariable(name: "shift", arg: 5, scope: !168, file: !28, line: 29, type: !56)
!178 = !DILocation(line: 29, column: 62, scope: !168)
!179 = !DILocalVariable(name: "mmx_len", scope: !168, file: !28, line: 31, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "x86_reg", file: !181, line: 39, baseType: !182)
!181 = !DIFile(filename: "./libavutil/x86/asm.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !109, line: 40, baseType: !183)
!183 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!184 = !DILocation(line: 31, column: 13, scope: !168)
!185 = !DILocation(line: 31, column: 22, scope: !168)
!186 = !DILocation(line: 31, column: 26, scope: !168)
!187 = !DILocation(line: 32, column: 14, scope: !168)
!188 = !DILocation(line: 32, column: 11, scope: !168)
!189 = !DILocation(line: 49, column: 21, scope: !168)
!190 = !DILocation(line: 49, column: 25, scope: !168)
!191 = !DILocation(line: 49, column: 24, scope: !168)
