; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--takdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--takdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TAKMetaDataType", file: !939, line: 104, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavcodec/tak.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948}
!941 = !DIEnumerator(name: "TAK_METADATA_END", value: 0)
!942 = !DIEnumerator(name: "TAK_METADATA_STREAMINFO", value: 1)
!943 = !DIEnumerator(name: "TAK_METADATA_SEEKTABLE", value: 2)
!944 = !DIEnumerator(name: "TAK_METADATA_SIMPLE_WAVE_DATA", value: 3)
!945 = !DIEnumerator(name: "TAK_METADATA_ENCODER", value: 4)
!946 = !DIEnumerator(name: "TAK_METADATA_PADDING", value: 5)
!947 = !DIEnumerator(name: "TAK_METADATA_MD5", value: 6)
!948 = !DIEnumerator(name: "TAK_METADATA_LAST_FRAME", value: 7)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TAKCodecType", file: !939, line: 99, size: 32, align: 32, elements: !950)
!950 = !{!951, !952}
!951 = !DIEnumerator(name: "TAK_CODEC_MONO_STEREO", value: 2)
!952 = !DIEnumerator(name: "TAK_CODEC_MULTICHANNEL", value: 4)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !954, line: 49, size: 32, align: 32, elements: !955)
!954 = !DIFile(filename: "./libavutil/crc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!955 = !{!956, !957, !958, !959, !960, !961, !962, !963, !964}
!956 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!957 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!958 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!959 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!960 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!961 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!962 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!963 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!964 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!965 = !{!966, !967, !968, !971}
!966 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!967 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !969, line: 55, baseType: !970)
!969 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!970 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !974, line: 221, size: 32, align: 8, elements: !975)
!974 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !973, file: !974, line: 221, baseType: !977, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !969, line: 51, baseType: !966)
!978 = !{!979}
!979 = distinct !DIGlobalVariable(name: "ff_tak_demuxer", scope: !0, file: !980, line: 207, type: !981, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_tak_demuxer)
!980 = !DIFile(filename: "libavformat/takdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !983)
!983 = !{!984, !988, !989, !990, !991, !1001, !1083, !1084, !1086, !1087, !1088, !1102, !2204, !2205, !2206, !2210, !2214, !2215, !2216, !2220, !2221, !2222}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !982, file: !919, line: 638, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !982, file: !919, line: 645, baseType: !985, size: 64, align: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !982, file: !919, line: 652, baseType: !967, size: 32, align: 32, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !982, file: !919, line: 659, baseType: !985, size: 64, align: 64, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !982, file: !919, line: 661, baseType: !992, size: 64, align: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !997, line: 44, size: 64, align: 32, elements: !998)
!997 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !996, file: !997, line: 45, baseType: !3, size: 32, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !996, file: !997, line: 46, baseType: !966, size: 32, align: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !982, file: !919, line: 663, baseType: !1002, size: 64, align: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1013, !1042, !1043, !1044, !1045, !1049, !1055, !1057, !1061}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1005, file: !486, line: 72, baseType: !985, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1005, file: !486, line: 78, baseType: !1009, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!985, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1005, file: !486, line: 85, baseType: !1014, size: 64, align: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1038, !1039, !1040, !1041}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !464, line: 247, baseType: !985, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1016, file: !464, line: 253, baseType: !985, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1016, file: !464, line: 259, baseType: !967, size: 32, align: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1016, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1016, file: !464, line: 271, baseType: !1023, size: 64, align: 64, offset: 192)
!1023 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1016, file: !464, line: 265, size: 64, align: 64, elements: !1024)
!1024 = !{!1025, !1028, !1030, !1031}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1023, file: !464, line: 266, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !969, line: 40, baseType: !1027)
!1027 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1023, file: !464, line: 267, baseType: !1029, size: 64, align: 64)
!1029 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1023, file: !464, line: 268, baseType: !985, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1023, file: !464, line: 270, baseType: !1032, size: 64, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1033, line: 61, baseType: !1034)
!1033 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1033, line: 58, size: 64, align: 32, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1034, file: !1033, line: 59, baseType: !967, size: 32, align: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1034, file: !1033, line: 60, baseType: !967, size: 32, align: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1016, file: !464, line: 272, baseType: !1029, size: 64, align: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1016, file: !464, line: 273, baseType: !1029, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1016, file: !464, line: 275, baseType: !967, size: 32, align: 32, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1016, file: !464, line: 300, baseType: !985, size: 64, align: 64, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1005, file: !486, line: 93, baseType: !967, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1005, file: !486, line: 99, baseType: !967, size: 32, align: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1005, file: !486, line: 108, baseType: !967, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1005, file: !486, line: 113, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1012, !1012, !1012}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1005, file: !486, line: 123, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1005, file: !486, line: 130, baseType: !1056, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1005, file: !486, line: 136, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1056, !1012}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1005, file: !486, line: 142, baseType: !1062, size: 64, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!967, !1065, !1012, !985, !967}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1068)
!1068 = !{!1069, !1081, !1082}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1067, file: !464, line: 360, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1073, file: !464, line: 307, baseType: !985, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1073, file: !464, line: 313, baseType: !1029, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1073, file: !464, line: 313, baseType: !1029, size: 64, align: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1073, file: !464, line: 318, baseType: !1029, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1073, file: !464, line: 318, baseType: !1029, size: 64, align: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1073, file: !464, line: 323, baseType: !967, size: 32, align: 32, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1067, file: !464, line: 364, baseType: !967, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1067, file: !464, line: 368, baseType: !967, size: 32, align: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !982, file: !919, line: 670, baseType: !985, size: 64, align: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !919, line: 679, baseType: !1085, size: 64, align: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !982, file: !919, line: 684, baseType: !967, size: 32, align: 32, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !982, file: !919, line: 689, baseType: !967, size: 32, align: 32, offset: 544)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !982, file: !919, line: 696, baseType: !1089, size: 64, align: 64, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!967, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1100, !1101}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1094, file: !919, line: 449, baseType: !985, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1094, file: !919, line: 450, baseType: !1098, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1094, file: !919, line: 451, baseType: !967, size: 32, align: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1094, file: !919, line: 452, baseType: !985, size: 64, align: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !982, file: !919, line: 703, baseType: !1103, size: 64, align: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!967, !1106}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1301, !1302, !1367, !1368, !1369, !2061, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2115, !2116, !2117, !2118, !2119, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2170, !2171, !2174, !2175, !2176, !2177, !2178, !2179, !2181, !2182, !2183, !2184, !2192, !2193, !2197, !2201, !2202, !2203}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1107, file: !919, line: 1342, baseType: !1002, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1107, file: !919, line: 1349, baseType: !1085, size: 64, align: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1107, file: !919, line: 1356, baseType: !1112, size: 64, align: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1168, !1169, !1173, !1177, !1182, !1188, !1276, !1282, !1288, !1289, !1290, !1291, !1295}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1113, file: !919, line: 498, baseType: !985, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1113, file: !919, line: 504, baseType: !985, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1113, file: !919, line: 505, baseType: !985, size: 64, align: 64, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1113, file: !919, line: 506, baseType: !985, size: 64, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1113, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1113, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1113, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !919, line: 517, baseType: !967, size: 32, align: 32, offset: 352)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1113, file: !919, line: 523, baseType: !992, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1113, file: !919, line: 526, baseType: !1002, size: 64, align: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1113, file: !919, line: 535, baseType: !1112, size: 64, align: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1113, file: !919, line: 539, baseType: !967, size: 32, align: 32, offset: 576)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1113, file: !919, line: 541, baseType: !1103, size: 64, align: 64, offset: 640)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1113, file: !919, line: 549, baseType: !1129, size: 64, align: 64, offset: 704)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!967, !1106, !1132}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1135)
!1135 = !{!1136, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1164, !1165, !1166, !1167}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1134, file: !4, line: 1451, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1139, line: 94, baseType: !1140)
!1139 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1139, line: 81, size: 192, align: 64, elements: !1141)
!1141 = !{!1142, !1146, !1149}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1140, file: !1139, line: 82, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1139, line: 73, baseType: !1145)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1139, line: 73, flags: DIFlagFwdDecl)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1140, file: !1139, line: 89, baseType: !1147, size: 64, align: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !969, line: 48, baseType: !1099)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !1139, line: 93, baseType: !967, size: 32, align: 32, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1134, file: !4, line: 1461, baseType: !1026, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1134, file: !4, line: 1467, baseType: !1026, size: 64, align: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !4, line: 1468, baseType: !1147, size: 64, align: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !4, line: 1469, baseType: !967, size: 32, align: 32, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1134, file: !4, line: 1470, baseType: !967, size: 32, align: 32, offset: 288)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1134, file: !4, line: 1474, baseType: !967, size: 32, align: 32, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1134, file: !4, line: 1479, baseType: !1157, size: 64, align: 64, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1160)
!1160 = !{!1161, !1162, !1163}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !4, line: 1412, baseType: !1147, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !4, line: 1413, baseType: !967, size: 32, align: 32, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1159, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1134, file: !4, line: 1480, baseType: !967, size: 32, align: 32, offset: 448)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1134, file: !4, line: 1486, baseType: !1026, size: 64, align: 64, offset: 512)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1134, file: !4, line: 1488, baseType: !1026, size: 64, align: 64, offset: 576)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1134, file: !4, line: 1497, baseType: !1026, size: 64, align: 64, offset: 640)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1113, file: !919, line: 550, baseType: !1103, size: 64, align: 64, offset: 768)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1113, file: !919, line: 554, baseType: !1170, size: 64, align: 64, offset: 832)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!967, !1106, !1132, !1132, !967}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1113, file: !919, line: 563, baseType: !1174, size: 64, align: 64, offset: 896)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!967, !3, !967}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1113, file: !919, line: 565, baseType: !1178, size: 64, align: 64, offset: 960)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !1106, !967, !1181, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1113, file: !919, line: 570, baseType: !1183, size: 64, align: 64, offset: 1024)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!967, !1106, !967, !1012, !1186}
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1187, line: 216, baseType: !970)
!1187 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1113, file: !919, line: 581, baseType: !1189, size: 64, align: 64, offset: 1088)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!967, !1106, !967, !1192, !966}
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1196)
!1196 = !{!1197, !1201, !1203, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1230, !1232, !1233, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1195, file: !548, line: 282, baseType: !1198, size: 512, align: 64)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 512, align: 64, elements: !1199)
!1199 = !{!1200}
!1200 = !DISubrange(count: 8)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1195, file: !548, line: 299, baseType: !1202, size: 256, align: 32, offset: 512)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 256, align: 32, elements: !1199)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1195, file: !548, line: 315, baseType: !1204, size: 64, align: 64, offset: 768)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1195, file: !548, line: 326, baseType: !967, size: 32, align: 32, offset: 832)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1195, file: !548, line: 326, baseType: !967, size: 32, align: 32, offset: 864)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1195, file: !548, line: 334, baseType: !967, size: 32, align: 32, offset: 896)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1195, file: !548, line: 341, baseType: !967, size: 32, align: 32, offset: 928)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1195, file: !548, line: 346, baseType: !967, size: 32, align: 32, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1195, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1195, file: !548, line: 356, baseType: !1032, size: 64, align: 32, offset: 1024)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1195, file: !548, line: 361, baseType: !1026, size: 64, align: 64, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1195, file: !548, line: 369, baseType: !1026, size: 64, align: 64, offset: 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1195, file: !548, line: 377, baseType: !1026, size: 64, align: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1195, file: !548, line: 382, baseType: !967, size: 32, align: 32, offset: 1280)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1195, file: !548, line: 386, baseType: !967, size: 32, align: 32, offset: 1312)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1195, file: !548, line: 391, baseType: !967, size: 32, align: 32, offset: 1344)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1195, file: !548, line: 396, baseType: !1012, size: 64, align: 64, offset: 1408)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1195, file: !548, line: 403, baseType: !1220, size: 512, align: 64, offset: 1472)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 512, align: 64, elements: !1199)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1195, file: !548, line: 410, baseType: !967, size: 32, align: 32, offset: 1984)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1195, file: !548, line: 415, baseType: !967, size: 32, align: 32, offset: 2016)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1195, file: !548, line: 420, baseType: !967, size: 32, align: 32, offset: 2048)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1195, file: !548, line: 425, baseType: !967, size: 32, align: 32, offset: 2080)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1195, file: !548, line: 435, baseType: !1026, size: 64, align: 64, offset: 2112)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1195, file: !548, line: 440, baseType: !967, size: 32, align: 32, offset: 2176)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1195, file: !548, line: 445, baseType: !968, size: 64, align: 64, offset: 2240)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1195, file: !548, line: 459, baseType: !1229, size: 512, align: 64, offset: 2304)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 512, align: 64, elements: !1199)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1195, file: !548, line: 473, baseType: !1231, size: 64, align: 64, offset: 2816)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1195, file: !548, line: 477, baseType: !967, size: 32, align: 32, offset: 2880)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1195, file: !548, line: 479, baseType: !1234, size: 64, align: 64, offset: 2944)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1247}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1237, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !548, line: 203, baseType: !1147, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1237, file: !548, line: 204, baseType: !967, size: 32, align: 32, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1237, file: !548, line: 205, baseType: !1243, size: 64, align: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1245, line: 86, baseType: !1246)
!1245 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1245, line: 86, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1237, file: !548, line: 206, baseType: !1137, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1195, file: !548, line: 480, baseType: !967, size: 32, align: 32, offset: 3008)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1195, file: !548, line: 505, baseType: !967, size: 32, align: 32, offset: 3040)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1195, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1195, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1195, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1195, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1195, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1195, file: !548, line: 532, baseType: !1026, size: 64, align: 64, offset: 3264)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1195, file: !548, line: 539, baseType: !1026, size: 64, align: 64, offset: 3328)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1195, file: !548, line: 547, baseType: !1026, size: 64, align: 64, offset: 3392)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1195, file: !548, line: 554, baseType: !1243, size: 64, align: 64, offset: 3456)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1195, file: !548, line: 563, baseType: !967, size: 32, align: 32, offset: 3520)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1195, file: !548, line: 572, baseType: !967, size: 32, align: 32, offset: 3552)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1195, file: !548, line: 581, baseType: !967, size: 32, align: 32, offset: 3584)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1195, file: !548, line: 588, baseType: !1263, size: 64, align: 64, offset: 3648)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !969, line: 36, baseType: !1265)
!1265 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1195, file: !548, line: 593, baseType: !967, size: 32, align: 32, offset: 3712)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1195, file: !548, line: 596, baseType: !967, size: 32, align: 32, offset: 3744)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1195, file: !548, line: 599, baseType: !1137, size: 64, align: 64, offset: 3776)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1195, file: !548, line: 605, baseType: !1137, size: 64, align: 64, offset: 3840)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1195, file: !548, line: 616, baseType: !1137, size: 64, align: 64, offset: 3904)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1195, file: !548, line: 626, baseType: !1186, size: 64, align: 64, offset: 3968)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1195, file: !548, line: 627, baseType: !1186, size: 64, align: 64, offset: 4032)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1195, file: !548, line: 628, baseType: !1186, size: 64, align: 64, offset: 4096)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1195, file: !548, line: 629, baseType: !1186, size: 64, align: 64, offset: 4160)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1195, file: !548, line: 645, baseType: !1137, size: 64, align: 64, offset: 4224)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1113, file: !919, line: 587, baseType: !1277, size: 64, align: 64, offset: 1152)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!967, !1106, !1280}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1113, file: !919, line: 592, baseType: !1283, size: 64, align: 64, offset: 1216)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!967, !1106, !1286}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1113, file: !919, line: 597, baseType: !1283, size: 64, align: 64, offset: 1280)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1113, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1113, file: !919, line: 608, baseType: !1103, size: 64, align: 64, offset: 1408)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1113, file: !919, line: 617, baseType: !1292, size: 64, align: 64, offset: 1472)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{null, !1106}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1113, file: !919, line: 623, baseType: !1296, size: 64, align: 64, offset: 1536)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!967, !1106, !1299}
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1107, file: !919, line: 1365, baseType: !1012, size: 64, align: 64, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1107, file: !919, line: 1379, baseType: !1303, size: 64, align: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310, !1311, !1312, !1313, !1317, !1318, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1334, !1335, !1339, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1357, !1358, !1359, !1360, !1364, !1365, !1366}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1305, file: !650, line: 174, baseType: !1002, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1305, file: !650, line: 226, baseType: !1098, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1305, file: !650, line: 227, baseType: !967, size: 32, align: 32, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1305, file: !650, line: 228, baseType: !1098, size: 64, align: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1305, file: !650, line: 229, baseType: !1098, size: 64, align: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1305, file: !650, line: 233, baseType: !1012, size: 64, align: 64, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1305, file: !650, line: 235, baseType: !1314, size: 64, align: 64, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!967, !1012, !1147, !967}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1305, file: !650, line: 236, baseType: !1314, size: 64, align: 64, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1305, file: !650, line: 237, baseType: !1319, size: 64, align: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!1026, !1012, !1026, !967}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1305, file: !650, line: 238, baseType: !1026, size: 64, align: 64, offset: 576)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1305, file: !650, line: 239, baseType: !967, size: 32, align: 32, offset: 640)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1305, file: !650, line: 240, baseType: !967, size: 32, align: 32, offset: 672)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1305, file: !650, line: 241, baseType: !967, size: 32, align: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1305, file: !650, line: 242, baseType: !970, size: 64, align: 64, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1305, file: !650, line: 243, baseType: !1098, size: 64, align: 64, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1305, file: !650, line: 244, baseType: !1329, size: 64, align: 64, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!970, !970, !1332, !966}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1148)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1305, file: !650, line: 245, baseType: !967, size: 32, align: 32, offset: 960)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1305, file: !650, line: 249, baseType: !1336, size: 64, align: 64, offset: 1024)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!967, !1012, !967}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1305, file: !650, line: 255, baseType: !1340, size: 64, align: 64, offset: 1088)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!1026, !1012, !967, !1026, !967}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1305, file: !650, line: 260, baseType: !967, size: 32, align: 32, offset: 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1305, file: !650, line: 266, baseType: !1026, size: 64, align: 64, offset: 1216)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1305, file: !650, line: 273, baseType: !967, size: 32, align: 32, offset: 1280)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1305, file: !650, line: 279, baseType: !1026, size: 64, align: 64, offset: 1344)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1305, file: !650, line: 285, baseType: !967, size: 32, align: 32, offset: 1408)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1305, file: !650, line: 291, baseType: !967, size: 32, align: 32, offset: 1440)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1305, file: !650, line: 298, baseType: !967, size: 32, align: 32, offset: 1472)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1305, file: !650, line: 304, baseType: !967, size: 32, align: 32, offset: 1504)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1305, file: !650, line: 309, baseType: !985, size: 64, align: 64, offset: 1536)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1305, file: !650, line: 314, baseType: !985, size: 64, align: 64, offset: 1600)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1305, file: !650, line: 319, baseType: !1354, size: 64, align: 64, offset: 1664)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{!967, !1012, !1147, !967, !649, !1026}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1305, file: !650, line: 326, baseType: !967, size: 32, align: 32, offset: 1728)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1305, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1305, file: !650, line: 332, baseType: !1026, size: 64, align: 64, offset: 1792)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1305, file: !650, line: 338, baseType: !1361, size: 64, align: 64, offset: 1856)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!967, !1012}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1305, file: !650, line: 340, baseType: !1026, size: 64, align: 64, offset: 1920)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1305, file: !650, line: 346, baseType: !1098, size: 64, align: 64, offset: 1984)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1305, file: !650, line: 351, baseType: !967, size: 32, align: 32, offset: 2048)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1107, file: !919, line: 1386, baseType: !967, size: 32, align: 32, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1107, file: !919, line: 1393, baseType: !966, size: 32, align: 32, offset: 352)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1107, file: !919, line: 1405, baseType: !1370, size: 64, align: 64, offset: 384)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1373)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1374)
!1374 = !{!1375, !1376, !1377, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1847, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1947, !1953, !1954, !1958, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1990, !1991, !1992, !1993, !1994, !1995}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1373, file: !919, line: 866, baseType: !967, size: 32, align: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1373, file: !919, line: 872, baseType: !967, size: 32, align: 32, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1373, file: !919, line: 878, baseType: !1378, size: 64, align: 64, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1381)
!1381 = !{!1382, !1383, !1384, !1385, !1522, !1523, !1524, !1525, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1551, !1555, !1556, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1735, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1380, file: !4, line: 1561, baseType: !1002, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1380, file: !4, line: 1562, baseType: !967, size: 32, align: 32, offset: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1380, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1380, file: !4, line: 1565, baseType: !1386, size: 64, align: 64, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1389)
!1389 = !{!1390, !1391, !1392, !1393, !1394, !1395, !1398, !1401, !1404, !1407, !1410, !1411, !1412, !1420, !1421, !1422, !1424, !1428, !1434, !1439, !1443, !1444, !1487, !1494, !1498, !1499, !1503, !1507, !1511, !1515, !1516, !1517}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1388, file: !4, line: 3475, baseType: !985, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1388, file: !4, line: 3480, baseType: !985, size: 64, align: 64, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1388, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1388, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1388, file: !4, line: 3487, baseType: !967, size: 32, align: 32, offset: 192)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1388, file: !4, line: 3488, baseType: !1396, size: 64, align: 64, offset: 256)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1388, file: !4, line: 3489, baseType: !1399, size: 64, align: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1388, file: !4, line: 3490, baseType: !1402, size: 64, align: 64, offset: 384)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1388, file: !4, line: 3491, baseType: !1405, size: 64, align: 64, offset: 448)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1388, file: !4, line: 3492, baseType: !1408, size: 64, align: 64, offset: 512)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1388, file: !4, line: 3493, baseType: !1148, size: 8, align: 8, offset: 576)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1388, file: !4, line: 3494, baseType: !1002, size: 64, align: 64, offset: 640)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1388, file: !4, line: 3495, baseType: !1413, size: 64, align: 64, offset: 704)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1415)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1416)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1417)
!1417 = !{!1418, !1419}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1416, file: !4, line: 3402, baseType: !967, size: 32, align: 32)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1416, file: !4, line: 3403, baseType: !985, size: 64, align: 64, offset: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1388, file: !4, line: 3507, baseType: !985, size: 64, align: 64, offset: 768)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1388, file: !4, line: 3516, baseType: !967, size: 32, align: 32, offset: 832)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1388, file: !4, line: 3517, baseType: !1423, size: 64, align: 64, offset: 896)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1388, file: !4, line: 3527, baseType: !1425, size: 64, align: 64, offset: 960)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!967, !1378}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1388, file: !4, line: 3535, baseType: !1429, size: 64, align: 64, offset: 1024)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!967, !1378, !1432}
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1379)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1388, file: !4, line: 3541, baseType: !1435, size: 64, align: 64, offset: 1088)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1437)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1438)
!1438 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1388, file: !4, line: 3549, baseType: !1440, size: 64, align: 64, offset: 1152)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{null, !1423}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1388, file: !4, line: 3551, baseType: !1425, size: 64, align: 64, offset: 1216)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1388, file: !4, line: 3552, baseType: !1445, size: 64, align: 64, offset: 1280)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!967, !1378, !1147, !967, !1448}
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1451)
!1451 = !{!1452, !1455, !1456, !1457, !1458, !1486}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1450, file: !4, line: 3921, baseType: !1453, size: 16, align: 16)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !969, line: 49, baseType: !1454)
!1454 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1450, file: !4, line: 3922, baseType: !977, size: 32, align: 32, offset: 32)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1450, file: !4, line: 3923, baseType: !977, size: 32, align: 32, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1450, file: !4, line: 3924, baseType: !966, size: 32, align: 32, offset: 96)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1450, file: !4, line: 3925, baseType: !1459, size: 64, align: 64, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1463)
!1463 = !{!1464, !1465, !1466, !1467, !1468, !1469, !1475, !1479, !1481, !1482, !1484, !1485}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1462, file: !4, line: 3886, baseType: !967, size: 32, align: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1462, file: !4, line: 3887, baseType: !967, size: 32, align: 32, offset: 32)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1462, file: !4, line: 3888, baseType: !967, size: 32, align: 32, offset: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1462, file: !4, line: 3889, baseType: !967, size: 32, align: 32, offset: 96)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1462, file: !4, line: 3890, baseType: !967, size: 32, align: 32, offset: 128)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1462, file: !4, line: 3897, baseType: !1470, size: 768, align: 64, offset: 192)
!1470 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1471)
!1471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1472)
!1472 = !{!1473, !1474}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1471, file: !4, line: 3855, baseType: !1198, size: 512, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1471, file: !4, line: 3857, baseType: !1202, size: 256, align: 32, offset: 512)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1462, file: !4, line: 3903, baseType: !1476, size: 256, align: 64, offset: 960)
!1476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 256, align: 64, elements: !1477)
!1477 = !{!1478}
!1478 = !DISubrange(count: 4)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1462, file: !4, line: 3904, baseType: !1480, size: 128, align: 32, offset: 1216)
!1480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 128, align: 32, elements: !1477)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1462, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1462, file: !4, line: 3908, baseType: !1483, size: 64, align: 64, offset: 1408)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1462, file: !4, line: 3915, baseType: !1483, size: 64, align: 64, offset: 1472)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1462, file: !4, line: 3917, baseType: !967, size: 32, align: 32, offset: 1536)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1450, file: !4, line: 3926, baseType: !1026, size: 64, align: 64, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1388, file: !4, line: 3564, baseType: !1488, size: 64, align: 64, offset: 1344)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!967, !1378, !1132, !1491, !1493}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1388, file: !4, line: 3566, baseType: !1495, size: 64, align: 64, offset: 1408)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!967, !1378, !1012, !1493, !1132}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1388, file: !4, line: 3567, baseType: !1425, size: 64, align: 64, offset: 1472)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1388, file: !4, line: 3576, baseType: !1500, size: 64, align: 64, offset: 1536)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!967, !1378, !1491}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1388, file: !4, line: 3577, baseType: !1504, size: 64, align: 64, offset: 1600)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!967, !1378, !1132}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1388, file: !4, line: 3584, baseType: !1508, size: 64, align: 64, offset: 1664)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!967, !1378, !1193}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1388, file: !4, line: 3589, baseType: !1512, size: 64, align: 64, offset: 1728)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{null, !1378}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1388, file: !4, line: 3594, baseType: !967, size: 32, align: 32, offset: 1792)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1388, file: !4, line: 3600, baseType: !985, size: 64, align: 64, offset: 1856)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1388, file: !4, line: 3609, baseType: !1518, size: 64, align: 64, offset: 1920)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1521)
!1521 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1380, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1380, file: !4, line: 1581, baseType: !966, size: 32, align: 32, offset: 224)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1380, file: !4, line: 1583, baseType: !1012, size: 64, align: 64, offset: 256)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1380, file: !4, line: 1591, baseType: !1526, size: 64, align: 64, offset: 320)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1380, file: !4, line: 1598, baseType: !1012, size: 64, align: 64, offset: 384)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1380, file: !4, line: 1606, baseType: !1026, size: 64, align: 64, offset: 448)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1380, file: !4, line: 1614, baseType: !967, size: 32, align: 32, offset: 512)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1380, file: !4, line: 1622, baseType: !967, size: 32, align: 32, offset: 544)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1380, file: !4, line: 1628, baseType: !967, size: 32, align: 32, offset: 576)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1380, file: !4, line: 1636, baseType: !967, size: 32, align: 32, offset: 608)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1380, file: !4, line: 1643, baseType: !967, size: 32, align: 32, offset: 640)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1380, file: !4, line: 1657, baseType: !1147, size: 64, align: 64, offset: 704)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1380, file: !4, line: 1658, baseType: !967, size: 32, align: 32, offset: 768)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1380, file: !4, line: 1679, baseType: !1032, size: 64, align: 32, offset: 800)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1380, file: !4, line: 1688, baseType: !967, size: 32, align: 32, offset: 864)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1380, file: !4, line: 1712, baseType: !967, size: 32, align: 32, offset: 896)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1380, file: !4, line: 1729, baseType: !967, size: 32, align: 32, offset: 928)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1380, file: !4, line: 1729, baseType: !967, size: 32, align: 32, offset: 960)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1380, file: !4, line: 1744, baseType: !967, size: 32, align: 32, offset: 992)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1380, file: !4, line: 1744, baseType: !967, size: 32, align: 32, offset: 1024)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1380, file: !4, line: 1751, baseType: !967, size: 32, align: 32, offset: 1056)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1380, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1380, file: !4, line: 1791, baseType: !1547, size: 64, align: 64, offset: 1152)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DISubroutineType(types: !1549)
!1549 = !{null, !1550, !1491, !1493, !967, !967, !967}
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1380, file: !4, line: 1808, baseType: !1552, size: 64, align: 64, offset: 1216)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!667, !1550, !1399}
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1380, file: !4, line: 1816, baseType: !967, size: 32, align: 32, offset: 1280)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1380, file: !4, line: 1825, baseType: !1557, size: 32, align: 32, offset: 1312)
!1557 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1380, file: !4, line: 1830, baseType: !967, size: 32, align: 32, offset: 1344)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1380, file: !4, line: 1838, baseType: !1557, size: 32, align: 32, offset: 1376)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1380, file: !4, line: 1846, baseType: !967, size: 32, align: 32, offset: 1408)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1380, file: !4, line: 1851, baseType: !967, size: 32, align: 32, offset: 1440)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1380, file: !4, line: 1861, baseType: !1557, size: 32, align: 32, offset: 1472)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1380, file: !4, line: 1868, baseType: !1557, size: 32, align: 32, offset: 1504)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1380, file: !4, line: 1875, baseType: !1557, size: 32, align: 32, offset: 1536)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1380, file: !4, line: 1882, baseType: !1557, size: 32, align: 32, offset: 1568)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1380, file: !4, line: 1889, baseType: !1557, size: 32, align: 32, offset: 1600)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1380, file: !4, line: 1896, baseType: !1557, size: 32, align: 32, offset: 1632)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1380, file: !4, line: 1903, baseType: !1557, size: 32, align: 32, offset: 1664)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1380, file: !4, line: 1910, baseType: !967, size: 32, align: 32, offset: 1696)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1380, file: !4, line: 1915, baseType: !967, size: 32, align: 32, offset: 1728)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1380, file: !4, line: 1926, baseType: !1493, size: 64, align: 64, offset: 1792)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1380, file: !4, line: 1935, baseType: !1032, size: 64, align: 32, offset: 1856)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1380, file: !4, line: 1942, baseType: !967, size: 32, align: 32, offset: 1920)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1380, file: !4, line: 1948, baseType: !967, size: 32, align: 32, offset: 1952)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1380, file: !4, line: 1954, baseType: !967, size: 32, align: 32, offset: 1984)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1380, file: !4, line: 1960, baseType: !967, size: 32, align: 32, offset: 2016)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1380, file: !4, line: 1984, baseType: !967, size: 32, align: 32, offset: 2048)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1380, file: !4, line: 1991, baseType: !967, size: 32, align: 32, offset: 2080)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1380, file: !4, line: 1996, baseType: !967, size: 32, align: 32, offset: 2112)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1380, file: !4, line: 2004, baseType: !967, size: 32, align: 32, offset: 2144)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1380, file: !4, line: 2011, baseType: !967, size: 32, align: 32, offset: 2176)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1380, file: !4, line: 2018, baseType: !967, size: 32, align: 32, offset: 2208)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1380, file: !4, line: 2027, baseType: !967, size: 32, align: 32, offset: 2240)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1380, file: !4, line: 2034, baseType: !967, size: 32, align: 32, offset: 2272)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1380, file: !4, line: 2044, baseType: !967, size: 32, align: 32, offset: 2304)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1380, file: !4, line: 2054, baseType: !1587, size: 64, align: 64, offset: 2368)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1380, file: !4, line: 2061, baseType: !1587, size: 64, align: 64, offset: 2432)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1380, file: !4, line: 2066, baseType: !967, size: 32, align: 32, offset: 2496)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1380, file: !4, line: 2070, baseType: !967, size: 32, align: 32, offset: 2528)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1380, file: !4, line: 2078, baseType: !967, size: 32, align: 32, offset: 2560)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1380, file: !4, line: 2085, baseType: !967, size: 32, align: 32, offset: 2592)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1380, file: !4, line: 2092, baseType: !967, size: 32, align: 32, offset: 2624)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1380, file: !4, line: 2099, baseType: !967, size: 32, align: 32, offset: 2656)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1380, file: !4, line: 2106, baseType: !967, size: 32, align: 32, offset: 2688)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1380, file: !4, line: 2113, baseType: !967, size: 32, align: 32, offset: 2720)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1380, file: !4, line: 2120, baseType: !967, size: 32, align: 32, offset: 2752)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1380, file: !4, line: 2125, baseType: !967, size: 32, align: 32, offset: 2784)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1380, file: !4, line: 2133, baseType: !967, size: 32, align: 32, offset: 2816)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1380, file: !4, line: 2140, baseType: !967, size: 32, align: 32, offset: 2848)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1380, file: !4, line: 2145, baseType: !967, size: 32, align: 32, offset: 2880)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1380, file: !4, line: 2153, baseType: !967, size: 32, align: 32, offset: 2912)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1380, file: !4, line: 2158, baseType: !967, size: 32, align: 32, offset: 2944)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1380, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1380, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1380, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1380, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1380, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1380, file: !4, line: 2203, baseType: !967, size: 32, align: 32, offset: 3136)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1380, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1380, file: !4, line: 2212, baseType: !967, size: 32, align: 32, offset: 3200)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1380, file: !4, line: 2213, baseType: !967, size: 32, align: 32, offset: 3232)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1380, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1380, file: !4, line: 2232, baseType: !967, size: 32, align: 32, offset: 3296)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1380, file: !4, line: 2243, baseType: !967, size: 32, align: 32, offset: 3328)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1380, file: !4, line: 2249, baseType: !967, size: 32, align: 32, offset: 3360)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1380, file: !4, line: 2256, baseType: !967, size: 32, align: 32, offset: 3392)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1380, file: !4, line: 2263, baseType: !968, size: 64, align: 64, offset: 3456)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1380, file: !4, line: 2270, baseType: !968, size: 64, align: 64, offset: 3520)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1380, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1380, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1380, file: !4, line: 2367, baseType: !1623, size: 64, align: 64, offset: 3648)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!967, !1550, !1193, !967}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1380, file: !4, line: 2383, baseType: !967, size: 32, align: 32, offset: 3712)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1380, file: !4, line: 2386, baseType: !1557, size: 32, align: 32, offset: 3744)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1380, file: !4, line: 2387, baseType: !1557, size: 32, align: 32, offset: 3776)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1380, file: !4, line: 2394, baseType: !967, size: 32, align: 32, offset: 3808)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1380, file: !4, line: 2401, baseType: !967, size: 32, align: 32, offset: 3840)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1380, file: !4, line: 2408, baseType: !967, size: 32, align: 32, offset: 3872)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1380, file: !4, line: 2415, baseType: !967, size: 32, align: 32, offset: 3904)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1380, file: !4, line: 2422, baseType: !967, size: 32, align: 32, offset: 3936)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1380, file: !4, line: 2423, baseType: !1635, size: 64, align: 64, offset: 3968)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1637, file: !4, line: 827, baseType: !967, size: 32, align: 32)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1637, file: !4, line: 828, baseType: !967, size: 32, align: 32, offset: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1637, file: !4, line: 829, baseType: !967, size: 32, align: 32, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1637, file: !4, line: 830, baseType: !1557, size: 32, align: 32, offset: 96)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1380, file: !4, line: 2430, baseType: !1026, size: 64, align: 64, offset: 4032)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1380, file: !4, line: 2437, baseType: !1026, size: 64, align: 64, offset: 4096)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1380, file: !4, line: 2444, baseType: !1557, size: 32, align: 32, offset: 4160)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1380, file: !4, line: 2451, baseType: !1557, size: 32, align: 32, offset: 4192)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1380, file: !4, line: 2458, baseType: !967, size: 32, align: 32, offset: 4224)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1380, file: !4, line: 2469, baseType: !967, size: 32, align: 32, offset: 4256)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1380, file: !4, line: 2475, baseType: !967, size: 32, align: 32, offset: 4288)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1380, file: !4, line: 2481, baseType: !967, size: 32, align: 32, offset: 4320)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1380, file: !4, line: 2485, baseType: !967, size: 32, align: 32, offset: 4352)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1380, file: !4, line: 2489, baseType: !967, size: 32, align: 32, offset: 4384)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1380, file: !4, line: 2493, baseType: !967, size: 32, align: 32, offset: 4416)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1380, file: !4, line: 2501, baseType: !967, size: 32, align: 32, offset: 4448)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1380, file: !4, line: 2506, baseType: !967, size: 32, align: 32, offset: 4480)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1380, file: !4, line: 2510, baseType: !967, size: 32, align: 32, offset: 4512)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1380, file: !4, line: 2514, baseType: !1026, size: 64, align: 64, offset: 4544)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1380, file: !4, line: 2528, baseType: !1659, size: 64, align: 64, offset: 4608)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{null, !1550, !1012, !967, !967}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1380, file: !4, line: 2534, baseType: !967, size: 32, align: 32, offset: 4672)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1380, file: !4, line: 2545, baseType: !967, size: 32, align: 32, offset: 4704)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1380, file: !4, line: 2547, baseType: !967, size: 32, align: 32, offset: 4736)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1380, file: !4, line: 2549, baseType: !967, size: 32, align: 32, offset: 4768)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1380, file: !4, line: 2551, baseType: !967, size: 32, align: 32, offset: 4800)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1380, file: !4, line: 2553, baseType: !967, size: 32, align: 32, offset: 4832)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1380, file: !4, line: 2555, baseType: !967, size: 32, align: 32, offset: 4864)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1380, file: !4, line: 2557, baseType: !967, size: 32, align: 32, offset: 4896)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1380, file: !4, line: 2559, baseType: !967, size: 32, align: 32, offset: 4928)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1380, file: !4, line: 2563, baseType: !967, size: 32, align: 32, offset: 4960)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1380, file: !4, line: 2571, baseType: !1483, size: 64, align: 64, offset: 4992)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1380, file: !4, line: 2579, baseType: !1483, size: 64, align: 64, offset: 5056)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1380, file: !4, line: 2586, baseType: !967, size: 32, align: 32, offset: 5120)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1380, file: !4, line: 2615, baseType: !967, size: 32, align: 32, offset: 5152)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1380, file: !4, line: 2627, baseType: !967, size: 32, align: 32, offset: 5184)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1380, file: !4, line: 2637, baseType: !967, size: 32, align: 32, offset: 5216)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1380, file: !4, line: 2681, baseType: !967, size: 32, align: 32, offset: 5248)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1380, file: !4, line: 2709, baseType: !1026, size: 64, align: 64, offset: 5312)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1380, file: !4, line: 2716, baseType: !1681, size: 64, align: 64, offset: 5376)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688, !1689, !1690, !1691, !1695, !1699, !1700, !1701, !1702, !1708, !1709, !1710, !1711, !1712}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1683, file: !4, line: 3642, baseType: !985, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1683, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1683, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1683, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1683, file: !4, line: 3669, baseType: !967, size: 32, align: 32, offset: 160)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1683, file: !4, line: 3682, baseType: !1508, size: 64, align: 64, offset: 192)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1683, file: !4, line: 3698, baseType: !1692, size: 64, align: 64, offset: 256)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!967, !1378, !1332, !977}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1683, file: !4, line: 3712, baseType: !1696, size: 64, align: 64, offset: 320)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!967, !1378, !967, !1332, !977}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1683, file: !4, line: 3726, baseType: !1692, size: 64, align: 64, offset: 384)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1683, file: !4, line: 3737, baseType: !1425, size: 64, align: 64, offset: 448)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1683, file: !4, line: 3746, baseType: !967, size: 32, align: 32, offset: 512)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1683, file: !4, line: 3757, baseType: !1703, size: 64, align: 64, offset: 576)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{null, !1706}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1683, file: !4, line: 3766, baseType: !1425, size: 64, align: 64, offset: 640)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1683, file: !4, line: 3774, baseType: !1425, size: 64, align: 64, offset: 704)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1683, file: !4, line: 3780, baseType: !967, size: 32, align: 32, offset: 768)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1683, file: !4, line: 3785, baseType: !967, size: 32, align: 32, offset: 800)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1683, file: !4, line: 3795, baseType: !1713, size: 64, align: 64, offset: 832)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{!967, !1378, !1137}
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1380, file: !4, line: 2728, baseType: !1012, size: 64, align: 64, offset: 5440)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1380, file: !4, line: 2735, baseType: !1220, size: 512, align: 64, offset: 5504)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1380, file: !4, line: 2742, baseType: !967, size: 32, align: 32, offset: 6016)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1380, file: !4, line: 2755, baseType: !967, size: 32, align: 32, offset: 6048)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1380, file: !4, line: 2776, baseType: !967, size: 32, align: 32, offset: 6080)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1380, file: !4, line: 2783, baseType: !967, size: 32, align: 32, offset: 6112)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1380, file: !4, line: 2791, baseType: !967, size: 32, align: 32, offset: 6144)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1380, file: !4, line: 2802, baseType: !1193, size: 64, align: 64, offset: 6208)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1380, file: !4, line: 2811, baseType: !967, size: 32, align: 32, offset: 6272)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1380, file: !4, line: 2821, baseType: !967, size: 32, align: 32, offset: 6304)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1380, file: !4, line: 2830, baseType: !967, size: 32, align: 32, offset: 6336)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1380, file: !4, line: 2840, baseType: !967, size: 32, align: 32, offset: 6368)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1380, file: !4, line: 2851, baseType: !1729, size: 64, align: 64, offset: 6400)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64, align: 64)
!1730 = !DISubroutineType(types: !1731)
!1731 = !{!967, !1550, !1732, !1012, !1493, !967, !967}
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!967, !1550, !1012}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1380, file: !4, line: 2871, baseType: !1736, size: 64, align: 64, offset: 6464)
!1736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1737, size: 64, align: 64)
!1737 = !DISubroutineType(types: !1738)
!1738 = !{!967, !1550, !1739, !1012, !1493, !967}
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64, align: 64)
!1740 = !DISubroutineType(types: !1741)
!1741 = !{!967, !1550, !1012, !967, !967}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1380, file: !4, line: 2878, baseType: !967, size: 32, align: 32, offset: 6528)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1380, file: !4, line: 2885, baseType: !967, size: 32, align: 32, offset: 6560)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1380, file: !4, line: 3005, baseType: !967, size: 32, align: 32, offset: 6592)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1380, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
