; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--icoenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--icoenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type opaque
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !926}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !920, line: 222, size: 16, align: 8, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !928, file: !920, line: 222, baseType: !931, size: 16, align: 16)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !932)
!932 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!933 = !{!934}
!934 = distinct !DIGlobalVariable(name: "ff_ico_muxer", scope: !0, file: !935, line: 191, type: !936, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_ico_muxer)
!935 = !DIFile(filename: "libavformat/icoenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !938)
!938 = !{!939, !943, !944, !945, !946, !947, !948, !949, !951, !957, !999, !1001, !1002, !2027, !2028, !2029, !2033, !2037, !2041, !2042, !2047, !2048, !2049, !2050, !2051, !2052, !2056}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !897, line: 498, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !937, file: !897, line: 504, baseType: !940, size: 64, align: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !937, file: !897, line: 505, baseType: !940, size: 64, align: 64, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !937, file: !897, line: 506, baseType: !940, size: 64, align: 64, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !937, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !937, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !937, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !897, line: 517, baseType: !950, size: 32, align: 32, offset: 352)
!950 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !937, file: !897, line: 523, baseType: !952, size: 64, align: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !937, file: !897, line: 526, baseType: !958, size: 64, align: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !962)
!962 = !{!963, !964, !969, !973, !974, !975, !976, !980, !986, !988, !992}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !961, file: !464, line: 72, baseType: !940, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !961, file: !464, line: 78, baseType: !965, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!940, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !961, file: !464, line: 85, baseType: !970, size: 64, align: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !961, file: !464, line: 93, baseType: !950, size: 32, align: 32, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !961, file: !464, line: 99, baseType: !950, size: 32, align: 32, offset: 224)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !961, file: !464, line: 108, baseType: !950, size: 32, align: 32, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !961, file: !464, line: 113, baseType: !977, size: 64, align: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!968, !968, !968}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !961, file: !464, line: 123, baseType: !981, size: 64, align: 64, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!984, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !961, file: !464, line: 130, baseType: !987, size: 32, align: 32, offset: 448)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !961, file: !464, line: 136, baseType: !989, size: 64, align: 64, offset: 512)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!987, !968}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !961, file: !464, line: 142, baseType: !993, size: 64, align: 64, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!950, !996, !968, !940, !950}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !937, file: !897, line: 535, baseType: !1000, size: 64, align: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !937, file: !897, line: 539, baseType: !950, size: 32, align: 32, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !937, file: !897, line: 541, baseType: !1003, size: 64, align: 64, offset: 640)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!950, !1006}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1110, !1111, !1112, !1178, !1179, !1180, !1901, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1955, !1956, !1957, !1958, !1959, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1990, !1991, !1994, !1995, !1996, !1997, !1998, !1999, !2004, !2005, !2006, !2007, !2015, !2016, !2020, !2024, !2025, !2026}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1007, file: !897, line: 1342, baseType: !958, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1007, file: !897, line: 1349, baseType: !1011, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1038, !1039, !1081, !1082, !1086, !1091, !1092, !1093, !1097, !1103, !1109}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1012, file: !897, line: 638, baseType: !940, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1012, file: !897, line: 645, baseType: !940, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1012, file: !897, line: 652, baseType: !950, size: 32, align: 32, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1012, file: !897, line: 659, baseType: !940, size: 64, align: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1012, file: !897, line: 661, baseType: !952, size: 64, align: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1012, file: !897, line: 663, baseType: !958, size: 64, align: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1012, file: !897, line: 670, baseType: !940, size: 64, align: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1012, file: !897, line: 679, baseType: !1011, size: 64, align: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1012, file: !897, line: 684, baseType: !950, size: 32, align: 32, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1012, file: !897, line: 689, baseType: !950, size: 32, align: 32, offset: 544)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1012, file: !897, line: 696, baseType: !1025, size: 64, align: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!950, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1036, !1037}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1030, file: !897, line: 449, baseType: !940, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1030, file: !897, line: 450, baseType: !1034, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1030, file: !897, line: 451, baseType: !950, size: 32, align: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1030, file: !897, line: 452, baseType: !940, size: 64, align: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1012, file: !897, line: 703, baseType: !1003, size: 64, align: 64, offset: 640)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1012, file: !897, line: 714, baseType: !1040, size: 64, align: 64, offset: 704)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!950, !1006, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1046)
!1046 = !{!1047, !1061, !1064, !1065, !1066, !1067, !1068, !1069, !1077, !1078, !1079, !1080}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1045, file: !4, line: 1451, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1050, line: 94, baseType: !1051)
!1050 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1050, line: 81, size: 192, align: 64, elements: !1052)
!1052 = !{!1053, !1057, !1060}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1051, file: !1050, line: 82, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1050, line: 73, baseType: !1056)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1050, line: 73, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1051, file: !1050, line: 89, baseType: !1058, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !1035)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1051, file: !1050, line: 93, baseType: !950, size: 32, align: 32, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1045, file: !4, line: 1461, baseType: !1062, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1063)
!1063 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1045, file: !4, line: 1467, baseType: !1062, size: 64, align: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1045, file: !4, line: 1468, baseType: !1058, size: 64, align: 64, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1045, file: !4, line: 1469, baseType: !950, size: 32, align: 32, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1045, file: !4, line: 1470, baseType: !950, size: 32, align: 32, offset: 288)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1045, file: !4, line: 1474, baseType: !950, size: 32, align: 32, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1045, file: !4, line: 1479, baseType: !1070, size: 64, align: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1072, file: !4, line: 1412, baseType: !1058, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !4, line: 1413, baseType: !950, size: 32, align: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1072, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1045, file: !4, line: 1480, baseType: !950, size: 32, align: 32, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1045, file: !4, line: 1486, baseType: !1062, size: 64, align: 64, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1045, file: !4, line: 1488, baseType: !1062, size: 64, align: 64, offset: 576)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1045, file: !4, line: 1497, baseType: !1062, size: 64, align: 64, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1012, file: !897, line: 720, baseType: !1003, size: 64, align: 64, offset: 768)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1012, file: !897, line: 730, baseType: !1083, size: 64, align: 64, offset: 832)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!950, !1006, !950, !1062, !950}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1012, file: !897, line: 737, baseType: !1087, size: 64, align: 64, offset: 896)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!1062, !1006, !950, !1090, !1062}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1012, file: !897, line: 744, baseType: !1003, size: 64, align: 64, offset: 960)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1012, file: !897, line: 750, baseType: !1003, size: 64, align: 64, offset: 1024)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1012, file: !897, line: 758, baseType: !1094, size: 64, align: 64, offset: 1088)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!950, !1006, !950, !1062, !1062, !1062, !950}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1012, file: !897, line: 764, baseType: !1098, size: 64, align: 64, offset: 1152)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!950, !1006, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1012, file: !897, line: 770, baseType: !1104, size: 64, align: 64, offset: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{!950, !1006, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1012, file: !897, line: 776, baseType: !1104, size: 64, align: 64, offset: 1280)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1007, file: !897, line: 1356, baseType: !1000, size: 64, align: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1007, file: !897, line: 1365, baseType: !968, size: 64, align: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1007, file: !897, line: 1379, baseType: !1113, size: 64, align: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1127, !1128, !1132, !1133, !1134, !1135, !1136, !1138, !1139, !1145, !1146, !1150, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1168, !1169, !1170, !1171, !1175, !1176, !1177}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1115, file: !515, line: 174, baseType: !958, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1115, file: !515, line: 226, baseType: !1034, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1115, file: !515, line: 227, baseType: !950, size: 32, align: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1115, file: !515, line: 228, baseType: !1034, size: 64, align: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1115, file: !515, line: 229, baseType: !1034, size: 64, align: 64, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1115, file: !515, line: 233, baseType: !968, size: 64, align: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1115, file: !515, line: 235, baseType: !1124, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!950, !968, !1058, !950}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1115, file: !515, line: 236, baseType: !1124, size: 64, align: 64, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1115, file: !515, line: 237, baseType: !1129, size: 64, align: 64, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!1062, !968, !1062, !950}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1115, file: !515, line: 238, baseType: !1062, size: 64, align: 64, offset: 576)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1115, file: !515, line: 239, baseType: !950, size: 32, align: 32, offset: 640)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1115, file: !515, line: 240, baseType: !950, size: 32, align: 32, offset: 672)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1115, file: !515, line: 241, baseType: !950, size: 32, align: 32, offset: 704)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1115, file: !515, line: 242, baseType: !1137, size: 64, align: 64, offset: 768)
!1137 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1115, file: !515, line: 243, baseType: !1034, size: 64, align: 64, offset: 832)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1115, file: !515, line: 244, baseType: !1140, size: 64, align: 64, offset: 896)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!1137, !1137, !1143, !925}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1115, file: !515, line: 245, baseType: !950, size: 32, align: 32, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1115, file: !515, line: 249, baseType: !1147, size: 64, align: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{!950, !968, !950}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1115, file: !515, line: 255, baseType: !1151, size: 64, align: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!1062, !968, !950, !1062, !950}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1115, file: !515, line: 260, baseType: !950, size: 32, align: 32, offset: 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1115, file: !515, line: 266, baseType: !1062, size: 64, align: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1115, file: !515, line: 273, baseType: !950, size: 32, align: 32, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1115, file: !515, line: 279, baseType: !1062, size: 64, align: 64, offset: 1344)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1115, file: !515, line: 285, baseType: !950, size: 32, align: 32, offset: 1408)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1115, file: !515, line: 291, baseType: !950, size: 32, align: 32, offset: 1440)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1115, file: !515, line: 298, baseType: !950, size: 32, align: 32, offset: 1472)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1115, file: !515, line: 304, baseType: !950, size: 32, align: 32, offset: 1504)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1115, file: !515, line: 309, baseType: !940, size: 64, align: 64, offset: 1536)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1115, file: !515, line: 314, baseType: !940, size: 64, align: 64, offset: 1600)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1115, file: !515, line: 319, baseType: !1165, size: 64, align: 64, offset: 1664)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!950, !968, !1058, !950, !514, !1062}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1115, file: !515, line: 326, baseType: !950, size: 32, align: 32, offset: 1728)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1115, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1115, file: !515, line: 332, baseType: !1062, size: 64, align: 64, offset: 1792)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1115, file: !515, line: 338, baseType: !1172, size: 64, align: 64, offset: 1856)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!950, !968}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1115, file: !515, line: 340, baseType: !1062, size: 64, align: 64, offset: 1920)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1115, file: !515, line: 346, baseType: !1034, size: 64, align: 64, offset: 1984)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1115, file: !515, line: 351, baseType: !950, size: 32, align: 32, offset: 2048)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1007, file: !897, line: 1386, baseType: !950, size: 32, align: 32, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1007, file: !897, line: 1393, baseType: !925, size: 32, align: 32, offset: 352)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1007, file: !897, line: 1405, baseType: !1181, size: 64, align: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1748, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1849, !1855, !1856, !1860, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1892, !1893, !1894, !1895, !1896, !1897}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1184, file: !897, line: 866, baseType: !950, size: 32, align: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1184, file: !897, line: 872, baseType: !950, size: 32, align: 32, offset: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1184, file: !897, line: 878, baseType: !1189, size: 64, align: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195, !1196, !1423, !1424, !1425, !1426, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1452, !1456, !1457, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1636, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1191, file: !4, line: 1561, baseType: !958, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1191, file: !4, line: 1562, baseType: !950, size: 32, align: 32, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1191, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1191, file: !4, line: 1565, baseType: !1197, size: 64, align: 64, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1215, !1218, !1221, !1224, !1228, !1229, !1230, !1238, !1239, !1240, !1242, !1246, !1252, !1257, !1261, !1262, !1307, !1394, !1398, !1399, !1403, !1407, !1412, !1416, !1417, !1418}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1199, file: !4, line: 3475, baseType: !940, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1199, file: !4, line: 3480, baseType: !940, size: 64, align: 64, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1199, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1199, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1199, file: !4, line: 3487, baseType: !950, size: 32, align: 32, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1199, file: !4, line: 3488, baseType: !1207, size: 64, align: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1210, line: 61, baseType: !1211)
!1210 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1210, line: 58, size: 64, align: 32, elements: !1212)
!1212 = !{!1213, !1214}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1211, file: !1210, line: 59, baseType: !950, size: 32, align: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1211, file: !1210, line: 60, baseType: !950, size: 32, align: 32, offset: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1199, file: !4, line: 3489, baseType: !1216, size: 64, align: 64, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1199, file: !4, line: 3490, baseType: !1219, size: 64, align: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1199, file: !4, line: 3491, baseType: !1222, size: 64, align: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1199, file: !4, line: 3492, baseType: !1225, size: 64, align: 64, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1137)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1199, file: !4, line: 3493, baseType: !1059, size: 8, align: 8, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1199, file: !4, line: 3494, baseType: !958, size: 64, align: 64, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1199, file: !4, line: 3495, baseType: !1231, size: 64, align: 64, offset: 704)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1235)
!1235 = !{!1236, !1237}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1234, file: !4, line: 3402, baseType: !950, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1234, file: !4, line: 3403, baseType: !940, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1199, file: !4, line: 3507, baseType: !940, size: 64, align: 64, offset: 768)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1199, file: !4, line: 3516, baseType: !950, size: 32, align: 32, offset: 832)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1199, file: !4, line: 3517, baseType: !1241, size: 64, align: 64, offset: 896)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1199, file: !4, line: 3527, baseType: !1243, size: 64, align: 64, offset: 960)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!950, !1189}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1199, file: !4, line: 3535, baseType: !1247, size: 64, align: 64, offset: 1024)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!950, !1189, !1250}
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1199, file: !4, line: 3541, baseType: !1253, size: 64, align: 64, offset: 1088)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1256)
!1256 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1199, file: !4, line: 3549, baseType: !1258, size: 64, align: 64, offset: 1152)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !1241}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1199, file: !4, line: 3551, baseType: !1243, size: 64, align: 64, offset: 1216)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1199, file: !4, line: 3552, baseType: !1263, size: 64, align: 64, offset: 1280)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!950, !1189, !1058, !950, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1274, !1306}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1268, file: !4, line: 3921, baseType: !931, size: 16, align: 16)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1268, file: !4, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1268, file: !4, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1268, file: !4, line: 3924, baseType: !925, size: 32, align: 32, offset: 96)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1268, file: !4, line: 3925, baseType: !1275, size: 64, align: 64, offset: 128)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1279)
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1285, !1295, !1299, !1301, !1302, !1304, !1305}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1278, file: !4, line: 3886, baseType: !950, size: 32, align: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1278, file: !4, line: 3887, baseType: !950, size: 32, align: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1278, file: !4, line: 3888, baseType: !950, size: 32, align: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1278, file: !4, line: 3889, baseType: !950, size: 32, align: 32, offset: 96)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1278, file: !4, line: 3890, baseType: !950, size: 32, align: 32, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1278, file: !4, line: 3897, baseType: !1286, size: 768, align: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1288)
!1288 = !{!1289, !1293}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1287, file: !4, line: 3855, baseType: !1290, size: 512, align: 64)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 512, align: 64, elements: !1291)
!1291 = !{!1292}
!1292 = !DISubrange(count: 8)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1287, file: !4, line: 3857, baseType: !1294, size: 256, align: 32, offset: 512)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 256, align: 32, elements: !1291)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1278, file: !4, line: 3903, baseType: !1296, size: 256, align: 64, offset: 960)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 256, align: 64, elements: !1297)
!1297 = !{!1298}
!1298 = !DISubrange(count: 4)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1278, file: !4, line: 3904, baseType: !1300, size: 128, align: 32, offset: 1216)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !950, size: 128, align: 32, elements: !1297)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1278, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1278, file: !4, line: 3908, baseType: !1303, size: 64, align: 64, offset: 1408)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1278, file: !4, line: 3915, baseType: !1303, size: 64, align: 64, offset: 1472)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1278, file: !4, line: 3917, baseType: !950, size: 32, align: 32, offset: 1536)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1268, file: !4, line: 3926, baseType: !1062, size: 64, align: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1199, file: !4, line: 3564, baseType: !1308, size: 64, align: 64, offset: 1344)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!950, !1189, !1043, !1311, !1393}
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1313)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1315)
!1315 = !{!1316, !1317, !1318, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1345, !1347, !1348, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1381, !1382, !1383, !1384, !1385, !1386, !1389, !1390, !1391, !1392}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1314, file: !767, line: 282, baseType: !1290, size: 512, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1314, file: !767, line: 299, baseType: !1294, size: 256, align: 32, offset: 512)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1314, file: !767, line: 315, baseType: !1319, size: 64, align: 64, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1314, file: !767, line: 326, baseType: !950, size: 32, align: 32, offset: 832)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1314, file: !767, line: 326, baseType: !950, size: 32, align: 32, offset: 864)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1314, file: !767, line: 334, baseType: !950, size: 32, align: 32, offset: 896)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1314, file: !767, line: 341, baseType: !950, size: 32, align: 32, offset: 928)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1314, file: !767, line: 346, baseType: !950, size: 32, align: 32, offset: 960)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1314, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1314, file: !767, line: 356, baseType: !1209, size: 64, align: 32, offset: 1024)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1314, file: !767, line: 361, baseType: !1062, size: 64, align: 64, offset: 1088)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1314, file: !767, line: 369, baseType: !1062, size: 64, align: 64, offset: 1152)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1314, file: !767, line: 377, baseType: !1062, size: 64, align: 64, offset: 1216)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1314, file: !767, line: 382, baseType: !950, size: 32, align: 32, offset: 1280)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1314, file: !767, line: 386, baseType: !950, size: 32, align: 32, offset: 1312)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1314, file: !767, line: 391, baseType: !950, size: 32, align: 32, offset: 1344)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1314, file: !767, line: 396, baseType: !968, size: 64, align: 64, offset: 1408)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1314, file: !767, line: 403, baseType: !1335, size: 512, align: 64, offset: 1472)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1227, size: 512, align: 64, elements: !1291)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1314, file: !767, line: 410, baseType: !950, size: 32, align: 32, offset: 1984)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1314, file: !767, line: 415, baseType: !950, size: 32, align: 32, offset: 2016)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1314, file: !767, line: 420, baseType: !950, size: 32, align: 32, offset: 2048)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1314, file: !767, line: 425, baseType: !950, size: 32, align: 32, offset: 2080)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1314, file: !767, line: 435, baseType: !1062, size: 64, align: 64, offset: 2112)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1314, file: !767, line: 440, baseType: !950, size: 32, align: 32, offset: 2176)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1314, file: !767, line: 445, baseType: !1227, size: 64, align: 64, offset: 2240)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1314, file: !767, line: 459, baseType: !1344, size: 512, align: 64, offset: 2304)
!1344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 512, align: 64, elements: !1291)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1314, file: !767, line: 473, baseType: !1346, size: 64, align: 64, offset: 2816)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1314, file: !767, line: 477, baseType: !950, size: 32, align: 32, offset: 2880)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1314, file: !767, line: 479, baseType: !1349, size: 64, align: 64, offset: 2944)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1362}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1352, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1352, file: !767, line: 203, baseType: !1058, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1352, file: !767, line: 204, baseType: !950, size: 32, align: 32, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1352, file: !767, line: 205, baseType: !1358, size: 64, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1360, line: 86, baseType: !1361)
!1360 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1361 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1360, line: 86, flags: DIFlagFwdDecl)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1352, file: !767, line: 206, baseType: !1048, size: 64, align: 64, offset: 256)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1314, file: !767, line: 480, baseType: !950, size: 32, align: 32, offset: 3008)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1314, file: !767, line: 505, baseType: !950, size: 32, align: 32, offset: 3040)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1314, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1314, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1314, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1314, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1314, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1314, file: !767, line: 532, baseType: !1062, size: 64, align: 64, offset: 3264)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1314, file: !767, line: 539, baseType: !1062, size: 64, align: 64, offset: 3328)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1314, file: !767, line: 547, baseType: !1062, size: 64, align: 64, offset: 3392)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1314, file: !767, line: 554, baseType: !1358, size: 64, align: 64, offset: 3456)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1314, file: !767, line: 563, baseType: !950, size: 32, align: 32, offset: 3520)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1314, file: !767, line: 572, baseType: !950, size: 32, align: 32, offset: 3552)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1314, file: !767, line: 581, baseType: !950, size: 32, align: 32, offset: 3584)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1314, file: !767, line: 588, baseType: !1378, size: 64, align: 64, offset: 3648)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1380)
!1380 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1314, file: !767, line: 593, baseType: !950, size: 32, align: 32, offset: 3712)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1314, file: !767, line: 596, baseType: !950, size: 32, align: 32, offset: 3744)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1314, file: !767, line: 599, baseType: !1048, size: 64, align: 64, offset: 3776)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1314, file: !767, line: 605, baseType: !1048, size: 64, align: 64, offset: 3840)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1314, file: !767, line: 616, baseType: !1048, size: 64, align: 64, offset: 3904)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1314, file: !767, line: 626, baseType: !1387, size: 64, align: 64, offset: 3968)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1388, line: 216, baseType: !1137)
!1388 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1314, file: !767, line: 627, baseType: !1387, size: 64, align: 64, offset: 4032)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1314, file: !767, line: 628, baseType: !1387, size: 64, align: 64, offset: 4096)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1314, file: !767, line: 629, baseType: !1387, size: 64, align: 64, offset: 4160)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1314, file: !767, line: 645, baseType: !1048, size: 64, align: 64, offset: 4224)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1199, file: !4, line: 3566, baseType: !1395, size: 64, align: 64, offset: 1408)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!950, !1189, !968, !1393, !1043}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1199, file: !4, line: 3567, baseType: !1243, size: 64, align: 64, offset: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1199, file: !4, line: 3576, baseType: !1400, size: 64, align: 64, offset: 1536)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!950, !1189, !1311}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1199, file: !4, line: 3577, baseType: !1404, size: 64, align: 64, offset: 1600)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!950, !1189, !1043}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1199, file: !4, line: 3584, baseType: !1408, size: 64, align: 64, offset: 1664)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!950, !1189, !1411}
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1199, file: !4, line: 3589, baseType: !1413, size: 64, align: 64, offset: 1728)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{null, !1189}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1199, file: !4, line: 3594, baseType: !950, size: 32, align: 32, offset: 1792)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1199, file: !4, line: 3600, baseType: !940, size: 64, align: 64, offset: 1856)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1199, file: !4, line: 3609, baseType: !1419, size: 64, align: 64, offset: 1920)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1422)
!1422 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1191, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1191, file: !4, line: 1581, baseType: !925, size: 32, align: 32, offset: 224)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1191, file: !4, line: 1583, baseType: !968, size: 64, align: 64, offset: 256)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1191, file: !4, line: 1591, baseType: !1427, size: 64, align: 64, offset: 320)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1191, file: !4, line: 1598, baseType: !968, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1191, file: !4, line: 1606, baseType: !1062, size: 64, align: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1191, file: !4, line: 1614, baseType: !950, size: 32, align: 32, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1191, file: !4, line: 1622, baseType: !950, size: 32, align: 32, offset: 544)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1191, file: !4, line: 1628, baseType: !950, size: 32, align: 32, offset: 576)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1191, file: !4, line: 1636, baseType: !950, size: 32, align: 32, offset: 608)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1191, file: !4, line: 1643, baseType: !950, size: 32, align: 32, offset: 640)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1191, file: !4, line: 1657, baseType: !1058, size: 64, align: 64, offset: 704)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1191, file: !4, line: 1658, baseType: !950, size: 32, align: 32, offset: 768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1191, file: !4, line: 1679, baseType: !1209, size: 64, align: 32, offset: 800)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1191, file: !4, line: 1688, baseType: !950, size: 32, align: 32, offset: 864)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1191, file: !4, line: 1712, baseType: !950, size: 32, align: 32, offset: 896)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1191, file: !4, line: 1729, baseType: !950, size: 32, align: 32, offset: 928)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1191, file: !4, line: 1729, baseType: !950, size: 32, align: 32, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1191, file: !4, line: 1744, baseType: !950, size: 32, align: 32, offset: 992)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1191, file: !4, line: 1744, baseType: !950, size: 32, align: 32, offset: 1024)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1191, file: !4, line: 1751, baseType: !950, size: 32, align: 32, offset: 1056)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1191, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1191, file: !4, line: 1791, baseType: !1448, size: 64, align: 64, offset: 1152)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{null, !1451, !1311, !1393, !950, !950, !950}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1191, file: !4, line: 1808, baseType: !1453, size: 64, align: 64, offset: 1216)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!533, !1451, !1216}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1191, file: !4, line: 1816, baseType: !950, size: 32, align: 32, offset: 1280)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1191, file: !4, line: 1825, baseType: !1458, size: 32, align: 32, offset: 1312)
!1458 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1191, file: !4, line: 1830, baseType: !950, size: 32, align: 32, offset: 1344)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1191, file: !4, line: 1838, baseType: !1458, size: 32, align: 32, offset: 1376)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1191, file: !4, line: 1846, baseType: !950, size: 32, align: 32, offset: 1408)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1191, file: !4, line: 1851, baseType: !950, size: 32, align: 32, offset: 1440)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1191, file: !4, line: 1861, baseType: !1458, size: 32, align: 32, offset: 1472)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1191, file: !4, line: 1868, baseType: !1458, size: 32, align: 32, offset: 1504)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1191, file: !4, line: 1875, baseType: !1458, size: 32, align: 32, offset: 1536)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1191, file: !4, line: 1882, baseType: !1458, size: 32, align: 32, offset: 1568)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1191, file: !4, line: 1889, baseType: !1458, size: 32, align: 32, offset: 1600)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1191, file: !4, line: 1896, baseType: !1458, size: 32, align: 32, offset: 1632)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1191, file: !4, line: 1903, baseType: !1458, size: 32, align: 32, offset: 1664)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1191, file: !4, line: 1910, baseType: !950, size: 32, align: 32, offset: 1696)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1191, file: !4, line: 1915, baseType: !950, size: 32, align: 32, offset: 1728)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1191, file: !4, line: 1926, baseType: !1393, size: 64, align: 64, offset: 1792)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1191, file: !4, line: 1935, baseType: !1209, size: 64, align: 32, offset: 1856)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1191, file: !4, line: 1942, baseType: !950, size: 32, align: 32, offset: 1920)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1191, file: !4, line: 1948, baseType: !950, size: 32, align: 32, offset: 1952)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1191, file: !4, line: 1954, baseType: !950, size: 32, align: 32, offset: 1984)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1191, file: !4, line: 1960, baseType: !950, size: 32, align: 32, offset: 2016)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1191, file: !4, line: 1984, baseType: !950, size: 32, align: 32, offset: 2048)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1191, file: !4, line: 1991, baseType: !950, size: 32, align: 32, offset: 2080)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1191, file: !4, line: 1996, baseType: !950, size: 32, align: 32, offset: 2112)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1191, file: !4, line: 2004, baseType: !950, size: 32, align: 32, offset: 2144)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1191, file: !4, line: 2011, baseType: !950, size: 32, align: 32, offset: 2176)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1191, file: !4, line: 2018, baseType: !950, size: 32, align: 32, offset: 2208)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1191, file: !4, line: 2027, baseType: !950, size: 32, align: 32, offset: 2240)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1191, file: !4, line: 2034, baseType: !950, size: 32, align: 32, offset: 2272)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1191, file: !4, line: 2044, baseType: !950, size: 32, align: 32, offset: 2304)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1191, file: !4, line: 2054, baseType: !1488, size: 64, align: 64, offset: 2368)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1191, file: !4, line: 2061, baseType: !1488, size: 64, align: 64, offset: 2432)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1191, file: !4, line: 2066, baseType: !950, size: 32, align: 32, offset: 2496)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1191, file: !4, line: 2070, baseType: !950, size: 32, align: 32, offset: 2528)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1191, file: !4, line: 2078, baseType: !950, size: 32, align: 32, offset: 2560)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1191, file: !4, line: 2085, baseType: !950, size: 32, align: 32, offset: 2592)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1191, file: !4, line: 2092, baseType: !950, size: 32, align: 32, offset: 2624)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1191, file: !4, line: 2099, baseType: !950, size: 32, align: 32, offset: 2656)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1191, file: !4, line: 2106, baseType: !950, size: 32, align: 32, offset: 2688)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1191, file: !4, line: 2113, baseType: !950, size: 32, align: 32, offset: 2720)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1191, file: !4, line: 2120, baseType: !950, size: 32, align: 32, offset: 2752)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1191, file: !4, line: 2125, baseType: !950, size: 32, align: 32, offset: 2784)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1191, file: !4, line: 2133, baseType: !950, size: 32, align: 32, offset: 2816)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1191, file: !4, line: 2140, baseType: !950, size: 32, align: 32, offset: 2848)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1191, file: !4, line: 2145, baseType: !950, size: 32, align: 32, offset: 2880)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1191, file: !4, line: 2153, baseType: !950, size: 32, align: 32, offset: 2912)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1191, file: !4, line: 2158, baseType: !950, size: 32, align: 32, offset: 2944)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1191, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1191, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1191, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1191, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1191, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1191, file: !4, line: 2203, baseType: !950, size: 32, align: 32, offset: 3136)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1191, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1191, file: !4, line: 2212, baseType: !950, size: 32, align: 32, offset: 3200)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1191, file: !4, line: 2213, baseType: !950, size: 32, align: 32, offset: 3232)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1191, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1191, file: !4, line: 2232, baseType: !950, size: 32, align: 32, offset: 3296)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1191, file: !4, line: 2243, baseType: !950, size: 32, align: 32, offset: 3328)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1191, file: !4, line: 2249, baseType: !950, size: 32, align: 32, offset: 3360)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1191, file: !4, line: 2256, baseType: !950, size: 32, align: 32, offset: 3392)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1191, file: !4, line: 2263, baseType: !1227, size: 64, align: 64, offset: 3456)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1191, file: !4, line: 2270, baseType: !1227, size: 64, align: 64, offset: 3520)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1191, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1191, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1191, file: !4, line: 2367, baseType: !1524, size: 64, align: 64, offset: 3648)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{!950, !1451, !1411, !950}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1191, file: !4, line: 2383, baseType: !950, size: 32, align: 32, offset: 3712)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1191, file: !4, line: 2386, baseType: !1458, size: 32, align: 32, offset: 3744)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1191, file: !4, line: 2387, baseType: !1458, size: 32, align: 32, offset: 3776)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1191, file: !4, line: 2394, baseType: !950, size: 32, align: 32, offset: 3808)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1191, file: !4, line: 2401, baseType: !950, size: 32, align: 32, offset: 3840)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1191, file: !4, line: 2408, baseType: !950, size: 32, align: 32, offset: 3872)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1191, file: !4, line: 2415, baseType: !950, size: 32, align: 32, offset: 3904)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1191, file: !4, line: 2422, baseType: !950, size: 32, align: 32, offset: 3936)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1191, file: !4, line: 2423, baseType: !1536, size: 64, align: 64, offset: 3968)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1538)
!1538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1539)
!1539 = !{!1540, !1541, !1542, !1543}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1538, file: !4, line: 827, baseType: !950, size: 32, align: 32)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1538, file: !4, line: 828, baseType: !950, size: 32, align: 32, offset: 32)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1538, file: !4, line: 829, baseType: !950, size: 32, align: 32, offset: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1538, file: !4, line: 830, baseType: !1458, size: 32, align: 32, offset: 96)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1191, file: !4, line: 2430, baseType: !1062, size: 64, align: 64, offset: 4032)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1191, file: !4, line: 2437, baseType: !1062, size: 64, align: 64, offset: 4096)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1191, file: !4, line: 2444, baseType: !1458, size: 32, align: 32, offset: 4160)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1191, file: !4, line: 2451, baseType: !1458, size: 32, align: 32, offset: 4192)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1191, file: !4, line: 2458, baseType: !950, size: 32, align: 32, offset: 4224)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1191, file: !4, line: 2469, baseType: !950, size: 32, align: 32, offset: 4256)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1191, file: !4, line: 2475, baseType: !950, size: 32, align: 32, offset: 4288)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1191, file: !4, line: 2481, baseType: !950, size: 32, align: 32, offset: 4320)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1191, file: !4, line: 2485, baseType: !950, size: 32, align: 32, offset: 4352)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1191, file: !4, line: 2489, baseType: !950, size: 32, align: 32, offset: 4384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1191, file: !4, line: 2493, baseType: !950, size: 32, align: 32, offset: 4416)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1191, file: !4, line: 2501, baseType: !950, size: 32, align: 32, offset: 4448)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1191, file: !4, line: 2506, baseType: !950, size: 32, align: 32, offset: 4480)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1191, file: !4, line: 2510, baseType: !950, size: 32, align: 32, offset: 4512)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1191, file: !4, line: 2514, baseType: !1062, size: 64, align: 64, offset: 4544)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1191, file: !4, line: 2528, baseType: !1560, size: 64, align: 64, offset: 4608)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{null, !1451, !968, !950, !950}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1191, file: !4, line: 2534, baseType: !950, size: 32, align: 32, offset: 4672)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1191, file: !4, line: 2545, baseType: !950, size: 32, align: 32, offset: 4704)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1191, file: !4, line: 2547, baseType: !950, size: 32, align: 32, offset: 4736)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1191, file: !4, line: 2549, baseType: !950, size: 32, align: 32, offset: 4768)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1191, file: !4, line: 2551, baseType: !950, size: 32, align: 32, offset: 4800)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1191, file: !4, line: 2553, baseType: !950, size: 32, align: 32, offset: 4832)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1191, file: !4, line: 2555, baseType: !950, size: 32, align: 32, offset: 4864)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1191, file: !4, line: 2557, baseType: !950, size: 32, align: 32, offset: 4896)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1191, file: !4, line: 2559, baseType: !950, size: 32, align: 32, offset: 4928)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1191, file: !4, line: 2563, baseType: !950, size: 32, align: 32, offset: 4960)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1191, file: !4, line: 2571, baseType: !1303, size: 64, align: 64, offset: 4992)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1191, file: !4, line: 2579, baseType: !1303, size: 64, align: 64, offset: 5056)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1191, file: !4, line: 2586, baseType: !950, size: 32, align: 32, offset: 5120)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1191, file: !4, line: 2615, baseType: !950, size: 32, align: 32, offset: 5152)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1191, file: !4, line: 2627, baseType: !950, size: 32, align: 32, offset: 5184)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1191, file: !4, line: 2637, baseType: !950, size: 32, align: 32, offset: 5216)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1191, file: !4, line: 2681, baseType: !950, size: 32, align: 32, offset: 5248)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1191, file: !4, line: 2709, baseType: !1062, size: 64, align: 64, offset: 5312)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1191, file: !4, line: 2716, baseType: !1582, size: 64, align: 64, offset: 5376)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1584)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1585)
!1585 = !{!1586, !1587, !1588, !1589, !1590, !1591, !1592, !1596, !1600, !1601, !1602, !1603, !1609, !1610, !1611, !1612, !1613}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1584, file: !4, line: 3642, baseType: !940, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1584, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1584, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1584, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1584, file: !4, line: 3669, baseType: !950, size: 32, align: 32, offset: 160)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1584, file: !4, line: 3682, baseType: !1408, size: 64, align: 64, offset: 192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1584, file: !4, line: 3698, baseType: !1593, size: 64, align: 64, offset: 256)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!950, !1189, !1143, !923}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1584, file: !4, line: 3712, baseType: !1597, size: 64, align: 64, offset: 320)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!950, !1189, !950, !1143, !923}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1584, file: !4, line: 3726, baseType: !1593, size: 64, align: 64, offset: 384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1584, file: !4, line: 3737, baseType: !1243, size: 64, align: 64, offset: 448)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1584, file: !4, line: 3746, baseType: !950, size: 32, align: 32, offset: 512)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1584, file: !4, line: 3757, baseType: !1604, size: 64, align: 64, offset: 576)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{null, !1607}
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1584, file: !4, line: 3766, baseType: !1243, size: 64, align: 64, offset: 640)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1584, file: !4, line: 3774, baseType: !1243, size: 64, align: 64, offset: 704)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1584, file: !4, line: 3780, baseType: !950, size: 32, align: 32, offset: 768)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1584, file: !4, line: 3785, baseType: !950, size: 32, align: 32, offset: 800)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1584, file: !4, line: 3795, baseType: !1614, size: 64, align: 64, offset: 832)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{!950, !1189, !1048}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1191, file: !4, line: 2728, baseType: !968, size: 64, align: 64, offset: 5440)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1191, file: !4, line: 2735, baseType: !1335, size: 512, align: 64, offset: 5504)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1191, file: !4, line: 2742, baseType: !950, size: 32, align: 32, offset: 6016)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1191, file: !4, line: 2755, baseType: !950, size: 32, align: 32, offset: 6048)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1191, file: !4, line: 2776, baseType: !950, size: 32, align: 32, offset: 6080)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1191, file: !4, line: 2783, baseType: !950, size: 32, align: 32, offset: 6112)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1191, file: !4, line: 2791, baseType: !950, size: 32, align: 32, offset: 6144)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1191, file: !4, line: 2802, baseType: !1411, size: 64, align: 64, offset: 6208)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1191, file: !4, line: 2811, baseType: !950, size: 32, align: 32, offset: 6272)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1191, file: !4, line: 2821, baseType: !950, size: 32, align: 32, offset: 6304)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1191, file: !4, line: 2830, baseType: !950, size: 32, align: 32, offset: 6336)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1191, file: !4, line: 2840, baseType: !950, size: 32, align: 32, offset: 6368)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1191, file: !4, line: 2851, baseType: !1630, size: 64, align: 64, offset: 6400)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!950, !1451, !1633, !968, !1393, !950, !950}
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!950, !1451, !968}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1191, file: !4, line: 2871, baseType: !1637, size: 64, align: 64, offset: 6464)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!950, !1451, !1640, !968, !1393, !950}
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!950, !1451, !968, !950, !950}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1191, file: !4, line: 2878, baseType: !950, size: 32, align: 32, offset: 6528)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1191, file: !4, line: 2885, baseType: !950, size: 32, align: 32, offset: 6560)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1191, file: !4, line: 3005, baseType: !950, size: 32, align: 32, offset: 6592)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1191, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1191, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1191, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1191, file: !4, line: 3037, baseType: !1058, size: 64, align: 64, offset: 6720)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1191, file: !4, line: 3038, baseType: !950, size: 32, align: 32, offset: 6784)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1191, file: !4, line: 3050, baseType: !1227, size: 64, align: 64, offset: 6848)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1191, file: !4, line: 3065, baseType: !950, size: 32, align: 32, offset: 6912)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1191, file: !4, line: 3083, baseType: !950, size: 32, align: 32, offset: 6944)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1191, file: !4, line: 3092, baseType: !1209, size: 64, align: 32, offset: 6976)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1191, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1191, file: !4, line: 3106, baseType: !1209, size: 64, align: 32, offset: 7072)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1191, file: !4, line: 3113, baseType: !1658, size: 64, align: 64, offset: 7168)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1660)
!1660 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1661)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1662)
!1662 = !{!1663, !1664, !1665, !1666, !1667, !1668, !1671}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1661, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1661, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1661, file: !4, line: 720, baseType: !940, size: 64, align: 64, offset: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1661, file: !4, line: 724, baseType: !940, size: 64, align: 64, offset: 128)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1661, file: !4, line: 728, baseType: !950, size: 32, align: 32, offset: 192)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1661, file: !4, line: 734, baseType: !1669, size: 64, align: 64, offset: 256)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1661, file: !4, line: 739, baseType: !1672, size: 64, align: 64, offset: 320)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1234)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1191, file: !4, line: 3129, baseType: !1062, size: 64, align: 64, offset: 7232)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1191, file: !4, line: 3130, baseType: !1062, size: 64, align: 64, offset: 7296)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1191, file: !4, line: 3131, baseType: !1062, size: 64, align: 64, offset: 7360)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1191, file: !4, line: 3132, baseType: !1062, size: 64, align: 64, offset: 7424)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1191, file: !4, line: 3139, baseType: !1303, size: 64, align: 64, offset: 7488)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1191, file: !4, line: 3147, baseType: !950, size: 32, align: 32, offset: 7552)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1191, file: !4, line: 3165, baseType: !950, size: 32, align: 32, offset: 7584)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1191, file: !4, line: 3172, baseType: !950, size: 32, align: 32, offset: 7616)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1191, file: !4, line: 3180, baseType: !950, size: 32, align: 32, offset: 7648)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1191, file: !4, line: 3191, baseType: !1488, size: 64, align: 64, offset: 7680)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1191, file: !4, line: 3199, baseType: !1058, size: 64, align: 64, offset: 7744)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1191, file: !4, line: 3207, baseType: !1303, size: 64, align: 64, offset: 7808)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1191, file: !4, line: 3214, baseType: !925, size: 32, align: 32, offset: 7872)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1191, file: !4, line: 3224, baseType: !1070, size: 64, align: 64, offset: 7936)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1191, file: !4, line: 3225, baseType: !950, size: 32, align: 32, offset: 8000)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1191, file: !4, line: 3249, baseType: !1048, size: 64, align: 64, offset: 8064)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1191, file: !4, line: 3256, baseType: !950, size: 32, align: 32, offset: 8128)
