; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--pixdesc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--pixdesc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVPixFmtDescriptor = type { i8*, i8, i8, i8, i64, [4 x %struct.AVComponentDescriptor], i8* }
%struct.AVComponentDescriptor = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%union.unaligned_16 = type { i16 }
%union.unaligned_32 = type { i32 }


!235 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!236 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!237 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!238 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!239 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!240 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!241 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!242 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!243 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!244 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!245 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!246 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!247 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!248 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!249 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!250 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!251 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !4, line: 493, size: 32, align: 32, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269}
!253 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!254 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!255 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!256 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!257 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!258 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!259 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!260 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!261 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!262 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!263 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!264 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!265 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!266 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!267 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!268 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!269 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !4, line: 538, size: 32, align: 32, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !277, !278, !279}
!272 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!273 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!274 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!275 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!276 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!277 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!278 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!279 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!280 = !{!281, !290, !297, !298, !296, !299}
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !284, line: 222, size: 16, align: 8, elements: !285)
!284 = !DIFile(filename: "libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !283, file: !284, line: 222, baseType: !287, size: 16, align: 16)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !288, line: 49, baseType: !289)
!288 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!289 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !284, line: 221, size: 32, align: 8, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !292, file: !284, line: 221, baseType: !295, size: 32, align: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !288, line: 51, baseType: !296)
!296 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!300 = !{!301, !340, !345, !349, !353, !357}
!301 = distinct !DIGlobalVariable(name: "av_pix_fmt_descriptors", scope: !0, file: !302, line: 173, type: !303, isLocal: true, isDefinition: true, variable: [191 x %struct.AVPixFmtDescriptor]* @av_pix_fmt_descriptors)
!302 = !DIFile(filename: "libavutil/pixdesc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !304, size: 244480, align: 64, elements: !338)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !306, line: 123, baseType: !307)
!306 = !DIFile(filename: "libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !306, line: 81, size: 1280, align: 64, elements: !308)
!308 = !{!309, !313, !316, !317, !318, !321, !337}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !307, file: !306, line: 82, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !307, file: !306, line: 83, baseType: !314, size: 8, align: 8, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !288, line: 48, baseType: !315)
!315 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !307, file: !306, line: 92, baseType: !314, size: 8, align: 8, offset: 72)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !307, file: !306, line: 101, baseType: !314, size: 8, align: 8, offset: 80)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !307, file: !306, line: 106, baseType: !319, size: 64, align: 64, offset: 128)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !288, line: 55, baseType: !320)
!320 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !307, file: !306, line: 117, baseType: !322, size: 1024, align: 32, offset: 192)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 1024, align: 32, elements: !335)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !306, line: 70, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !306, line: 31, size: 256, align: 32, elements: !325)
!325 = !{!326, !328, !329, !330, !331, !332, !333, !334}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !324, file: !306, line: 35, baseType: !327, size: 32, align: 32)
!327 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !324, file: !306, line: 41, baseType: !327, size: 32, align: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !324, file: !306, line: 47, baseType: !327, size: 32, align: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !324, file: !306, line: 53, baseType: !327, size: 32, align: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !324, file: !306, line: 58, baseType: !327, size: 32, align: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !324, file: !306, line: 62, baseType: !327, size: 32, align: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !324, file: !306, line: 65, baseType: !327, size: 32, align: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !324, file: !306, line: 68, baseType: !327, size: 32, align: 32, offset: 224)
!335 = !{!336}
!336 = !DISubrange(count: 4)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !307, file: !306, line: 122, baseType: !310, size: 64, align: 64, offset: 1216)
!338 = !{!339}
!339 = !DISubrange(count: 191)
!340 = distinct !DIGlobalVariable(name: "color_range_names", scope: !0, file: !302, line: 2328, type: !341, isLocal: true, isDefinition: true, variable: [3 x i8*]* @color_range_names)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 192, align: 64, elements: !343)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!343 = !{!344}
!344 = !DISubrange(count: 3)
!345 = distinct !DIGlobalVariable(name: "color_primaries_names", scope: !0, file: !302, line: 2334, type: !346, isLocal: true, isDefinition: true, variable: [23 x i8*]* @color_primaries_names)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 1472, align: 64, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 23)
!349 = distinct !DIGlobalVariable(name: "color_transfer_names", scope: !0, file: !302, line: 2351, type: !350, isLocal: true, isDefinition: true, variable: [19 x i8*]* @color_transfer_names)
!350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 1216, align: 64, elements: !351)
!351 = !{!352}
!352 = !DISubrange(count: 19)
!353 = distinct !DIGlobalVariable(name: "color_space_names", scope: !0, file: !302, line: 2373, type: !354, isLocal: true, isDefinition: true, variable: [15 x i8*]* @color_space_names)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 960, align: 64, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 15)
!357 = distinct !DIGlobalVariable(name: "chroma_location_names", scope: !0, file: !302, line: 2391, type: !358, isLocal: true, isDefinition: true, variable: [7 x i8*]* @chroma_location_names)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !342, size: 448, align: 64, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 7)
!361 = !{i32 2, !"Dwarf Version", i32 4}
!362 = !{i32 2, !"Debug Info Version", i32 3}
!363 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!364 = distinct !DISubprogram(name: "av_read_image_line2", scope: !302, file: !302, line: 34, type: !365, isLocal: false, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !373)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !299, !367, !370, !372, !327, !327, !327, !327, !327, !327}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!373 = !{}
!374 = !DILocalVariable(name: "x", arg: 1, scope: !375, file: !376, line: 66, type: !295)
!375 = distinct !DISubprogram(name: "av_bswap32", scope: !376, file: !376, line: 66, type: !377, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !373)
!376 = !DIFile(filename: "libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!377 = !DISubroutineType(types: !378)
!378 = !{!295, !295}
!379 = !DIExpression()
!380 = !DILocation(line: 66, column: 98, scope: !375, inlinedAt: !381)
!381 = distinct !DILocation(line: 79, column: 43, scope: !382)
!382 = !DILexicalBlockFile(scope: !383, file: !302, discriminator: 1)
!383 = distinct !DILexicalBlock(scope: !384, file: !302, line: 78, column: 21)
!384 = distinct !DILexicalBlock(scope: !385, file: !302, line: 77, column: 17)
!385 = distinct !DILexicalBlock(scope: !386, file: !302, line: 75, column: 21)
!386 = distinct !DILexicalBlock(scope: !387, file: !302, line: 66, column: 12)
!387 = distinct !DILexicalBlock(scope: !364, file: !302, line: 51, column: 9)
