; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mss4.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mss4.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FrameType", file: !888, line: 37, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/mss4.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "INTRA_FRAME", value: 0)
!891 = !DIEnumerator(name: "INTER_FRAME", value: 1)
!892 = !DIEnumerator(name: "SKIP_FRAME", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "BlockType", file: !888, line: 43, size: 32, align: 32, elements: !894)
!894 = !{!895, !896, !897}
!895 = !DIEnumerator(name: "SKIP_BLOCK", value: 0)
!896 = !DIEnumerator(name: "DCT_BLOCK", value: 1)
!897 = !DIEnumerator(name: "IMAGE_BLOCK", value: 2)
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CachePos", file: !888, line: 49, size: 32, align: 32, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIEnumerator(name: "LEFT", value: 0)
!901 = !DIEnumerator(name: "TOP_LEFT", value: 1)
!902 = !DIEnumerator(name: "TOP", value: 2)
!903 = !{!904, !905, !906, !907, !916, !920, !929, !918}
!904 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!905 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !910, line: 222, size: 16, align: 8, elements: !911)
!910 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !909, file: !910, line: 222, baseType: !913, size: 16, align: 16)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !914, line: 49, baseType: !915)
!914 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!915 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !914, line: 48, baseType: !919)
!919 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias16", file: !910, line: 46, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !910, line: 43, size: 16, align: 16, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !922, file: !910, line: 44, baseType: !913, size: 16, align: 16)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !922, file: !910, line: 45, baseType: !926, size: 16, align: 8)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 16, align: 8, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 2)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !910, line: 221, size: 32, align: 8, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !931, file: !910, line: 221, baseType: !934, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !914, line: 51, baseType: !905)
!935 = !{!936, !1659, !1663, !1664, !1668, !1669, !1673}
!936 = distinct !DIGlobalVariable(name: "ff_mts2_decoder", scope: !0, file: !888, line: 673, type: !937, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mts2_decoder)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !939)
!939 = !{!940, !944, !945, !946, !947, !948, !957, !960, !963, !966, !971, !972, !1013, !1021, !1022, !1023, !1025, !1574, !1580, !1588, !1592, !1593, !1630, !1634, !1638, !1639, !1643, !1647, !1648, !1652, !1653, !1654}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !14, line: 3475, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !938, file: !14, line: 3480, baseType: !941, size: 64, align: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !938, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !938, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !938, file: !14, line: 3487, baseType: !904, size: 32, align: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !938, file: !14, line: 3488, baseType: !949, size: 64, align: 64, offset: 256)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !952, line: 61, baseType: !953)
!952 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !952, line: 58, size: 64, align: 32, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !953, file: !952, line: 59, baseType: !904, size: 32, align: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !953, file: !952, line: 60, baseType: !904, size: 32, align: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !938, file: !14, line: 3489, baseType: !958, size: 64, align: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !938, file: !14, line: 3490, baseType: !961, size: 64, align: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !938, file: !14, line: 3491, baseType: !964, size: 64, align: 64, offset: 448)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !938, file: !14, line: 3492, baseType: !967, size: 64, align: 64, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !914, line: 55, baseType: !970)
!970 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !938, file: !14, line: 3493, baseType: !918, size: 8, align: 8, offset: 576)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !938, file: !14, line: 3494, baseType: !973, size: 64, align: 64, offset: 640)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !979, !983, !987, !988, !989, !990, !994, !1000, !1002, !1006}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !691, line: 72, baseType: !941, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !691, line: 78, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!941, !906}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !691, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !691, line: 93, baseType: !904, size: 32, align: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !691, line: 99, baseType: !904, size: 32, align: 32, offset: 224)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !691, line: 108, baseType: !904, size: 32, align: 32, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !691, line: 113, baseType: !991, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{!906, !906, !906}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !691, line: 123, baseType: !995, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!998, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !691, line: 130, baseType: !1001, size: 32, align: 32, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !691, line: 136, baseType: !1003, size: 64, align: 64, offset: 512)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!1001, !906}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !691, line: 142, baseType: !1007, size: 64, align: 64, offset: 576)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!904, !1010, !906, !941, !904}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !938, file: !14, line: 3495, baseType: !1014, size: 64, align: 64, offset: 704)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1017, file: !14, line: 3402, baseType: !904, size: 32, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1017, file: !14, line: 3403, baseType: !941, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !938, file: !14, line: 3507, baseType: !941, size: 64, align: 64, offset: 768)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !938, file: !14, line: 3516, baseType: !904, size: 32, align: 32, offset: 832)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !938, file: !14, line: 3517, baseType: !1024, size: 64, align: 64, offset: 896)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !938, file: !14, line: 3527, baseType: !1026, size: 64, align: 64, offset: 960)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!904, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1032)
!1032 = !{!1033, !1034, !1035, !1036, !1039, !1040, !1041, !1042, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1324, !1328, !1329, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1512, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1031, file: !14, line: 1561, baseType: !973, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1031, file: !14, line: 1562, baseType: !904, size: 32, align: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1031, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1031, file: !14, line: 1565, baseType: !1037, size: 64, align: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1031, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1031, file: !14, line: 1581, baseType: !905, size: 32, align: 32, offset: 224)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1031, file: !14, line: 1583, baseType: !906, size: 64, align: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1031, file: !14, line: 1591, baseType: !1043, size: 64, align: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1045, line: 129, size: 1664, align: 64, elements: !1046)
!1045 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1046 = !{!1047, !1048, !1049, !1050, !1150, !1171, !1172, !1201, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1044, file: !1045, line: 136, baseType: !904, size: 32, align: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1044, file: !1045, line: 151, baseType: !904, size: 32, align: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1044, file: !1045, line: 157, baseType: !904, size: 32, align: 32, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1044, file: !1045, line: 159, baseType: !1051, size: 64, align: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1054)
!1054 = !{!1055, !1060, !1062, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1102, !1104, !1105, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1138, !1139, !1140, !1141, !1142, !1143, !1146, !1147, !1148, !1149}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1053, file: !722, line: 282, baseType: !1056, size: 512, align: 64)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 512, align: 64, elements: !1058)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!1058 = !{!1059}
!1059 = !DISubrange(count: 8)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1053, file: !722, line: 299, baseType: !1061, size: 256, align: 32, offset: 512)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 256, align: 32, elements: !1058)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1053, file: !722, line: 315, baseType: !1063, size: 64, align: 64, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1053, file: !722, line: 326, baseType: !904, size: 32, align: 32, offset: 832)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1053, file: !722, line: 326, baseType: !904, size: 32, align: 32, offset: 864)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1053, file: !722, line: 334, baseType: !904, size: 32, align: 32, offset: 896)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1053, file: !722, line: 341, baseType: !904, size: 32, align: 32, offset: 928)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1053, file: !722, line: 346, baseType: !904, size: 32, align: 32, offset: 960)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1053, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1053, file: !722, line: 356, baseType: !951, size: 64, align: 32, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1053, file: !722, line: 361, baseType: !1072, size: 64, align: 64, offset: 1088)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !914, line: 40, baseType: !1073)
!1073 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1053, file: !722, line: 369, baseType: !1072, size: 64, align: 64, offset: 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1053, file: !722, line: 377, baseType: !1072, size: 64, align: 64, offset: 1216)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1053, file: !722, line: 382, baseType: !904, size: 32, align: 32, offset: 1280)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1053, file: !722, line: 386, baseType: !904, size: 32, align: 32, offset: 1312)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1053, file: !722, line: 391, baseType: !904, size: 32, align: 32, offset: 1344)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1053, file: !722, line: 396, baseType: !906, size: 64, align: 64, offset: 1408)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1053, file: !722, line: 403, baseType: !1081, size: 512, align: 64, offset: 1472)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 512, align: 64, elements: !1058)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1053, file: !722, line: 410, baseType: !904, size: 32, align: 32, offset: 1984)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1053, file: !722, line: 415, baseType: !904, size: 32, align: 32, offset: 2016)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1053, file: !722, line: 420, baseType: !904, size: 32, align: 32, offset: 2048)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1053, file: !722, line: 425, baseType: !904, size: 32, align: 32, offset: 2080)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1053, file: !722, line: 435, baseType: !1072, size: 64, align: 64, offset: 2112)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1053, file: !722, line: 440, baseType: !904, size: 32, align: 32, offset: 2176)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1053, file: !722, line: 445, baseType: !969, size: 64, align: 64, offset: 2240)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1053, file: !722, line: 459, baseType: !1090, size: 512, align: 64, offset: 2304)
!1090 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 512, align: 64, elements: !1058)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1093, line: 94, baseType: !1094)
!1093 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1093, line: 81, size: 192, align: 64, elements: !1095)
!1095 = !{!1096, !1100, !1101}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1094, file: !1093, line: 82, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1093, line: 73, baseType: !1099)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1093, line: 73, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1094, file: !1093, line: 89, baseType: !1057, size: 64, align: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !1093, line: 93, baseType: !904, size: 32, align: 32, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1053, file: !722, line: 473, baseType: !1103, size: 64, align: 64, offset: 2816)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1053, file: !722, line: 477, baseType: !904, size: 32, align: 32, offset: 2880)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1053, file: !722, line: 479, baseType: !1106, size: 64, align: 64, offset: 2944)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1119}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1109, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !722, line: 203, baseType: !1057, size: 64, align: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !722, line: 204, baseType: !904, size: 32, align: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1109, file: !722, line: 205, baseType: !1115, size: 64, align: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1117, line: 86, baseType: !1118)
!1117 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1117, line: 86, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1109, file: !722, line: 206, baseType: !1091, size: 64, align: 64, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1053, file: !722, line: 480, baseType: !904, size: 32, align: 32, offset: 3008)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1053, file: !722, line: 505, baseType: !904, size: 32, align: 32, offset: 3040)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1053, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1053, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1053, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1053, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1053, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1053, file: !722, line: 532, baseType: !1072, size: 64, align: 64, offset: 3264)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1053, file: !722, line: 539, baseType: !1072, size: 64, align: 64, offset: 3328)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1053, file: !722, line: 547, baseType: !1072, size: 64, align: 64, offset: 3392)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1053, file: !722, line: 554, baseType: !1115, size: 64, align: 64, offset: 3456)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1053, file: !722, line: 563, baseType: !904, size: 32, align: 32, offset: 3520)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1053, file: !722, line: 572, baseType: !904, size: 32, align: 32, offset: 3552)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1053, file: !722, line: 581, baseType: !904, size: 32, align: 32, offset: 3584)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1053, file: !722, line: 588, baseType: !1135, size: 64, align: 64, offset: 3648)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !914, line: 36, baseType: !1137)
!1137 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1053, file: !722, line: 593, baseType: !904, size: 32, align: 32, offset: 3712)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1053, file: !722, line: 596, baseType: !904, size: 32, align: 32, offset: 3744)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1053, file: !722, line: 599, baseType: !1091, size: 64, align: 64, offset: 3776)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1053, file: !722, line: 605, baseType: !1091, size: 64, align: 64, offset: 3840)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1053, file: !722, line: 616, baseType: !1091, size: 64, align: 64, offset: 3904)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1053, file: !722, line: 626, baseType: !1144, size: 64, align: 64, offset: 3968)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1145, line: 216, baseType: !970)
!1145 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1053, file: !722, line: 627, baseType: !1144, size: 64, align: 64, offset: 4032)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1053, file: !722, line: 628, baseType: !1144, size: 64, align: 64, offset: 4096)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1053, file: !722, line: 629, baseType: !1144, size: 64, align: 64, offset: 4160)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1053, file: !722, line: 645, baseType: !1091, size: 64, align: 64, offset: 4224)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1044, file: !1045, line: 161, baseType: !1151, size: 64, align: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1045, line: 117, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1045, line: 100, size: 832, align: 64, elements: !1154)
!1154 = !{!1155, !1162, !1163, !1164, !1165, !1166, !1168, !1169, !1170}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1153, file: !1045, line: 105, baseType: !1156, size: 256, align: 64)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1157, size: 256, align: 64, elements: !1160)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1093, line: 238, baseType: !1159)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1093, line: 238, flags: DIFlagFwdDecl)
!1160 = !{!1161}
!1161 = !DISubrange(count: 4)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1153, file: !1045, line: 110, baseType: !904, size: 32, align: 32, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1153, file: !1045, line: 111, baseType: !904, size: 32, align: 32, offset: 288)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1153, file: !1045, line: 111, baseType: !904, size: 32, align: 32, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1153, file: !1045, line: 112, baseType: !1061, size: 256, align: 32, offset: 352)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1153, file: !1045, line: 113, baseType: !1167, size: 128, align: 32, offset: 608)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 128, align: 32, elements: !1160)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1153, file: !1045, line: 114, baseType: !904, size: 32, align: 32, offset: 736)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1153, file: !1045, line: 115, baseType: !904, size: 32, align: 32, offset: 768)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1153, file: !1045, line: 116, baseType: !904, size: 32, align: 32, offset: 800)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1044, file: !1045, line: 163, baseType: !906, size: 64, align: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1044, file: !1045, line: 165, baseType: !1173, size: 128, align: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1045, line: 122, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1045, line: 119, size: 128, align: 64, elements: !1175)
!1175 = !{!1176, !1200}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1174, file: !1045, line: 120, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1196, !1197, !1198, !1199}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1179, file: !14, line: 1451, baseType: !1091, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1179, file: !14, line: 1461, baseType: !1072, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1179, file: !14, line: 1467, baseType: !1072, size: 64, align: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !14, line: 1468, baseType: !1057, size: 64, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !14, line: 1469, baseType: !904, size: 32, align: 32, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1179, file: !14, line: 1470, baseType: !904, size: 32, align: 32, offset: 288)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1179, file: !14, line: 1474, baseType: !904, size: 32, align: 32, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1179, file: !14, line: 1479, baseType: !1189, size: 64, align: 64, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !14, line: 1412, baseType: !1057, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1191, file: !14, line: 1413, baseType: !904, size: 32, align: 32, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1191, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1179, file: !14, line: 1480, baseType: !904, size: 32, align: 32, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1179, file: !14, line: 1486, baseType: !1072, size: 64, align: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1179, file: !14, line: 1488, baseType: !1072, size: 64, align: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1179, file: !14, line: 1497, baseType: !1072, size: 64, align: 64, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1174, file: !1045, line: 121, baseType: !1051, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1044, file: !1045, line: 166, baseType: !1202, size: 128, align: 64, offset: 448)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1045, line: 127, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1045, line: 124, size: 128, align: 64, elements: !1204)
!1204 = !{!1205, !1278}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1203, file: !1045, line: 125, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1236, !1240, !1241, !1275, !1276, !1277}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1209, file: !14, line: 5751, baseType: !973, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1209, file: !14, line: 5756, baseType: !1213, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1221, !1222, !1223, !1227, !1231, !1235}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1215, file: !14, line: 5797, baseType: !941, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1215, file: !14, line: 5804, baseType: !1219, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1215, file: !14, line: 5815, baseType: !973, size: 64, align: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1215, file: !14, line: 5825, baseType: !904, size: 32, align: 32, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1215, file: !14, line: 5826, baseType: !1224, size: 64, align: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!904, !1207}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1215, file: !14, line: 5827, baseType: !1228, size: 64, align: 64, offset: 320)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!904, !1207, !1177}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1215, file: !14, line: 5828, baseType: !1232, size: 64, align: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !1207}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1215, file: !14, line: 5829, baseType: !1232, size: 64, align: 64, offset: 448)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1209, file: !14, line: 5762, baseType: !1237, size: 64, align: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1239)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1209, file: !14, line: 5768, baseType: !906, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1209, file: !14, line: 5775, baseType: !1242, size: 64, align: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1244, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1244, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1244, file: !14, line: 3948, baseType: !934, size: 32, align: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1244, file: !14, line: 3958, baseType: !1057, size: 64, align: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1244, file: !14, line: 3962, baseType: !904, size: 32, align: 32, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1244, file: !14, line: 3968, baseType: !904, size: 32, align: 32, offset: 224)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1244, file: !14, line: 3973, baseType: !1072, size: 64, align: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1244, file: !14, line: 3986, baseType: !904, size: 32, align: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1244, file: !14, line: 3999, baseType: !904, size: 32, align: 32, offset: 352)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1244, file: !14, line: 4004, baseType: !904, size: 32, align: 32, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1244, file: !14, line: 4005, baseType: !904, size: 32, align: 32, offset: 416)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1244, file: !14, line: 4010, baseType: !904, size: 32, align: 32, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1244, file: !14, line: 4011, baseType: !904, size: 32, align: 32, offset: 480)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1244, file: !14, line: 4020, baseType: !951, size: 64, align: 32, offset: 512)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1244, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1244, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1244, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1244, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1244, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1244, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1244, file: !14, line: 4039, baseType: !904, size: 32, align: 32, offset: 768)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1244, file: !14, line: 4046, baseType: !969, size: 64, align: 64, offset: 832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1244, file: !14, line: 4050, baseType: !904, size: 32, align: 32, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1244, file: !14, line: 4054, baseType: !904, size: 32, align: 32, offset: 928)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1244, file: !14, line: 4061, baseType: !904, size: 32, align: 32, offset: 960)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1244, file: !14, line: 4065, baseType: !904, size: 32, align: 32, offset: 992)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1244, file: !14, line: 4073, baseType: !904, size: 32, align: 32, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1244, file: !14, line: 4080, baseType: !904, size: 32, align: 32, offset: 1056)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1244, file: !14, line: 4084, baseType: !904, size: 32, align: 32, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1209, file: !14, line: 5781, baseType: !1242, size: 64, align: 64, offset: 320)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1209, file: !14, line: 5787, baseType: !951, size: 64, align: 32, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1209, file: !14, line: 5793, baseType: !951, size: 64, align: 32, offset: 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1203, file: !1045, line: 126, baseType: !904, size: 32, align: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1044, file: !1045, line: 172, baseType: !1177, size: 64, align: 64, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1044, file: !1045, line: 177, baseType: !1057, size: 64, align: 64, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1044, file: !1045, line: 178, baseType: !905, size: 32, align: 32, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1044, file: !1045, line: 180, baseType: !906, size: 64, align: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1044, file: !1045, line: 185, baseType: !904, size: 32, align: 32, offset: 832)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1044, file: !1045, line: 190, baseType: !906, size: 64, align: 64, offset: 896)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1044, file: !1045, line: 195, baseType: !904, size: 32, align: 32, offset: 960)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1044, file: !1045, line: 200, baseType: !1177, size: 64, align: 64, offset: 1024)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1044, file: !1045, line: 201, baseType: !904, size: 32, align: 32, offset: 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1044, file: !1045, line: 202, baseType: !1051, size: 64, align: 64, offset: 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1044, file: !1045, line: 203, baseType: !904, size: 32, align: 32, offset: 1216)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1044, file: !1045, line: 205, baseType: !904, size: 32, align: 32, offset: 1248)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1044, file: !1045, line: 206, baseType: !904, size: 32, align: 32, offset: 1280)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1044, file: !1045, line: 209, baseType: !1144, size: 64, align: 64, offset: 1344)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1044, file: !1045, line: 212, baseType: !1144, size: 64, align: 64, offset: 1408)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1044, file: !1045, line: 213, baseType: !1051, size: 64, align: 64, offset: 1472)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1044, file: !1045, line: 215, baseType: !904, size: 32, align: 32, offset: 1536)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1044, file: !1045, line: 217, baseType: !904, size: 32, align: 32, offset: 1568)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1044, file: !1045, line: 220, baseType: !904, size: 32, align: 32, offset: 1600)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1031, file: !14, line: 1598, baseType: !906, size: 64, align: 64, offset: 384)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1031, file: !14, line: 1606, baseType: !1072, size: 64, align: 64, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1031, file: !14, line: 1614, baseType: !904, size: 32, align: 32, offset: 512)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1031, file: !14, line: 1622, baseType: !904, size: 32, align: 32, offset: 544)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1031, file: !14, line: 1628, baseType: !904, size: 32, align: 32, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !14, line: 1636, baseType: !904, size: 32, align: 32, offset: 608)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1031, file: !14, line: 1643, baseType: !904, size: 32, align: 32, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1031, file: !14, line: 1657, baseType: !1057, size: 64, align: 64, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1031, file: !14, line: 1658, baseType: !904, size: 32, align: 32, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1031, file: !14, line: 1679, baseType: !951, size: 64, align: 32, offset: 800)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1031, file: !14, line: 1688, baseType: !904, size: 32, align: 32, offset: 864)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1031, file: !14, line: 1712, baseType: !904, size: 32, align: 32, offset: 896)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1031, file: !14, line: 1729, baseType: !904, size: 32, align: 32, offset: 928)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1031, file: !14, line: 1729, baseType: !904, size: 32, align: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1031, file: !14, line: 1744, baseType: !904, size: 32, align: 32, offset: 992)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1031, file: !14, line: 1744, baseType: !904, size: 32, align: 32, offset: 1024)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1031, file: !14, line: 1751, baseType: !904, size: 32, align: 32, offset: 1056)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1031, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1031, file: !14, line: 1791, baseType: !1317, size: 64, align: 64, offset: 1152)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{null, !1320, !1321, !1323, !904, !904, !904}
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1031, file: !14, line: 1808, baseType: !1325, size: 64, align: 64, offset: 1216)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!473, !1320, !958}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1031, file: !14, line: 1816, baseType: !904, size: 32, align: 32, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1031, file: !14, line: 1825, baseType: !1330, size: 32, align: 32, offset: 1312)
!1330 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1031, file: !14, line: 1830, baseType: !904, size: 32, align: 32, offset: 1344)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1031, file: !14, line: 1838, baseType: !1330, size: 32, align: 32, offset: 1376)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1031, file: !14, line: 1846, baseType: !904, size: 32, align: 32, offset: 1408)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1031, file: !14, line: 1851, baseType: !904, size: 32, align: 32, offset: 1440)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1031, file: !14, line: 1861, baseType: !1330, size: 32, align: 32, offset: 1472)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1031, file: !14, line: 1868, baseType: !1330, size: 32, align: 32, offset: 1504)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1031, file: !14, line: 1875, baseType: !1330, size: 32, align: 32, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1031, file: !14, line: 1882, baseType: !1330, size: 32, align: 32, offset: 1568)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1031, file: !14, line: 1889, baseType: !1330, size: 32, align: 32, offset: 1600)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1031, file: !14, line: 1896, baseType: !1330, size: 32, align: 32, offset: 1632)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1031, file: !14, line: 1903, baseType: !1330, size: 32, align: 32, offset: 1664)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1031, file: !14, line: 1910, baseType: !904, size: 32, align: 32, offset: 1696)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1031, file: !14, line: 1915, baseType: !904, size: 32, align: 32, offset: 1728)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1031, file: !14, line: 1926, baseType: !1323, size: 64, align: 64, offset: 1792)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1031, file: !14, line: 1935, baseType: !951, size: 64, align: 32, offset: 1856)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1031, file: !14, line: 1942, baseType: !904, size: 32, align: 32, offset: 1920)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1031, file: !14, line: 1948, baseType: !904, size: 32, align: 32, offset: 1952)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1031, file: !14, line: 1954, baseType: !904, size: 32, align: 32, offset: 1984)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1031, file: !14, line: 1960, baseType: !904, size: 32, align: 32, offset: 2016)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1031, file: !14, line: 1984, baseType: !904, size: 32, align: 32, offset: 2048)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1031, file: !14, line: 1991, baseType: !904, size: 32, align: 32, offset: 2080)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1031, file: !14, line: 1996, baseType: !904, size: 32, align: 32, offset: 2112)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1031, file: !14, line: 2004, baseType: !904, size: 32, align: 32, offset: 2144)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1031, file: !14, line: 2011, baseType: !904, size: 32, align: 32, offset: 2176)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1031, file: !14, line: 2018, baseType: !904, size: 32, align: 32, offset: 2208)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1031, file: !14, line: 2027, baseType: !904, size: 32, align: 32, offset: 2240)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1031, file: !14, line: 2034, baseType: !904, size: 32, align: 32, offset: 2272)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1031, file: !14, line: 2044, baseType: !904, size: 32, align: 32, offset: 2304)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1031, file: !14, line: 2054, baseType: !1360, size: 64, align: 64, offset: 2368)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1031, file: !14, line: 2061, baseType: !1360, size: 64, align: 64, offset: 2432)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1031, file: !14, line: 2066, baseType: !904, size: 32, align: 32, offset: 2496)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1031, file: !14, line: 2070, baseType: !904, size: 32, align: 32, offset: 2528)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1031, file: !14, line: 2078, baseType: !904, size: 32, align: 32, offset: 2560)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1031, file: !14, line: 2085, baseType: !904, size: 32, align: 32, offset: 2592)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1031, file: !14, line: 2092, baseType: !904, size: 32, align: 32, offset: 2624)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1031, file: !14, line: 2099, baseType: !904, size: 32, align: 32, offset: 2656)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1031, file: !14, line: 2106, baseType: !904, size: 32, align: 32, offset: 2688)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1031, file: !14, line: 2113, baseType: !904, size: 32, align: 32, offset: 2720)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1031, file: !14, line: 2120, baseType: !904, size: 32, align: 32, offset: 2752)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1031, file: !14, line: 2125, baseType: !904, size: 32, align: 32, offset: 2784)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1031, file: !14, line: 2133, baseType: !904, size: 32, align: 32, offset: 2816)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1031, file: !14, line: 2140, baseType: !904, size: 32, align: 32, offset: 2848)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1031, file: !14, line: 2145, baseType: !904, size: 32, align: 32, offset: 2880)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1031, file: !14, line: 2153, baseType: !904, size: 32, align: 32, offset: 2912)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1031, file: !14, line: 2158, baseType: !904, size: 32, align: 32, offset: 2944)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1031, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1031, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1031, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1031, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1031, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1031, file: !14, line: 2203, baseType: !904, size: 32, align: 32, offset: 3136)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1031, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1031, file: !14, line: 2212, baseType: !904, size: 32, align: 32, offset: 3200)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1031, file: !14, line: 2213, baseType: !904, size: 32, align: 32, offset: 3232)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1031, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1031, file: !14, line: 2232, baseType: !904, size: 32, align: 32, offset: 3296)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1031, file: !14, line: 2243, baseType: !904, size: 32, align: 32, offset: 3328)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1031, file: !14, line: 2249, baseType: !904, size: 32, align: 32, offset: 3360)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1031, file: !14, line: 2256, baseType: !904, size: 32, align: 32, offset: 3392)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1031, file: !14, line: 2263, baseType: !969, size: 64, align: 64, offset: 3456)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1031, file: !14, line: 2270, baseType: !969, size: 64, align: 64, offset: 3520)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1031, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1031, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1031, file: !14, line: 2367, baseType: !1396, size: 64, align: 64, offset: 3648)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!904, !1320, !1051, !904}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1031, file: !14, line: 2383, baseType: !904, size: 32, align: 32, offset: 3712)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1031, file: !14, line: 2386, baseType: !1330, size: 32, align: 32, offset: 3744)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1031, file: !14, line: 2387, baseType: !1330, size: 32, align: 32, offset: 3776)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1031, file: !14, line: 2394, baseType: !904, size: 32, align: 32, offset: 3808)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1031, file: !14, line: 2401, baseType: !904, size: 32, align: 32, offset: 3840)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1031, file: !14, line: 2408, baseType: !904, size: 32, align: 32, offset: 3872)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1031, file: !14, line: 2415, baseType: !904, size: 32, align: 32, offset: 3904)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1031, file: !14, line: 2422, baseType: !904, size: 32, align: 32, offset: 3936)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1031, file: !14, line: 2423, baseType: !1408, size: 64, align: 64, offset: 3968)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1415}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1410, file: !14, line: 827, baseType: !904, size: 32, align: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1410, file: !14, line: 828, baseType: !904, size: 32, align: 32, offset: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1410, file: !14, line: 829, baseType: !904, size: 32, align: 32, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1410, file: !14, line: 830, baseType: !1330, size: 32, align: 32, offset: 96)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1031, file: !14, line: 2430, baseType: !1072, size: 64, align: 64, offset: 4032)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1031, file: !14, line: 2437, baseType: !1072, size: 64, align: 64, offset: 4096)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1031, file: !14, line: 2444, baseType: !1330, size: 32, align: 32, offset: 4160)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1031, file: !14, line: 2451, baseType: !1330, size: 32, align: 32, offset: 4192)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1031, file: !14, line: 2458, baseType: !904, size: 32, align: 32, offset: 4224)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1031, file: !14, line: 2469, baseType: !904, size: 32, align: 32, offset: 4256)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1031, file: !14, line: 2475, baseType: !904, size: 32, align: 32, offset: 4288)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1031, file: !14, line: 2481, baseType: !904, size: 32, align: 32, offset: 4320)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1031, file: !14, line: 2485, baseType: !904, size: 32, align: 32, offset: 4352)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1031, file: !14, line: 2489, baseType: !904, size: 32, align: 32, offset: 4384)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1031, file: !14, line: 2493, baseType: !904, size: 32, align: 32, offset: 4416)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1031, file: !14, line: 2501, baseType: !904, size: 32, align: 32, offset: 4448)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1031, file: !14, line: 2506, baseType: !904, size: 32, align: 32, offset: 4480)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1031, file: !14, line: 2510, baseType: !904, size: 32, align: 32, offset: 4512)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1031, file: !14, line: 2514, baseType: !1072, size: 64, align: 64, offset: 4544)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1031, file: !14, line: 2528, baseType: !1432, size: 64, align: 64, offset: 4608)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{null, !1320, !906, !904, !904}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1031, file: !14, line: 2534, baseType: !904, size: 32, align: 32, offset: 4672)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1031, file: !14, line: 2545, baseType: !904, size: 32, align: 32, offset: 4704)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1031, file: !14, line: 2547, baseType: !904, size: 32, align: 32, offset: 4736)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1031, file: !14, line: 2549, baseType: !904, size: 32, align: 32, offset: 4768)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1031, file: !14, line: 2551, baseType: !904, size: 32, align: 32, offset: 4800)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1031, file: !14, line: 2553, baseType: !904, size: 32, align: 32, offset: 4832)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1031, file: !14, line: 2555, baseType: !904, size: 32, align: 32, offset: 4864)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1031, file: !14, line: 2557, baseType: !904, size: 32, align: 32, offset: 4896)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1031, file: !14, line: 2559, baseType: !904, size: 32, align: 32, offset: 4928)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1031, file: !14, line: 2563, baseType: !904, size: 32, align: 32, offset: 4960)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1031, file: !14, line: 2571, baseType: !1446, size: 64, align: 64, offset: 4992)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1031, file: !14, line: 2579, baseType: !1446, size: 64, align: 64, offset: 5056)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1031, file: !14, line: 2586, baseType: !904, size: 32, align: 32, offset: 5120)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1031, file: !14, line: 2615, baseType: !904, size: 32, align: 32, offset: 5152)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1031, file: !14, line: 2627, baseType: !904, size: 32, align: 32, offset: 5184)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1031, file: !14, line: 2637, baseType: !904, size: 32, align: 32, offset: 5216)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1031, file: !14, line: 2681, baseType: !904, size: 32, align: 32, offset: 5248)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1031, file: !14, line: 2709, baseType: !1072, size: 64, align: 64, offset: 5312)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1031, file: !14, line: 2716, baseType: !1455, size: 64, align: 64, offset: 5376)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1457)
!1457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1458)
!1458 = !{!1459, !1460, !1461, !1462, !1463, !1464, !1468, !1472, !1476, !1477, !1478, !1479, !1485, !1486, !1487, !1488, !1489}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1457, file: !14, line: 3642, baseType: !941, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1457, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1457, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1457, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1457, file: !14, line: 3669, baseType: !904, size: 32, align: 32, offset: 160)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1457, file: !14, line: 3682, baseType: !1465, size: 64, align: 64, offset: 192)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!904, !1029, !1051}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1457, file: !14, line: 3698, baseType: !1469, size: 64, align: 64, offset: 256)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!904, !1029, !916, !934}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1457, file: !14, line: 3712, baseType: !1473, size: 64, align: 64, offset: 320)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!904, !1029, !904, !916, !934}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1457, file: !14, line: 3726, baseType: !1469, size: 64, align: 64, offset: 384)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1457, file: !14, line: 3737, baseType: !1026, size: 64, align: 64, offset: 448)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1457, file: !14, line: 3746, baseType: !904, size: 32, align: 32, offset: 512)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1457, file: !14, line: 3757, baseType: !1480, size: 64, align: 64, offset: 576)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{null, !1483}
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1457, file: !14, line: 3766, baseType: !1026, size: 64, align: 64, offset: 640)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1457, file: !14, line: 3774, baseType: !1026, size: 64, align: 64, offset: 704)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1457, file: !14, line: 3780, baseType: !904, size: 32, align: 32, offset: 768)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1457, file: !14, line: 3785, baseType: !904, size: 32, align: 32, offset: 800)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1457, file: !14, line: 3795, baseType: !1490, size: 64, align: 64, offset: 832)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!904, !1029, !1091}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1031, file: !14, line: 2728, baseType: !906, size: 64, align: 64, offset: 5440)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1031, file: !14, line: 2735, baseType: !1081, size: 512, align: 64, offset: 5504)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1031, file: !14, line: 2742, baseType: !904, size: 32, align: 32, offset: 6016)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1031, file: !14, line: 2755, baseType: !904, size: 32, align: 32, offset: 6048)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1031, file: !14, line: 2776, baseType: !904, size: 32, align: 32, offset: 6080)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1031, file: !14, line: 2783, baseType: !904, size: 32, align: 32, offset: 6112)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1031, file: !14, line: 2791, baseType: !904, size: 32, align: 32, offset: 6144)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1031, file: !14, line: 2802, baseType: !1051, size: 64, align: 64, offset: 6208)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1031, file: !14, line: 2811, baseType: !904, size: 32, align: 32, offset: 6272)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1031, file: !14, line: 2821, baseType: !904, size: 32, align: 32, offset: 6304)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1031, file: !14, line: 2830, baseType: !904, size: 32, align: 32, offset: 6336)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1031, file: !14, line: 2840, baseType: !904, size: 32, align: 32, offset: 6368)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1031, file: !14, line: 2851, baseType: !1506, size: 64, align: 64, offset: 6400)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!904, !1320, !1509, !906, !1323, !904, !904}
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!904, !1320, !906}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1031, file: !14, line: 2871, baseType: !1513, size: 64, align: 64, offset: 6464)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!904, !1320, !1516, !906, !1323, !904}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!904, !1320, !906, !904, !904}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1031, file: !14, line: 2878, baseType: !904, size: 32, align: 32, offset: 6528)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1031, file: !14, line: 2885, baseType: !904, size: 32, align: 32, offset: 6560)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1031, file: !14, line: 3005, baseType: !904, size: 32, align: 32, offset: 6592)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1031, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1031, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1031, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1031, file: !14, line: 3037, baseType: !1057, size: 64, align: 64, offset: 6720)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1031, file: !14, line: 3038, baseType: !904, size: 32, align: 32, offset: 6784)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1031, file: !14, line: 3050, baseType: !969, size: 64, align: 64, offset: 6848)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1031, file: !14, line: 3065, baseType: !904, size: 32, align: 32, offset: 6912)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1031, file: !14, line: 3083, baseType: !904, size: 32, align: 32, offset: 6944)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1031, file: !14, line: 3092, baseType: !951, size: 64, align: 32, offset: 6976)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1031, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1031, file: !14, line: 3106, baseType: !951, size: 64, align: 32, offset: 7072)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1031, file: !14, line: 3113, baseType: !1534, size: 64, align: 64, offset: 7168)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1536)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1537)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1542, !1543, !1544, !1547}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1537, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1537, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1537, file: !14, line: 720, baseType: !941, size: 64, align: 64, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1537, file: !14, line: 724, baseType: !941, size: 64, align: 64, offset: 128)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1537, file: !14, line: 728, baseType: !904, size: 32, align: 32, offset: 192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1537, file: !14, line: 734, baseType: !1545, size: 64, align: 64, offset: 256)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1537, file: !14, line: 739, baseType: !1548, size: 64, align: 64, offset: 320)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1031, file: !14, line: 3129, baseType: !1072, size: 64, align: 64, offset: 7232)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1031, file: !14, line: 3130, baseType: !1072, size: 64, align: 64, offset: 7296)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1031, file: !14, line: 3131, baseType: !1072, size: 64, align: 64, offset: 7360)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1031, file: !14, line: 3132, baseType: !1072, size: 64, align: 64, offset: 7424)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1031, file: !14, line: 3139, baseType: !1446, size: 64, align: 64, offset: 7488)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1031, file: !14, line: 3147, baseType: !904, size: 32, align: 32, offset: 7552)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1031, file: !14, line: 3165, baseType: !904, size: 32, align: 32, offset: 7584)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1031, file: !14, line: 3172, baseType: !904, size: 32, align: 32, offset: 7616)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1031, file: !14, line: 3180, baseType: !904, size: 32, align: 32, offset: 7648)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1031, file: !14, line: 3191, baseType: !1360, size: 64, align: 64, offset: 7680)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1031, file: !14, line: 3199, baseType: !1057, size: 64, align: 64, offset: 7744)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1031, file: !14, line: 3207, baseType: !1446, size: 64, align: 64, offset: 7808)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1031, file: !14, line: 3214, baseType: !905, size: 32, align: 32, offset: 7872)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1031, file: !14, line: 3224, baseType: !1189, size: 64, align: 64, offset: 7936)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1031, file: !14, line: 3225, baseType: !904, size: 32, align: 32, offset: 8000)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1031, file: !14, line: 3249, baseType: !1091, size: 64, align: 64, offset: 8064)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1031, file: !14, line: 3256, baseType: !904, size: 32, align: 32, offset: 8128)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1031, file: !14, line: 3271, baseType: !904, size: 32, align: 32, offset: 8160)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1031, file: !14, line: 3279, baseType: !1072, size: 64, align: 64, offset: 8192)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1031, file: !14, line: 3301, baseType: !1091, size: 64, align: 64, offset: 8256)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1031, file: !14, line: 3310, baseType: !904, size: 32, align: 32, offset: 8320)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1031, file: !14, line: 3337, baseType: !904, size: 32, align: 32, offset: 8352)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1031, file: !14, line: 3351, baseType: !904, size: 32, align: 32, offset: 8384)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1031, file: !14, line: 3359, baseType: !904, size: 32, align: 32, offset: 8416)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !938, file: !14, line: 3535, baseType: !1575, size: 64, align: 64, offset: 1024)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{!904, !1029, !1578}
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !938, file: !14, line: 3541, baseType: !1581, size: 64, align: 64, offset: 1088)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1583)
!1583 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1584)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1045, line: 223, size: 128, align: 64, elements: !1585)
!1585 = !{!1586, !1587}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1584, file: !1045, line: 224, baseType: !916, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1584, file: !1045, line: 225, baseType: !916, size: 64, align: 64, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !938, file: !14, line: 3549, baseType: !1589, size: 64, align: 64, offset: 1152)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{null, !1024}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !938, file: !14, line: 3551, baseType: !1026, size: 64, align: 64, offset: 1216)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !938, file: !14, line: 3552, baseType: !1594, size: 64, align: 64, offset: 1280)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{!904, !1029, !1057, !904, !1597}
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1599)
!1599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1600)
!1600 = !{!1601, !1602, !1603, !1604, !1605, !1629}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1599, file: !14, line: 3921, baseType: !913, size: 16, align: 16)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1599, file: !14, line: 3922, baseType: !934, size: 32, align: 32, offset: 32)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1599, file: !14, line: 3923, baseType: !934, size: 32, align: 32, offset: 64)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1599, file: !14, line: 3924, baseType: !905, size: 32, align: 32, offset: 96)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1599, file: !14, line: 3925, baseType: !1606, size: 64, align: 64, offset: 128)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1609)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1610)
!1610 = !{!1611, !1612, !1613, !1614, !1615, !1616, !1622, !1624, !1625, !1626, !1627, !1628}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1609, file: !14, line: 3886, baseType: !904, size: 32, align: 32)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1609, file: !14, line: 3887, baseType: !904, size: 32, align: 32, offset: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1609, file: !14, line: 3888, baseType: !904, size: 32, align: 32, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1609, file: !14, line: 3889, baseType: !904, size: 32, align: 32, offset: 96)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1609, file: !14, line: 3890, baseType: !904, size: 32, align: 32, offset: 128)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1609, file: !14, line: 3897, baseType: !1617, size: 768, align: 64, offset: 192)
!1617 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1618)
!1618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1619)
!1619 = !{!1620, !1621}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1618, file: !14, line: 3855, baseType: !1056, size: 512, align: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1618, file: !14, line: 3857, baseType: !1061, size: 256, align: 32, offset: 512)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1609, file: !14, line: 3903, baseType: !1623, size: 256, align: 64, offset: 960)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 256, align: 64, elements: !1160)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1609, file: !14, line: 3904, baseType: !1167, size: 128, align: 32, offset: 1216)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1609, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1609, file: !14, line: 3908, baseType: !1446, size: 64, align: 64, offset: 1408)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1609, file: !14, line: 3915, baseType: !1446, size: 64, align: 64, offset: 1472)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1609, file: !14, line: 3917, baseType: !904, size: 32, align: 32, offset: 1536)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1599, file: !14, line: 3926, baseType: !1072, size: 64, align: 64, offset: 192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !938, file: !14, line: 3564, baseType: !1631, size: 64, align: 64, offset: 1344)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DISubroutineType(types: !1633)
!1633 = !{!904, !1029, !1177, !1321, !1323}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !938, file: !14, line: 3566, baseType: !1635, size: 64, align: 64, offset: 1408)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!904, !1029, !906, !1323, !1177}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !938, file: !14, line: 3567, baseType: !1026, size: 64, align: 64, offset: 1472)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !938, file: !14, line: 3576, baseType: !1640, size: 64, align: 64, offset: 1536)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!904, !1029, !1321}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !938, file: !14, line: 3577, baseType: !1644, size: 64, align: 64, offset: 1600)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!904, !1029, !1177}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !938, file: !14, line: 3584, baseType: !1465, size: 64, align: 64, offset: 1664)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !938, file: !14, line: 3589, baseType: !1649, size: 64, align: 64, offset: 1728)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{null, !1029}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !938, file: !14, line: 3594, baseType: !904, size: 32, align: 32, offset: 1792)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !938, file: !14, line: 3600, baseType: !941, size: 64, align: 64, offset: 1856)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !938, file: !14, line: 3609, baseType: !1655, size: 64, align: 64, offset: 1920)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1658)
!1658 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1659 = distinct !DIGlobalVariable(name: "mss4_dc_vlc_lens", scope: !0, file: !888, line: 55, type: !1660, isLocal: true, isDefinition: true, variable: [2 x [16 x i8]]* @mss4_dc_vlc_lens)
!1660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 8, elements: !1661)
!1661 = !{!928, !1662}
!1662 = !DISubrange(count: 16)
!1663 = distinct !DIGlobalVariable(name: "mss4_ac_vlc_lens", scope: !0, file: !888, line: 60, type: !1660, isLocal: true, isDefinition: true, variable: [2 x [16 x i8]]* @mss4_ac_vlc_lens)
!1664 = distinct !DIGlobalVariable(name: "mss4_ac_vlc_syms", scope: !0, file: !888, line: 65, type: !1665, isLocal: true, isDefinition: true, variable: [2 x [162 x i8]]* @mss4_ac_vlc_syms)
!1665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 2592, align: 8, elements: !1666)
!1666 = !{!928, !1667}
!1667 = !DISubrange(count: 162)
!1668 = distinct !DIGlobalVariable(name: "mss4_vec_entry_vlc_lens", scope: !0, file: !888, line: 115, type: !1660, isLocal: true, isDefinition: true, variable: [2 x [16 x i8]]* @mss4_vec_entry_vlc_lens)
!1669 = distinct !DIGlobalVariable(name: "mss4_vec_entry_vlc_syms", scope: !0, file: !888, line: 120, type: !1670, isLocal: true, isDefinition: true, variable: [2 x [9 x i8]]* @mss4_vec_entry_vlc_syms)
!1670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 144, align: 8, elements: !1671)
!1671 = !{!928, !1672}
!1672 = !DISubrange(count: 9)
!1673 = distinct !DIGlobalVariable(name: "vec_len_syms", scope: !0, file: !888, line: 110, type: !1674, isLocal: true, isDefinition: true, variable: [2 x [4 x i8]]* @vec_len_syms)
!1674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 64, align: 8, elements: !1675)
!1675 = !{!928, !1161}
!1676 = !{i32 2, !"Dwarf Version", i32 4}
!1677 = !{i32 2, !"Debug Info Version", i32 3}
