; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mp3_header_decompress_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mp3_header_decompress_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!555 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!556 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!557 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!558 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!559 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!560 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!561 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!562 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!563 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!564 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!565 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!566 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!567 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!568 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!569 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !620}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64, align: 64)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !614, line: 221, size: 32, align: 8, elements: !615)
!614 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !613, file: !614, line: 221, baseType: !617, size: 32, align: 32)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !618, line: 51, baseType: !619)
!618 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!619 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!621 = !{!622, !789}
!622 = distinct !DIGlobalVariable(name: "ff_mp3_header_decompress_bsf", scope: !0, file: !623, line: 120, type: !624, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_mp3_header_decompress_bsf)
!623 = !DIFile(filename: "libavcodec/mp3_header_decompress_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !625)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !627)
!627 = !{!628, !632, !635, !678, !679, !746, !784, !788}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !4, line: 5797, baseType: !629, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !626, file: !4, line: 5804, baseType: !633, size: 64, align: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64, align: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !626, file: !4, line: 5815, baseType: !636, size: 64, align: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !640)
!640 = !{!641, !642, !647, !651, !653, !654, !655, !659, !665, !667, !671}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !639, file: !464, line: 72, baseType: !629, size: 64, align: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !639, file: !464, line: 78, baseType: !643, size: 64, align: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!629, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !639, file: !464, line: 85, baseType: !648, size: 64, align: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !639, file: !464, line: 93, baseType: !652, size: 32, align: 32, offset: 192)
!652 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !639, file: !464, line: 99, baseType: !652, size: 32, align: 32, offset: 224)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !639, file: !464, line: 108, baseType: !652, size: 32, align: 32, offset: 256)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !639, file: !464, line: 113, baseType: !656, size: 64, align: 64, offset: 320)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64, align: 64)
!657 = !DISubroutineType(types: !658)
!658 = !{!646, !646, !646}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !639, file: !464, line: 123, baseType: !660, size: 64, align: 64, offset: 384)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{!663, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !639, file: !464, line: 130, baseType: !666, size: 32, align: 32, offset: 448)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !639, file: !464, line: 136, baseType: !668, size: 64, align: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!669 = !DISubroutineType(types: !670)
!670 = !{!666, !646}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !639, file: !464, line: 142, baseType: !672, size: 64, align: 64, offset: 576)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!652, !675, !646, !629, !652}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64, align: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !626, file: !4, line: 5825, baseType: !652, size: 32, align: 32, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !626, file: !4, line: 5826, baseType: !680, size: 64, align: 64, offset: 256)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64, align: 64)
!681 = !DISubroutineType(types: !682)
!682 = !{!652, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !686)
!686 = !{!687, !688, !691, !695, !696, !743, !744, !745}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !685, file: !4, line: 5751, baseType: !636, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !685, file: !4, line: 5756, baseType: !689, size: 64, align: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !685, file: !4, line: 5762, baseType: !692, size: 64, align: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !694)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !685, file: !4, line: 5768, baseType: !646, size: 64, align: 64, offset: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !685, file: !4, line: 5775, baseType: !697, size: 64, align: 64, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !700)
!700 = !{!701, !702, !703, !704, !708, !709, !710, !713, !714, !715, !716, !717, !718, !719, !726, !727, !728, !729, !730, !731, !732, !733, !736, !737, !738, !739, !740, !741, !742}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !699, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !699, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !699, file: !4, line: 3948, baseType: !617, size: 32, align: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !699, file: !4, line: 3958, baseType: !705, size: 64, align: 64, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !618, line: 48, baseType: !707)
!707 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !699, file: !4, line: 3962, baseType: !652, size: 32, align: 32, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !699, file: !4, line: 3968, baseType: !652, size: 32, align: 32, offset: 224)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !699, file: !4, line: 3973, baseType: !711, size: 64, align: 64, offset: 256)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !618, line: 40, baseType: !712)
!712 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !699, file: !4, line: 3986, baseType: !652, size: 32, align: 32, offset: 320)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !699, file: !4, line: 3999, baseType: !652, size: 32, align: 32, offset: 352)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !699, file: !4, line: 4004, baseType: !652, size: 32, align: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !699, file: !4, line: 4005, baseType: !652, size: 32, align: 32, offset: 416)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !699, file: !4, line: 4010, baseType: !652, size: 32, align: 32, offset: 448)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !699, file: !4, line: 4011, baseType: !652, size: 32, align: 32, offset: 480)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !699, file: !4, line: 4020, baseType: !720, size: 64, align: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !721, line: 61, baseType: !722)
!721 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !721, line: 58, size: 64, align: 32, elements: !723)
!723 = !{!724, !725}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !722, file: !721, line: 59, baseType: !652, size: 32, align: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !722, file: !721, line: 60, baseType: !652, size: 32, align: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !699, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !699, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !699, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !699, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !699, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !699, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !699, file: !4, line: 4039, baseType: !652, size: 32, align: 32, offset: 768)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !699, file: !4, line: 4046, baseType: !734, size: 64, align: 64, offset: 832)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !618, line: 55, baseType: !735)
!735 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !699, file: !4, line: 4050, baseType: !652, size: 32, align: 32, offset: 896)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !699, file: !4, line: 4054, baseType: !652, size: 32, align: 32, offset: 928)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !699, file: !4, line: 4061, baseType: !652, size: 32, align: 32, offset: 960)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !699, file: !4, line: 4065, baseType: !652, size: 32, align: 32, offset: 992)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !699, file: !4, line: 4073, baseType: !652, size: 32, align: 32, offset: 1024)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !699, file: !4, line: 4080, baseType: !652, size: 32, align: 32, offset: 1056)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !699, file: !4, line: 4084, baseType: !652, size: 32, align: 32, offset: 1088)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !685, file: !4, line: 5781, baseType: !697, size: 64, align: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !685, file: !4, line: 5787, baseType: !720, size: 64, align: 32, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !685, file: !4, line: 5793, baseType: !720, size: 64, align: 32, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !626, file: !4, line: 5827, baseType: !747, size: 64, align: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64, align: 64)
!748 = !DISubroutineType(types: !749)
!749 = !{!652, !683, !750}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !753)
!753 = !{!754, !766, !767, !768, !769, !770, !771, !772, !780, !781, !782, !783}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !752, file: !4, line: 1451, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64, align: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !757, line: 94, baseType: !758)
!757 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !757, line: 81, size: 192, align: 64, elements: !759)
!759 = !{!760, !764, !765}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !758, file: !757, line: 82, baseType: !761, size: 64, align: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !757, line: 73, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !757, line: 73, flags: DIFlagFwdDecl)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !758, file: !757, line: 89, baseType: !705, size: 64, align: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !758, file: !757, line: 93, baseType: !652, size: 32, align: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !752, file: !4, line: 1461, baseType: !711, size: 64, align: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !752, file: !4, line: 1467, baseType: !711, size: 64, align: 64, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !752, file: !4, line: 1468, baseType: !705, size: 64, align: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !752, file: !4, line: 1469, baseType: !652, size: 32, align: 32, offset: 256)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !752, file: !4, line: 1470, baseType: !652, size: 32, align: 32, offset: 288)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !752, file: !4, line: 1474, baseType: !652, size: 32, align: 32, offset: 320)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !752, file: !4, line: 1479, baseType: !773, size: 64, align: 64, offset: 384)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64, align: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !775, file: !4, line: 1412, baseType: !705, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !775, file: !4, line: 1413, baseType: !652, size: 32, align: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !775, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !752, file: !4, line: 1480, baseType: !652, size: 32, align: 32, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !752, file: !4, line: 1486, baseType: !711, size: 64, align: 64, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !752, file: !4, line: 1488, baseType: !711, size: 64, align: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !752, file: !4, line: 1497, baseType: !711, size: 64, align: 64, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !626, file: !4, line: 5828, baseType: !785, size: 64, align: 64, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64, align: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !683}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !626, file: !4, line: 5829, baseType: !785, size: 64, align: 64, offset: 448)
!789 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !623, line: 116, type: !790, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 64, align: 32, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 2)
!793 = !{i32 2, !"Dwarf Version", i32 4}
!794 = !{i32 2, !"Debug Info Version", i32 3}
!795 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!796 = distinct !DISubprogram(name: "mp3_header_decompress", scope: !623, file: !623, line: 29, type: !748, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !797)
!797 = !{}
!798 = !DILocalVariable(name: "x", arg: 1, scope: !799, file: !800, line: 66, type: !617)
!799 = distinct !DISubprogram(name: "av_bswap32", scope: !800, file: !800, line: 66, type: !801, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !797)
!800 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!801 = !DISubroutineType(types: !802)
!802 = !{!617, !617}
!803 = !DIExpression()
!804 = !DILocation(line: 66, column: 98, scope: !799, inlinedAt: !805)
!805 = distinct !DILocation(line: 60, column: 13, scope: !796)
!806 = !DILocation(line: 66, column: 98, scope: !799, inlinedAt: !807)
!807 = distinct !DILocation(line: 107, column: 51, scope: !796)
!808 = !DILocation(line: 66, column: 98, scope: !799, inlinedAt: !809)
!809 = distinct !DILocation(line: 46, column: 14, scope: !796)
!810 = !DILocalVariable(name: "ctx", arg: 1, scope: !796, file: !623, line: 29, type: !683)
!811 = !DILocation(line: 29, column: 48, scope: !796)
!812 = !DILocalVariable(name: "out", arg: 2, scope: !796, file: !623, line: 29, type: !750)
!813 = !DILocation(line: 29, column: 63, scope: !796)
!814 = !DILocalVariable(name: "in", scope: !796, file: !623, line: 31, type: !750)
!815 = !DILocation(line: 31, column: 15, scope: !796)
!816 = !DILocalVariable(name: "header", scope: !796, file: !623, line: 32, type: !617)
!817 = !DILocation(line: 32, column: 14, scope: !796)
!818 = !DILocalVariable(name: "sample_rate", scope: !796, file: !623, line: 33, type: !652)
!819 = !DILocation(line: 33, column: 9, scope: !796)
!820 = !DILocation(line: 33, column: 22, scope: !796)
!821 = !DILocation(line: 33, column: 27, scope: !796)
!822 = !DILocation(line: 33, column: 35, scope: !796)
!823 = !DILocalVariable(name: "sample_rate_index", scope: !796, file: !623, line: 34, type: !652)
!824 = !DILocation(line: 34, column: 9, scope: !796)
!825 = !DILocalVariable(name: "lsf", scope: !796, file: !623, line: 35, type: !652)
!826 = !DILocation(line: 35, column: 9, scope: !796)
!827 = !DILocalVariable(name: "mpeg25", scope: !796, file: !623, line: 35, type: !652)
!828 = !DILocation(line: 35, column: 14, scope: !796)
!829 = !DILocalVariable(name: "bitrate_index", scope: !796, file: !623, line: 35, type: !652)
!830 = !DILocation(line: 35, column: 22, scope: !796)
!831 = !DILocalVariable(name: "frame_size", scope: !796, file: !623, line: 35, type: !652)
!832 = !DILocation(line: 35, column: 37, scope: !796)
!833 = !DILocalVariable(name: "ret", scope: !796, file: !623, line: 35, type: !652)
!834 = !DILocation(line: 35, column: 49, scope: !796)
!835 = !DILocalVariable(name: "buf", scope: !796, file: !623, line: 36, type: !705)
!836 = !DILocation(line: 36, column: 14, scope: !796)
!837 = !DILocalVariable(name: "buf_size", scope: !796, file: !623, line: 37, type: !652)
!838 = !DILocation(line: 37, column: 9, scope: !796)
!839 = !DILocation(line: 39, column: 29, scope: !796)
!840 = !DILocation(line: 39, column: 11, scope: !796)
!841 = !DILocation(line: 39, column: 9, scope: !796)
!842 = !DILocation(line: 40, column: 9, scope: !843)
