; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dca.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dca.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }
%union.unaligned_32 = type { i32 }
%union.unaligned_16 = type { i16 }
%struct.DCACoreFrameHeader = type { i8, i8, i8, i8, i16, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }

@avpriv_dca_sample_rates = constant [16 x i32] [i32 0, i32 8000, i32 16000, i32 32000, i32 0, i32 0, i32 11025, i32 22050, i32 44100, i32 0, i32 0, i32 12000, i32 24000, i32 48000, i32 96000, i32 192000], align 16
@ff_dca_sampling_freqs = constant [16 x i32] [i32 8000, i32 16000, i32 32000, i32 64000, i32 128000, i32 22050, i32 44100, i32 88200, i32 176400, i32 352800, i32 12000, i32 24000, i32 48000, i32 96000, i32 192000, i32 384000], align 16
@ff_dca_freq_ranges = constant [16 x i8] c"\00\01\02\03\04\01\02\03\04\04\00\01\02\03\04\04", align 16
@ff_dca_bits_per_sample = constant [8 x i8] c"\10\10\14\14\00\18\18\00", align 1
@.str = private unnamed_addr constant [43 x i8] c"Internal error, put_bits buffer too small\0A\00", align 1
@.str.1 = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1

!51 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!53 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !44, line: 48, baseType: !57)
!57 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!58 = !{!59, !65, !66, !69}
!59 = distinct !DIGlobalVariable(name: "avpriv_dca_sample_rates", scope: !0, file: !60, line: 36, type: !61, isLocal: false, isDefinition: true, variable: [16 x i32]* @avpriv_dca_sample_rates)
!60 = !DIFile(filename: "libavcodec/dca.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 512, align: 32, elements: !63)
!62 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!63 = !{!64}
!64 = !DISubrange(count: 16)
!65 = distinct !DIGlobalVariable(name: "ff_dca_sampling_freqs", scope: !0, file: !60, line: 41, type: !61, isLocal: false, isDefinition: true, variable: [16 x i32]* @ff_dca_sampling_freqs)
!66 = distinct !DIGlobalVariable(name: "ff_dca_freq_ranges", scope: !0, file: !60, line: 46, type: !67, isLocal: false, isDefinition: true, variable: [16 x i8]* @ff_dca_freq_ranges)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 128, align: 8, elements: !63)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!69 = distinct !DIGlobalVariable(name: "ff_dca_bits_per_sample", scope: !0, file: !60, line: 50, type: !70, isLocal: false, isDefinition: true, variable: [8 x i8]* @ff_dca_bits_per_sample)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64, align: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 8)
!73 = !{i32 2, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!76 = distinct !DISubprogram(name: "avpriv_dca_convert_bitstream", scope: !60, file: !60, line: 54, type: !77, isLocal: false, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!77 = !DISubroutineType(types: !78)
!78 = !{!53, !79, !53, !80, !53}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!81 = !{}
!82 = !DILocalVariable(name: "x", arg: 1, scope: !83, file: !84, line: 58, type: !50)
!83 = distinct !DISubprogram(name: "av_bswap16", scope: !84, file: !84, line: 58, type: !85, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!84 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!85 = !DISubroutineType(types: !86)
!86 = !{!50, !50}
!87 = !DIExpression()
!88 = !DILocation(line: 58, column: 98, scope: !83, inlinedAt: !89)
!89 = distinct !DILocation(line: 81, column: 43, scope: !90)
!90 = !DILexicalBlockFile(scope: !91, file: !60, discriminator: 1)
!91 = distinct !DILexicalBlock(scope: !92, file: !60, line: 80, column: 61)
!92 = distinct !DILexicalBlock(scope: !93, file: !60, line: 80, column: 9)
!93 = distinct !DILexicalBlock(scope: !94, file: !60, line: 80, column: 9)
!94 = distinct !DILexicalBlock(scope: !76, file: !60, line: 65, column: 18)
!95 = !DILocation(line: 58, column: 98, scope: !83, inlinedAt: !96)
!96 = distinct !DILocation(line: 72, column: 53, scope: !97)
!97 = distinct !DILexicalBlock(scope: !98, file: !60, line: 71, column: 51)
!98 = distinct !DILexicalBlock(scope: !99, file: !60, line: 71, column: 9)
!99 = distinct !DILexicalBlock(scope: !94, file: !60, line: 71, column: 9)
!100 = !DILocalVariable(name: "x", arg: 1, scope: !101, file: !84, line: 66, type: !43)
!101 = distinct !DISubprogram(name: "av_bswap32", scope: !84, file: !84, line: 66, type: !102, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!102 = !DISubroutineType(types: !103)
!103 = !{!43, !43}
!104 = !DILocation(line: 66, column: 98, scope: !101, inlinedAt: !105)
!105 = distinct !DILocation(line: 64, column: 11, scope: !76)
!106 = !DILocalVariable(name: "src", arg: 1, scope: !76, file: !60, line: 54, type: !79)
!107 = !DILocation(line: 54, column: 49, scope: !76)
!108 = !DILocalVariable(name: "src_size", arg: 2, scope: !76, file: !60, line: 54, type: !53)
!109 = !DILocation(line: 54, column: 58, scope: !76)
!110 = !DILocalVariable(name: "dst", arg: 3, scope: !76, file: !60, line: 54, type: !80)
!111 = !DILocation(line: 54, column: 77, scope: !76)
!112 = !DILocalVariable(name: "max_size", arg: 4, scope: !76, file: !60, line: 55, type: !53)
!113 = !DILocation(line: 55, column: 34, scope: !76)
!114 = !DILocalVariable(name: "mrk", scope: !76, file: !60, line: 57, type: !43)
!115 = !DILocation(line: 57, column: 14, scope: !76)
!116 = !DILocalVariable(name: "i", scope: !76, file: !60, line: 58, type: !53)
!117 = !DILocation(line: 58, column: 9, scope: !76)
!118 = !DILocalVariable(name: "tmp", scope: !76, file: !60, line: 58, type: !53)
!119 = !DILocation(line: 58, column: 12, scope: !76)
!120 = !DILocalVariable(name: "pb", scope: !76, file: !60, line: 59, type: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !122, line: 40, baseType: !123)
!122 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !122, line: 35, size: 320, align: 64, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !123, file: !122, line: 36, baseType: !43, size: 32, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !123, file: !122, line: 37, baseType: !53, size: 32, align: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !123, file: !122, line: 38, baseType: !80, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !123, file: !122, line: 38, baseType: !80, size: 64, align: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !123, file: !122, line: 38, baseType: !80, size: 64, align: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !123, file: !122, line: 39, baseType: !53, size: 32, align: 32, offset: 256)
!131 = !DILocation(line: 59, column: 19, scope: !76)
!132 = !DILocation(line: 61, column: 20, scope: !133)
!133 = distinct !DILexicalBlock(scope: !76, file: !60, line: 61, column: 9)
!134 = !DILocation(line: 61, column: 42, scope: !133)
!135 = !DILocation(line: 61, column: 29, scope: !133)
!136 = !DILocation(line: 61, column: 9, scope: !76)
!137 = !DILocation(line: 62, column: 20, scope: !133)
!138 = !DILocation(line: 62, column: 18, scope: !133)
!139 = !DILocation(line: 62, column: 9, scope: !133)
!140 = !DILocation(line: 64, column: 54, scope: !76)
!141 = !DILocation(line: 64, column: 61, scope: !76)
!142 = !DILocation(line: 64, column: 11, scope: !76)
!143 = !DILocation(line: 68, column: 16, scope: !101, inlinedAt: !105)
!144 = !DILocation(line: 68, column: 19, scope: !101, inlinedAt: !105)
!145 = !DILocation(line: 68, column: 24, scope: !101, inlinedAt: !105)
!146 = !DILocation(line: 68, column: 38, scope: !101, inlinedAt: !105)
!147 = !DILocation(line: 68, column: 41, scope: !101, inlinedAt: !105)
!148 = !DILocation(line: 68, column: 46, scope: !101, inlinedAt: !105)
!149 = !DILocation(line: 68, column: 34, scope: !101, inlinedAt: !105)
!150 = !DILocation(line: 68, column: 57, scope: !101, inlinedAt: !105)
!151 = !DILocation(line: 68, column: 69, scope: !101, inlinedAt: !105)
!152 = !DILocation(line: 68, column: 72, scope: !101, inlinedAt: !105)
!153 = !DILocation(line: 68, column: 79, scope: !101, inlinedAt: !105)
!154 = !DILocation(line: 68, column: 84, scope: !101, inlinedAt: !105)
!155 = !DILocation(line: 68, column: 99, scope: !101, inlinedAt: !105)
!156 = !DILocation(line: 68, column: 102, scope: !101, inlinedAt: !105)
!157 = !DILocation(line: 68, column: 109, scope: !101, inlinedAt: !105)
!158 = !DILocation(line: 68, column: 114, scope: !101, inlinedAt: !105)
!159 = !DILocation(line: 68, column: 94, scope: !101, inlinedAt: !105)
!160 = !DILocation(line: 68, column: 63, scope: !101, inlinedAt: !105)
!161 = !DILocation(line: 64, column: 9, scope: !76)
!162 = !DILocation(line: 65, column: 13, scope: !76)
!163 = !DILocation(line: 65, column: 5, scope: !76)
!164 = !DILocation(line: 68, column: 16, scope: !94)
!165 = !DILocation(line: 68, column: 21, scope: !94)
!166 = !DILocation(line: 68, column: 26, scope: !94)
!167 = !DILocation(line: 68, column: 9, scope: !94)
!168 = !DILocation(line: 69, column: 16, scope: !94)
!169 = !DILocation(line: 69, column: 9, scope: !94)
!170 = !DILocation(line: 71, column: 16, scope: !99)
!171 = !DILocation(line: 71, column: 14, scope: !99)
!172 = !DILocation(line: 71, column: 21, scope: !173)
!173 = !DILexicalBlockFile(scope: !98, file: !60, discriminator: 1)
!174 = !DILocation(line: 71, column: 26, scope: !173)
!175 = !DILocation(line: 71, column: 35, scope: !173)
!176 = !DILocation(line: 71, column: 40, scope: !173)
!177 = !DILocation(line: 71, column: 23, scope: !173)
!178 = !DILocation(line: 71, column: 9, scope: !173)
!179 = !DILocation(line: 72, column: 96, scope: !97)
!180 = !DILocation(line: 72, column: 103, scope: !97)
!181 = !DILocation(line: 72, column: 53, scope: !97)
!182 = !DILocation(line: 60, column: 9, scope: !83, inlinedAt: !96)
!183 = !DILocation(line: 60, column: 10, scope: !83, inlinedAt: !96)
!184 = !DILocation(line: 60, column: 18, scope: !83, inlinedAt: !96)
!185 = !DILocation(line: 60, column: 19, scope: !83, inlinedAt: !96)
!186 = !DILocation(line: 60, column: 15, scope: !83, inlinedAt: !96)
!187 = !DILocation(line: 60, column: 8, scope: !83, inlinedAt: !96)
!188 = !DILocation(line: 60, column: 6, scope: !83, inlinedAt: !96)
!189 = !DILocation(line: 61, column: 12, scope: !83, inlinedAt: !96)
!190 = !DILocation(line: 72, column: 40, scope: !97)
!191 = !DILocation(line: 72, column: 47, scope: !97)
!192 = !DILocation(line: 72, column: 50, scope: !97)
!193 = !DILocation(line: 73, column: 17, scope: !97)
!194 = !DILocation(line: 74, column: 17, scope: !97)
!195 = !DILocation(line: 75, column: 9, scope: !97)
!196 = !DILocation(line: 71, column: 47, scope: !197)
!197 = !DILexicalBlockFile(scope: !98, file: !60, discriminator: 2)
!198 = !DILocation(line: 71, column: 9, scope: !197)
!199 = distinct !{!199, !200}
!200 = !DILocation(line: 71, column: 9, scope: !94)
!201 = !DILocation(line: 76, column: 16, scope: !94)
!202 = !DILocation(line: 76, column: 9, scope: !94)
!203 = !DILocation(line: 79, column: 28, scope: !94)
!204 = !DILocation(line: 79, column: 33, scope: !94)
!205 = !DILocation(line: 79, column: 9, scope: !94)
!206 = !DILocation(line: 80, column: 16, scope: !93)
!207 = !DILocation(line: 80, column: 14, scope: !93)
!208 = !DILocation(line: 80, column: 21, scope: !209)
!209 = !DILexicalBlockFile(scope: !92, file: !60, discriminator: 1)
!210 = !DILocation(line: 80, column: 26, scope: !209)
!211 = !DILocation(line: 80, column: 35, scope: !209)
!212 = !DILocation(line: 80, column: 40, scope: !209)
!213 = !DILocation(line: 80, column: 23, scope: !209)
!214 = !DILocation(line: 80, column: 9, scope: !209)
!215 = !DILocation(line: 81, column: 21, scope: !91)
!216 = !DILocation(line: 81, column: 25, scope: !91)
!217 = !DILocation(line: 81, column: 20, scope: !91)
!218 = !DILocation(line: 81, column: 86, scope: !90)
!219 = !DILocation(line: 81, column: 93, scope: !90)
!220 = !DILocation(line: 81, column: 43, scope: !90)
!221 = !DILocation(line: 60, column: 9, scope: !83, inlinedAt: !89)
!222 = !DILocation(line: 60, column: 10, scope: !83, inlinedAt: !89)
!223 = !DILocation(line: 60, column: 18, scope: !83, inlinedAt: !89)
!224 = !DILocation(line: 60, column: 19, scope: !83, inlinedAt: !89)
!225 = !DILocation(line: 60, column: 15, scope: !83, inlinedAt: !89)
!226 = !DILocation(line: 60, column: 8, scope: !83, inlinedAt: !89)
!227 = !DILocation(line: 60, column: 6, scope: !83, inlinedAt: !89)
!228 = !DILocation(line: 61, column: 12, scope: !83, inlinedAt: !89)
!229 = !DILocation(line: 81, column: 20, scope: !90)
!230 = !DILocation(line: 81, column: 131, scope: !231)
!231 = !DILexicalBlockFile(scope: !91, file: !60, discriminator: 2)
!232 = !DILocation(line: 81, column: 138, scope: !231)
!233 = !DILocation(line: 81, column: 99, scope: !231)
!234 = !DILocation(line: 81, column: 20, scope: !231)
!235 = !DILocation(line: 81, column: 20, scope: !236)
!236 = !DILexicalBlockFile(scope: !91, file: !60, discriminator: 3)
!237 = !DILocation(line: 81, column: 142, scope: !236)
!238 = !DILocation(line: 81, column: 17, scope: !236)
!239 = !DILocation(line: 82, column: 31, scope: !91)
!240 = !DILocation(line: 82, column: 13, scope: !91)
!241 = !DILocation(line: 83, column: 9, scope: !91)
!242 = !DILocation(line: 80, column: 47, scope: !243)
!243 = !DILexicalBlockFile(scope: !92, file: !60, discriminator: 2)
!244 = !DILocation(line: 80, column: 55, scope: !243)
!245 = !DILocation(line: 80, column: 9, scope: !243)
!246 = distinct !{!246, !247}
!247 = !DILocation(line: 80, column: 9, scope: !94)
!248 = !DILocation(line: 84, column: 9, scope: !94)
!249 = !DILocation(line: 85, column: 17, scope: !94)
!250 = !DILocation(line: 85, column: 37, scope: !94)
!251 = !DILocation(line: 85, column: 42, scope: !94)
!252 = !DILocation(line: 85, column: 9, scope: !94)
!253 = !DILocation(line: 87, column: 9, scope: !94)
!254 = !DILocation(line: 89, column: 1, scope: !76)
!255 = distinct !DISubprogram(name: "init_put_bits", scope: !122, file: !122, line: 48, type: !256, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !258, !80, !53}
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!259 = !DILocalVariable(name: "s", arg: 1, scope: !255, file: !122, line: 48, type: !258)
!260 = !DILocation(line: 48, column: 49, scope: !255)
!261 = !DILocalVariable(name: "buffer", arg: 2, scope: !255, file: !122, line: 48, type: !80)
!262 = !DILocation(line: 48, column: 61, scope: !255)
!263 = !DILocalVariable(name: "buffer_size", arg: 3, scope: !255, file: !122, line: 49, type: !53)
!264 = !DILocation(line: 49, column: 38, scope: !255)
!265 = !DILocation(line: 51, column: 9, scope: !266)
!266 = distinct !DILexicalBlock(scope: !255, file: !122, line: 51, column: 9)
!267 = !DILocation(line: 51, column: 21, scope: !266)
!268 = !DILocation(line: 51, column: 9, scope: !255)
!269 = !DILocation(line: 52, column: 21, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !122, line: 51, column: 26)
!271 = !DILocation(line: 53, column: 16, scope: !270)
!272 = !DILocation(line: 54, column: 5, scope: !270)
!273 = !DILocation(line: 56, column: 27, scope: !255)
!274 = !DILocation(line: 56, column: 25, scope: !255)
!275 = !DILocation(line: 56, column: 5, scope: !255)
!276 = !DILocation(line: 56, column: 8, scope: !255)
!277 = !DILocation(line: 56, column: 21, scope: !255)
!278 = !DILocation(line: 57, column: 14, scope: !255)
!279 = !DILocation(line: 57, column: 5, scope: !255)
!280 = !DILocation(line: 57, column: 8, scope: !255)
!281 = !DILocation(line: 57, column: 12, scope: !255)
!282 = !DILocation(line: 58, column: 18, scope: !255)
!283 = !DILocation(line: 58, column: 21, scope: !255)
!284 = !DILocation(line: 58, column: 27, scope: !255)
!285 = !DILocation(line: 58, column: 25, scope: !255)
!286 = !DILocation(line: 58, column: 5, scope: !255)
!287 = !DILocation(line: 58, column: 8, scope: !255)
!288 = !DILocation(line: 58, column: 16, scope: !255)
!289 = !DILocation(line: 59, column: 18, scope: !255)
!290 = !DILocation(line: 59, column: 21, scope: !255)
!291 = !DILocation(line: 59, column: 5, scope: !255)
!292 = !DILocation(line: 59, column: 8, scope: !255)
!293 = !DILocation(line: 59, column: 16, scope: !255)
!294 = !DILocation(line: 60, column: 5, scope: !255)
!295 = !DILocation(line: 60, column: 8, scope: !255)
!296 = !DILocation(line: 60, column: 17, scope: !255)
!297 = !DILocation(line: 61, column: 5, scope: !255)
!298 = !DILocation(line: 61, column: 8, scope: !255)
!299 = !DILocation(line: 61, column: 16, scope: !255)
!300 = !DILocation(line: 62, column: 1, scope: !255)
!301 = distinct !DISubprogram(name: "put_bits", scope: !122, file: !122, line: 164, type: !302, isLocal: true, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !258, !53, !36}
!304 = !DILocation(line: 66, column: 98, scope: !101, inlinedAt: !305)
!305 = distinct !DILocation(line: 197, column: 60, scope: !306)
!306 = distinct !DILexicalBlock(scope: !307, file: !122, line: 196, column: 42)
!307 = distinct !DILexicalBlock(scope: !308, file: !122, line: 196, column: 13)
!308 = distinct !DILexicalBlock(scope: !309, file: !122, line: 193, column: 12)
!309 = distinct !DILexicalBlock(scope: !301, file: !122, line: 190, column: 9)
!310 = !DILocalVariable(name: "s", arg: 1, scope: !301, file: !122, line: 164, type: !258)
!311 = !DILocation(line: 164, column: 44, scope: !301)
!312 = !DILocalVariable(name: "n", arg: 2, scope: !301, file: !122, line: 164, type: !53)
!313 = !DILocation(line: 164, column: 51, scope: !301)
!314 = !DILocalVariable(name: "value", arg: 3, scope: !301, file: !122, line: 164, type: !36)
!315 = !DILocation(line: 164, column: 67, scope: !301)
!316 = !DILocalVariable(name: "bit_buf", scope: !301, file: !122, line: 166, type: !36)
!317 = !DILocation(line: 166, column: 18, scope: !301)
!318 = !DILocalVariable(name: "bit_left", scope: !301, file: !122, line: 167, type: !53)
!319 = !DILocation(line: 167, column: 9, scope: !301)
!320 = !DILocation(line: 171, column: 15, scope: !301)
!321 = !DILocation(line: 171, column: 18, scope: !301)
!322 = !DILocation(line: 171, column: 13, scope: !301)
!323 = !DILocation(line: 172, column: 16, scope: !301)
!324 = !DILocation(line: 172, column: 19, scope: !301)
!325 = !DILocation(line: 172, column: 14, scope: !301)
!326 = !DILocation(line: 190, column: 9, scope: !309)
!327 = !DILocation(line: 190, column: 13, scope: !309)
!328 = !DILocation(line: 190, column: 11, scope: !309)
!329 = !DILocation(line: 190, column: 9, scope: !301)
!330 = !DILocation(line: 191, column: 20, scope: !331)
!331 = distinct !DILexicalBlock(scope: !309, file: !122, line: 190, column: 23)
!332 = !DILocation(line: 191, column: 31, scope: !331)
!333 = !DILocation(line: 191, column: 28, scope: !331)
!334 = !DILocation(line: 191, column: 36, scope: !331)
!335 = !DILocation(line: 191, column: 34, scope: !331)
!336 = !DILocation(line: 191, column: 17, scope: !331)
!337 = !DILocation(line: 192, column: 21, scope: !331)
!338 = !DILocation(line: 192, column: 18, scope: !331)
!339 = !DILocation(line: 193, column: 5, scope: !331)
!340 = !DILocation(line: 194, column: 21, scope: !308)
!341 = !DILocation(line: 194, column: 17, scope: !308)
!342 = !DILocation(line: 195, column: 20, scope: !308)
!343 = !DILocation(line: 195, column: 30, scope: !308)
!344 = !DILocation(line: 195, column: 34, scope: !308)
!345 = !DILocation(line: 195, column: 32, scope: !308)
!346 = !DILocation(line: 195, column: 26, scope: !308)
!347 = !DILocation(line: 195, column: 17, scope: !308)
!348 = !DILocation(line: 196, column: 17, scope: !307)
!349 = !DILocation(line: 196, column: 20, scope: !307)
!350 = !DILocation(line: 196, column: 30, scope: !307)
!351 = !DILocation(line: 196, column: 33, scope: !307)
!352 = !DILocation(line: 196, column: 28, scope: !307)
!353 = !DILocation(line: 196, column: 15, scope: !307)
!354 = !DILocation(line: 196, column: 13, scope: !308)
!355 = !DILocation(line: 197, column: 71, scope: !306)
!356 = !DILocation(line: 197, column: 60, scope: !306)
!357 = !DILocation(line: 68, column: 16, scope: !101, inlinedAt: !305)
!358 = !DILocation(line: 68, column: 19, scope: !101, inlinedAt: !305)
!359 = !DILocation(line: 68, column: 24, scope: !101, inlinedAt: !305)
!360 = !DILocation(line: 68, column: 38, scope: !101, inlinedAt: !305)
!361 = !DILocation(line: 68, column: 41, scope: !101, inlinedAt: !305)
!362 = !DILocation(line: 68, column: 46, scope: !101, inlinedAt: !305)
!363 = !DILocation(line: 68, column: 34, scope: !101, inlinedAt: !305)
!364 = !DILocation(line: 68, column: 57, scope: !101, inlinedAt: !305)
!365 = !DILocation(line: 68, column: 69, scope: !101, inlinedAt: !305)
!366 = !DILocation(line: 68, column: 72, scope: !101, inlinedAt: !305)
!367 = !DILocation(line: 68, column: 79, scope: !101, inlinedAt: !305)
!368 = !DILocation(line: 68, column: 84, scope: !101, inlinedAt: !305)
!369 = !DILocation(line: 68, column: 99, scope: !101, inlinedAt: !305)
!370 = !DILocation(line: 68, column: 102, scope: !101, inlinedAt: !305)
!371 = !DILocation(line: 68, column: 109, scope: !101, inlinedAt: !305)
!372 = !DILocation(line: 68, column: 114, scope: !101, inlinedAt: !305)
!373 = !DILocation(line: 68, column: 94, scope: !101, inlinedAt: !305)
!374 = !DILocation(line: 68, column: 63, scope: !101, inlinedAt: !305)
!375 = !DILocation(line: 197, column: 40, scope: !306)
!376 = !DILocation(line: 197, column: 43, scope: !306)
!377 = !DILocation(line: 197, column: 54, scope: !306)
!378 = !DILocation(line: 197, column: 57, scope: !306)
!379 = !DILocation(line: 198, column: 13, scope: !306)
!380 = !DILocation(line: 198, column: 16, scope: !306)
!381 = !DILocation(line: 198, column: 24, scope: !306)
!382 = !DILocation(line: 199, column: 9, scope: !306)
!383 = !DILocation(line: 200, column: 13, scope: !384)
!384 = distinct !DILexicalBlock(scope: !307, file: !122, line: 199, column: 16)
!385 = !DILocation(line: 203, column: 26, scope: !308)
!386 = !DILocation(line: 203, column: 24, scope: !308)
!387 = !DILocation(line: 203, column: 18, scope: !308)
!388 = !DILocation(line: 204, column: 19, scope: !308)
!389 = !DILocation(line: 204, column: 17, scope: !308)
!390 = !DILocation(line: 208, column: 18, scope: !301)
!391 = !DILocation(line: 208, column: 5, scope: !301)
!392 = !DILocation(line: 208, column: 8, scope: !301)
!393 = !DILocation(line: 208, column: 16, scope: !301)
!394 = !DILocation(line: 209, column: 19, scope: !301)
!395 = !DILocation(line: 209, column: 5, scope: !301)
!396 = !DILocation(line: 209, column: 8, scope: !301)
!397 = !DILocation(line: 209, column: 17, scope: !301)
!398 = !DILocation(line: 210, column: 1, scope: !301)
!399 = distinct !DISubprogram(name: "flush_put_bits", scope: !122, file: !122, line: 101, type: !400, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !258}
!402 = !DILocalVariable(name: "s", arg: 1, scope: !399, file: !122, line: 101, type: !258)
!403 = !DILocation(line: 101, column: 50, scope: !399)
!404 = !DILocation(line: 104, column: 9, scope: !405)
!405 = distinct !DILexicalBlock(scope: !399, file: !122, line: 104, column: 9)
!406 = !DILocation(line: 104, column: 12, scope: !405)
!407 = !DILocation(line: 104, column: 21, scope: !405)
!408 = !DILocation(line: 104, column: 9, scope: !399)
!409 = !DILocation(line: 105, column: 24, scope: !405)
!410 = !DILocation(line: 105, column: 27, scope: !405)
!411 = !DILocation(line: 105, column: 9, scope: !405)
!412 = !DILocation(line: 105, column: 12, scope: !405)
!413 = !DILocation(line: 105, column: 20, scope: !405)
!414 = !DILocation(line: 107, column: 5, scope: !399)
!415 = !DILocation(line: 107, column: 12, scope: !416)
!416 = !DILexicalBlockFile(scope: !399, file: !122, discriminator: 1)
!417 = !DILocation(line: 107, column: 15, scope: !416)
!418 = !DILocation(line: 107, column: 24, scope: !416)
!419 = !DILocation(line: 107, column: 5, scope: !416)
!420 = !DILocation(line: 108, column: 9, scope: !421)
!421 = distinct !DILexicalBlock(scope: !399, file: !122, line: 107, column: 30)
!422 = distinct !{!422, !420}
!423 = !DILocation(line: 108, column: 20, scope: !424)
!424 = !DILexicalBlockFile(scope: !425, file: !122, discriminator: 1)
!425 = distinct !DILexicalBlock(scope: !426, file: !122, line: 108, column: 18)
!426 = distinct !DILexicalBlock(scope: !421, file: !122, line: 108, column: 12)
!427 = !DILocation(line: 108, column: 23, scope: !424)
!428 = !DILocation(line: 108, column: 33, scope: !424)
!429 = !DILocation(line: 108, column: 36, scope: !424)
!430 = !DILocation(line: 108, column: 31, scope: !424)
!431 = !DILocation(line: 108, column: 18, scope: !424)
!432 = !DILocation(line: 108, column: 48, scope: !433)
!433 = !DILexicalBlockFile(scope: !434, file: !122, discriminator: 2)
!434 = distinct !DILexicalBlock(scope: !425, file: !122, line: 108, column: 46)
!435 = !DILocation(line: 108, column: 105, scope: !436)
!436 = !DILexicalBlockFile(scope: !433, file: !122, discriminator: 4)
!437 = !DILocation(line: 108, column: 105, scope: !433)
!438 = !DILocation(line: 108, column: 116, scope: !439)
!439 = !DILexicalBlockFile(scope: !426, file: !122, discriminator: 3)
!440 = !DILocation(line: 113, column: 25, scope: !421)
!441 = !DILocation(line: 113, column: 28, scope: !421)
!442 = !DILocation(line: 113, column: 36, scope: !421)
!443 = !DILocation(line: 113, column: 10, scope: !421)
!444 = !DILocation(line: 113, column: 13, scope: !421)
!445 = !DILocation(line: 113, column: 20, scope: !421)
!446 = !DILocation(line: 113, column: 23, scope: !421)
!447 = !DILocation(line: 114, column: 9, scope: !421)
!448 = !DILocation(line: 114, column: 12, scope: !421)
!449 = !DILocation(line: 114, column: 20, scope: !421)
!450 = !DILocation(line: 116, column: 9, scope: !421)
!451 = !DILocation(line: 116, column: 12, scope: !421)
!452 = !DILocation(line: 116, column: 21, scope: !421)
!453 = !DILocation(line: 107, column: 5, scope: !454)
!454 = !DILexicalBlockFile(scope: !399, file: !122, discriminator: 2)
!455 = distinct !{!455, !414}
!456 = !DILocation(line: 118, column: 5, scope: !399)
!457 = !DILocation(line: 118, column: 8, scope: !399)
!458 = !DILocation(line: 118, column: 17, scope: !399)
!459 = !DILocation(line: 119, column: 5, scope: !399)
!460 = !DILocation(line: 119, column: 8, scope: !399)
!461 = !DILocation(line: 119, column: 16, scope: !399)
!462 = !DILocation(line: 120, column: 1, scope: !399)
!463 = distinct !DISubprogram(name: "put_bits_count", scope: !122, file: !122, line: 85, type: !464, isLocal: true, isDefinition: true, scopeLine: 86, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!464 = !DISubroutineType(types: !465)
!465 = !{!53, !258}
!466 = !DILocalVariable(name: "s", arg: 1, scope: !463, file: !122, line: 85, type: !258)
!467 = !DILocation(line: 85, column: 49, scope: !463)
!468 = !DILocation(line: 87, column: 13, scope: !463)
!469 = !DILocation(line: 87, column: 16, scope: !463)
!470 = !DILocation(line: 87, column: 26, scope: !463)
!471 = !DILocation(line: 87, column: 29, scope: !463)
!472 = !DILocation(line: 87, column: 24, scope: !463)
!473 = !DILocation(line: 87, column: 34, scope: !463)
!474 = !DILocation(line: 87, column: 38, scope: !463)
!475 = !DILocation(line: 87, column: 45, scope: !463)
!476 = !DILocation(line: 87, column: 48, scope: !463)
!477 = !DILocation(line: 87, column: 43, scope: !463)
!478 = !DILocation(line: 87, column: 12, scope: !463)
!479 = !DILocation(line: 87, column: 5, scope: !463)
!480 = distinct !DISubprogram(name: "ff_dca_parse_core_frame_header", scope: !60, file: !60, line: 91, type: !481, isLocal: false, isDefinition: true, scopeLine: 92, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !81)
!481 = !DISubroutineType(types: !482)
!482 = !{!53, !483, !511}
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64, align: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCACoreFrameHeader", file: !4, line: 76, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCACoreFrameHeader", file: !4, line: 51, size: 208, align: 16, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "normal_frame", scope: !485, file: !4, line: 52, baseType: !56, size: 8, align: 8)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "deficit_samples", scope: !485, file: !4, line: 53, baseType: !56, size: 8, align: 8, offset: 8)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "crc_present", scope: !485, file: !4, line: 54, baseType: !56, size: 8, align: 8, offset: 16)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "npcmblocks", scope: !485, file: !4, line: 55, baseType: !56, size: 8, align: 8, offset: 24)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !485, file: !4, line: 56, baseType: !50, size: 16, align: 16, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "audio_mode", scope: !485, file: !4, line: 57, baseType: !56, size: 8, align: 8, offset: 48)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "sr_code", scope: !485, file: !4, line: 58, baseType: !56, size: 8, align: 8, offset: 56)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "br_code", scope: !485, file: !4, line: 59, baseType: !56, size: 8, align: 8, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "drc_present", scope: !485, file: !4, line: 60, baseType: !56, size: 8, align: 8, offset: 72)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ts_present", scope: !485, file: !4, line: 61, baseType: !56, size: 8, align: 8, offset: 80)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "aux_present", scope: !485, file: !4, line: 62, baseType: !56, size: 8, align: 8, offset: 88)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "hdcd_master", scope: !485, file: !4, line: 63, baseType: !56, size: 8, align: 8, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ext_audio_type", scope: !485, file: !4, line: 64, baseType: !56, size: 8, align: 8, offset: 104)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ext_audio_present", scope: !485, file: !4, line: 65, baseType: !56, size: 8, align: 8, offset: 112)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "sync_ssf", scope: !485, file: !4, line: 66, baseType: !56, size: 8, align: 8, offset: 120)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_present", scope: !485, file: !4, line: 67, baseType: !56, size: 8, align: 8, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "predictor_history", scope: !485, file: !4, line: 68, baseType: !56, size: 8, align: 8, offset: 136)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "filter_perfect", scope: !485, file: !4, line: 69, baseType: !56, size: 8, align: 8, offset: 144)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "encoder_rev", scope: !485, file: !4, line: 70, baseType: !56, size: 8, align: 8, offset: 152)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "copy_hist", scope: !485, file: !4, line: 71, baseType: !56, size: 8, align: 8, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pcmr_code", scope: !485, file: !4, line: 72, baseType: !56, size: 8, align: 8, offset: 168)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "sumdiff_front", scope: !485, file: !4, line: 73, baseType: !56, size: 8, align: 8, offset: 176)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "sumdiff_surround", scope: !485, file: !4, line: 74, baseType: !56, size: 8, align: 8, offset: 184)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dn_code", scope: !485, file: !4, line: 75, baseType: !56, size: 8, align: 8, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !513, line: 70, baseType: !514)
!513 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !513, line: 61, size: 256, align: 64, elements: !515)
!515 = !{!516, !517, !518, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !514, file: !513, line: 62, baseType: !79, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !514, file: !513, line: 62, baseType: !79, size: 64, align: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !514, file: !513, line: 67, baseType: !53, size: 32, align: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !514, file: !513, line: 68, baseType: !53, size: 32, align: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !514, file: !513, line: 69, baseType: !53, size: 32, align: 32, offset: 192)
!521 = !DILocalVariable(name: "h", arg: 1, scope: !480, file: !60, line: 91, type: !483)
!522 = !DILocation(line: 91, column: 56, scope: !480)
!523 = !DILocalVariable(name: "gb", arg: 2, scope: !480, file: !60, line: 91, type: !511)
!524 = !DILocation(line: 91, column: 74, scope: !480)
!525 = !DILocation(line: 93, column: 23, scope: !526)
!526 = distinct !DILexicalBlock(scope: !480, file: !60, line: 93, column: 9)
!527 = !DILocation(line: 93, column: 9, scope: !526)
!528 = !DILocation(line: 93, column: 31, scope: !526)
!529 = !DILocation(line: 93, column: 9, scope: !480)
!530 = !DILocation(line: 94, column: 9, scope: !526)
!531 = !DILocation(line: 96, column: 33, scope: !480)
!532 = !DILocation(line: 96, column: 23, scope: !480)
!533 = !DILocation(line: 96, column: 5, scope: !480)
!534 = !DILocation(line: 96, column: 8, scope: !480)
!535 = !DILocation(line: 96, column: 21, scope: !480)
!536 = !DILocation(line: 97, column: 35, scope: !480)
!537 = !DILocation(line: 97, column: 26, scope: !480)
!538 = !DILocation(line: 97, column: 42, scope: !480)
!539 = !DILocation(line: 97, column: 5, scope: !480)
!540 = !DILocation(line: 97, column: 8, scope: !480)
!541 = !DILocation(line: 97, column: 24, scope: !480)
!542 = !DILocation(line: 98, column: 9, scope: !543)
!543 = distinct !DILexicalBlock(scope: !480, file: !60, line: 98, column: 9)
!544 = !DILocation(line: 98, column: 12, scope: !543)
!545 = !DILocation(line: 98, column: 28, scope: !543)
!546 = !DILocation(line: 98, column: 9, scope: !480)
!547 = !DILocation(line: 99, column: 9, scope: !543)
!548 = !DILocation(line: 101, column: 32, scope: !480)
!549 = !DILocation(line: 101, column: 22, scope: !480)
!550 = !DILocation(line: 101, column: 5, scope: !480)
!551 = !DILocation(line: 101, column: 8, scope: !480)
!552 = !DILocation(line: 101, column: 20, scope: !480)
!553 = !DILocation(line: 102, column: 30, scope: !480)
!554 = !DILocation(line: 102, column: 21, scope: !480)
!555 = !DILocation(line: 102, column: 37, scope: !480)
!556 = !DILocation(line: 102, column: 5, scope: !480)
!557 = !DILocation(line: 102, column: 8, scope: !480)
!558 = !DILocation(line: 102, column: 19, scope: !480)
!559 = !DILocation(line: 103, column: 9, scope: !560)
!560 = distinct !DILexicalBlock(scope: !480, file: !60, line: 103, column: 9)
!561 = !DILocation(line: 103, column: 12, scope: !560)
!562 = !DILocation(line: 103, column: 23, scope: !560)
!563 = !DILocation(line: 103, column: 9, scope: !480)
!564 = !DILocation(line: 104, column: 9, scope: !560)
!565 = !DILocation(line: 106, column: 30, scope: !480)
!566 = !DILocation(line: 106, column: 21, scope: !480)
!567 = !DILocation(line: 106, column: 38, scope: !480)
!568 = !DILocation(line: 106, column: 5, scope: !480)
!569 = !DILocation(line: 106, column: 8, scope: !480)
!570 = !DILocation(line: 106, column: 19, scope: !480)
!571 = !DILocation(line: 107, column: 9, scope: !572)
!572 = distinct !DILexicalBlock(scope: !480, file: !60, line: 107, column: 9)
!573 = !DILocation(line: 107, column: 12, scope: !572)
!574 = !DILocation(line: 107, column: 23, scope: !572)
!575 = !DILocation(line: 107, column: 9, scope: !480)
!576 = !DILocation(line: 108, column: 9, scope: !572)
!577 = !DILocation(line: 110, column: 30, scope: !480)
!578 = !DILocation(line: 110, column: 21, scope: !480)
!579 = !DILocation(line: 110, column: 5, scope: !480)
!580 = !DILocation(line: 110, column: 8, scope: !480)
!581 = !DILocation(line: 110, column: 19, scope: !480)
!582 = !DILocation(line: 111, column: 9, scope: !583)
!583 = distinct !DILexicalBlock(scope: !480, file: !60, line: 111, column: 9)
!584 = !DILocation(line: 111, column: 12, scope: !583)
!585 = !DILocation(line: 111, column: 23, scope: !583)
!586 = !DILocation(line: 111, column: 9, scope: !480)
!587 = !DILocation(line: 112, column: 9, scope: !583)
!588 = !DILocation(line: 114, column: 27, scope: !480)
