; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--flvdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--flvdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }

!941 = !DIEnumerator(name: "FLV_HEADER_FLAG_HASVIDEO", value: 1)
!942 = !DIEnumerator(name: "FLV_HEADER_FLAG_HASAUDIO", value: 4)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FlvTagType", file: !939, line: 59, size: 32, align: 32, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIEnumerator(name: "FLV_TAG_TYPE_AUDIO", value: 8)
!946 = !DIEnumerator(name: "FLV_TAG_TYPE_VIDEO", value: 9)
!947 = !DIEnumerator(name: "FLV_TAG_TYPE_META", value: 18)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 65, size: 32, align: 32, elements: !949)
!949 = !{!950, !951, !952, !953, !954}
!950 = !DIEnumerator(name: "FLV_STREAM_TYPE_VIDEO", value: 0)
!951 = !DIEnumerator(name: "FLV_STREAM_TYPE_AUDIO", value: 1)
!952 = !DIEnumerator(name: "FLV_STREAM_TYPE_SUBTITLE", value: 2)
!953 = !DIEnumerator(name: "FLV_STREAM_TYPE_DATA", value: 3)
!954 = !DIEnumerator(name: "FLV_STREAM_TYPE_NB", value: 4)
!955 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 115, size: 32, align: 32, elements: !956)
!956 = !{!957, !958, !959, !960, !961}
!957 = !DIEnumerator(name: "FLV_FRAME_KEY", value: 16)
!958 = !DIEnumerator(name: "FLV_FRAME_INTER", value: 32)
!959 = !DIEnumerator(name: "FLV_FRAME_DISP_INTER", value: 48)
!960 = !DIEnumerator(name: "FLV_FRAME_GENERATED_KEY", value: 64)
!961 = !DIEnumerator(name: "FLV_FRAME_VIDEO_INFO_CMD", value: 80)
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 73, size: 32, align: 32, elements: !963)
!963 = !{!964, !965}
!964 = !DIEnumerator(name: "FLV_MONO", value: 0)
!965 = !DIEnumerator(name: "FLV_STEREO", value: 1)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 123, size: 32, align: 32, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!968 = !DIEnumerator(name: "AMF_DATA_TYPE_NUMBER", value: 0)
!969 = !DIEnumerator(name: "AMF_DATA_TYPE_BOOL", value: 1)
!970 = !DIEnumerator(name: "AMF_DATA_TYPE_STRING", value: 2)
!971 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT", value: 3)
!972 = !DIEnumerator(name: "AMF_DATA_TYPE_NULL", value: 5)
!973 = !DIEnumerator(name: "AMF_DATA_TYPE_UNDEFINED", value: 6)
!974 = !DIEnumerator(name: "AMF_DATA_TYPE_REFERENCE", value: 7)
!975 = !DIEnumerator(name: "AMF_DATA_TYPE_MIXEDARRAY", value: 8)
!976 = !DIEnumerator(name: "AMF_DATA_TYPE_OBJECT_END", value: 9)
!977 = !DIEnumerator(name: "AMF_DATA_TYPE_ARRAY", value: 10)
!978 = !DIEnumerator(name: "AMF_DATA_TYPE_DATE", value: 11)
!979 = !DIEnumerator(name: "AMF_DATA_TYPE_LONG_STRING", value: 12)
!980 = !DIEnumerator(name: "AMF_DATA_TYPE_UNSUPPORTED", value: 13)
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 104, size: 32, align: 32, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !988, !989, !990}
!983 = !DIEnumerator(name: "FLV_CODECID_H263", value: 2)
!984 = !DIEnumerator(name: "FLV_CODECID_SCREEN", value: 3)
!985 = !DIEnumerator(name: "FLV_CODECID_VP6", value: 4)
!986 = !DIEnumerator(name: "FLV_CODECID_VP6A", value: 5)
!987 = !DIEnumerator(name: "FLV_CODECID_SCREEN2", value: 6)
!988 = !DIEnumerator(name: "FLV_CODECID_H264", value: 7)
!989 = !DIEnumerator(name: "FLV_CODECID_REALH263", value: 8)
!990 = !DIEnumerator(name: "FLV_CODECID_MPEG4", value: 9)
!991 = !{!992, !1001, !1000, !1003, !1004, !1005}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !995, line: 221, size: 32, align: 8, elements: !996)
!995 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !994, file: !995, line: 221, baseType: !998, size: 32, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !999, line: 51, baseType: !1000)
!999 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1000 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !999, line: 40, baseType: !1002)
!1002 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1003 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !999, line: 48, baseType: !1008)
!1008 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1009 = !{!1010, !2308, !2309, !2310, !2314, !2323}
!1010 = distinct !DIGlobalVariable(name: "ff_flv_demuxer", scope: !0, file: !1011, line: 1336, type: !1012, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_flv_demuxer)
!1011 = !DIFile(filename: "libavformat/flvdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1014)
!1014 = !{!1015, !1019, !1020, !1021, !1022, !1032, !1111, !1112, !1114, !1115, !1116, !1129, !2289, !2290, !2291, !2295, !2299, !2300, !2301, !2305, !2306, !2307}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !919, line: 638, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1013, file: !919, line: 645, baseType: !1016, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1013, file: !919, line: 652, baseType: !1003, size: 32, align: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1013, file: !919, line: 659, baseType: !1016, size: 64, align: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1013, file: !919, line: 661, baseType: !1023, size: 64, align: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1028, line: 44, size: 64, align: 32, elements: !1029)
!1028 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1027, file: !1028, line: 45, baseType: !3, size: 32, align: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1027, file: !1028, line: 46, baseType: !1000, size: 32, align: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1013, file: !919, line: 663, baseType: !1033, size: 64, align: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1043, !1070, !1071, !1072, !1073, !1077, !1083, !1085, !1089}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1036, file: !486, line: 72, baseType: !1016, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1036, file: !486, line: 78, baseType: !1040, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1016, !1004}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1036, file: !486, line: 85, baseType: !1044, size: 64, align: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1066, !1067, !1068, !1069}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1046, file: !464, line: 247, baseType: !1016, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1046, file: !464, line: 253, baseType: !1016, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1046, file: !464, line: 259, baseType: !1003, size: 32, align: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1046, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1046, file: !464, line: 271, baseType: !1053, size: 64, align: 64, offset: 192)
!1053 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1046, file: !464, line: 265, size: 64, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1058, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1053, file: !464, line: 266, baseType: !1001, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1053, file: !464, line: 267, baseType: !1057, size: 64, align: 64)
!1057 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1053, file: !464, line: 268, baseType: !1016, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1053, file: !464, line: 270, baseType: !1060, size: 64, align: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1061, line: 61, baseType: !1062)
!1061 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1061, line: 58, size: 64, align: 32, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1062, file: !1061, line: 59, baseType: !1003, size: 32, align: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1062, file: !1061, line: 60, baseType: !1003, size: 32, align: 32, offset: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1046, file: !464, line: 272, baseType: !1057, size: 64, align: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1046, file: !464, line: 273, baseType: !1057, size: 64, align: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1046, file: !464, line: 275, baseType: !1003, size: 32, align: 32, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1046, file: !464, line: 300, baseType: !1016, size: 64, align: 64, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1036, file: !486, line: 93, baseType: !1003, size: 32, align: 32, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1036, file: !486, line: 99, baseType: !1003, size: 32, align: 32, offset: 224)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1036, file: !486, line: 108, baseType: !1003, size: 32, align: 32, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1036, file: !486, line: 113, baseType: !1074, size: 64, align: 64, offset: 320)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1004, !1004, !1004}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1036, file: !486, line: 123, baseType: !1078, size: 64, align: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!1081, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1036, file: !486, line: 130, baseType: !1084, size: 32, align: 32, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1036, file: !486, line: 136, baseType: !1086, size: 64, align: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!1084, !1004}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1036, file: !486, line: 142, baseType: !1090, size: 64, align: 64, offset: 576)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!1003, !1093, !1004, !1016, !1003}
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1096)
!1096 = !{!1097, !1109, !1110}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1095, file: !464, line: 360, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1101, file: !464, line: 307, baseType: !1016, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1101, file: !464, line: 313, baseType: !1057, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1101, file: !464, line: 313, baseType: !1057, size: 64, align: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1101, file: !464, line: 318, baseType: !1057, size: 64, align: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1101, file: !464, line: 318, baseType: !1057, size: 64, align: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1101, file: !464, line: 323, baseType: !1003, size: 32, align: 32, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1095, file: !464, line: 364, baseType: !1003, size: 32, align: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1095, file: !464, line: 368, baseType: !1003, size: 32, align: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1013, file: !919, line: 670, baseType: !1016, size: 64, align: 64, offset: 384)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1013, file: !919, line: 679, baseType: !1113, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1013, file: !919, line: 684, baseType: !1003, size: 32, align: 32, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1013, file: !919, line: 689, baseType: !1003, size: 32, align: 32, offset: 544)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1013, file: !919, line: 696, baseType: !1117, size: 64, align: 64, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!1003, !1120}
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1123)
!1123 = !{!1124, !1125, !1127, !1128}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1122, file: !919, line: 449, baseType: !1016, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1122, file: !919, line: 450, baseType: !1126, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1122, file: !919, line: 451, baseType: !1003, size: 32, align: 32, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1122, file: !919, line: 452, baseType: !1016, size: 64, align: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1013, file: !919, line: 703, baseType: !1130, size: 64, align: 64, offset: 640)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!1003, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1135)
!1135 = !{!1136, !1137, !1138, !1329, !1330, !1393, !1394, !1395, !2146, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2200, !2201, !2202, !2203, !2204, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2255, !2256, !2259, !2260, !2261, !2262, !2263, !2264, !2266, !2267, !2268, !2269, !2277, !2278, !2282, !2286, !2287, !2288}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1134, file: !919, line: 1342, baseType: !1033, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1134, file: !919, line: 1349, baseType: !1113, size: 64, align: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1134, file: !919, line: 1356, baseType: !1139, size: 64, align: 64, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1194, !1195, !1199, !1203, !1208, !1215, !1304, !1310, !1316, !1317, !1318, !1319, !1323}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1140, file: !919, line: 498, baseType: !1016, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1140, file: !919, line: 504, baseType: !1016, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1140, file: !919, line: 505, baseType: !1016, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1140, file: !919, line: 506, baseType: !1016, size: 64, align: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1140, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1140, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1140, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1140, file: !919, line: 517, baseType: !1003, size: 32, align: 32, offset: 352)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1140, file: !919, line: 523, baseType: !1023, size: 64, align: 64, offset: 384)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1140, file: !919, line: 526, baseType: !1033, size: 64, align: 64, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1140, file: !919, line: 535, baseType: !1139, size: 64, align: 64, offset: 512)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1140, file: !919, line: 539, baseType: !1003, size: 32, align: 32, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1140, file: !919, line: 541, baseType: !1130, size: 64, align: 64, offset: 640)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1140, file: !919, line: 549, baseType: !1156, size: 64, align: 64, offset: 704)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!1003, !1133, !1159}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1162)
!1162 = !{!1163, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1190, !1191, !1192, !1193}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1161, file: !4, line: 1451, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1166, line: 94, baseType: !1167)
!1166 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1166, line: 81, size: 192, align: 64, elements: !1168)
!1168 = !{!1169, !1173, !1175}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1167, file: !1166, line: 82, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1166, line: 73, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1166, line: 73, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !1166, line: 89, baseType: !1174, size: 64, align: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !1166, line: 93, baseType: !1003, size: 32, align: 32, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1161, file: !4, line: 1461, baseType: !1001, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1161, file: !4, line: 1467, baseType: !1001, size: 64, align: 64, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1161, file: !4, line: 1468, baseType: !1174, size: 64, align: 64, offset: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !4, line: 1469, baseType: !1003, size: 32, align: 32, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1161, file: !4, line: 1470, baseType: !1003, size: 32, align: 32, offset: 288)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1161, file: !4, line: 1474, baseType: !1003, size: 32, align: 32, offset: 320)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1161, file: !4, line: 1479, baseType: !1183, size: 64, align: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !4, line: 1412, baseType: !1174, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !4, line: 1413, baseType: !1003, size: 32, align: 32, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1185, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1161, file: !4, line: 1480, baseType: !1003, size: 32, align: 32, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1161, file: !4, line: 1486, baseType: !1001, size: 64, align: 64, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1161, file: !4, line: 1488, baseType: !1001, size: 64, align: 64, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1161, file: !4, line: 1497, baseType: !1001, size: 64, align: 64, offset: 640)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1140, file: !919, line: 550, baseType: !1130, size: 64, align: 64, offset: 768)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1140, file: !919, line: 554, baseType: !1196, size: 64, align: 64, offset: 832)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!1003, !1133, !1159, !1159, !1003}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1140, file: !919, line: 563, baseType: !1200, size: 64, align: 64, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1003, !3, !1003}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1140, file: !919, line: 565, baseType: !1204, size: 64, align: 64, offset: 960)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{null, !1133, !1003, !1207, !1207}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1140, file: !919, line: 570, baseType: !1209, size: 64, align: 64, offset: 1024)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!1003, !1133, !1003, !1004, !1212}
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1213, line: 216, baseType: !1214)
!1213 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1214 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1140, file: !919, line: 581, baseType: !1216, size: 64, align: 64, offset: 1088)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!1003, !1133, !1003, !1219, !1000}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1223)
!1223 = !{!1224, !1228, !1230, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1258, !1260, !1261, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1222, file: !548, line: 282, baseType: !1225, size: 512, align: 64)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 512, align: 64, elements: !1226)
!1226 = !{!1227}
!1227 = !DISubrange(count: 8)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1222, file: !548, line: 299, baseType: !1229, size: 256, align: 32, offset: 512)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 256, align: 32, elements: !1226)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1222, file: !548, line: 315, baseType: !1231, size: 64, align: 64, offset: 768)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1222, file: !548, line: 326, baseType: !1003, size: 32, align: 32, offset: 832)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1222, file: !548, line: 326, baseType: !1003, size: 32, align: 32, offset: 864)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1222, file: !548, line: 334, baseType: !1003, size: 32, align: 32, offset: 896)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1222, file: !548, line: 341, baseType: !1003, size: 32, align: 32, offset: 928)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1222, file: !548, line: 346, baseType: !1003, size: 32, align: 32, offset: 960)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1222, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1222, file: !548, line: 356, baseType: !1060, size: 64, align: 32, offset: 1024)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1222, file: !548, line: 361, baseType: !1001, size: 64, align: 64, offset: 1088)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1222, file: !548, line: 369, baseType: !1001, size: 64, align: 64, offset: 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1222, file: !548, line: 377, baseType: !1001, size: 64, align: 64, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1222, file: !548, line: 382, baseType: !1003, size: 32, align: 32, offset: 1280)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1222, file: !548, line: 386, baseType: !1003, size: 32, align: 32, offset: 1312)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1222, file: !548, line: 391, baseType: !1003, size: 32, align: 32, offset: 1344)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1222, file: !548, line: 396, baseType: !1004, size: 64, align: 64, offset: 1408)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1222, file: !548, line: 403, baseType: !1247, size: 512, align: 64, offset: 1472)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 512, align: 64, elements: !1226)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !999, line: 55, baseType: !1214)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1222, file: !548, line: 410, baseType: !1003, size: 32, align: 32, offset: 1984)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1222, file: !548, line: 415, baseType: !1003, size: 32, align: 32, offset: 2016)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1222, file: !548, line: 420, baseType: !1003, size: 32, align: 32, offset: 2048)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1222, file: !548, line: 425, baseType: !1003, size: 32, align: 32, offset: 2080)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1222, file: !548, line: 435, baseType: !1001, size: 64, align: 64, offset: 2112)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1222, file: !548, line: 440, baseType: !1003, size: 32, align: 32, offset: 2176)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1222, file: !548, line: 445, baseType: !1248, size: 64, align: 64, offset: 2240)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1222, file: !548, line: 459, baseType: !1257, size: 512, align: 64, offset: 2304)
!1257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 512, align: 64, elements: !1226)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1222, file: !548, line: 473, baseType: !1259, size: 64, align: 64, offset: 2816)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1222, file: !548, line: 477, baseType: !1003, size: 32, align: 32, offset: 2880)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1222, file: !548, line: 479, baseType: !1262, size: 64, align: 64, offset: 2944)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1275}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1265, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1265, file: !548, line: 203, baseType: !1174, size: 64, align: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1265, file: !548, line: 204, baseType: !1003, size: 32, align: 32, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1265, file: !548, line: 205, baseType: !1271, size: 64, align: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1273, line: 86, baseType: !1274)
!1273 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1274 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1273, line: 86, flags: DIFlagFwdDecl)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1265, file: !548, line: 206, baseType: !1164, size: 64, align: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1222, file: !548, line: 480, baseType: !1003, size: 32, align: 32, offset: 3008)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1222, file: !548, line: 505, baseType: !1003, size: 32, align: 32, offset: 3040)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1222, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1222, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1222, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1222, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1222, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1222, file: !548, line: 532, baseType: !1001, size: 64, align: 64, offset: 3264)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1222, file: !548, line: 539, baseType: !1001, size: 64, align: 64, offset: 3328)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1222, file: !548, line: 547, baseType: !1001, size: 64, align: 64, offset: 3392)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1222, file: !548, line: 554, baseType: !1271, size: 64, align: 64, offset: 3456)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1222, file: !548, line: 563, baseType: !1003, size: 32, align: 32, offset: 3520)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1222, file: !548, line: 572, baseType: !1003, size: 32, align: 32, offset: 3552)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1222, file: !548, line: 581, baseType: !1003, size: 32, align: 32, offset: 3584)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1222, file: !548, line: 588, baseType: !1291, size: 64, align: 64, offset: 3648)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !999, line: 36, baseType: !1293)
!1293 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1222, file: !548, line: 593, baseType: !1003, size: 32, align: 32, offset: 3712)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1222, file: !548, line: 596, baseType: !1003, size: 32, align: 32, offset: 3744)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1222, file: !548, line: 599, baseType: !1164, size: 64, align: 64, offset: 3776)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1222, file: !548, line: 605, baseType: !1164, size: 64, align: 64, offset: 3840)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1222, file: !548, line: 616, baseType: !1164, size: 64, align: 64, offset: 3904)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1222, file: !548, line: 626, baseType: !1212, size: 64, align: 64, offset: 3968)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1222, file: !548, line: 627, baseType: !1212, size: 64, align: 64, offset: 4032)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1222, file: !548, line: 628, baseType: !1212, size: 64, align: 64, offset: 4096)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1222, file: !548, line: 629, baseType: !1212, size: 64, align: 64, offset: 4160)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1222, file: !548, line: 645, baseType: !1164, size: 64, align: 64, offset: 4224)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1140, file: !919, line: 587, baseType: !1305, size: 64, align: 64, offset: 1152)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!1003, !1133, !1308}
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1140, file: !919, line: 592, baseType: !1311, size: 64, align: 64, offset: 1216)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!1003, !1133, !1314}
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1140, file: !919, line: 597, baseType: !1311, size: 64, align: 64, offset: 1280)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1140, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1140, file: !919, line: 608, baseType: !1130, size: 64, align: 64, offset: 1408)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1140, file: !919, line: 617, baseType: !1320, size: 64, align: 64, offset: 1472)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{null, !1133}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1140, file: !919, line: 623, baseType: !1324, size: 64, align: 64, offset: 1536)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!1003, !1133, !1327}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1134, file: !919, line: 1365, baseType: !1004, size: 64, align: 64, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1134, file: !919, line: 1379, baseType: !1331, size: 64, align: 64, offset: 256)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337, !1338, !1339, !1340, !1341, !1345, !1346, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1360, !1361, !1365, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1385, !1386, !1390, !1391, !1392}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1333, file: !650, line: 174, baseType: !1033, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1333, file: !650, line: 226, baseType: !1126, size: 64, align: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1333, file: !650, line: 227, baseType: !1003, size: 32, align: 32, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1333, file: !650, line: 228, baseType: !1126, size: 64, align: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1333, file: !650, line: 229, baseType: !1126, size: 64, align: 64, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1333, file: !650, line: 233, baseType: !1004, size: 64, align: 64, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1333, file: !650, line: 235, baseType: !1342, size: 64, align: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!1003, !1004, !1174, !1003}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1333, file: !650, line: 236, baseType: !1342, size: 64, align: 64, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1333, file: !650, line: 237, baseType: !1347, size: 64, align: 64, offset: 512)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!1001, !1004, !1001, !1003}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1333, file: !650, line: 238, baseType: !1001, size: 64, align: 64, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1333, file: !650, line: 239, baseType: !1003, size: 32, align: 32, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1333, file: !650, line: 240, baseType: !1003, size: 32, align: 32, offset: 672)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1333, file: !650, line: 241, baseType: !1003, size: 32, align: 32, offset: 704)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1333, file: !650, line: 242, baseType: !1214, size: 64, align: 64, offset: 768)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1333, file: !650, line: 243, baseType: !1126, size: 64, align: 64, offset: 832)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1333, file: !650, line: 244, baseType: !1357, size: 64, align: 64, offset: 896)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!1214, !1214, !1005, !1000}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1333, file: !650, line: 245, baseType: !1003, size: 32, align: 32, offset: 960)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1333, file: !650, line: 249, baseType: !1362, size: 64, align: 64, offset: 1024)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!1003, !1004, !1003}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1333, file: !650, line: 255, baseType: !1366, size: 64, align: 64, offset: 1088)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!1001, !1004, !1003, !1001, !1003}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1333, file: !650, line: 260, baseType: !1003, size: 32, align: 32, offset: 1152)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1333, file: !650, line: 266, baseType: !1001, size: 64, align: 64, offset: 1216)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1333, file: !650, line: 273, baseType: !1003, size: 32, align: 32, offset: 1280)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1333, file: !650, line: 279, baseType: !1001, size: 64, align: 64, offset: 1344)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1333, file: !650, line: 285, baseType: !1003, size: 32, align: 32, offset: 1408)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1333, file: !650, line: 291, baseType: !1003, size: 32, align: 32, offset: 1440)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1333, file: !650, line: 298, baseType: !1003, size: 32, align: 32, offset: 1472)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1333, file: !650, line: 304, baseType: !1003, size: 32, align: 32, offset: 1504)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1333, file: !650, line: 309, baseType: !1016, size: 64, align: 64, offset: 1536)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1333, file: !650, line: 314, baseType: !1016, size: 64, align: 64, offset: 1600)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1333, file: !650, line: 319, baseType: !1380, size: 64, align: 64, offset: 1664)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!1003, !1004, !1174, !1003, !649, !1001}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1333, file: !650, line: 326, baseType: !1003, size: 32, align: 32, offset: 1728)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1333, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1333, file: !650, line: 332, baseType: !1001, size: 64, align: 64, offset: 1792)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1333, file: !650, line: 338, baseType: !1387, size: 64, align: 64, offset: 1856)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!1003, !1004}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1333, file: !650, line: 340, baseType: !1001, size: 64, align: 64, offset: 1920)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1333, file: !650, line: 346, baseType: !1126, size: 64, align: 64, offset: 1984)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1333, file: !650, line: 351, baseType: !1003, size: 32, align: 32, offset: 2048)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1134, file: !919, line: 1386, baseType: !1003, size: 32, align: 32, offset: 320)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1134, file: !919, line: 1393, baseType: !1000, size: 32, align: 32, offset: 352)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1134, file: !919, line: 1405, baseType: !1396, size: 64, align: 64, offset: 384)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1403, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2071, !2077, !2078, !2082, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2114, !2115, !2116, !2117, !2118, !2119}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1399, file: !919, line: 866, baseType: !1003, size: 32, align: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1399, file: !919, line: 872, baseType: !1003, size: 32, align: 32, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1399, file: !919, line: 878, baseType: !1404, size: 64, align: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1406)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1407)
!1407 = !{!1408, !1409, !1410, !1411, !1552, !1553, !1554, !1555, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1708, !1712, !1713, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1892, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1406, file: !4, line: 1561, baseType: !1033, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1406, file: !4, line: 1562, baseType: !1003, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1406, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1406, file: !4, line: 1565, baseType: !1412, size: 64, align: 64, offset: 128)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1421, !1424, !1427, !1430, !1433, !1436, !1437, !1438, !1446, !1447, !1448, !1450, !1454, !1460, !1469, !1473, !1474, !1517, !1524, !1528, !1529, !1533, !1537, !1541, !1545, !1546, !1547}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1414, file: !4, line: 3475, baseType: !1016, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1414, file: !4, line: 3480, baseType: !1016, size: 64, align: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1414, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1414, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1414, file: !4, line: 3487, baseType: !1003, size: 32, align: 32, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1414, file: !4, line: 3488, baseType: !1422, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1414, file: !4, line: 3489, baseType: !1425, size: 64, align: 64, offset: 320)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1414, file: !4, line: 3490, baseType: !1428, size: 64, align: 64, offset: 384)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1414, file: !4, line: 3491, baseType: !1431, size: 64, align: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1414, file: !4, line: 3492, baseType: !1434, size: 64, align: 64, offset: 512)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1248)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1414, file: !4, line: 3493, baseType: !1007, size: 8, align: 8, offset: 576)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1414, file: !4, line: 3494, baseType: !1033, size: 64, align: 64, offset: 640)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1414, file: !4, line: 3495, baseType: !1439, size: 64, align: 64, offset: 704)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1441)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1442)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1443)
!1443 = !{!1444, !1445}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1442, file: !4, line: 3402, baseType: !1003, size: 32, align: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1442, file: !4, line: 3403, baseType: !1016, size: 64, align: 64, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1414, file: !4, line: 3507, baseType: !1016, size: 64, align: 64, offset: 768)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1414, file: !4, line: 3516, baseType: !1003, size: 32, align: 32, offset: 832)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1414, file: !4, line: 3517, baseType: !1449, size: 64, align: 64, offset: 896)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1414, file: !4, line: 3527, baseType: !1451, size: 64, align: 64, offset: 960)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!1003, !1404}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1414, file: !4, line: 3535, baseType: !1455, size: 64, align: 64, offset: 1024)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!1003, !1404, !1458}
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1405)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1414, file: !4, line: 3541, baseType: !1461, size: 64, align: 64, offset: 1088)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1463)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1465, line: 223, size: 128, align: 64, elements: !1466)
!1465 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1466 = !{!1467, !1468}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1464, file: !1465, line: 224, baseType: !1005, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1464, file: !1465, line: 225, baseType: !1005, size: 64, align: 64, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1414, file: !4, line: 3549, baseType: !1470, size: 64, align: 64, offset: 1152)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{null, !1449}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1414, file: !4, line: 3551, baseType: !1451, size: 64, align: 64, offset: 1216)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1414, file: !4, line: 3552, baseType: !1475, size: 64, align: 64, offset: 1280)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!1003, !1404, !1174, !1003, !1478}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1480)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1481)
!1481 = !{!1482, !1485, !1486, !1487, !1488, !1516}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1480, file: !4, line: 3921, baseType: !1483, size: 16, align: 16)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !999, line: 49, baseType: !1484)
!1484 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1480, file: !4, line: 3922, baseType: !998, size: 32, align: 32, offset: 32)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1480, file: !4, line: 3923, baseType: !998, size: 32, align: 32, offset: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1480, file: !4, line: 3924, baseType: !1000, size: 32, align: 32, offset: 96)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1480, file: !4, line: 3925, baseType: !1489, size: 64, align: 64, offset: 128)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1492)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1493)
!1493 = !{!1494, !1495, !1496, !1497, !1498, !1499, !1505, !1509, !1511, !1512, !1514, !1515}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1492, file: !4, line: 3886, baseType: !1003, size: 32, align: 32)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1492, file: !4, line: 3887, baseType: !1003, size: 32, align: 32, offset: 32)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1492, file: !4, line: 3888, baseType: !1003, size: 32, align: 32, offset: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1492, file: !4, line: 3889, baseType: !1003, size: 32, align: 32, offset: 96)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1492, file: !4, line: 3890, baseType: !1003, size: 32, align: 32, offset: 128)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1492, file: !4, line: 3897, baseType: !1500, size: 768, align: 64, offset: 192)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1502)
!1502 = !{!1503, !1504}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1501, file: !4, line: 3855, baseType: !1225, size: 512, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1501, file: !4, line: 3857, baseType: !1229, size: 256, align: 32, offset: 512)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1492, file: !4, line: 3903, baseType: !1506, size: 256, align: 64, offset: 960)
!1506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 256, align: 64, elements: !1507)
!1507 = !{!1508}
!1508 = !DISubrange(count: 4)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1492, file: !4, line: 3904, baseType: !1510, size: 128, align: 32, offset: 1216)
!1510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1003, size: 128, align: 32, elements: !1507)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1492, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1492, file: !4, line: 3908, baseType: !1513, size: 64, align: 64, offset: 1408)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1492, file: !4, line: 3915, baseType: !1513, size: 64, align: 64, offset: 1472)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1492, file: !4, line: 3917, baseType: !1003, size: 32, align: 32, offset: 1536)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1480, file: !4, line: 3926, baseType: !1001, size: 64, align: 64, offset: 192)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1414, file: !4, line: 3564, baseType: !1518, size: 64, align: 64, offset: 1344)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!1003, !1404, !1159, !1521, !1523}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1414, file: !4, line: 3566, baseType: !1525, size: 64, align: 64, offset: 1408)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!1003, !1404, !1004, !1523, !1159}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1414, file: !4, line: 3567, baseType: !1451, size: 64, align: 64, offset: 1472)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1414, file: !4, line: 3576, baseType: !1530, size: 64, align: 64, offset: 1536)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!1003, !1404, !1521}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1414, file: !4, line: 3577, baseType: !1534, size: 64, align: 64, offset: 1600)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!1003, !1404, !1159}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1414, file: !4, line: 3584, baseType: !1538, size: 64, align: 64, offset: 1664)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!1003, !1404, !1220}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1414, file: !4, line: 3589, baseType: !1542, size: 64, align: 64, offset: 1728)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{null, !1404}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1414, file: !4, line: 3594, baseType: !1003, size: 32, align: 32, offset: 1792)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1414, file: !4, line: 3600, baseType: !1016, size: 64, align: 64, offset: 1856)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1414, file: !4, line: 3609, baseType: !1548, size: 64, align: 64, offset: 1920)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1551)
!1551 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1406, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1406, file: !4, line: 1581, baseType: !1000, size: 32, align: 32, offset: 224)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1406, file: !4, line: 1583, baseType: !1004, size: 64, align: 64, offset: 256)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1406, file: !4, line: 1591, baseType: !1556, size: 64, align: 64, offset: 320)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1465, line: 129, size: 1664, align: 64, elements: !1558)
!1558 = !{!1559, !1560, !1561, !1562, !1563, !1581, !1582, !1588, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1557, file: !1465, line: 136, baseType: !1003, size: 32, align: 32)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1557, file: !1465, line: 151, baseType: !1003, size: 32, align: 32, offset: 32)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1557, file: !1465, line: 157, baseType: !1003, size: 32, align: 32, offset: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1557, file: !1465, line: 159, baseType: !1220, size: 64, align: 64, offset: 128)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1557, file: !1465, line: 161, baseType: !1564, size: 64, align: 64, offset: 192)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1465, line: 117, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1465, line: 100, size: 832, align: 64, elements: !1567)
!1567 = !{!1568, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1566, file: !1465, line: 105, baseType: !1569, size: 256, align: 64)
!1569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1570, size: 256, align: 64, elements: !1507)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1166, line: 238, baseType: !1572)
!1572 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1166, line: 238, flags: DIFlagFwdDecl)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1566, file: !1465, line: 110, baseType: !1003, size: 32, align: 32, offset: 256)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1566, file: !1465, line: 111, baseType: !1003, size: 32, align: 32, offset: 288)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1566, file: !1465, line: 111, baseType: !1003, size: 32, align: 32, offset: 320)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1566, file: !1465, line: 112, baseType: !1229, size: 256, align: 32, offset: 352)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1566, file: !1465, line: 113, baseType: !1510, size: 128, align: 32, offset: 608)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1566, file: !1465, line: 114, baseType: !1003, size: 32, align: 32, offset: 736)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1566, file: !1465, line: 115, baseType: !1003, size: 32, align: 32, offset: 768)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1566, file: !1465, line: 116, baseType: !1003, size: 32, align: 32, offset: 800)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1557, file: !1465, line: 163, baseType: !1004, size: 64, align: 64, offset: 256)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1557, file: !1465, line: 165, baseType: !1583, size: 128, align: 64, offset: 320)
!1583 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1465, line: 122, baseType: !1584)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1465, line: 119, size: 128, align: 64, elements: !1585)
!1585 = !{!1586, !1587}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1584, file: !1465, line: 120, baseType: !1159, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1584, file: !1465, line: 121, baseType: !1220, size: 64, align: 64, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1557, file: !1465, line: 166, baseType: !1589, size: 128, align: 64, offset: 448)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1465, line: 127, baseType: !1590)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1465, line: 124, size: 128, align: 64, elements: !1591)
!1591 = !{!1592, !1665}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1590, file: !1465, line: 125, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1597)
!1597 = !{!1598, !1599, !1623, !1627, !1628, !1662, !1663, !1664}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1596, file: !4, line: 5751, baseType: !1033, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1596, file: !4, line: 5756, baseType: !1600, size: 64, align: 64, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1603)
!1603 = !{!1604, !1605, !1608, !1609, !1610, !1614, !1618, !1622}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1602, file: !4, line: 5797, baseType: !1016, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1602, file: !4, line: 5804, baseType: !1606, size: 64, align: 64, offset: 64)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1602, file: !4, line: 5815, baseType: !1033, size: 64, align: 64, offset: 128)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1602, file: !4, line: 5825, baseType: !1003, size: 32, align: 32, offset: 192)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1602, file: !4, line: 5826, baseType: !1611, size: 64, align: 64, offset: 256)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!1003, !1594}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1602, file: !4, line: 5827, baseType: !1615, size: 64, align: 64, offset: 320)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!1003, !1594, !1159}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1602, file: !4, line: 5828, baseType: !1619, size: 64, align: 64, offset: 384)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1594}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1602, file: !4, line: 5829, baseType: !1619, size: 64, align: 64, offset: 448)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1596, file: !4, line: 5762, baseType: !1624, size: 64, align: 64, offset: 128)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1626)
!1626 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1596, file: !4, line: 5768, baseType: !1004, size: 64, align: 64, offset: 192)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1596, file: !4, line: 5775, baseType: !1629, size: 64, align: 64, offset: 256)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1631)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1632)
!1632 = !{!1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1631, file: !4, line: 3940, baseType: !658, size: 32, align: 32)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1631, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1631, file: !4, line: 3948, baseType: !998, size: 32, align: 32, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1631, file: !4, line: 3958, baseType: !1174, size: 64, align: 64, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1631, file: !4, line: 3962, baseType: !1003, size: 32, align: 32, offset: 192)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1631, file: !4, line: 3968, baseType: !1003, size: 32, align: 32, offset: 224)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1631, file: !4, line: 3973, baseType: !1001, size: 64, align: 64, offset: 256)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1631, file: !4, line: 3986, baseType: !1003, size: 32, align: 32, offset: 320)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1631, file: !4, line: 3999, baseType: !1003, size: 32, align: 32, offset: 352)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1631, file: !4, line: 4004, baseType: !1003, size: 32, align: 32, offset: 384)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1631, file: !4, line: 4005, baseType: !1003, size: 32, align: 32, offset: 416)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1631, file: !4, line: 4010, baseType: !1003, size: 32, align: 32, offset: 448)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1631, file: !4, line: 4011, baseType: !1003, size: 32, align: 32, offset: 480)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1631, file: !4, line: 4020, baseType: !1060, size: 64, align: 32, offset: 512)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1631, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1631, file: !4, line: 4030, baseType: !571, size: 32, align: 32, offset: 608)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1631, file: !4, line: 4031, baseType: !578, size: 32, align: 32, offset: 640)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1631, file: !4, line: 4032, baseType: !596, size: 32, align: 32, offset: 672)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1631, file: !4, line: 4033, baseType: !620, size: 32, align: 32, offset: 704)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1631, file: !4, line: 4034, baseType: !639, size: 32, align: 32, offset: 736)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1631, file: !4, line: 4039, baseType: !1003, size: 32, align: 32, offset: 768)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1631, file: !4, line: 4046, baseType: !1248, size: 64, align: 64, offset: 832)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1631, file: !4, line: 4050, baseType: !1003, size: 32, align: 32, offset: 896)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1631, file: !4, line: 4054, baseType: !1003, size: 32, align: 32, offset: 928)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1631, file: !4, line: 4061, baseType: !1003, size: 32, align: 32, offset: 960)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1631, file: !4, line: 4065, baseType: !1003, size: 32, align: 32, offset: 992)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1631, file: !4, line: 4073, baseType: !1003, size: 32, align: 32, offset: 1024)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1631, file: !4, line: 4080, baseType: !1003, size: 32, align: 32, offset: 1056)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1631, file: !4, line: 4084, baseType: !1003, size: 32, align: 32, offset: 1088)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1596, file: !4, line: 5781, baseType: !1629, size: 64, align: 64, offset: 320)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1596, file: !4, line: 5787, baseType: !1060, size: 64, align: 32, offset: 384)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1596, file: !4, line: 5793, baseType: !1060, size: 64, align: 32, offset: 448)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1590, file: !1465, line: 126, baseType: !1003, size: 32, align: 32, offset: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1557, file: !1465, line: 172, baseType: !1159, size: 64, align: 64, offset: 576)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1557, file: !1465, line: 177, baseType: !1174, size: 64, align: 64, offset: 640)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1557, file: !1465, line: 178, baseType: !1000, size: 32, align: 32, offset: 704)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1557, file: !1465, line: 180, baseType: !1004, size: 64, align: 64, offset: 768)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1557, file: !1465, line: 185, baseType: !1003, size: 32, align: 32, offset: 832)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1557, file: !1465, line: 190, baseType: !1004, size: 64, align: 64, offset: 896)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1557, file: !1465, line: 195, baseType: !1003, size: 32, align: 32, offset: 960)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1557, file: !1465, line: 200, baseType: !1159, size: 64, align: 64, offset: 1024)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1557, file: !1465, line: 201, baseType: !1003, size: 32, align: 32, offset: 1088)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1557, file: !1465, line: 202, baseType: !1220, size: 64, align: 64, offset: 1152)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1557, file: !1465, line: 203, baseType: !1003, size: 32, align: 32, offset: 1216)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1557, file: !1465, line: 205, baseType: !1003, size: 32, align: 32, offset: 1248)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1557, file: !1465, line: 206, baseType: !1003, size: 32, align: 32, offset: 1280)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1557, file: !1465, line: 209, baseType: !1212, size: 64, align: 64, offset: 1344)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1557, file: !1465, line: 212, baseType: !1212, size: 64, align: 64, offset: 1408)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1557, file: !1465, line: 213, baseType: !1220, size: 64, align: 64, offset: 1472)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1557, file: !1465, line: 215, baseType: !1003, size: 32, align: 32, offset: 1536)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1557, file: !1465, line: 217, baseType: !1003, size: 32, align: 32, offset: 1568)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1557, file: !1465, line: 220, baseType: !1003, size: 32, align: 32, offset: 1600)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1406, file: !4, line: 1598, baseType: !1004, size: 64, align: 64, offset: 384)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1406, file: !4, line: 1606, baseType: !1001, size: 64, align: 64, offset: 448)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1406, file: !4, line: 1614, baseType: !1003, size: 32, align: 32, offset: 512)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1406, file: !4, line: 1622, baseType: !1003, size: 32, align: 32, offset: 544)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1406, file: !4, line: 1628, baseType: !1003, size: 32, align: 32, offset: 576)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1406, file: !4, line: 1636, baseType: !1003, size: 32, align: 32, offset: 608)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1406, file: !4, line: 1643, baseType: !1003, size: 32, align: 32, offset: 640)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1406, file: !4, line: 1657, baseType: !1174, size: 64, align: 64, offset: 704)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1406, file: !4, line: 1658, baseType: !1003, size: 32, align: 32, offset: 768)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1406, file: !4, line: 1679, baseType: !1060, size: 64, align: 32, offset: 800)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1406, file: !4, line: 1688, baseType: !1003, size: 32, align: 32, offset: 864)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1406, file: !4, line: 1712, baseType: !1003, size: 32, align: 32, offset: 896)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1406, file: !4, line: 1729, baseType: !1003, size: 32, align: 32, offset: 928)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1406, file: !4, line: 1729, baseType: !1003, size: 32, align: 32, offset: 960)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1406, file: !4, line: 1744, baseType: !1003, size: 32, align: 32, offset: 992)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1406, file: !4, line: 1744, baseType: !1003, size: 32, align: 32, offset: 1024)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1406, file: !4, line: 1751, baseType: !1003, size: 32, align: 32, offset: 1056)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1406, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1406, file: !4, line: 1791, baseType: !1704, size: 64, align: 64, offset: 1152)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{null, !1707, !1521, !1523, !1003, !1003, !1003}
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1406, file: !4, line: 1808, baseType: !1709, size: 64, align: 64, offset: 1216)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!667, !1707, !1425}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1406, file: !4, line: 1816, baseType: !1003, size: 32, align: 32, offset: 1280)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1406, file: !4, line: 1825, baseType: !1714, size: 32, align: 32, offset: 1312)
!1714 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1406, file: !4, line: 1830, baseType: !1003, size: 32, align: 32, offset: 1344)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1406, file: !4, line: 1838, baseType: !1714, size: 32, align: 32, offset: 1376)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1406, file: !4, line: 1846, baseType: !1003, size: 32, align: 32, offset: 1408)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1406, file: !4, line: 1851, baseType: !1003, size: 32, align: 32, offset: 1440)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1406, file: !4, line: 1861, baseType: !1714, size: 32, align: 32, offset: 1472)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1406, file: !4, line: 1868, baseType: !1714, size: 32, align: 32, offset: 1504)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1406, file: !4, line: 1875, baseType: !1714, size: 32, align: 32, offset: 1536)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1406, file: !4, line: 1882, baseType: !1714, size: 32, align: 32, offset: 1568)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1406, file: !4, line: 1889, baseType: !1714, size: 32, align: 32, offset: 1600)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1406, file: !4, line: 1896, baseType: !1714, size: 32, align: 32, offset: 1632)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1406, file: !4, line: 1903, baseType: !1714, size: 32, align: 32, offset: 1664)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1406, file: !4, line: 1910, baseType: !1003, size: 32, align: 32, offset: 1696)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1406, file: !4, line: 1915, baseType: !1003, size: 32, align: 32, offset: 1728)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1406, file: !4, line: 1926, baseType: !1523, size: 64, align: 64, offset: 1792)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1406, file: !4, line: 1935, baseType: !1060, size: 64, align: 32, offset: 1856)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1406, file: !4, line: 1942, baseType: !1003, size: 32, align: 32, offset: 1920)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1406, file: !4, line: 1948, baseType: !1003, size: 32, align: 32, offset: 1952)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1406, file: !4, line: 1954, baseType: !1003, size: 32, align: 32, offset: 1984)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1406, file: !4, line: 1960, baseType: !1003, size: 32, align: 32, offset: 2016)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1406, file: !4, line: 1984, baseType: !1003, size: 32, align: 32, offset: 2048)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1406, file: !4, line: 1991, baseType: !1003, size: 32, align: 32, offset: 2080)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1406, file: !4, line: 1996, baseType: !1003, size: 32, align: 32, offset: 2112)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1406, file: !4, line: 2004, baseType: !1003, size: 32, align: 32, offset: 2144)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1406, file: !4, line: 2011, baseType: !1003, size: 32, align: 32, offset: 2176)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1406, file: !4, line: 2018, baseType: !1003, size: 32, align: 32, offset: 2208)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1406, file: !4, line: 2027, baseType: !1003, size: 32, align: 32, offset: 2240)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1406, file: !4, line: 2034, baseType: !1003, size: 32, align: 32, offset: 2272)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1406, file: !4, line: 2044, baseType: !1003, size: 32, align: 32, offset: 2304)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1406, file: !4, line: 2054, baseType: !1744, size: 64, align: 64, offset: 2368)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1406, file: !4, line: 2061, baseType: !1744, size: 64, align: 64, offset: 2432)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1406, file: !4, line: 2066, baseType: !1003, size: 32, align: 32, offset: 2496)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1406, file: !4, line: 2070, baseType: !1003, size: 32, align: 32, offset: 2528)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1406, file: !4, line: 2078, baseType: !1003, size: 32, align: 32, offset: 2560)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1406, file: !4, line: 2085, baseType: !1003, size: 32, align: 32, offset: 2592)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1406, file: !4, line: 2092, baseType: !1003, size: 32, align: 32, offset: 2624)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1406, file: !4, line: 2099, baseType: !1003, size: 32, align: 32, offset: 2656)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1406, file: !4, line: 2106, baseType: !1003, size: 32, align: 32, offset: 2688)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1406, file: !4, line: 2113, baseType: !1003, size: 32, align: 32, offset: 2720)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1406, file: !4, line: 2120, baseType: !1003, size: 32, align: 32, offset: 2752)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1406, file: !4, line: 2125, baseType: !1003, size: 32, align: 32, offset: 2784)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1406, file: !4, line: 2133, baseType: !1003, size: 32, align: 32, offset: 2816)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1406, file: !4, line: 2140, baseType: !1003, size: 32, align: 32, offset: 2848)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1406, file: !4, line: 2145, baseType: !1003, size: 32, align: 32, offset: 2880)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1406, file: !4, line: 2153, baseType: !1003, size: 32, align: 32, offset: 2912)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1406, file: !4, line: 2158, baseType: !1003, size: 32, align: 32, offset: 2944)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1406, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1406, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1406, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1406, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1406, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1406, file: !4, line: 2203, baseType: !1003, size: 32, align: 32, offset: 3136)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1406, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
