; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_picture.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_picture.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MMCOOpcode", file: !888, line: 109, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/h264dec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895, !896}
!890 = !DIEnumerator(name: "MMCO_END", value: 0)
!891 = !DIEnumerator(name: "MMCO_SHORT2UNUSED", value: 1)
!892 = !DIEnumerator(name: "MMCO_LONG2UNUSED", value: 2)
!893 = !DIEnumerator(name: "MMCO_SHORT2LONG", value: 3)
!894 = !DIEnumerator(name: "MMCO_SET_MAX_LONG", value: 4)
!895 = !DIEnumerator(name: "MMCO_RESET", value: 5)
!896 = !DIEnumerator(name: "MMCO_LONG", value: 6)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 45, size: 32, align: 32, elements: !899)
!898 = !DIFile(filename: "libavcodec/h264_sei.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908}
!900 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME", value: 0)
!901 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_FIELD", value: 1)
!902 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_FIELD", value: 2)
!903 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_BOTTOM", value: 3)
!904 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_TOP", value: 4)
!905 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_TOP_BOTTOM_TOP", value: 5)
!906 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_BOTTOM_TOP_BOTTOM", value: 6)
!907 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_DOUBLING", value: 7)
!908 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_TRIPLING", value: 8)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !898, line: 60, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_CHECKERBOARD", value: 0)
!912 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_COLUMN", value: 1)
!913 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_ROW", value: 2)
!914 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_SIDE_BY_SIDE", value: 3)
!915 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_TOP_BOTTOM", value: 4)
!916 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_TEMPORAL", value: 5)
!917 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_2D", value: 6)
!918 = !{!919, !923}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !921, line: 48, baseType: !922)
!921 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!922 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!924 = !{i32 2, !"Dwarf Version", i32 4}
!925 = !{i32 2, !"Debug Info Version", i32 3}
!926 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!927 = distinct !DISubprogram(name: "ff_h264_unref_picture", scope: !928, file: !928, line: 45, type: !929, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2583)
!928 = !DIFile(filename: "libavcodec/h264_picture.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = !DISubroutineType(types: !930)
!930 = !{null, !931, !1845}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264Context", file: !888, line: 554, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264Context", file: !888, line: 337, size: 416128, align: 64, elements: !934)
!934 = !{!935, !980, !1665, !1679, !1763, !1775, !1790, !1844, !1846, !1847, !1848, !2161, !2162, !2163, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2258, !2262, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2279, !2280, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2433, !2434, !2448, !2450, !2452, !2453, !2457, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2479, !2480, !2481, !2482, !2576, !2577, !2578, !2579, !2580}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !933, file: !888, line: 338, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !940)
!940 = !{!941, !945, !949, !953, !955, !956, !957, !961, !967, !969, !973}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !939, file: !4, line: 72, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !939, file: !4, line: 78, baseType: !946, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!942, !923}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !939, file: !4, line: 85, baseType: !950, size: 64, align: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !939, file: !4, line: 93, baseType: !954, size: 32, align: 32, offset: 192)
!954 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !939, file: !4, line: 99, baseType: !954, size: 32, align: 32, offset: 224)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !939, file: !4, line: 108, baseType: !954, size: 32, align: 32, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !939, file: !4, line: 113, baseType: !958, size: 64, align: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!923, !923, !923}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !939, file: !4, line: 123, baseType: !962, size: 64, align: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!965, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !939, file: !4, line: 130, baseType: !968, size: 32, align: 32, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !939, file: !4, line: 136, baseType: !970, size: 64, align: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DISubroutineType(types: !972)
!972 = !{!968, !923}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !939, file: !4, line: 142, baseType: !974, size: 64, align: 64, offset: 576)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!954, !977, !923, !942, !954}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !933, file: !888, line: 339, baseType: !981, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !984)
!984 = !{!985, !986, !987, !988, !1263, !1264, !1265, !1266, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1419, !1423, !1424, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1603, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !983, file: !35, line: 1561, baseType: !936, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !983, file: !35, line: 1562, baseType: !954, size: 32, align: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !983, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !983, file: !35, line: 1565, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !998, !1007, !1010, !1013, !1016, !1021, !1022, !1023, !1031, !1032, !1033, !1035, !1039, !1045, !1056, !1060, !1061, !1113, !1234, !1238, !1239, !1243, !1247, !1252, !1256, !1257, !1258}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !35, line: 3475, baseType: !942, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !991, file: !35, line: 3480, baseType: !942, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !991, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !991, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !991, file: !35, line: 3487, baseType: !954, size: 32, align: 32, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !991, file: !35, line: 3488, baseType: !999, size: 64, align: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1002, line: 61, baseType: !1003)
!1002 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1002, line: 58, size: 64, align: 32, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1003, file: !1002, line: 59, baseType: !954, size: 32, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1003, file: !1002, line: 60, baseType: !954, size: 32, align: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !991, file: !35, line: 3489, baseType: !1008, size: 64, align: 64, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !991, file: !35, line: 3490, baseType: !1011, size: 64, align: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !991, file: !35, line: 3491, baseType: !1014, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !991, file: !35, line: 3492, baseType: !1017, size: 64, align: 64, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !921, line: 55, baseType: !1020)
!1020 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !991, file: !35, line: 3493, baseType: !920, size: 8, align: 8, offset: 576)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !991, file: !35, line: 3494, baseType: !936, size: 64, align: 64, offset: 640)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !991, file: !35, line: 3495, baseType: !1024, size: 64, align: 64, offset: 704)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1027, file: !35, line: 3402, baseType: !954, size: 32, align: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !35, line: 3403, baseType: !942, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !991, file: !35, line: 3507, baseType: !942, size: 64, align: 64, offset: 768)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !991, file: !35, line: 3516, baseType: !954, size: 32, align: 32, offset: 832)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !991, file: !35, line: 3517, baseType: !1034, size: 64, align: 64, offset: 896)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !991, file: !35, line: 3527, baseType: !1036, size: 64, align: 64, offset: 960)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!954, !981}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !991, file: !35, line: 3535, baseType: !1040, size: 64, align: 64, offset: 1024)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!954, !981, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !991, file: !35, line: 3541, baseType: !1046, size: 64, align: 64, offset: 1088)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1050, line: 223, size: 128, align: 64, elements: !1051)
!1050 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1051 = !{!1052, !1055}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1049, file: !1050, line: 224, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1049, file: !1050, line: 225, baseType: !1053, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !991, file: !35, line: 3549, baseType: !1057, size: 64, align: 64, offset: 1152)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{null, !1034}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !991, file: !35, line: 3551, baseType: !1036, size: 64, align: 64, offset: 1216)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !991, file: !35, line: 3552, baseType: !1062, size: 64, align: 64, offset: 1280)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!954, !981, !919, !954, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1068)
!1068 = !{!1069, !1072, !1075, !1076, !1077, !1109}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1067, file: !35, line: 3921, baseType: !1070, size: 16, align: 16)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !921, line: 49, baseType: !1071)
!1071 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1067, file: !35, line: 3922, baseType: !1073, size: 32, align: 32, offset: 32)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !921, line: 51, baseType: !1074)
!1074 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1067, file: !35, line: 3923, baseType: !1073, size: 32, align: 32, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1067, file: !35, line: 3924, baseType: !1074, size: 32, align: 32, offset: 96)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1067, file: !35, line: 3925, baseType: !1078, size: 64, align: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087, !1088, !1098, !1102, !1104, !1105, !1107, !1108}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1081, file: !35, line: 3886, baseType: !954, size: 32, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1081, file: !35, line: 3887, baseType: !954, size: 32, align: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1081, file: !35, line: 3888, baseType: !954, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1081, file: !35, line: 3889, baseType: !954, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1081, file: !35, line: 3890, baseType: !954, size: 32, align: 32, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1081, file: !35, line: 3897, baseType: !1089, size: 768, align: 64, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1091)
!1091 = !{!1092, !1096}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1090, file: !35, line: 3855, baseType: !1093, size: 512, align: 64)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 512, align: 64, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 8)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1090, file: !35, line: 3857, baseType: !1097, size: 256, align: 32, offset: 512)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 256, align: 32, elements: !1094)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1081, file: !35, line: 3903, baseType: !1099, size: 256, align: 64, offset: 960)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 256, align: 64, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 4)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1081, file: !35, line: 3904, baseType: !1103, size: 128, align: 32, offset: 1216)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, align: 32, elements: !1100)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1081, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1081, file: !35, line: 3908, baseType: !1106, size: 64, align: 64, offset: 1408)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1081, file: !35, line: 3915, baseType: !1106, size: 64, align: 64, offset: 1472)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1081, file: !35, line: 3917, baseType: !954, size: 32, align: 32, offset: 1536)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1067, file: !35, line: 3926, baseType: !1110, size: 64, align: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1111, line: 197, baseType: !1112)
!1111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1112 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !991, file: !35, line: 3564, baseType: !1114, size: 64, align: 64, offset: 1344)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!954, !981, !1117, !1151, !1233}
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1120)
!1120 = !{!1121, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1147, !1148, !1149, !1150}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1119, file: !35, line: 1451, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1124, line: 94, baseType: !1125)
!1124 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1124, line: 81, size: 192, align: 64, elements: !1126)
!1126 = !{!1127, !1131, !1132}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1125, file: !1124, line: 82, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1124, line: 73, baseType: !1130)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1124, line: 73, flags: DIFlagFwdDecl)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1125, file: !1124, line: 89, baseType: !919, size: 64, align: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1125, file: !1124, line: 93, baseType: !954, size: 32, align: 32, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1119, file: !35, line: 1461, baseType: !1110, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1119, file: !35, line: 1467, baseType: !1110, size: 64, align: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !35, line: 1468, baseType: !919, size: 64, align: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1119, file: !35, line: 1469, baseType: !954, size: 32, align: 32, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1119, file: !35, line: 1470, baseType: !954, size: 32, align: 32, offset: 288)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1119, file: !35, line: 1474, baseType: !954, size: 32, align: 32, offset: 320)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1119, file: !35, line: 1479, baseType: !1140, size: 64, align: 64, offset: 384)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1143)
!1143 = !{!1144, !1145, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1142, file: !35, line: 1412, baseType: !919, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1142, file: !35, line: 1413, baseType: !954, size: 32, align: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1142, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1119, file: !35, line: 1480, baseType: !954, size: 32, align: 32, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1119, file: !35, line: 1486, baseType: !1110, size: 64, align: 64, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1119, file: !35, line: 1488, baseType: !1110, size: 64, align: 64, offset: 576)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1119, file: !35, line: 1497, baseType: !1110, size: 64, align: 64, offset: 640)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1185, !1187, !1188, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1221, !1222, !1223, !1224, !1225, !1226, !1229, !1230, !1231, !1232}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !758, line: 282, baseType: !1093, size: 512, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1154, file: !758, line: 299, baseType: !1097, size: 256, align: 32, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1154, file: !758, line: 315, baseType: !1159, size: 64, align: 64, offset: 768)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1154, file: !758, line: 326, baseType: !954, size: 32, align: 32, offset: 832)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1154, file: !758, line: 326, baseType: !954, size: 32, align: 32, offset: 864)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1154, file: !758, line: 334, baseType: !954, size: 32, align: 32, offset: 896)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1154, file: !758, line: 341, baseType: !954, size: 32, align: 32, offset: 928)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1154, file: !758, line: 346, baseType: !954, size: 32, align: 32, offset: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1154, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1154, file: !758, line: 356, baseType: !1001, size: 64, align: 32, offset: 1024)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1154, file: !758, line: 361, baseType: !1110, size: 64, align: 64, offset: 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1154, file: !758, line: 369, baseType: !1110, size: 64, align: 64, offset: 1152)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1154, file: !758, line: 377, baseType: !1110, size: 64, align: 64, offset: 1216)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1154, file: !758, line: 382, baseType: !954, size: 32, align: 32, offset: 1280)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1154, file: !758, line: 386, baseType: !954, size: 32, align: 32, offset: 1312)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1154, file: !758, line: 391, baseType: !954, size: 32, align: 32, offset: 1344)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1154, file: !758, line: 396, baseType: !923, size: 64, align: 64, offset: 1408)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1154, file: !758, line: 403, baseType: !1175, size: 512, align: 64, offset: 1472)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 512, align: 64, elements: !1094)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1154, file: !758, line: 410, baseType: !954, size: 32, align: 32, offset: 1984)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1154, file: !758, line: 415, baseType: !954, size: 32, align: 32, offset: 2016)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1154, file: !758, line: 420, baseType: !954, size: 32, align: 32, offset: 2048)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1154, file: !758, line: 425, baseType: !954, size: 32, align: 32, offset: 2080)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1154, file: !758, line: 435, baseType: !1110, size: 64, align: 64, offset: 2112)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1154, file: !758, line: 440, baseType: !954, size: 32, align: 32, offset: 2176)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1154, file: !758, line: 445, baseType: !1019, size: 64, align: 64, offset: 2240)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1154, file: !758, line: 459, baseType: !1184, size: 512, align: 64, offset: 2304)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 512, align: 64, elements: !1094)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1154, file: !758, line: 473, baseType: !1186, size: 64, align: 64, offset: 2816)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1154, file: !758, line: 477, baseType: !954, size: 32, align: 32, offset: 2880)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1154, file: !758, line: 479, baseType: !1189, size: 64, align: 64, offset: 2944)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1202}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1192, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !758, line: 203, baseType: !919, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1192, file: !758, line: 204, baseType: !954, size: 32, align: 32, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1192, file: !758, line: 205, baseType: !1198, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1200, line: 86, baseType: !1201)
!1200 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1200, line: 86, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1192, file: !758, line: 206, baseType: !1122, size: 64, align: 64, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1154, file: !758, line: 480, baseType: !954, size: 32, align: 32, offset: 3008)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !758, line: 505, baseType: !954, size: 32, align: 32, offset: 3040)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1154, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1154, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1154, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1154, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1154, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1154, file: !758, line: 532, baseType: !1110, size: 64, align: 64, offset: 3264)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1154, file: !758, line: 539, baseType: !1110, size: 64, align: 64, offset: 3328)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1154, file: !758, line: 547, baseType: !1110, size: 64, align: 64, offset: 3392)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1154, file: !758, line: 554, baseType: !1198, size: 64, align: 64, offset: 3456)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1154, file: !758, line: 563, baseType: !954, size: 32, align: 32, offset: 3520)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1154, file: !758, line: 572, baseType: !954, size: 32, align: 32, offset: 3552)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1154, file: !758, line: 581, baseType: !954, size: 32, align: 32, offset: 3584)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1154, file: !758, line: 588, baseType: !1218, size: 64, align: 64, offset: 3648)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1111, line: 194, baseType: !1220)
!1220 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1154, file: !758, line: 593, baseType: !954, size: 32, align: 32, offset: 3712)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1154, file: !758, line: 596, baseType: !954, size: 32, align: 32, offset: 3744)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1154, file: !758, line: 599, baseType: !1122, size: 64, align: 64, offset: 3776)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1154, file: !758, line: 605, baseType: !1122, size: 64, align: 64, offset: 3840)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1154, file: !758, line: 616, baseType: !1122, size: 64, align: 64, offset: 3904)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1154, file: !758, line: 626, baseType: !1227, size: 64, align: 64, offset: 3968)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1228, line: 216, baseType: !1020)
!1228 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1154, file: !758, line: 627, baseType: !1227, size: 64, align: 64, offset: 4032)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1154, file: !758, line: 628, baseType: !1227, size: 64, align: 64, offset: 4096)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1154, file: !758, line: 629, baseType: !1227, size: 64, align: 64, offset: 4160)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1154, file: !758, line: 645, baseType: !1122, size: 64, align: 64, offset: 4224)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !991, file: !35, line: 3566, baseType: !1235, size: 64, align: 64, offset: 1408)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!954, !981, !923, !1233, !1117}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !991, file: !35, line: 3567, baseType: !1036, size: 64, align: 64, offset: 1472)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !991, file: !35, line: 3576, baseType: !1240, size: 64, align: 64, offset: 1536)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!954, !981, !1151}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !991, file: !35, line: 3577, baseType: !1244, size: 64, align: 64, offset: 1600)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!954, !981, !1117}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !991, file: !35, line: 3584, baseType: !1248, size: 64, align: 64, offset: 1664)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!954, !981, !1251}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !991, file: !35, line: 3589, baseType: !1253, size: 64, align: 64, offset: 1728)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{null, !981}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !991, file: !35, line: 3594, baseType: !954, size: 32, align: 32, offset: 1792)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !991, file: !35, line: 3600, baseType: !942, size: 64, align: 64, offset: 1856)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !991, file: !35, line: 3609, baseType: !1259, size: 64, align: 64, offset: 1920)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1262)
!1262 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !983, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !983, file: !35, line: 1581, baseType: !1074, size: 32, align: 32, offset: 224)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !983, file: !35, line: 1583, baseType: !923, size: 64, align: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !983, file: !35, line: 1591, baseType: !1267, size: 64, align: 64, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1050, line: 129, size: 1664, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1274, !1292, !1293, !1299, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1268, file: !1050, line: 136, baseType: !954, size: 32, align: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1268, file: !1050, line: 151, baseType: !954, size: 32, align: 32, offset: 32)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1268, file: !1050, line: 157, baseType: !954, size: 32, align: 32, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1268, file: !1050, line: 159, baseType: !1251, size: 64, align: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1268, file: !1050, line: 161, baseType: !1275, size: 64, align: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1050, line: 117, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1050, line: 100, size: 832, align: 64, elements: !1278)
!1278 = !{!1279, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1277, file: !1050, line: 105, baseType: !1280, size: 256, align: 64)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 256, align: 64, elements: !1100)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1124, line: 238, baseType: !1283)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1124, line: 238, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1277, file: !1050, line: 110, baseType: !954, size: 32, align: 32, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1277, file: !1050, line: 111, baseType: !954, size: 32, align: 32, offset: 288)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1277, file: !1050, line: 111, baseType: !954, size: 32, align: 32, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1277, file: !1050, line: 112, baseType: !1097, size: 256, align: 32, offset: 352)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1277, file: !1050, line: 113, baseType: !1103, size: 128, align: 32, offset: 608)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1277, file: !1050, line: 114, baseType: !954, size: 32, align: 32, offset: 736)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1277, file: !1050, line: 115, baseType: !954, size: 32, align: 32, offset: 768)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1277, file: !1050, line: 116, baseType: !954, size: 32, align: 32, offset: 800)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1268, file: !1050, line: 163, baseType: !923, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1268, file: !1050, line: 165, baseType: !1294, size: 128, align: 64, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1050, line: 122, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1050, line: 119, size: 128, align: 64, elements: !1296)
!1296 = !{!1297, !1298}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1295, file: !1050, line: 120, baseType: !1117, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1295, file: !1050, line: 121, baseType: !1251, size: 64, align: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1268, file: !1050, line: 166, baseType: !1300, size: 128, align: 64, offset: 448)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1050, line: 127, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1050, line: 124, size: 128, align: 64, elements: !1302)
!1302 = !{!1303, !1376}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1301, file: !1050, line: 125, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1307)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1308)
!1308 = !{!1309, !1310, !1334, !1338, !1339, !1373, !1374, !1375}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1307, file: !35, line: 5751, baseType: !936, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1307, file: !35, line: 5756, baseType: !1311, size: 64, align: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1319, !1320, !1321, !1325, !1329, !1333}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1313, file: !35, line: 5797, baseType: !942, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1313, file: !35, line: 5804, baseType: !1317, size: 64, align: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1313, file: !35, line: 5815, baseType: !936, size: 64, align: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1313, file: !35, line: 5825, baseType: !954, size: 32, align: 32, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1313, file: !35, line: 5826, baseType: !1322, size: 64, align: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DISubroutineType(types: !1324)
!1324 = !{!954, !1305}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1313, file: !35, line: 5827, baseType: !1326, size: 64, align: 64, offset: 320)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DISubroutineType(types: !1328)
!1328 = !{!954, !1305, !1117}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1313, file: !35, line: 5828, baseType: !1330, size: 64, align: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{null, !1305}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1313, file: !35, line: 5829, baseType: !1330, size: 64, align: 64, offset: 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1307, file: !35, line: 5762, baseType: !1335, size: 64, align: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1337)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1307, file: !35, line: 5768, baseType: !923, size: 64, align: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1307, file: !35, line: 5775, baseType: !1340, size: 64, align: 64, offset: 256)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1343)
!1343 = !{!1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1342, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1342, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1342, file: !35, line: 3948, baseType: !1073, size: 32, align: 32, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1342, file: !35, line: 3958, baseType: !919, size: 64, align: 64, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1342, file: !35, line: 3962, baseType: !954, size: 32, align: 32, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1342, file: !35, line: 3968, baseType: !954, size: 32, align: 32, offset: 224)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1342, file: !35, line: 3973, baseType: !1110, size: 64, align: 64, offset: 256)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1342, file: !35, line: 3986, baseType: !954, size: 32, align: 32, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1342, file: !35, line: 3999, baseType: !954, size: 32, align: 32, offset: 352)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1342, file: !35, line: 4004, baseType: !954, size: 32, align: 32, offset: 384)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1342, file: !35, line: 4005, baseType: !954, size: 32, align: 32, offset: 416)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1342, file: !35, line: 4010, baseType: !954, size: 32, align: 32, offset: 448)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1342, file: !35, line: 4011, baseType: !954, size: 32, align: 32, offset: 480)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1342, file: !35, line: 4020, baseType: !1001, size: 64, align: 32, offset: 512)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1342, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1342, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1342, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1342, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1342, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1342, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1342, file: !35, line: 4039, baseType: !954, size: 32, align: 32, offset: 768)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1342, file: !35, line: 4046, baseType: !1019, size: 64, align: 64, offset: 832)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1342, file: !35, line: 4050, baseType: !954, size: 32, align: 32, offset: 896)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1342, file: !35, line: 4054, baseType: !954, size: 32, align: 32, offset: 928)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1342, file: !35, line: 4061, baseType: !954, size: 32, align: 32, offset: 960)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1342, file: !35, line: 4065, baseType: !954, size: 32, align: 32, offset: 992)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1342, file: !35, line: 4073, baseType: !954, size: 32, align: 32, offset: 1024)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1342, file: !35, line: 4080, baseType: !954, size: 32, align: 32, offset: 1056)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1342, file: !35, line: 4084, baseType: !954, size: 32, align: 32, offset: 1088)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1307, file: !35, line: 5781, baseType: !1340, size: 64, align: 64, offset: 320)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1307, file: !35, line: 5787, baseType: !1001, size: 64, align: 32, offset: 384)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1307, file: !35, line: 5793, baseType: !1001, size: 64, align: 32, offset: 448)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1301, file: !1050, line: 126, baseType: !954, size: 32, align: 32, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1268, file: !1050, line: 172, baseType: !1117, size: 64, align: 64, offset: 576)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1268, file: !1050, line: 177, baseType: !919, size: 64, align: 64, offset: 640)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1268, file: !1050, line: 178, baseType: !1074, size: 32, align: 32, offset: 704)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1268, file: !1050, line: 180, baseType: !923, size: 64, align: 64, offset: 768)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1268, file: !1050, line: 185, baseType: !954, size: 32, align: 32, offset: 832)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1268, file: !1050, line: 190, baseType: !923, size: 64, align: 64, offset: 896)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1268, file: !1050, line: 195, baseType: !954, size: 32, align: 32, offset: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1268, file: !1050, line: 200, baseType: !1117, size: 64, align: 64, offset: 1024)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1268, file: !1050, line: 201, baseType: !954, size: 32, align: 32, offset: 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1268, file: !1050, line: 202, baseType: !1251, size: 64, align: 64, offset: 1152)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1268, file: !1050, line: 203, baseType: !954, size: 32, align: 32, offset: 1216)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1268, file: !1050, line: 205, baseType: !954, size: 32, align: 32, offset: 1248)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1268, file: !1050, line: 206, baseType: !954, size: 32, align: 32, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1268, file: !1050, line: 209, baseType: !1227, size: 64, align: 64, offset: 1344)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1268, file: !1050, line: 212, baseType: !1227, size: 64, align: 64, offset: 1408)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1268, file: !1050, line: 213, baseType: !1251, size: 64, align: 64, offset: 1472)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1268, file: !1050, line: 215, baseType: !954, size: 32, align: 32, offset: 1536)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1268, file: !1050, line: 217, baseType: !954, size: 32, align: 32, offset: 1568)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1268, file: !1050, line: 220, baseType: !954, size: 32, align: 32, offset: 1600)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !983, file: !35, line: 1598, baseType: !923, size: 64, align: 64, offset: 384)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !983, file: !35, line: 1606, baseType: !1110, size: 64, align: 64, offset: 448)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !983, file: !35, line: 1614, baseType: !954, size: 32, align: 32, offset: 512)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !983, file: !35, line: 1622, baseType: !954, size: 32, align: 32, offset: 544)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !983, file: !35, line: 1628, baseType: !954, size: 32, align: 32, offset: 576)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !35, line: 1636, baseType: !954, size: 32, align: 32, offset: 608)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !983, file: !35, line: 1643, baseType: !954, size: 32, align: 32, offset: 640)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !983, file: !35, line: 1657, baseType: !919, size: 64, align: 64, offset: 704)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !983, file: !35, line: 1658, baseType: !954, size: 32, align: 32, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !983, file: !35, line: 1679, baseType: !1001, size: 64, align: 32, offset: 800)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !983, file: !35, line: 1688, baseType: !954, size: 32, align: 32, offset: 864)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !983, file: !35, line: 1712, baseType: !954, size: 32, align: 32, offset: 896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !983, file: !35, line: 1729, baseType: !954, size: 32, align: 32, offset: 928)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !983, file: !35, line: 1729, baseType: !954, size: 32, align: 32, offset: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !983, file: !35, line: 1744, baseType: !954, size: 32, align: 32, offset: 992)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !983, file: !35, line: 1744, baseType: !954, size: 32, align: 32, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !983, file: !35, line: 1751, baseType: !954, size: 32, align: 32, offset: 1056)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !983, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !983, file: !35, line: 1791, baseType: !1415, size: 64, align: 64, offset: 1152)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !1418, !1151, !1233, !954, !954, !954}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !983, file: !35, line: 1808, baseType: !1420, size: 64, align: 64, offset: 1216)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!494, !1418, !1008}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !983, file: !35, line: 1816, baseType: !954, size: 32, align: 32, offset: 1280)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !983, file: !35, line: 1825, baseType: !1425, size: 32, align: 32, offset: 1312)
!1425 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !983, file: !35, line: 1830, baseType: !954, size: 32, align: 32, offset: 1344)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !983, file: !35, line: 1838, baseType: !1425, size: 32, align: 32, offset: 1376)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !983, file: !35, line: 1846, baseType: !954, size: 32, align: 32, offset: 1408)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !983, file: !35, line: 1851, baseType: !954, size: 32, align: 32, offset: 1440)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !983, file: !35, line: 1861, baseType: !1425, size: 32, align: 32, offset: 1472)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !983, file: !35, line: 1868, baseType: !1425, size: 32, align: 32, offset: 1504)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !983, file: !35, line: 1875, baseType: !1425, size: 32, align: 32, offset: 1536)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !983, file: !35, line: 1882, baseType: !1425, size: 32, align: 32, offset: 1568)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !983, file: !35, line: 1889, baseType: !1425, size: 32, align: 32, offset: 1600)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !983, file: !35, line: 1896, baseType: !1425, size: 32, align: 32, offset: 1632)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !983, file: !35, line: 1903, baseType: !1425, size: 32, align: 32, offset: 1664)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !983, file: !35, line: 1910, baseType: !954, size: 32, align: 32, offset: 1696)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !983, file: !35, line: 1915, baseType: !954, size: 32, align: 32, offset: 1728)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !983, file: !35, line: 1926, baseType: !1233, size: 64, align: 64, offset: 1792)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !983, file: !35, line: 1935, baseType: !1001, size: 64, align: 32, offset: 1856)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !983, file: !35, line: 1942, baseType: !954, size: 32, align: 32, offset: 1920)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !983, file: !35, line: 1948, baseType: !954, size: 32, align: 32, offset: 1952)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !983, file: !35, line: 1954, baseType: !954, size: 32, align: 32, offset: 1984)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !983, file: !35, line: 1960, baseType: !954, size: 32, align: 32, offset: 2016)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !983, file: !35, line: 1984, baseType: !954, size: 32, align: 32, offset: 2048)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !983, file: !35, line: 1991, baseType: !954, size: 32, align: 32, offset: 2080)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !983, file: !35, line: 1996, baseType: !954, size: 32, align: 32, offset: 2112)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !983, file: !35, line: 2004, baseType: !954, size: 32, align: 32, offset: 2144)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !983, file: !35, line: 2011, baseType: !954, size: 32, align: 32, offset: 2176)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !983, file: !35, line: 2018, baseType: !954, size: 32, align: 32, offset: 2208)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !983, file: !35, line: 2027, baseType: !954, size: 32, align: 32, offset: 2240)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !983, file: !35, line: 2034, baseType: !954, size: 32, align: 32, offset: 2272)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !983, file: !35, line: 2044, baseType: !954, size: 32, align: 32, offset: 2304)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !983, file: !35, line: 2054, baseType: !1455, size: 64, align: 64, offset: 2368)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !983, file: !35, line: 2061, baseType: !1455, size: 64, align: 64, offset: 2432)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !983, file: !35, line: 2066, baseType: !954, size: 32, align: 32, offset: 2496)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !983, file: !35, line: 2070, baseType: !954, size: 32, align: 32, offset: 2528)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !983, file: !35, line: 2078, baseType: !954, size: 32, align: 32, offset: 2560)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !983, file: !35, line: 2085, baseType: !954, size: 32, align: 32, offset: 2592)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !983, file: !35, line: 2092, baseType: !954, size: 32, align: 32, offset: 2624)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !983, file: !35, line: 2099, baseType: !954, size: 32, align: 32, offset: 2656)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !983, file: !35, line: 2106, baseType: !954, size: 32, align: 32, offset: 2688)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !983, file: !35, line: 2113, baseType: !954, size: 32, align: 32, offset: 2720)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !983, file: !35, line: 2120, baseType: !954, size: 32, align: 32, offset: 2752)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !983, file: !35, line: 2125, baseType: !954, size: 32, align: 32, offset: 2784)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !983, file: !35, line: 2133, baseType: !954, size: 32, align: 32, offset: 2816)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !983, file: !35, line: 2140, baseType: !954, size: 32, align: 32, offset: 2848)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !983, file: !35, line: 2145, baseType: !954, size: 32, align: 32, offset: 2880)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !983, file: !35, line: 2153, baseType: !954, size: 32, align: 32, offset: 2912)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !983, file: !35, line: 2158, baseType: !954, size: 32, align: 32, offset: 2944)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !983, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !983, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !983, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !983, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !983, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !983, file: !35, line: 2203, baseType: !954, size: 32, align: 32, offset: 3136)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !983, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !983, file: !35, line: 2212, baseType: !954, size: 32, align: 32, offset: 3200)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !983, file: !35, line: 2213, baseType: !954, size: 32, align: 32, offset: 3232)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !983, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !983, file: !35, line: 2232, baseType: !954, size: 32, align: 32, offset: 3296)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !983, file: !35, line: 2243, baseType: !954, size: 32, align: 32, offset: 3328)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !983, file: !35, line: 2249, baseType: !954, size: 32, align: 32, offset: 3360)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !983, file: !35, line: 2256, baseType: !954, size: 32, align: 32, offset: 3392)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !983, file: !35, line: 2263, baseType: !1019, size: 64, align: 64, offset: 3456)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !983, file: !35, line: 2270, baseType: !1019, size: 64, align: 64, offset: 3520)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !983, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !983, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !983, file: !35, line: 2367, baseType: !1491, size: 64, align: 64, offset: 3648)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!954, !1418, !1251, !954}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !983, file: !35, line: 2383, baseType: !954, size: 32, align: 32, offset: 3712)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !983, file: !35, line: 2386, baseType: !1425, size: 32, align: 32, offset: 3744)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !983, file: !35, line: 2387, baseType: !1425, size: 32, align: 32, offset: 3776)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !983, file: !35, line: 2394, baseType: !954, size: 32, align: 32, offset: 3808)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !983, file: !35, line: 2401, baseType: !954, size: 32, align: 32, offset: 3840)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !983, file: !35, line: 2408, baseType: !954, size: 32, align: 32, offset: 3872)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !983, file: !35, line: 2415, baseType: !954, size: 32, align: 32, offset: 3904)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !983, file: !35, line: 2422, baseType: !954, size: 32, align: 32, offset: 3936)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !983, file: !35, line: 2423, baseType: !1503, size: 64, align: 64, offset: 3968)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1506)
!1506 = !{!1507, !1508, !1509, !1510}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1505, file: !35, line: 827, baseType: !954, size: 32, align: 32)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1505, file: !35, line: 828, baseType: !954, size: 32, align: 32, offset: 32)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1505, file: !35, line: 829, baseType: !954, size: 32, align: 32, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1505, file: !35, line: 830, baseType: !1425, size: 32, align: 32, offset: 96)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !983, file: !35, line: 2430, baseType: !1110, size: 64, align: 64, offset: 4032)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !983, file: !35, line: 2437, baseType: !1110, size: 64, align: 64, offset: 4096)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !983, file: !35, line: 2444, baseType: !1425, size: 32, align: 32, offset: 4160)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !983, file: !35, line: 2451, baseType: !1425, size: 32, align: 32, offset: 4192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !983, file: !35, line: 2458, baseType: !954, size: 32, align: 32, offset: 4224)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !983, file: !35, line: 2469, baseType: !954, size: 32, align: 32, offset: 4256)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !983, file: !35, line: 2475, baseType: !954, size: 32, align: 32, offset: 4288)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !983, file: !35, line: 2481, baseType: !954, size: 32, align: 32, offset: 4320)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !983, file: !35, line: 2485, baseType: !954, size: 32, align: 32, offset: 4352)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !983, file: !35, line: 2489, baseType: !954, size: 32, align: 32, offset: 4384)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !983, file: !35, line: 2493, baseType: !954, size: 32, align: 32, offset: 4416)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !983, file: !35, line: 2501, baseType: !954, size: 32, align: 32, offset: 4448)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !983, file: !35, line: 2506, baseType: !954, size: 32, align: 32, offset: 4480)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !983, file: !35, line: 2510, baseType: !954, size: 32, align: 32, offset: 4512)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !983, file: !35, line: 2514, baseType: !1110, size: 64, align: 64, offset: 4544)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !983, file: !35, line: 2528, baseType: !1527, size: 64, align: 64, offset: 4608)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DISubroutineType(types: !1529)
!1529 = !{null, !1418, !923, !954, !954}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !983, file: !35, line: 2534, baseType: !954, size: 32, align: 32, offset: 4672)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !983, file: !35, line: 2545, baseType: !954, size: 32, align: 32, offset: 4704)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !983, file: !35, line: 2547, baseType: !954, size: 32, align: 32, offset: 4736)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !983, file: !35, line: 2549, baseType: !954, size: 32, align: 32, offset: 4768)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !983, file: !35, line: 2551, baseType: !954, size: 32, align: 32, offset: 4800)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !983, file: !35, line: 2553, baseType: !954, size: 32, align: 32, offset: 4832)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !983, file: !35, line: 2555, baseType: !954, size: 32, align: 32, offset: 4864)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !983, file: !35, line: 2557, baseType: !954, size: 32, align: 32, offset: 4896)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !983, file: !35, line: 2559, baseType: !954, size: 32, align: 32, offset: 4928)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !983, file: !35, line: 2563, baseType: !954, size: 32, align: 32, offset: 4960)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !983, file: !35, line: 2571, baseType: !1106, size: 64, align: 64, offset: 4992)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !983, file: !35, line: 2579, baseType: !1106, size: 64, align: 64, offset: 5056)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !983, file: !35, line: 2586, baseType: !954, size: 32, align: 32, offset: 5120)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !983, file: !35, line: 2615, baseType: !954, size: 32, align: 32, offset: 5152)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !983, file: !35, line: 2627, baseType: !954, size: 32, align: 32, offset: 5184)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !983, file: !35, line: 2637, baseType: !954, size: 32, align: 32, offset: 5216)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !983, file: !35, line: 2681, baseType: !954, size: 32, align: 32, offset: 5248)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !983, file: !35, line: 2709, baseType: !1110, size: 64, align: 64, offset: 5312)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !983, file: !35, line: 2716, baseType: !1549, size: 64, align: 64, offset: 5376)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1551)
!1551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1552)
!1552 = !{!1553, !1554, !1555, !1556, !1557, !1558, !1559, !1563, !1567, !1568, !1569, !1570, !1576, !1577, !1578, !1579, !1580}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1551, file: !35, line: 3642, baseType: !942, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1551, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1551, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1551, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1551, file: !35, line: 3669, baseType: !954, size: 32, align: 32, offset: 160)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1551, file: !35, line: 3682, baseType: !1248, size: 64, align: 64, offset: 192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1551, file: !35, line: 3698, baseType: !1560, size: 64, align: 64, offset: 256)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!954, !981, !1053, !1073}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1551, file: !35, line: 3712, baseType: !1564, size: 64, align: 64, offset: 320)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!954, !981, !954, !1053, !1073}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1551, file: !35, line: 3726, baseType: !1560, size: 64, align: 64, offset: 384)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1551, file: !35, line: 3737, baseType: !1036, size: 64, align: 64, offset: 448)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1551, file: !35, line: 3746, baseType: !954, size: 32, align: 32, offset: 512)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1551, file: !35, line: 3757, baseType: !1571, size: 64, align: 64, offset: 576)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{null, !1574}
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1551, file: !35, line: 3766, baseType: !1036, size: 64, align: 64, offset: 640)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1551, file: !35, line: 3774, baseType: !1036, size: 64, align: 64, offset: 704)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1551, file: !35, line: 3780, baseType: !954, size: 32, align: 32, offset: 768)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1551, file: !35, line: 3785, baseType: !954, size: 32, align: 32, offset: 800)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1551, file: !35, line: 3795, baseType: !1581, size: 64, align: 64, offset: 832)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!954, !981, !1122}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !983, file: !35, line: 2728, baseType: !923, size: 64, align: 64, offset: 5440)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !983, file: !35, line: 2735, baseType: !1175, size: 512, align: 64, offset: 5504)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !983, file: !35, line: 2742, baseType: !954, size: 32, align: 32, offset: 6016)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !983, file: !35, line: 2755, baseType: !954, size: 32, align: 32, offset: 6048)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !983, file: !35, line: 2776, baseType: !954, size: 32, align: 32, offset: 6080)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !983, file: !35, line: 2783, baseType: !954, size: 32, align: 32, offset: 6112)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !983, file: !35, line: 2791, baseType: !954, size: 32, align: 32, offset: 6144)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !983, file: !35, line: 2802, baseType: !1251, size: 64, align: 64, offset: 6208)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !983, file: !35, line: 2811, baseType: !954, size: 32, align: 32, offset: 6272)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !983, file: !35, line: 2821, baseType: !954, size: 32, align: 32, offset: 6304)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !983, file: !35, line: 2830, baseType: !954, size: 32, align: 32, offset: 6336)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !983, file: !35, line: 2840, baseType: !954, size: 32, align: 32, offset: 6368)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !983, file: !35, line: 2851, baseType: !1597, size: 64, align: 64, offset: 6400)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!954, !1418, !1600, !923, !1233, !954, !954}
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!954, !1418, !923}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !983, file: !35, line: 2871, baseType: !1604, size: 64, align: 64, offset: 6464)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{!954, !1418, !1607, !923, !1233, !954}
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!954, !1418, !923, !954, !954}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !983, file: !35, line: 2878, baseType: !954, size: 32, align: 32, offset: 6528)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !983, file: !35, line: 2885, baseType: !954, size: 32, align: 32, offset: 6560)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !983, file: !35, line: 3005, baseType: !954, size: 32, align: 32, offset: 6592)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !983, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !983, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !983, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !983, file: !35, line: 3037, baseType: !919, size: 64, align: 64, offset: 6720)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !983, file: !35, line: 3038, baseType: !954, size: 32, align: 32, offset: 6784)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !983, file: !35, line: 3050, baseType: !1019, size: 64, align: 64, offset: 6848)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !983, file: !35, line: 3065, baseType: !954, size: 32, align: 32, offset: 6912)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !983, file: !35, line: 3083, baseType: !954, size: 32, align: 32, offset: 6944)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !983, file: !35, line: 3092, baseType: !1001, size: 64, align: 32, offset: 6976)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !983, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !983, file: !35, line: 3106, baseType: !1001, size: 64, align: 32, offset: 7072)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !983, file: !35, line: 3113, baseType: !1625, size: 64, align: 64, offset: 7168)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1627)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633, !1634, !1635, !1638}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1628, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1628, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1628, file: !35, line: 720, baseType: !942, size: 64, align: 64, offset: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1628, file: !35, line: 724, baseType: !942, size: 64, align: 64, offset: 128)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1628, file: !35, line: 728, baseType: !954, size: 32, align: 32, offset: 192)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1628, file: !35, line: 734, baseType: !1636, size: 64, align: 64, offset: 256)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1628, file: !35, line: 739, baseType: !1639, size: 64, align: 64, offset: 320)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !983, file: !35, line: 3129, baseType: !1110, size: 64, align: 64, offset: 7232)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !983, file: !35, line: 3130, baseType: !1110, size: 64, align: 64, offset: 7296)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !983, file: !35, line: 3131, baseType: !1110, size: 64, align: 64, offset: 7360)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !983, file: !35, line: 3132, baseType: !1110, size: 64, align: 64, offset: 7424)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !983, file: !35, line: 3139, baseType: !1106, size: 64, align: 64, offset: 7488)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !983, file: !35, line: 3147, baseType: !954, size: 32, align: 32, offset: 7552)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !983, file: !35, line: 3165, baseType: !954, size: 32, align: 32, offset: 7584)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !983, file: !35, line: 3172, baseType: !954, size: 32, align: 32, offset: 7616)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !983, file: !35, line: 3180, baseType: !954, size: 32, align: 32, offset: 7648)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !983, file: !35, line: 3191, baseType: !1455, size: 64, align: 64, offset: 7680)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !983, file: !35, line: 3199, baseType: !919, size: 64, align: 64, offset: 7744)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !983, file: !35, line: 3207, baseType: !1106, size: 64, align: 64, offset: 7808)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !983, file: !35, line: 3214, baseType: !1074, size: 32, align: 32, offset: 7872)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !983, file: !35, line: 3224, baseType: !1140, size: 64, align: 64, offset: 7936)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !983, file: !35, line: 3225, baseType: !954, size: 32, align: 32, offset: 8000)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !983, file: !35, line: 3249, baseType: !1122, size: 64, align: 64, offset: 8064)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !983, file: !35, line: 3256, baseType: !954, size: 32, align: 32, offset: 8128)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !983, file: !35, line: 3271, baseType: !954, size: 32, align: 32, offset: 8160)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !983, file: !35, line: 3279, baseType: !1110, size: 64, align: 64, offset: 8192)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !983, file: !35, line: 3301, baseType: !1122, size: 64, align: 64, offset: 8256)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !983, file: !35, line: 3310, baseType: !954, size: 32, align: 32, offset: 8320)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !983, file: !35, line: 3337, baseType: !954, size: 32, align: 32, offset: 8352)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !983, file: !35, line: 3351, baseType: !954, size: 32, align: 32, offset: 8384)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !983, file: !35, line: 3359, baseType: !954, size: 32, align: 32, offset: 8416)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "vdsp", scope: !933, file: !888, line: 340, baseType: !1666, size: 128, align: 64, offset: 128)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDSPContext", file: !1667, line: 77, baseType: !1668)
!1667 = !DIFile(filename: "libavcodec/videodsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VideoDSPContext", file: !1667, line: 41, size: 128, align: 64, elements: !1669)
!1669 = !{!1670, !1675}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "emulated_edge_mc", scope: !1668, file: !1667, line: 63, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{null, !919, !1053, !1674, !1674, !954, !954, !954, !954, !954, !954}
!1674 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1228, line: 149, baseType: !1112)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "prefetch", scope: !1668, file: !1667, line: 76, baseType: !1676, size: 64, align: 64, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{null, !919, !1674, !954}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "h264dsp", scope: !933, file: !888, line: 341, baseType: !1680, size: 2176, align: 64, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264DSPContext", file: !1681, line: 118, baseType: !1682)
!1681 = !DIFile(filename: "libavcodec/h264dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264DSPContext", file: !1681, line: 42, size: 2176, align: 64, elements: !1683)
!1683 = !{!1684, !1690, !1696, !1700, !1701, !1702, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1731, !1736, !1737, !1738, !1739, !1743, !1744, !1748, !1749, !1753, !1757, !1758, !1759}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "weight_h264_pixels_tab", scope: !1682, file: !1681, line: 44, baseType: !1685, size: 256, align: 64)
!1685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1686, size: 256, align: 64, elements: !1100)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "h264_weight_func", file: !1681, line: 33, baseType: !1687)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
