; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mxg.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mxg.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!930 = !DIEnumerator(name: "SOF13", value: 205)
!931 = !DIEnumerator(name: "SOF14", value: 206)
!932 = !DIEnumerator(name: "SOF15", value: 207)
!933 = !DIEnumerator(name: "DHT", value: 196)
!934 = !DIEnumerator(name: "DAC", value: 204)
!935 = !DIEnumerator(name: "RST0", value: 208)
!936 = !DIEnumerator(name: "RST1", value: 209)
!937 = !DIEnumerator(name: "RST2", value: 210)
!938 = !DIEnumerator(name: "RST3", value: 211)
!939 = !DIEnumerator(name: "RST4", value: 212)
!940 = !DIEnumerator(name: "RST5", value: 213)
!941 = !DIEnumerator(name: "RST6", value: 214)
!942 = !DIEnumerator(name: "RST7", value: 215)
!943 = !DIEnumerator(name: "SOI", value: 216)
!944 = !DIEnumerator(name: "EOI", value: 217)
!945 = !DIEnumerator(name: "SOS", value: 218)
!946 = !DIEnumerator(name: "DQT", value: 219)
!947 = !DIEnumerator(name: "DNL", value: 220)
!948 = !DIEnumerator(name: "DRI", value: 221)
!949 = !DIEnumerator(name: "DHP", value: 222)
!950 = !DIEnumerator(name: "EXP", value: 223)
!951 = !DIEnumerator(name: "APP0", value: 224)
!952 = !DIEnumerator(name: "APP1", value: 225)
!953 = !DIEnumerator(name: "APP2", value: 226)
!954 = !DIEnumerator(name: "APP3", value: 227)
!955 = !DIEnumerator(name: "APP4", value: 228)
!956 = !DIEnumerator(name: "APP5", value: 229)
!957 = !DIEnumerator(name: "APP6", value: 230)
!958 = !DIEnumerator(name: "APP7", value: 231)
!959 = !DIEnumerator(name: "APP8", value: 232)
!960 = !DIEnumerator(name: "APP9", value: 233)
!961 = !DIEnumerator(name: "APP10", value: 234)
!962 = !DIEnumerator(name: "APP11", value: 235)
!963 = !DIEnumerator(name: "APP12", value: 236)
!964 = !DIEnumerator(name: "APP13", value: 237)
!965 = !DIEnumerator(name: "APP14", value: 238)
!966 = !DIEnumerator(name: "APP15", value: 239)
!967 = !DIEnumerator(name: "JPG0", value: 240)
!968 = !DIEnumerator(name: "JPG1", value: 241)
!969 = !DIEnumerator(name: "JPG2", value: 242)
!970 = !DIEnumerator(name: "JPG3", value: 243)
!971 = !DIEnumerator(name: "JPG4", value: 244)
!972 = !DIEnumerator(name: "JPG5", value: 245)
!973 = !DIEnumerator(name: "JPG6", value: 246)
!974 = !DIEnumerator(name: "SOF48", value: 247)
!975 = !DIEnumerator(name: "LSE", value: 248)
!976 = !DIEnumerator(name: "JPG9", value: 249)
!977 = !DIEnumerator(name: "JPG10", value: 250)
!978 = !DIEnumerator(name: "JPG11", value: 251)
!979 = !DIEnumerator(name: "JPG12", value: 252)
!980 = !DIEnumerator(name: "JPG13", value: 253)
!981 = !DIEnumerator(name: "COM", value: 254)
!982 = !DIEnumerator(name: "TEM", value: 1)
!983 = !{!984, !987, !995, !1002, !1003, !1004}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !985, line: 40, baseType: !986)
!985 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!986 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !990, line: 222, size: 16, align: 8, elements: !991)
!990 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !989, file: !990, line: 222, baseType: !993, size: 16, align: 16)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !985, line: 49, baseType: !994)
!994 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !990, line: 220, size: 64, align: 8, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !997, file: !990, line: 220, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !985, line: 55, baseType: !1001)
!1001 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1002 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1003 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !990, line: 221, size: 32, align: 8, elements: !1007)
!1007 = !{!1008}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1006, file: !990, line: 221, baseType: !1009, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !985, line: 51, baseType: !1003)
!1010 = !{!1011}
!1011 = distinct !DIGlobalVariable(name: "ff_mxg_demuxer", scope: !0, file: !1012, line: 252, type: !1013, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_mxg_demuxer)
!1012 = !DIFile(filename: "libavformat/mxg.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1015)
!1015 = !{!1016, !1020, !1021, !1022, !1023, !1033, !1075, !1076, !1078, !1079, !1080, !1094, !2201, !2202, !2203, !2207, !2211, !2212, !2213, !2217, !2218, !2219}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !897, line: 638, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1014, file: !897, line: 645, baseType: !1017, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1014, file: !897, line: 652, baseType: !1002, size: 32, align: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1014, file: !897, line: 659, baseType: !1017, size: 64, align: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1014, file: !897, line: 661, baseType: !1024, size: 64, align: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1029, line: 44, size: 64, align: 32, elements: !1030)
!1029 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1028, file: !1029, line: 45, baseType: !3, size: 32, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1028, file: !1029, line: 46, baseType: !1003, size: 32, align: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1014, file: !897, line: 663, baseType: !1034, size: 64, align: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1045, !1049, !1050, !1051, !1052, !1056, !1062, !1064, !1068}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1037, file: !464, line: 72, baseType: !1017, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1037, file: !464, line: 78, baseType: !1041, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!1017, !1044}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1037, file: !464, line: 85, baseType: !1046, size: 64, align: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1037, file: !464, line: 93, baseType: !1002, size: 32, align: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1037, file: !464, line: 99, baseType: !1002, size: 32, align: 32, offset: 224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1037, file: !464, line: 108, baseType: !1002, size: 32, align: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1037, file: !464, line: 113, baseType: !1053, size: 64, align: 64, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!1044, !1044, !1044}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1037, file: !464, line: 123, baseType: !1057, size: 64, align: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1060, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1037, file: !464, line: 130, baseType: !1063, size: 32, align: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1037, file: !464, line: 136, baseType: !1065, size: 64, align: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!1063, !1044}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1037, file: !464, line: 142, baseType: !1069, size: 64, align: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!1002, !1072, !1044, !1017, !1002}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1014, file: !897, line: 670, baseType: !1017, size: 64, align: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !897, line: 679, baseType: !1077, size: 64, align: 64, offset: 448)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1014, file: !897, line: 684, baseType: !1002, size: 32, align: 32, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1014, file: !897, line: 689, baseType: !1002, size: 32, align: 32, offset: 544)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1014, file: !897, line: 696, baseType: !1081, size: 64, align: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!1002, !1084}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1092, !1093}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1086, file: !897, line: 449, baseType: !1017, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1086, file: !897, line: 450, baseType: !1090, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1086, file: !897, line: 451, baseType: !1002, size: 32, align: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1086, file: !897, line: 452, baseType: !1017, size: 64, align: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1014, file: !897, line: 703, baseType: !1095, size: 64, align: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!1002, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1299, !1300, !1365, !1366, !1367, !2058, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2112, !2113, !2114, !2115, !2116, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2167, !2168, !2171, !2172, !2173, !2174, !2175, !2176, !2178, !2179, !2180, !2181, !2189, !2190, !2194, !2198, !2199, !2200}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1099, file: !897, line: 1342, baseType: !1034, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1099, file: !897, line: 1349, baseType: !1077, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1099, file: !897, line: 1356, baseType: !1104, size: 64, align: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1160, !1161, !1165, !1169, !1174, !1180, !1274, !1280, !1286, !1287, !1288, !1289, !1293}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1105, file: !897, line: 498, baseType: !1017, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1105, file: !897, line: 504, baseType: !1017, size: 64, align: 64, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1105, file: !897, line: 505, baseType: !1017, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1105, file: !897, line: 506, baseType: !1017, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1105, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1105, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1105, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1105, file: !897, line: 517, baseType: !1002, size: 32, align: 32, offset: 352)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1105, file: !897, line: 523, baseType: !1024, size: 64, align: 64, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1105, file: !897, line: 526, baseType: !1034, size: 64, align: 64, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1105, file: !897, line: 535, baseType: !1104, size: 64, align: 64, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1105, file: !897, line: 539, baseType: !1002, size: 32, align: 32, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1105, file: !897, line: 541, baseType: !1095, size: 64, align: 64, offset: 640)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1105, file: !897, line: 549, baseType: !1121, size: 64, align: 64, offset: 704)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!1002, !1098, !1124}
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1127)
!1127 = !{!1128, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1156, !1157, !1158, !1159}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1126, file: !4, line: 1451, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1131, line: 94, baseType: !1132)
!1131 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1131, line: 81, size: 192, align: 64, elements: !1133)
!1133 = !{!1134, !1138, !1141}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1132, file: !1131, line: 82, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1131, line: 73, baseType: !1137)
!1137 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1131, line: 73, flags: DIFlagFwdDecl)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1132, file: !1131, line: 89, baseType: !1139, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !985, line: 48, baseType: !1091)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !1131, line: 93, baseType: !1002, size: 32, align: 32, offset: 128)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1126, file: !4, line: 1461, baseType: !984, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1126, file: !4, line: 1467, baseType: !984, size: 64, align: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !4, line: 1468, baseType: !1139, size: 64, align: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !4, line: 1469, baseType: !1002, size: 32, align: 32, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1126, file: !4, line: 1470, baseType: !1002, size: 32, align: 32, offset: 288)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1126, file: !4, line: 1474, baseType: !1002, size: 32, align: 32, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1126, file: !4, line: 1479, baseType: !1149, size: 64, align: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !4, line: 1412, baseType: !1139, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !4, line: 1413, baseType: !1002, size: 32, align: 32, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1151, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1126, file: !4, line: 1480, baseType: !1002, size: 32, align: 32, offset: 448)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1126, file: !4, line: 1486, baseType: !984, size: 64, align: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1126, file: !4, line: 1488, baseType: !984, size: 64, align: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1126, file: !4, line: 1497, baseType: !984, size: 64, align: 64, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1105, file: !897, line: 550, baseType: !1095, size: 64, align: 64, offset: 768)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1105, file: !897, line: 554, baseType: !1162, size: 64, align: 64, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!1002, !1098, !1124, !1124, !1002}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1105, file: !897, line: 563, baseType: !1166, size: 64, align: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!1002, !3, !1002}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1105, file: !897, line: 565, baseType: !1170, size: 64, align: 64, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !1098, !1002, !1173, !1173}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1105, file: !897, line: 570, baseType: !1175, size: 64, align: 64, offset: 1024)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!1002, !1098, !1002, !1044, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1179, line: 216, baseType: !1001)
!1179 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1105, file: !897, line: 581, baseType: !1181, size: 64, align: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!1002, !1098, !1002, !1184, !1003}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1188)
!1188 = !{!1189, !1193, !1195, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1228, !1230, !1231, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !526, line: 282, baseType: !1190, size: 512, align: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, align: 64, elements: !1191)
!1191 = !{!1192}
!1192 = !DISubrange(count: 8)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1187, file: !526, line: 299, baseType: !1194, size: 256, align: 32, offset: 512)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 256, align: 32, elements: !1191)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1187, file: !526, line: 315, baseType: !1196, size: 64, align: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1187, file: !526, line: 326, baseType: !1002, size: 32, align: 32, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1187, file: !526, line: 326, baseType: !1002, size: 32, align: 32, offset: 864)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1187, file: !526, line: 334, baseType: !1002, size: 32, align: 32, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1187, file: !526, line: 341, baseType: !1002, size: 32, align: 32, offset: 928)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1187, file: !526, line: 346, baseType: !1002, size: 32, align: 32, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1187, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1187, file: !526, line: 356, baseType: !1204, size: 64, align: 32, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1205, line: 61, baseType: !1206)
!1205 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1205, line: 58, size: 64, align: 32, elements: !1207)
!1207 = !{!1208, !1209}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1206, file: !1205, line: 59, baseType: !1002, size: 32, align: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1206, file: !1205, line: 60, baseType: !1002, size: 32, align: 32, offset: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1187, file: !526, line: 361, baseType: !984, size: 64, align: 64, offset: 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1187, file: !526, line: 369, baseType: !984, size: 64, align: 64, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1187, file: !526, line: 377, baseType: !984, size: 64, align: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1187, file: !526, line: 382, baseType: !1002, size: 32, align: 32, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1187, file: !526, line: 386, baseType: !1002, size: 32, align: 32, offset: 1312)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1187, file: !526, line: 391, baseType: !1002, size: 32, align: 32, offset: 1344)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1187, file: !526, line: 396, baseType: !1044, size: 64, align: 64, offset: 1408)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1187, file: !526, line: 403, baseType: !1218, size: 512, align: 64, offset: 1472)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 512, align: 64, elements: !1191)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1187, file: !526, line: 410, baseType: !1002, size: 32, align: 32, offset: 1984)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1187, file: !526, line: 415, baseType: !1002, size: 32, align: 32, offset: 2016)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1187, file: !526, line: 420, baseType: !1002, size: 32, align: 32, offset: 2048)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1187, file: !526, line: 425, baseType: !1002, size: 32, align: 32, offset: 2080)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1187, file: !526, line: 435, baseType: !984, size: 64, align: 64, offset: 2112)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1187, file: !526, line: 440, baseType: !1002, size: 32, align: 32, offset: 2176)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1187, file: !526, line: 445, baseType: !1000, size: 64, align: 64, offset: 2240)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1187, file: !526, line: 459, baseType: !1227, size: 512, align: 64, offset: 2304)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 512, align: 64, elements: !1191)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1187, file: !526, line: 473, baseType: !1229, size: 64, align: 64, offset: 2816)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1187, file: !526, line: 477, baseType: !1002, size: 32, align: 32, offset: 2880)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1187, file: !526, line: 479, baseType: !1232, size: 64, align: 64, offset: 2944)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240, !1245}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1235, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1235, file: !526, line: 203, baseType: !1139, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1235, file: !526, line: 204, baseType: !1002, size: 32, align: 32, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1235, file: !526, line: 205, baseType: !1241, size: 64, align: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1243, line: 86, baseType: !1244)
!1243 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1243, line: 86, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1235, file: !526, line: 206, baseType: !1129, size: 64, align: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1187, file: !526, line: 480, baseType: !1002, size: 32, align: 32, offset: 3008)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1187, file: !526, line: 505, baseType: !1002, size: 32, align: 32, offset: 3040)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1187, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1187, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1187, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1187, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1187, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1187, file: !526, line: 532, baseType: !984, size: 64, align: 64, offset: 3264)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1187, file: !526, line: 539, baseType: !984, size: 64, align: 64, offset: 3328)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1187, file: !526, line: 547, baseType: !984, size: 64, align: 64, offset: 3392)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1187, file: !526, line: 554, baseType: !1241, size: 64, align: 64, offset: 3456)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1187, file: !526, line: 563, baseType: !1002, size: 32, align: 32, offset: 3520)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1187, file: !526, line: 572, baseType: !1002, size: 32, align: 32, offset: 3552)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1187, file: !526, line: 581, baseType: !1002, size: 32, align: 32, offset: 3584)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1187, file: !526, line: 588, baseType: !1261, size: 64, align: 64, offset: 3648)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !985, line: 36, baseType: !1263)
!1263 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1187, file: !526, line: 593, baseType: !1002, size: 32, align: 32, offset: 3712)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1187, file: !526, line: 596, baseType: !1002, size: 32, align: 32, offset: 3744)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1187, file: !526, line: 599, baseType: !1129, size: 64, align: 64, offset: 3776)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1187, file: !526, line: 605, baseType: !1129, size: 64, align: 64, offset: 3840)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1187, file: !526, line: 616, baseType: !1129, size: 64, align: 64, offset: 3904)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1187, file: !526, line: 626, baseType: !1178, size: 64, align: 64, offset: 3968)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1187, file: !526, line: 627, baseType: !1178, size: 64, align: 64, offset: 4032)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1187, file: !526, line: 628, baseType: !1178, size: 64, align: 64, offset: 4096)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1187, file: !526, line: 629, baseType: !1178, size: 64, align: 64, offset: 4160)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1187, file: !526, line: 645, baseType: !1129, size: 64, align: 64, offset: 4224)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1105, file: !897, line: 587, baseType: !1275, size: 64, align: 64, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!1002, !1098, !1278}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1105, file: !897, line: 592, baseType: !1281, size: 64, align: 64, offset: 1216)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!1002, !1098, !1284}
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1105, file: !897, line: 597, baseType: !1281, size: 64, align: 64, offset: 1280)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1105, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1105, file: !897, line: 608, baseType: !1095, size: 64, align: 64, offset: 1408)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1105, file: !897, line: 617, baseType: !1290, size: 64, align: 64, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{null, !1098}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1105, file: !897, line: 623, baseType: !1294, size: 64, align: 64, offset: 1536)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!1002, !1098, !1297}
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1125)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1099, file: !897, line: 1365, baseType: !1044, size: 64, align: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1099, file: !897, line: 1379, baseType: !1301, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310, !1311, !1315, !1316, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1332, !1333, !1337, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1355, !1356, !1357, !1358, !1362, !1363, !1364}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1303, file: !628, line: 174, baseType: !1034, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1303, file: !628, line: 226, baseType: !1090, size: 64, align: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1303, file: !628, line: 227, baseType: !1002, size: 32, align: 32, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1303, file: !628, line: 228, baseType: !1090, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1303, file: !628, line: 229, baseType: !1090, size: 64, align: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1303, file: !628, line: 233, baseType: !1044, size: 64, align: 64, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1303, file: !628, line: 235, baseType: !1312, size: 64, align: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!1002, !1044, !1139, !1002}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1303, file: !628, line: 236, baseType: !1312, size: 64, align: 64, offset: 448)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1303, file: !628, line: 237, baseType: !1317, size: 64, align: 64, offset: 512)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!984, !1044, !984, !1002}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1303, file: !628, line: 238, baseType: !984, size: 64, align: 64, offset: 576)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1303, file: !628, line: 239, baseType: !1002, size: 32, align: 32, offset: 640)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1303, file: !628, line: 240, baseType: !1002, size: 32, align: 32, offset: 672)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1303, file: !628, line: 241, baseType: !1002, size: 32, align: 32, offset: 704)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1303, file: !628, line: 242, baseType: !1001, size: 64, align: 64, offset: 768)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1303, file: !628, line: 243, baseType: !1090, size: 64, align: 64, offset: 832)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1303, file: !628, line: 244, baseType: !1327, size: 64, align: 64, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!1001, !1001, !1330, !1003}
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1303, file: !628, line: 245, baseType: !1002, size: 32, align: 32, offset: 960)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1303, file: !628, line: 249, baseType: !1334, size: 64, align: 64, offset: 1024)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!1002, !1044, !1002}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1303, file: !628, line: 255, baseType: !1338, size: 64, align: 64, offset: 1088)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!984, !1044, !1002, !984, !1002}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1303, file: !628, line: 260, baseType: !1002, size: 32, align: 32, offset: 1152)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1303, file: !628, line: 266, baseType: !984, size: 64, align: 64, offset: 1216)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1303, file: !628, line: 273, baseType: !1002, size: 32, align: 32, offset: 1280)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1303, file: !628, line: 279, baseType: !984, size: 64, align: 64, offset: 1344)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1303, file: !628, line: 285, baseType: !1002, size: 32, align: 32, offset: 1408)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1303, file: !628, line: 291, baseType: !1002, size: 32, align: 32, offset: 1440)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1303, file: !628, line: 298, baseType: !1002, size: 32, align: 32, offset: 1472)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1303, file: !628, line: 304, baseType: !1002, size: 32, align: 32, offset: 1504)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1303, file: !628, line: 309, baseType: !1017, size: 64, align: 64, offset: 1536)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1303, file: !628, line: 314, baseType: !1017, size: 64, align: 64, offset: 1600)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1303, file: !628, line: 319, baseType: !1352, size: 64, align: 64, offset: 1664)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!1002, !1044, !1139, !1002, !627, !984}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1303, file: !628, line: 326, baseType: !1002, size: 32, align: 32, offset: 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1303, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1303, file: !628, line: 332, baseType: !984, size: 64, align: 64, offset: 1792)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1303, file: !628, line: 338, baseType: !1359, size: 64, align: 64, offset: 1856)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!1002, !1044}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1303, file: !628, line: 340, baseType: !984, size: 64, align: 64, offset: 1920)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1303, file: !628, line: 346, baseType: !1090, size: 64, align: 64, offset: 1984)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1303, file: !628, line: 351, baseType: !1002, size: 32, align: 32, offset: 2048)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1099, file: !897, line: 1386, baseType: !1002, size: 32, align: 32, offset: 320)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1099, file: !897, line: 1393, baseType: !1003, size: 32, align: 32, offset: 352)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1099, file: !897, line: 1405, baseType: !1368, size: 64, align: 64, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1843, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1944, !1950, !1951, !1955, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1987, !1988, !1989, !1990, !1991, !1992}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1371, file: !897, line: 866, baseType: !1002, size: 32, align: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1371, file: !897, line: 872, baseType: !1002, size: 32, align: 32, offset: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1371, file: !897, line: 878, baseType: !1376, size: 64, align: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1518, !1519, !1520, !1521, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1547, !1551, !1552, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1731, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1378, file: !4, line: 1561, baseType: !1034, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1378, file: !4, line: 1562, baseType: !1002, size: 32, align: 32, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1378, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1378, file: !4, line: 1565, baseType: !1384, size: 64, align: 64, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1387)
!1387 = !{!1388, !1389, !1390, !1391, !1392, !1393, !1396, !1399, !1402, !1405, !1408, !1409, !1410, !1418, !1419, !1420, !1422, !1426, !1432, !1437, !1441, !1442, !1483, !1490, !1494, !1495, !1499, !1503, !1507, !1511, !1512, !1513}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1386, file: !4, line: 3475, baseType: !1017, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1386, file: !4, line: 3480, baseType: !1017, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1386, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1386, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1386, file: !4, line: 3487, baseType: !1002, size: 32, align: 32, offset: 192)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1386, file: !4, line: 3488, baseType: !1394, size: 64, align: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1204)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1386, file: !4, line: 3489, baseType: !1397, size: 64, align: 64, offset: 320)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1386, file: !4, line: 3490, baseType: !1400, size: 64, align: 64, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1386, file: !4, line: 3491, baseType: !1403, size: 64, align: 64, offset: 448)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1386, file: !4, line: 3492, baseType: !1406, size: 64, align: 64, offset: 512)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1386, file: !4, line: 3493, baseType: !1140, size: 8, align: 8, offset: 576)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1386, file: !4, line: 3494, baseType: !1034, size: 64, align: 64, offset: 640)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1386, file: !4, line: 3495, baseType: !1411, size: 64, align: 64, offset: 704)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1413)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1415)
!1415 = !{!1416, !1417}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1414, file: !4, line: 3402, baseType: !1002, size: 32, align: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1414, file: !4, line: 3403, baseType: !1017, size: 64, align: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1386, file: !4, line: 3507, baseType: !1017, size: 64, align: 64, offset: 768)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1386, file: !4, line: 3516, baseType: !1002, size: 32, align: 32, offset: 832)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1386, file: !4, line: 3517, baseType: !1421, size: 64, align: 64, offset: 896)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1386, file: !4, line: 3527, baseType: !1423, size: 64, align: 64, offset: 960)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{!1002, !1376}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1386, file: !4, line: 3535, baseType: !1427, size: 64, align: 64, offset: 1024)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{!1002, !1376, !1430}
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1377)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1386, file: !4, line: 3541, baseType: !1433, size: 64, align: 64, offset: 1088)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1435)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1436)
!1436 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1386, file: !4, line: 3549, baseType: !1438, size: 64, align: 64, offset: 1152)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{null, !1421}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1386, file: !4, line: 3551, baseType: !1423, size: 64, align: 64, offset: 1216)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1386, file: !4, line: 3552, baseType: !1443, size: 64, align: 64, offset: 1280)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!1002, !1376, !1139, !1002, !1446}
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1448)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1454, !1482}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1448, file: !4, line: 3921, baseType: !993, size: 16, align: 16)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1448, file: !4, line: 3922, baseType: !1009, size: 32, align: 32, offset: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1448, file: !4, line: 3923, baseType: !1009, size: 32, align: 32, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1448, file: !4, line: 3924, baseType: !1003, size: 32, align: 32, offset: 96)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1448, file: !4, line: 3925, baseType: !1455, size: 64, align: 64, offset: 128)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1463, !1464, !1465, !1471, !1475, !1477, !1478, !1480, !1481}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1458, file: !4, line: 3886, baseType: !1002, size: 32, align: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1458, file: !4, line: 3887, baseType: !1002, size: 32, align: 32, offset: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1458, file: !4, line: 3888, baseType: !1002, size: 32, align: 32, offset: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1458, file: !4, line: 3889, baseType: !1002, size: 32, align: 32, offset: 96)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1458, file: !4, line: 3890, baseType: !1002, size: 32, align: 32, offset: 128)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1458, file: !4, line: 3897, baseType: !1466, size: 768, align: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1468)
!1468 = !{!1469, !1470}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1467, file: !4, line: 3855, baseType: !1190, size: 512, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1467, file: !4, line: 3857, baseType: !1194, size: 256, align: 32, offset: 512)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1458, file: !4, line: 3903, baseType: !1472, size: 256, align: 64, offset: 960)
!1472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 256, align: 64, elements: !1473)
!1473 = !{!1474}
!1474 = !DISubrange(count: 4)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1458, file: !4, line: 3904, baseType: !1476, size: 128, align: 32, offset: 1216)
!1476 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 128, align: 32, elements: !1473)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1458, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1458, file: !4, line: 3908, baseType: !1479, size: 64, align: 64, offset: 1408)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1458, file: !4, line: 3915, baseType: !1479, size: 64, align: 64, offset: 1472)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1458, file: !4, line: 3917, baseType: !1002, size: 32, align: 32, offset: 1536)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1448, file: !4, line: 3926, baseType: !984, size: 64, align: 64, offset: 192)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1386, file: !4, line: 3564, baseType: !1484, size: 64, align: 64, offset: 1344)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!1002, !1376, !1124, !1487, !1489}
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1386, file: !4, line: 3566, baseType: !1491, size: 64, align: 64, offset: 1408)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!1002, !1376, !1044, !1489, !1124}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1386, file: !4, line: 3567, baseType: !1423, size: 64, align: 64, offset: 1472)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1386, file: !4, line: 3576, baseType: !1496, size: 64, align: 64, offset: 1536)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!1002, !1376, !1487}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1386, file: !4, line: 3577, baseType: !1500, size: 64, align: 64, offset: 1600)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!1002, !1376, !1124}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1386, file: !4, line: 3584, baseType: !1504, size: 64, align: 64, offset: 1664)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!1002, !1376, !1185}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1386, file: !4, line: 3589, baseType: !1508, size: 64, align: 64, offset: 1728)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !1376}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1386, file: !4, line: 3594, baseType: !1002, size: 32, align: 32, offset: 1792)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1386, file: !4, line: 3600, baseType: !1017, size: 64, align: 64, offset: 1856)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1386, file: !4, line: 3609, baseType: !1514, size: 64, align: 64, offset: 1920)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1517)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1378, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1378, file: !4, line: 1581, baseType: !1003, size: 32, align: 32, offset: 224)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1378, file: !4, line: 1583, baseType: !1044, size: 64, align: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1378, file: !4, line: 1591, baseType: !1522, size: 64, align: 64, offset: 320)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1378, file: !4, line: 1598, baseType: !1044, size: 64, align: 64, offset: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1378, file: !4, line: 1606, baseType: !984, size: 64, align: 64, offset: 448)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1378, file: !4, line: 1614, baseType: !1002, size: 32, align: 32, offset: 512)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1378, file: !4, line: 1622, baseType: !1002, size: 32, align: 32, offset: 544)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1378, file: !4, line: 1628, baseType: !1002, size: 32, align: 32, offset: 576)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1378, file: !4, line: 1636, baseType: !1002, size: 32, align: 32, offset: 608)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1378, file: !4, line: 1643, baseType: !1002, size: 32, align: 32, offset: 640)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1378, file: !4, line: 1657, baseType: !1139, size: 64, align: 64, offset: 704)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1378, file: !4, line: 1658, baseType: !1002, size: 32, align: 32, offset: 768)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1378, file: !4, line: 1679, baseType: !1204, size: 64, align: 32, offset: 800)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1378, file: !4, line: 1688, baseType: !1002, size: 32, align: 32, offset: 864)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1378, file: !4, line: 1712, baseType: !1002, size: 32, align: 32, offset: 896)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1378, file: !4, line: 1729, baseType: !1002, size: 32, align: 32, offset: 928)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1378, file: !4, line: 1729, baseType: !1002, size: 32, align: 32, offset: 960)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1378, file: !4, line: 1744, baseType: !1002, size: 32, align: 32, offset: 992)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1378, file: !4, line: 1744, baseType: !1002, size: 32, align: 32, offset: 1024)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1378, file: !4, line: 1751, baseType: !1002, size: 32, align: 32, offset: 1056)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1378, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1378, file: !4, line: 1791, baseType: !1543, size: 64, align: 64, offset: 1152)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{null, !1546, !1487, !1489, !1002, !1002, !1002}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1378, file: !4, line: 1808, baseType: !1548, size: 64, align: 64, offset: 1216)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DISubroutineType(types: !1550)
!1550 = !{!645, !1546, !1397}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1378, file: !4, line: 1816, baseType: !1002, size: 32, align: 32, offset: 1280)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1378, file: !4, line: 1825, baseType: !1553, size: 32, align: 32, offset: 1312)
!1553 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1378, file: !4, line: 1830, baseType: !1002, size: 32, align: 32, offset: 1344)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1378, file: !4, line: 1838, baseType: !1553, size: 32, align: 32, offset: 1376)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1378, file: !4, line: 1846, baseType: !1002, size: 32, align: 32, offset: 1408)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1378, file: !4, line: 1851, baseType: !1002, size: 32, align: 32, offset: 1440)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1378, file: !4, line: 1861, baseType: !1553, size: 32, align: 32, offset: 1472)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1378, file: !4, line: 1868, baseType: !1553, size: 32, align: 32, offset: 1504)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1378, file: !4, line: 1875, baseType: !1553, size: 32, align: 32, offset: 1536)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1378, file: !4, line: 1882, baseType: !1553, size: 32, align: 32, offset: 1568)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1378, file: !4, line: 1889, baseType: !1553, size: 32, align: 32, offset: 1600)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1378, file: !4, line: 1896, baseType: !1553, size: 32, align: 32, offset: 1632)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1378, file: !4, line: 1903, baseType: !1553, size: 32, align: 32, offset: 1664)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1378, file: !4, line: 1910, baseType: !1002, size: 32, align: 32, offset: 1696)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1378, file: !4, line: 1915, baseType: !1002, size: 32, align: 32, offset: 1728)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1378, file: !4, line: 1926, baseType: !1489, size: 64, align: 64, offset: 1792)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1378, file: !4, line: 1935, baseType: !1204, size: 64, align: 32, offset: 1856)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1378, file: !4, line: 1942, baseType: !1002, size: 32, align: 32, offset: 1920)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1378, file: !4, line: 1948, baseType: !1002, size: 32, align: 32, offset: 1952)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1378, file: !4, line: 1954, baseType: !1002, size: 32, align: 32, offset: 1984)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1378, file: !4, line: 1960, baseType: !1002, size: 32, align: 32, offset: 2016)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1378, file: !4, line: 1984, baseType: !1002, size: 32, align: 32, offset: 2048)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1378, file: !4, line: 1991, baseType: !1002, size: 32, align: 32, offset: 2080)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1378, file: !4, line: 1996, baseType: !1002, size: 32, align: 32, offset: 2112)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1378, file: !4, line: 2004, baseType: !1002, size: 32, align: 32, offset: 2144)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1378, file: !4, line: 2011, baseType: !1002, size: 32, align: 32, offset: 2176)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1378, file: !4, line: 2018, baseType: !1002, size: 32, align: 32, offset: 2208)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1378, file: !4, line: 2027, baseType: !1002, size: 32, align: 32, offset: 2240)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1378, file: !4, line: 2034, baseType: !1002, size: 32, align: 32, offset: 2272)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1378, file: !4, line: 2044, baseType: !1002, size: 32, align: 32, offset: 2304)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1378, file: !4, line: 2054, baseType: !1583, size: 64, align: 64, offset: 2368)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1378, file: !4, line: 2061, baseType: !1583, size: 64, align: 64, offset: 2432)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1378, file: !4, line: 2066, baseType: !1002, size: 32, align: 32, offset: 2496)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1378, file: !4, line: 2070, baseType: !1002, size: 32, align: 32, offset: 2528)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1378, file: !4, line: 2078, baseType: !1002, size: 32, align: 32, offset: 2560)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1378, file: !4, line: 2085, baseType: !1002, size: 32, align: 32, offset: 2592)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1378, file: !4, line: 2092, baseType: !1002, size: 32, align: 32, offset: 2624)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1378, file: !4, line: 2099, baseType: !1002, size: 32, align: 32, offset: 2656)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1378, file: !4, line: 2106, baseType: !1002, size: 32, align: 32, offset: 2688)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1378, file: !4, line: 2113, baseType: !1002, size: 32, align: 32, offset: 2720)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1378, file: !4, line: 2120, baseType: !1002, size: 32, align: 32, offset: 2752)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1378, file: !4, line: 2125, baseType: !1002, size: 32, align: 32, offset: 2784)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1378, file: !4, line: 2133, baseType: !1002, size: 32, align: 32, offset: 2816)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1378, file: !4, line: 2140, baseType: !1002, size: 32, align: 32, offset: 2848)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1378, file: !4, line: 2145, baseType: !1002, size: 32, align: 32, offset: 2880)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1378, file: !4, line: 2153, baseType: !1002, size: 32, align: 32, offset: 2912)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1378, file: !4, line: 2158, baseType: !1002, size: 32, align: 32, offset: 2944)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1378, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1378, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1378, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1378, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1378, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1378, file: !4, line: 2203, baseType: !1002, size: 32, align: 32, offset: 3136)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1378, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1378, file: !4, line: 2212, baseType: !1002, size: 32, align: 32, offset: 3200)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1378, file: !4, line: 2213, baseType: !1002, size: 32, align: 32, offset: 3232)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1378, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1378, file: !4, line: 2232, baseType: !1002, size: 32, align: 32, offset: 3296)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1378, file: !4, line: 2243, baseType: !1002, size: 32, align: 32, offset: 3328)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1378, file: !4, line: 2249, baseType: !1002, size: 32, align: 32, offset: 3360)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1378, file: !4, line: 2256, baseType: !1002, size: 32, align: 32, offset: 3392)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1378, file: !4, line: 2263, baseType: !1000, size: 64, align: 64, offset: 3456)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1378, file: !4, line: 2270, baseType: !1000, size: 64, align: 64, offset: 3520)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1378, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1378, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1378, file: !4, line: 2367, baseType: !1619, size: 64, align: 64, offset: 3648)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!1002, !1546, !1185, !1002}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1378, file: !4, line: 2383, baseType: !1002, size: 32, align: 32, offset: 3712)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1378, file: !4, line: 2386, baseType: !1553, size: 32, align: 32, offset: 3744)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1378, file: !4, line: 2387, baseType: !1553, size: 32, align: 32, offset: 3776)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1378, file: !4, line: 2394, baseType: !1002, size: 32, align: 32, offset: 3808)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1378, file: !4, line: 2401, baseType: !1002, size: 32, align: 32, offset: 3840)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1378, file: !4, line: 2408, baseType: !1002, size: 32, align: 32, offset: 3872)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1378, file: !4, line: 2415, baseType: !1002, size: 32, align: 32, offset: 3904)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1378, file: !4, line: 2422, baseType: !1002, size: 32, align: 32, offset: 3936)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1378, file: !4, line: 2423, baseType: !1631, size: 64, align: 64, offset: 3968)
!1631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1632, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1633)
!1633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1634)
!1634 = !{!1635, !1636, !1637, !1638}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1633, file: !4, line: 827, baseType: !1002, size: 32, align: 32)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1633, file: !4, line: 828, baseType: !1002, size: 32, align: 32, offset: 32)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1633, file: !4, line: 829, baseType: !1002, size: 32, align: 32, offset: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1633, file: !4, line: 830, baseType: !1553, size: 32, align: 32, offset: 96)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1378, file: !4, line: 2430, baseType: !984, size: 64, align: 64, offset: 4032)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1378, file: !4, line: 2437, baseType: !984, size: 64, align: 64, offset: 4096)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1378, file: !4, line: 2444, baseType: !1553, size: 32, align: 32, offset: 4160)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1378, file: !4, line: 2451, baseType: !1553, size: 32, align: 32, offset: 4192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1378, file: !4, line: 2458, baseType: !1002, size: 32, align: 32, offset: 4224)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1378, file: !4, line: 2469, baseType: !1002, size: 32, align: 32, offset: 4256)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1378, file: !4, line: 2475, baseType: !1002, size: 32, align: 32, offset: 4288)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1378, file: !4, line: 2481, baseType: !1002, size: 32, align: 32, offset: 4320)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1378, file: !4, line: 2485, baseType: !1002, size: 32, align: 32, offset: 4352)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1378, file: !4, line: 2489, baseType: !1002, size: 32, align: 32, offset: 4384)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1378, file: !4, line: 2493, baseType: !1002, size: 32, align: 32, offset: 4416)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1378, file: !4, line: 2501, baseType: !1002, size: 32, align: 32, offset: 4448)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1378, file: !4, line: 2506, baseType: !1002, size: 32, align: 32, offset: 4480)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1378, file: !4, line: 2510, baseType: !1002, size: 32, align: 32, offset: 4512)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1378, file: !4, line: 2514, baseType: !984, size: 64, align: 64, offset: 4544)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1378, file: !4, line: 2528, baseType: !1655, size: 64, align: 64, offset: 4608)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{null, !1546, !1044, !1002, !1002}
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1378, file: !4, line: 2534, baseType: !1002, size: 32, align: 32, offset: 4672)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1378, file: !4, line: 2545, baseType: !1002, size: 32, align: 32, offset: 4704)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1378, file: !4, line: 2547, baseType: !1002, size: 32, align: 32, offset: 4736)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1378, file: !4, line: 2549, baseType: !1002, size: 32, align: 32, offset: 4768)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1378, file: !4, line: 2551, baseType: !1002, size: 32, align: 32, offset: 4800)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1378, file: !4, line: 2553, baseType: !1002, size: 32, align: 32, offset: 4832)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1378, file: !4, line: 2555, baseType: !1002, size: 32, align: 32, offset: 4864)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1378, file: !4, line: 2557, baseType: !1002, size: 32, align: 32, offset: 4896)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1378, file: !4, line: 2559, baseType: !1002, size: 32, align: 32, offset: 4928)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1378, file: !4, line: 2563, baseType: !1002, size: 32, align: 32, offset: 4960)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1378, file: !4, line: 2571, baseType: !1479, size: 64, align: 64, offset: 4992)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1378, file: !4, line: 2579, baseType: !1479, size: 64, align: 64, offset: 5056)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1378, file: !4, line: 2586, baseType: !1002, size: 32, align: 32, offset: 5120)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1378, file: !4, line: 2615, baseType: !1002, size: 32, align: 32, offset: 5152)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1378, file: !4, line: 2627, baseType: !1002, size: 32, align: 32, offset: 5184)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1378, file: !4, line: 2637, baseType: !1002, size: 32, align: 32, offset: 5216)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1378, file: !4, line: 2681, baseType: !1002, size: 32, align: 32, offset: 5248)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1378, file: !4, line: 2709, baseType: !984, size: 64, align: 64, offset: 5312)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1378, file: !4, line: 2716, baseType: !1677, size: 64, align: 64, offset: 5376)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1679)
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1680)
!1680 = !{!1681, !1682, !1683, !1684, !1685, !1686, !1687, !1691, !1695, !1696, !1697, !1698, !1704, !1705, !1706, !1707, !1708}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1679, file: !4, line: 3642, baseType: !1017, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1679, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1679, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1679, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1679, file: !4, line: 3669, baseType: !1002, size: 32, align: 32, offset: 160)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1679, file: !4, line: 3682, baseType: !1504, size: 64, align: 64, offset: 192)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1679, file: !4, line: 3698, baseType: !1688, size: 64, align: 64, offset: 256)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!1002, !1376, !1330, !1009}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1679, file: !4, line: 3712, baseType: !1692, size: 64, align: 64, offset: 320)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!1002, !1376, !1002, !1330, !1009}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1679, file: !4, line: 3726, baseType: !1688, size: 64, align: 64, offset: 384)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1679, file: !4, line: 3737, baseType: !1423, size: 64, align: 64, offset: 448)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1679, file: !4, line: 3746, baseType: !1002, size: 32, align: 32, offset: 512)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1679, file: !4, line: 3757, baseType: !1699, size: 64, align: 64, offset: 576)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{null, !1702}
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1679, file: !4, line: 3766, baseType: !1423, size: 64, align: 64, offset: 640)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1679, file: !4, line: 3774, baseType: !1423, size: 64, align: 64, offset: 704)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1679, file: !4, line: 3780, baseType: !1002, size: 32, align: 32, offset: 768)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1679, file: !4, line: 3785, baseType: !1002, size: 32, align: 32, offset: 800)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1679, file: !4, line: 3795, baseType: !1709, size: 64, align: 64, offset: 832)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!1002, !1376, !1129}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1378, file: !4, line: 2728, baseType: !1044, size: 64, align: 64, offset: 5440)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1378, file: !4, line: 2735, baseType: !1218, size: 512, align: 64, offset: 5504)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1378, file: !4, line: 2742, baseType: !1002, size: 32, align: 32, offset: 6016)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1378, file: !4, line: 2755, baseType: !1002, size: 32, align: 32, offset: 6048)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1378, file: !4, line: 2776, baseType: !1002, size: 32, align: 32, offset: 6080)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1378, file: !4, line: 2783, baseType: !1002, size: 32, align: 32, offset: 6112)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1378, file: !4, line: 2791, baseType: !1002, size: 32, align: 32, offset: 6144)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1378, file: !4, line: 2802, baseType: !1185, size: 64, align: 64, offset: 6208)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1378, file: !4, line: 2811, baseType: !1002, size: 32, align: 32, offset: 6272)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1378, file: !4, line: 2821, baseType: !1002, size: 32, align: 32, offset: 6304)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1378, file: !4, line: 2830, baseType: !1002, size: 32, align: 32, offset: 6336)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1378, file: !4, line: 2840, baseType: !1002, size: 32, align: 32, offset: 6368)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1378, file: !4, line: 2851, baseType: !1725, size: 64, align: 64, offset: 6400)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!1002, !1546, !1728, !1044, !1489, !1002, !1002}
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{!1002, !1546, !1044}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1378, file: !4, line: 2871, baseType: !1732, size: 64, align: 64, offset: 6464)
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!1002, !1546, !1735, !1044, !1489, !1002}
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DISubroutineType(types: !1737)
!1737 = !{!1002, !1546, !1044, !1002, !1002}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1378, file: !4, line: 2878, baseType: !1002, size: 32, align: 32, offset: 6528)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1378, file: !4, line: 2885, baseType: !1002, size: 32, align: 32, offset: 6560)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1378, file: !4, line: 3005, baseType: !1002, size: 32, align: 32, offset: 6592)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1378, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1378, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1378, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1378, file: !4, line: 3037, baseType: !1139, size: 64, align: 64, offset: 6720)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1378, file: !4, line: 3038, baseType: !1002, size: 32, align: 32, offset: 6784)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1378, file: !4, line: 3050, baseType: !1000, size: 64, align: 64, offset: 6848)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1378, file: !4, line: 3065, baseType: !1002, size: 32, align: 32, offset: 6912)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1378, file: !4, line: 3083, baseType: !1002, size: 32, align: 32, offset: 6944)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1378, file: !4, line: 3092, baseType: !1204, size: 64, align: 32, offset: 6976)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1378, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1378, file: !4, line: 3106, baseType: !1204, size: 64, align: 32, offset: 7072)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1378, file: !4, line: 3113, baseType: !1753, size: 64, align: 64, offset: 7168)
!1753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1754, size: 64, align: 64)
!1754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1755)
!1755 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1756)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1757)
!1757 = !{!1758, !1759, !1760, !1761, !1762, !1763, !1766}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1756, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1756, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1756, file: !4, line: 720, baseType: !1017, size: 64, align: 64, offset: 64)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1756, file: !4, line: 724, baseType: !1017, size: 64, align: 64, offset: 128)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1756, file: !4, line: 728, baseType: !1002, size: 32, align: 32, offset: 192)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1756, file: !4, line: 734, baseType: !1764, size: 64, align: 64, offset: 256)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1756, file: !4, line: 739, baseType: !1767, size: 64, align: 64, offset: 320)
!1767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1768, size: 64, align: 64)
!1768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1378, file: !4, line: 3129, baseType: !984, size: 64, align: 64, offset: 7232)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1378, file: !4, line: 3130, baseType: !984, size: 64, align: 64, offset: 7296)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1378, file: !4, line: 3131, baseType: !984, size: 64, align: 64, offset: 7360)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1378, file: !4, line: 3132, baseType: !984, size: 64, align: 64, offset: 7424)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1378, file: !4, line: 3139, baseType: !1479, size: 64, align: 64, offset: 7488)
