; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--pcm.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--pcm.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !917, line: 79, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!920 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!921 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!922 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!923 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!924 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !927, line: 40, baseType: !928)
!927 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!929 = !{i32 2, !"Dwarf Version", i32 4}
!930 = !{i32 2, !"Debug Info Version", i32 3}
!931 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!932 = distinct !DISubprogram(name: "ff_pcm_read_packet", scope: !933, file: !933, line: 29, type: !934, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2151)
!933 = !DIFile(filename: "libavformat/pcm.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!934 = !DISubroutineType(types: !935)
!935 = !{!936, !937, !1033}
!936 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !940)
!940 = !{!941, !986, !1098, !1246, !1247, !1312, !1313, !1314, !2008, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2062, !2063, !2064, !2065, !2066, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2117, !2118, !2121, !2122, !2123, !2124, !2125, !2126, !2128, !2129, !2130, !2131, !2139, !2140, !2144, !2148, !2149, !2150}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !939, file: !897, line: 1342, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !946)
!946 = !{!947, !951, !956, !960, !961, !962, !963, !967, !973, !975, !979}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !945, file: !4, line: 72, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !945, file: !4, line: 78, baseType: !952, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!948, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !945, file: !4, line: 85, baseType: !957, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !945, file: !4, line: 93, baseType: !936, size: 32, align: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !945, file: !4, line: 99, baseType: !936, size: 32, align: 32, offset: 224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !945, file: !4, line: 108, baseType: !936, size: 32, align: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !945, file: !4, line: 113, baseType: !964, size: 64, align: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!955, !955, !955}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !945, file: !4, line: 123, baseType: !968, size: 64, align: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!971, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !945, file: !4, line: 130, baseType: !974, size: 32, align: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !945, file: !4, line: 136, baseType: !976, size: 64, align: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!974, !955}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !945, file: !4, line: 142, baseType: !980, size: 64, align: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!936, !983, !955, !948, !936}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !939, file: !897, line: 1349, baseType: !987, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !1005, !1006, !1007, !1008, !1009, !1010, !1024, !1029, !1069, !1070, !1074, !1079, !1080, !1081, !1085, !1091, !1097}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !897, line: 638, baseType: !948, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !988, file: !897, line: 645, baseType: !948, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !988, file: !897, line: 652, baseType: !936, size: 32, align: 32, offset: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !988, file: !897, line: 659, baseType: !948, size: 64, align: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !988, file: !897, line: 661, baseType: !995, size: 64, align: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1000, line: 44, size: 64, align: 32, elements: !1001)
!1000 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !999, file: !1000, line: 45, baseType: !24, size: 32, align: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !999, file: !1000, line: 46, baseType: !1004, size: 32, align: 32, offset: 32)
!1004 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !988, file: !897, line: 663, baseType: !942, size: 64, align: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !988, file: !897, line: 670, baseType: !948, size: 64, align: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !897, line: 679, baseType: !987, size: 64, align: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !988, file: !897, line: 684, baseType: !936, size: 32, align: 32, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !988, file: !897, line: 689, baseType: !936, size: 32, align: 32, offset: 544)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !988, file: !897, line: 696, baseType: !1011, size: 64, align: 64, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!936, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1017)
!1017 = !{!1018, !1019, !1022, !1023}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1016, file: !897, line: 449, baseType: !948, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1016, file: !897, line: 450, baseType: !1020, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1016, file: !897, line: 451, baseType: !936, size: 32, align: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1016, file: !897, line: 452, baseType: !948, size: 64, align: 64, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !988, file: !897, line: 703, baseType: !1025, size: 64, align: 64, offset: 640)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!936, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !988, file: !897, line: 714, baseType: !1030, size: 64, align: 64, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!936, !1028, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1036)
!1036 = !{!1037, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1065, !1066, !1067, !1068}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1035, file: !25, line: 1451, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1040, line: 94, baseType: !1041)
!1040 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1040, line: 81, size: 192, align: 64, elements: !1042)
!1042 = !{!1043, !1047, !1050}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1041, file: !1040, line: 82, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1040, line: 73, baseType: !1046)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1040, line: 73, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1041, file: !1040, line: 89, baseType: !1048, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !927, line: 48, baseType: !1021)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1041, file: !1040, line: 93, baseType: !936, size: 32, align: 32, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1035, file: !25, line: 1461, baseType: !926, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1035, file: !25, line: 1467, baseType: !926, size: 64, align: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1035, file: !25, line: 1468, baseType: !1048, size: 64, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1035, file: !25, line: 1469, baseType: !936, size: 32, align: 32, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1035, file: !25, line: 1470, baseType: !936, size: 32, align: 32, offset: 288)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1035, file: !25, line: 1474, baseType: !936, size: 32, align: 32, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1035, file: !25, line: 1479, baseType: !1058, size: 64, align: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1060, file: !25, line: 1412, baseType: !1048, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1060, file: !25, line: 1413, baseType: !936, size: 32, align: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1060, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1035, file: !25, line: 1480, baseType: !936, size: 32, align: 32, offset: 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1035, file: !25, line: 1486, baseType: !926, size: 64, align: 64, offset: 512)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1035, file: !25, line: 1488, baseType: !926, size: 64, align: 64, offset: 576)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1035, file: !25, line: 1497, baseType: !926, size: 64, align: 64, offset: 640)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !988, file: !897, line: 720, baseType: !1025, size: 64, align: 64, offset: 768)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !988, file: !897, line: 730, baseType: !1071, size: 64, align: 64, offset: 832)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!936, !1028, !936, !926, !936}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !988, file: !897, line: 737, baseType: !1075, size: 64, align: 64, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!926, !1028, !936, !1078, !926}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !988, file: !897, line: 744, baseType: !1025, size: 64, align: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !988, file: !897, line: 750, baseType: !1025, size: 64, align: 64, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !988, file: !897, line: 758, baseType: !1082, size: 64, align: 64, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!936, !1028, !936, !926, !926, !926, !936}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !988, file: !897, line: 764, baseType: !1086, size: 64, align: 64, offset: 1152)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!936, !1028, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !988, file: !897, line: 770, baseType: !1092, size: 64, align: 64, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!936, !1028, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !988, file: !897, line: 776, baseType: !1092, size: 64, align: 64, offset: 1280)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !939, file: !897, line: 1356, baseType: !1099, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1121, !1125, !1129, !1136, !1231, !1232, !1233, !1234, !1235, !1236, !1240}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1100, file: !897, line: 498, baseType: !948, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1100, file: !897, line: 504, baseType: !948, size: 64, align: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1100, file: !897, line: 505, baseType: !948, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1100, file: !897, line: 506, baseType: !948, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1100, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1100, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1100, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1100, file: !897, line: 517, baseType: !936, size: 32, align: 32, offset: 352)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1100, file: !897, line: 523, baseType: !995, size: 64, align: 64, offset: 384)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1100, file: !897, line: 526, baseType: !942, size: 64, align: 64, offset: 448)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1100, file: !897, line: 535, baseType: !1099, size: 64, align: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1100, file: !897, line: 539, baseType: !936, size: 32, align: 32, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1100, file: !897, line: 541, baseType: !1025, size: 64, align: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1100, file: !897, line: 549, baseType: !1030, size: 64, align: 64, offset: 704)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1100, file: !897, line: 550, baseType: !1025, size: 64, align: 64, offset: 768)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1100, file: !897, line: 554, baseType: !1118, size: 64, align: 64, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!936, !1028, !1033, !1033, !936}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1100, file: !897, line: 563, baseType: !1122, size: 64, align: 64, offset: 896)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!936, !24, !936}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1100, file: !897, line: 565, baseType: !1126, size: 64, align: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{null, !1028, !936, !1078, !1078}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1100, file: !897, line: 570, baseType: !1130, size: 64, align: 64, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!936, !1028, !936, !955, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1134, line: 216, baseType: !1135)
!1134 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1135 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1100, file: !897, line: 581, baseType: !1137, size: 64, align: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!936, !1028, !936, !1140, !1004}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1143)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1144)
!1144 = !{!1145, !1149, !1151, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1185, !1187, !1188, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !526, line: 282, baseType: !1146, size: 512, align: 64)
!1146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 512, align: 64, elements: !1147)
!1147 = !{!1148}
!1148 = !DISubrange(count: 8)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1143, file: !526, line: 299, baseType: !1150, size: 256, align: 32, offset: 512)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 256, align: 32, elements: !1147)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1143, file: !526, line: 315, baseType: !1152, size: 64, align: 64, offset: 768)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1143, file: !526, line: 326, baseType: !936, size: 32, align: 32, offset: 832)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1143, file: !526, line: 326, baseType: !936, size: 32, align: 32, offset: 864)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1143, file: !526, line: 334, baseType: !936, size: 32, align: 32, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1143, file: !526, line: 341, baseType: !936, size: 32, align: 32, offset: 928)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1143, file: !526, line: 346, baseType: !936, size: 32, align: 32, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1143, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1143, file: !526, line: 356, baseType: !1160, size: 64, align: 32, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1161, line: 61, baseType: !1162)
!1161 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1161, line: 58, size: 64, align: 32, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1162, file: !1161, line: 59, baseType: !936, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1162, file: !1161, line: 60, baseType: !936, size: 32, align: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1143, file: !526, line: 361, baseType: !926, size: 64, align: 64, offset: 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1143, file: !526, line: 369, baseType: !926, size: 64, align: 64, offset: 1152)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1143, file: !526, line: 377, baseType: !926, size: 64, align: 64, offset: 1216)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1143, file: !526, line: 382, baseType: !936, size: 32, align: 32, offset: 1280)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1143, file: !526, line: 386, baseType: !936, size: 32, align: 32, offset: 1312)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1143, file: !526, line: 391, baseType: !936, size: 32, align: 32, offset: 1344)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1143, file: !526, line: 396, baseType: !955, size: 64, align: 64, offset: 1408)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1143, file: !526, line: 403, baseType: !1174, size: 512, align: 64, offset: 1472)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 512, align: 64, elements: !1147)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !927, line: 55, baseType: !1135)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1143, file: !526, line: 410, baseType: !936, size: 32, align: 32, offset: 1984)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1143, file: !526, line: 415, baseType: !936, size: 32, align: 32, offset: 2016)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1143, file: !526, line: 420, baseType: !936, size: 32, align: 32, offset: 2048)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1143, file: !526, line: 425, baseType: !936, size: 32, align: 32, offset: 2080)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1143, file: !526, line: 435, baseType: !926, size: 64, align: 64, offset: 2112)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1143, file: !526, line: 440, baseType: !936, size: 32, align: 32, offset: 2176)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1143, file: !526, line: 445, baseType: !1175, size: 64, align: 64, offset: 2240)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1143, file: !526, line: 459, baseType: !1184, size: 512, align: 64, offset: 2304)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 512, align: 64, elements: !1147)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1143, file: !526, line: 473, baseType: !1186, size: 64, align: 64, offset: 2816)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1143, file: !526, line: 477, baseType: !936, size: 32, align: 32, offset: 2880)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1143, file: !526, line: 479, baseType: !1189, size: 64, align: 64, offset: 2944)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1202}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1192, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !526, line: 203, baseType: !1048, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1192, file: !526, line: 204, baseType: !936, size: 32, align: 32, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1192, file: !526, line: 205, baseType: !1198, size: 64, align: 64, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1200, line: 86, baseType: !1201)
!1200 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1200, line: 86, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1192, file: !526, line: 206, baseType: !1038, size: 64, align: 64, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1143, file: !526, line: 480, baseType: !936, size: 32, align: 32, offset: 3008)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1143, file: !526, line: 505, baseType: !936, size: 32, align: 32, offset: 3040)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1143, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1143, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1143, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1143, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1143, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1143, file: !526, line: 532, baseType: !926, size: 64, align: 64, offset: 3264)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1143, file: !526, line: 539, baseType: !926, size: 64, align: 64, offset: 3328)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1143, file: !526, line: 547, baseType: !926, size: 64, align: 64, offset: 3392)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1143, file: !526, line: 554, baseType: !1198, size: 64, align: 64, offset: 3456)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1143, file: !526, line: 563, baseType: !936, size: 32, align: 32, offset: 3520)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1143, file: !526, line: 572, baseType: !936, size: 32, align: 32, offset: 3552)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1143, file: !526, line: 581, baseType: !936, size: 32, align: 32, offset: 3584)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1143, file: !526, line: 588, baseType: !1218, size: 64, align: 64, offset: 3648)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !927, line: 36, baseType: !1220)
!1220 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1143, file: !526, line: 593, baseType: !936, size: 32, align: 32, offset: 3712)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1143, file: !526, line: 596, baseType: !936, size: 32, align: 32, offset: 3744)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1143, file: !526, line: 599, baseType: !1038, size: 64, align: 64, offset: 3776)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1143, file: !526, line: 605, baseType: !1038, size: 64, align: 64, offset: 3840)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1143, file: !526, line: 616, baseType: !1038, size: 64, align: 64, offset: 3904)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1143, file: !526, line: 626, baseType: !1133, size: 64, align: 64, offset: 3968)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1143, file: !526, line: 627, baseType: !1133, size: 64, align: 64, offset: 4032)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1143, file: !526, line: 628, baseType: !1133, size: 64, align: 64, offset: 4096)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1143, file: !526, line: 629, baseType: !1133, size: 64, align: 64, offset: 4160)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1143, file: !526, line: 645, baseType: !1038, size: 64, align: 64, offset: 4224)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1100, file: !897, line: 587, baseType: !1086, size: 64, align: 64, offset: 1152)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1100, file: !897, line: 592, baseType: !1092, size: 64, align: 64, offset: 1216)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1100, file: !897, line: 597, baseType: !1092, size: 64, align: 64, offset: 1280)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1100, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1100, file: !897, line: 608, baseType: !1025, size: 64, align: 64, offset: 1408)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1100, file: !897, line: 617, baseType: !1237, size: 64, align: 64, offset: 1472)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{null, !1028}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1100, file: !897, line: 623, baseType: !1241, size: 64, align: 64, offset: 1536)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!936, !1028, !1244}
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !939, file: !897, line: 1365, baseType: !955, size: 64, align: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !939, file: !897, line: 1379, baseType: !1248, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1257, !1258, !1262, !1263, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1279, !1280, !1284, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1302, !1303, !1304, !1305, !1309, !1310, !1311}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1250, file: !628, line: 174, baseType: !942, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1250, file: !628, line: 226, baseType: !1020, size: 64, align: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1250, file: !628, line: 227, baseType: !936, size: 32, align: 32, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1250, file: !628, line: 228, baseType: !1020, size: 64, align: 64, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1250, file: !628, line: 229, baseType: !1020, size: 64, align: 64, offset: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1250, file: !628, line: 233, baseType: !955, size: 64, align: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1250, file: !628, line: 235, baseType: !1259, size: 64, align: 64, offset: 384)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!936, !955, !1048, !936}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1250, file: !628, line: 236, baseType: !1259, size: 64, align: 64, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1250, file: !628, line: 237, baseType: !1264, size: 64, align: 64, offset: 512)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!926, !955, !926, !936}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1250, file: !628, line: 238, baseType: !926, size: 64, align: 64, offset: 576)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1250, file: !628, line: 239, baseType: !936, size: 32, align: 32, offset: 640)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1250, file: !628, line: 240, baseType: !936, size: 32, align: 32, offset: 672)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1250, file: !628, line: 241, baseType: !936, size: 32, align: 32, offset: 704)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1250, file: !628, line: 242, baseType: !1135, size: 64, align: 64, offset: 768)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1250, file: !628, line: 243, baseType: !1020, size: 64, align: 64, offset: 832)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1250, file: !628, line: 244, baseType: !1274, size: 64, align: 64, offset: 896)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!1135, !1135, !1277, !1004}
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1250, file: !628, line: 245, baseType: !936, size: 32, align: 32, offset: 960)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1250, file: !628, line: 249, baseType: !1281, size: 64, align: 64, offset: 1024)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!936, !955, !936}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1250, file: !628, line: 255, baseType: !1285, size: 64, align: 64, offset: 1088)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!926, !955, !936, !926, !936}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1250, file: !628, line: 260, baseType: !936, size: 32, align: 32, offset: 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1250, file: !628, line: 266, baseType: !926, size: 64, align: 64, offset: 1216)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1250, file: !628, line: 273, baseType: !936, size: 32, align: 32, offset: 1280)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1250, file: !628, line: 279, baseType: !926, size: 64, align: 64, offset: 1344)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1250, file: !628, line: 285, baseType: !936, size: 32, align: 32, offset: 1408)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1250, file: !628, line: 291, baseType: !936, size: 32, align: 32, offset: 1440)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1250, file: !628, line: 298, baseType: !936, size: 32, align: 32, offset: 1472)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1250, file: !628, line: 304, baseType: !936, size: 32, align: 32, offset: 1504)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1250, file: !628, line: 309, baseType: !948, size: 64, align: 64, offset: 1536)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1250, file: !628, line: 314, baseType: !948, size: 64, align: 64, offset: 1600)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1250, file: !628, line: 319, baseType: !1299, size: 64, align: 64, offset: 1664)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DISubroutineType(types: !1301)
!1301 = !{!936, !955, !1048, !936, !627, !926}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1250, file: !628, line: 326, baseType: !936, size: 32, align: 32, offset: 1728)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1250, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1250, file: !628, line: 332, baseType: !926, size: 64, align: 64, offset: 1792)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1250, file: !628, line: 338, baseType: !1306, size: 64, align: 64, offset: 1856)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!936, !955}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1250, file: !628, line: 340, baseType: !926, size: 64, align: 64, offset: 1920)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1250, file: !628, line: 346, baseType: !1020, size: 64, align: 64, offset: 1984)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1250, file: !628, line: 351, baseType: !936, size: 32, align: 32, offset: 2048)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !939, file: !897, line: 1386, baseType: !936, size: 32, align: 32, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !939, file: !897, line: 1393, baseType: !1004, size: 32, align: 32, offset: 352)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !939, file: !897, line: 1405, baseType: !1315, size: 64, align: 64, offset: 384)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1793, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1894, !1900, !1901, !1905, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1937, !1938, !1939, !1940, !1941, !1942}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1318, file: !897, line: 866, baseType: !936, size: 32, align: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1318, file: !897, line: 872, baseType: !936, size: 32, align: 32, offset: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1318, file: !897, line: 878, baseType: !1323, size: 64, align: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1330, !1468, !1469, !1470, !1471, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1497, !1501, !1502, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1681, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1325, file: !25, line: 1561, baseType: !942, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1325, file: !25, line: 1562, baseType: !936, size: 32, align: 32, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1325, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1325, file: !25, line: 1565, baseType: !1331, size: 64, align: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1334)
!1334 = !{!1335, !1336, !1337, !1338, !1339, !1340, !1343, !1346, !1349, !1352, !1355, !1356, !1357, !1365, !1366, !1367, !1369, !1373, !1379, !1384, !1388, !1389, !1433, !1440, !1444, !1445, !1449, !1453, !1457, !1461, !1462, !1463}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1333, file: !25, line: 3475, baseType: !948, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1333, file: !25, line: 3480, baseType: !948, size: 64, align: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1333, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1333, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1333, file: !25, line: 3487, baseType: !936, size: 32, align: 32, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1333, file: !25, line: 3488, baseType: !1341, size: 64, align: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1333, file: !25, line: 3489, baseType: !1344, size: 64, align: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1333, file: !25, line: 3490, baseType: !1347, size: 64, align: 64, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1333, file: !25, line: 3491, baseType: !1350, size: 64, align: 64, offset: 448)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1333, file: !25, line: 3492, baseType: !1353, size: 64, align: 64, offset: 512)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1175)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1333, file: !25, line: 3493, baseType: !1049, size: 8, align: 8, offset: 576)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1333, file: !25, line: 3494, baseType: !942, size: 64, align: 64, offset: 640)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1333, file: !25, line: 3495, baseType: !1358, size: 64, align: 64, offset: 704)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1361, file: !25, line: 3402, baseType: !936, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1361, file: !25, line: 3403, baseType: !948, size: 64, align: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1333, file: !25, line: 3507, baseType: !948, size: 64, align: 64, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1333, file: !25, line: 3516, baseType: !936, size: 32, align: 32, offset: 832)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1333, file: !25, line: 3517, baseType: !1368, size: 64, align: 64, offset: 896)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1333, file: !25, line: 3527, baseType: !1370, size: 64, align: 64, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!936, !1323}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1333, file: !25, line: 3535, baseType: !1374, size: 64, align: 64, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!936, !1323, !1377}
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1324)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1333, file: !25, line: 3541, baseType: !1380, size: 64, align: 64, offset: 1088)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1382)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1383)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1333, file: !25, line: 3549, baseType: !1385, size: 64, align: 64, offset: 1152)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{null, !1368}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1333, file: !25, line: 3551, baseType: !1370, size: 64, align: 64, offset: 1216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1333, file: !25, line: 3552, baseType: !1390, size: 64, align: 64, offset: 1280)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!936, !1323, !1048, !936, !1393}
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1396)
!1396 = !{!1397, !1400, !1402, !1403, !1404, !1432}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1395, file: !25, line: 3921, baseType: !1398, size: 16, align: 16)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !927, line: 49, baseType: !1399)
!1399 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1395, file: !25, line: 3922, baseType: !1401, size: 32, align: 32, offset: 32)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !927, line: 51, baseType: !1004)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1395, file: !25, line: 3923, baseType: !1401, size: 32, align: 32, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1395, file: !25, line: 3924, baseType: !1004, size: 32, align: 32, offset: 96)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1395, file: !25, line: 3925, baseType: !1405, size: 64, align: 64, offset: 128)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1409)
!1409 = !{!1410, !1411, !1412, !1413, !1414, !1415, !1421, !1425, !1427, !1428, !1430, !1431}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1408, file: !25, line: 3886, baseType: !936, size: 32, align: 32)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1408, file: !25, line: 3887, baseType: !936, size: 32, align: 32, offset: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1408, file: !25, line: 3888, baseType: !936, size: 32, align: 32, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1408, file: !25, line: 3889, baseType: !936, size: 32, align: 32, offset: 96)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1408, file: !25, line: 3890, baseType: !936, size: 32, align: 32, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1408, file: !25, line: 3897, baseType: !1416, size: 768, align: 64, offset: 192)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1417)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1418)
!1418 = !{!1419, !1420}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1417, file: !25, line: 3855, baseType: !1146, size: 512, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1417, file: !25, line: 3857, baseType: !1150, size: 256, align: 32, offset: 512)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1408, file: !25, line: 3903, baseType: !1422, size: 256, align: 64, offset: 960)
!1422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 256, align: 64, elements: !1423)
!1423 = !{!1424}
!1424 = !DISubrange(count: 4)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1408, file: !25, line: 3904, baseType: !1426, size: 128, align: 32, offset: 1216)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 128, align: 32, elements: !1423)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1408, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1408, file: !25, line: 3908, baseType: !1429, size: 64, align: 64, offset: 1408)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1408, file: !25, line: 3915, baseType: !1429, size: 64, align: 64, offset: 1472)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1408, file: !25, line: 3917, baseType: !936, size: 32, align: 32, offset: 1536)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1395, file: !25, line: 3926, baseType: !926, size: 64, align: 64, offset: 192)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1333, file: !25, line: 3564, baseType: !1434, size: 64, align: 64, offset: 1344)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!936, !1323, !1033, !1437, !1439}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1333, file: !25, line: 3566, baseType: !1441, size: 64, align: 64, offset: 1408)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DISubroutineType(types: !1443)
!1443 = !{!936, !1323, !955, !1439, !1033}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1333, file: !25, line: 3567, baseType: !1370, size: 64, align: 64, offset: 1472)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1333, file: !25, line: 3576, baseType: !1446, size: 64, align: 64, offset: 1536)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!936, !1323, !1437}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1333, file: !25, line: 3577, baseType: !1450, size: 64, align: 64, offset: 1600)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!936, !1323, !1033}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1333, file: !25, line: 3584, baseType: !1454, size: 64, align: 64, offset: 1664)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!936, !1323, !1141}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1333, file: !25, line: 3589, baseType: !1458, size: 64, align: 64, offset: 1728)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{null, !1323}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1333, file: !25, line: 3594, baseType: !936, size: 32, align: 32, offset: 1792)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1333, file: !25, line: 3600, baseType: !948, size: 64, align: 64, offset: 1856)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1333, file: !25, line: 3609, baseType: !1464, size: 64, align: 64, offset: 1920)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1467)
!1467 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1325, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1325, file: !25, line: 1581, baseType: !1004, size: 32, align: 32, offset: 224)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1325, file: !25, line: 1583, baseType: !955, size: 64, align: 64, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1325, file: !25, line: 1591, baseType: !1472, size: 64, align: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1325, file: !25, line: 1598, baseType: !955, size: 64, align: 64, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1325, file: !25, line: 1606, baseType: !926, size: 64, align: 64, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1325, file: !25, line: 1614, baseType: !936, size: 32, align: 32, offset: 512)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1325, file: !25, line: 1622, baseType: !936, size: 32, align: 32, offset: 544)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1325, file: !25, line: 1628, baseType: !936, size: 32, align: 32, offset: 576)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1325, file: !25, line: 1636, baseType: !936, size: 32, align: 32, offset: 608)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1325, file: !25, line: 1643, baseType: !936, size: 32, align: 32, offset: 640)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1325, file: !25, line: 1657, baseType: !1048, size: 64, align: 64, offset: 704)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1325, file: !25, line: 1658, baseType: !936, size: 32, align: 32, offset: 768)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1325, file: !25, line: 1679, baseType: !1160, size: 64, align: 32, offset: 800)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1325, file: !25, line: 1688, baseType: !936, size: 32, align: 32, offset: 864)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1325, file: !25, line: 1712, baseType: !936, size: 32, align: 32, offset: 896)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1325, file: !25, line: 1729, baseType: !936, size: 32, align: 32, offset: 928)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1325, file: !25, line: 1729, baseType: !936, size: 32, align: 32, offset: 960)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1325, file: !25, line: 1744, baseType: !936, size: 32, align: 32, offset: 992)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1325, file: !25, line: 1744, baseType: !936, size: 32, align: 32, offset: 1024)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1325, file: !25, line: 1751, baseType: !936, size: 32, align: 32, offset: 1056)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1325, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1325, file: !25, line: 1791, baseType: !1493, size: 64, align: 64, offset: 1152)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{null, !1496, !1437, !1439, !936, !936, !936}
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1325, file: !25, line: 1808, baseType: !1498, size: 64, align: 64, offset: 1216)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!645, !1496, !1344}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1325, file: !25, line: 1816, baseType: !936, size: 32, align: 32, offset: 1280)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1325, file: !25, line: 1825, baseType: !1503, size: 32, align: 32, offset: 1312)
!1503 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1325, file: !25, line: 1830, baseType: !936, size: 32, align: 32, offset: 1344)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1325, file: !25, line: 1838, baseType: !1503, size: 32, align: 32, offset: 1376)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1325, file: !25, line: 1846, baseType: !936, size: 32, align: 32, offset: 1408)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1325, file: !25, line: 1851, baseType: !936, size: 32, align: 32, offset: 1440)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1325, file: !25, line: 1861, baseType: !1503, size: 32, align: 32, offset: 1472)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1325, file: !25, line: 1868, baseType: !1503, size: 32, align: 32, offset: 1504)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1325, file: !25, line: 1875, baseType: !1503, size: 32, align: 32, offset: 1536)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1325, file: !25, line: 1882, baseType: !1503, size: 32, align: 32, offset: 1568)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1325, file: !25, line: 1889, baseType: !1503, size: 32, align: 32, offset: 1600)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1325, file: !25, line: 1896, baseType: !1503, size: 32, align: 32, offset: 1632)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1325, file: !25, line: 1903, baseType: !1503, size: 32, align: 32, offset: 1664)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1325, file: !25, line: 1910, baseType: !936, size: 32, align: 32, offset: 1696)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1325, file: !25, line: 1915, baseType: !936, size: 32, align: 32, offset: 1728)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1325, file: !25, line: 1926, baseType: !1439, size: 64, align: 64, offset: 1792)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1325, file: !25, line: 1935, baseType: !1160, size: 64, align: 32, offset: 1856)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1325, file: !25, line: 1942, baseType: !936, size: 32, align: 32, offset: 1920)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1325, file: !25, line: 1948, baseType: !936, size: 32, align: 32, offset: 1952)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1325, file: !25, line: 1954, baseType: !936, size: 32, align: 32, offset: 1984)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1325, file: !25, line: 1960, baseType: !936, size: 32, align: 32, offset: 2016)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1325, file: !25, line: 1984, baseType: !936, size: 32, align: 32, offset: 2048)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1325, file: !25, line: 1991, baseType: !936, size: 32, align: 32, offset: 2080)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1325, file: !25, line: 1996, baseType: !936, size: 32, align: 32, offset: 2112)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1325, file: !25, line: 2004, baseType: !936, size: 32, align: 32, offset: 2144)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1325, file: !25, line: 2011, baseType: !936, size: 32, align: 32, offset: 2176)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1325, file: !25, line: 2018, baseType: !936, size: 32, align: 32, offset: 2208)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1325, file: !25, line: 2027, baseType: !936, size: 32, align: 32, offset: 2240)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1325, file: !25, line: 2034, baseType: !936, size: 32, align: 32, offset: 2272)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1325, file: !25, line: 2044, baseType: !936, size: 32, align: 32, offset: 2304)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1325, file: !25, line: 2054, baseType: !1533, size: 64, align: 64, offset: 2368)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1325, file: !25, line: 2061, baseType: !1533, size: 64, align: 64, offset: 2432)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1325, file: !25, line: 2066, baseType: !936, size: 32, align: 32, offset: 2496)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1325, file: !25, line: 2070, baseType: !936, size: 32, align: 32, offset: 2528)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1325, file: !25, line: 2078, baseType: !936, size: 32, align: 32, offset: 2560)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1325, file: !25, line: 2085, baseType: !936, size: 32, align: 32, offset: 2592)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1325, file: !25, line: 2092, baseType: !936, size: 32, align: 32, offset: 2624)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1325, file: !25, line: 2099, baseType: !936, size: 32, align: 32, offset: 2656)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1325, file: !25, line: 2106, baseType: !936, size: 32, align: 32, offset: 2688)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1325, file: !25, line: 2113, baseType: !936, size: 32, align: 32, offset: 2720)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1325, file: !25, line: 2120, baseType: !936, size: 32, align: 32, offset: 2752)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1325, file: !25, line: 2125, baseType: !936, size: 32, align: 32, offset: 2784)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1325, file: !25, line: 2133, baseType: !936, size: 32, align: 32, offset: 2816)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1325, file: !25, line: 2140, baseType: !936, size: 32, align: 32, offset: 2848)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1325, file: !25, line: 2145, baseType: !936, size: 32, align: 32, offset: 2880)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1325, file: !25, line: 2153, baseType: !936, size: 32, align: 32, offset: 2912)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1325, file: !25, line: 2158, baseType: !936, size: 32, align: 32, offset: 2944)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1325, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1325, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1325, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1325, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1325, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1325, file: !25, line: 2203, baseType: !936, size: 32, align: 32, offset: 3136)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1325, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1325, file: !25, line: 2212, baseType: !936, size: 32, align: 32, offset: 3200)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1325, file: !25, line: 2213, baseType: !936, size: 32, align: 32, offset: 3232)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1325, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1325, file: !25, line: 2232, baseType: !936, size: 32, align: 32, offset: 3296)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1325, file: !25, line: 2243, baseType: !936, size: 32, align: 32, offset: 3328)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1325, file: !25, line: 2249, baseType: !936, size: 32, align: 32, offset: 3360)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1325, file: !25, line: 2256, baseType: !936, size: 32, align: 32, offset: 3392)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1325, file: !25, line: 2263, baseType: !1175, size: 64, align: 64, offset: 3456)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1325, file: !25, line: 2270, baseType: !1175, size: 64, align: 64, offset: 3520)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1325, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1325, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1325, file: !25, line: 2367, baseType: !1569, size: 64, align: 64, offset: 3648)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{!936, !1496, !1141, !936}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1325, file: !25, line: 2383, baseType: !936, size: 32, align: 32, offset: 3712)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1325, file: !25, line: 2386, baseType: !1503, size: 32, align: 32, offset: 3744)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1325, file: !25, line: 2387, baseType: !1503, size: 32, align: 32, offset: 3776)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1325, file: !25, line: 2394, baseType: !936, size: 32, align: 32, offset: 3808)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1325, file: !25, line: 2401, baseType: !936, size: 32, align: 32, offset: 3840)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1325, file: !25, line: 2408, baseType: !936, size: 32, align: 32, offset: 3872)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1325, file: !25, line: 2415, baseType: !936, size: 32, align: 32, offset: 3904)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1325, file: !25, line: 2422, baseType: !936, size: 32, align: 32, offset: 3936)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1325, file: !25, line: 2423, baseType: !1581, size: 64, align: 64, offset: 3968)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1584)
!1584 = !{!1585, !1586, !1587, !1588}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1583, file: !25, line: 827, baseType: !936, size: 32, align: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1583, file: !25, line: 828, baseType: !936, size: 32, align: 32, offset: 32)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1583, file: !25, line: 829, baseType: !936, size: 32, align: 32, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1583, file: !25, line: 830, baseType: !1503, size: 32, align: 32, offset: 96)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1325, file: !25, line: 2430, baseType: !926, size: 64, align: 64, offset: 4032)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1325, file: !25, line: 2437, baseType: !926, size: 64, align: 64, offset: 4096)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1325, file: !25, line: 2444, baseType: !1503, size: 32, align: 32, offset: 4160)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1325, file: !25, line: 2451, baseType: !1503, size: 32, align: 32, offset: 4192)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1325, file: !25, line: 2458, baseType: !936, size: 32, align: 32, offset: 4224)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1325, file: !25, line: 2469, baseType: !936, size: 32, align: 32, offset: 4256)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1325, file: !25, line: 2475, baseType: !936, size: 32, align: 32, offset: 4288)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1325, file: !25, line: 2481, baseType: !936, size: 32, align: 32, offset: 4320)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1325, file: !25, line: 2485, baseType: !936, size: 32, align: 32, offset: 4352)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1325, file: !25, line: 2489, baseType: !936, size: 32, align: 32, offset: 4384)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1325, file: !25, line: 2493, baseType: !936, size: 32, align: 32, offset: 4416)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1325, file: !25, line: 2501, baseType: !936, size: 32, align: 32, offset: 4448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1325, file: !25, line: 2506, baseType: !936, size: 32, align: 32, offset: 4480)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1325, file: !25, line: 2510, baseType: !936, size: 32, align: 32, offset: 4512)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1325, file: !25, line: 2514, baseType: !926, size: 64, align: 64, offset: 4544)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1325, file: !25, line: 2528, baseType: !1605, size: 64, align: 64, offset: 4608)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{null, !1496, !955, !936, !936}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1325, file: !25, line: 2534, baseType: !936, size: 32, align: 32, offset: 4672)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1325, file: !25, line: 2545, baseType: !936, size: 32, align: 32, offset: 4704)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1325, file: !25, line: 2547, baseType: !936, size: 32, align: 32, offset: 4736)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1325, file: !25, line: 2549, baseType: !936, size: 32, align: 32, offset: 4768)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1325, file: !25, line: 2551, baseType: !936, size: 32, align: 32, offset: 4800)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1325, file: !25, line: 2553, baseType: !936, size: 32, align: 32, offset: 4832)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1325, file: !25, line: 2555, baseType: !936, size: 32, align: 32, offset: 4864)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1325, file: !25, line: 2557, baseType: !936, size: 32, align: 32, offset: 4896)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1325, file: !25, line: 2559, baseType: !936, size: 32, align: 32, offset: 4928)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1325, file: !25, line: 2563, baseType: !936, size: 32, align: 32, offset: 4960)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1325, file: !25, line: 2571, baseType: !1429, size: 64, align: 64, offset: 4992)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1325, file: !25, line: 2579, baseType: !1429, size: 64, align: 64, offset: 5056)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1325, file: !25, line: 2586, baseType: !936, size: 32, align: 32, offset: 5120)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1325, file: !25, line: 2615, baseType: !936, size: 32, align: 32, offset: 5152)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1325, file: !25, line: 2627, baseType: !936, size: 32, align: 32, offset: 5184)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1325, file: !25, line: 2637, baseType: !936, size: 32, align: 32, offset: 5216)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1325, file: !25, line: 2681, baseType: !936, size: 32, align: 32, offset: 5248)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1325, file: !25, line: 2709, baseType: !926, size: 64, align: 64, offset: 5312)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1325, file: !25, line: 2716, baseType: !1627, size: 64, align: 64, offset: 5376)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1630)
!1630 = !{!1631, !1632, !1633, !1634, !1635, !1636, !1637, !1641, !1645, !1646, !1647, !1648, !1654, !1655, !1656, !1657, !1658}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1629, file: !25, line: 3642, baseType: !948, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1629, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1629, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1629, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1629, file: !25, line: 3669, baseType: !936, size: 32, align: 32, offset: 160)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1629, file: !25, line: 3682, baseType: !1454, size: 64, align: 64, offset: 192)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1629, file: !25, line: 3698, baseType: !1638, size: 64, align: 64, offset: 256)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DISubroutineType(types: !1640)
!1640 = !{!936, !1323, !1277, !1401}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1629, file: !25, line: 3712, baseType: !1642, size: 64, align: 64, offset: 320)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!936, !1323, !936, !1277, !1401}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1629, file: !25, line: 3726, baseType: !1638, size: 64, align: 64, offset: 384)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1629, file: !25, line: 3737, baseType: !1370, size: 64, align: 64, offset: 448)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1629, file: !25, line: 3746, baseType: !936, size: 32, align: 32, offset: 512)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1629, file: !25, line: 3757, baseType: !1649, size: 64, align: 64, offset: 576)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{null, !1652}
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1629, file: !25, line: 3766, baseType: !1370, size: 64, align: 64, offset: 640)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1629, file: !25, line: 3774, baseType: !1370, size: 64, align: 64, offset: 704)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1629, file: !25, line: 3780, baseType: !936, size: 32, align: 32, offset: 768)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1629, file: !25, line: 3785, baseType: !936, size: 32, align: 32, offset: 800)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1629, file: !25, line: 3795, baseType: !1659, size: 64, align: 64, offset: 832)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!936, !1323, !1038}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1325, file: !25, line: 2728, baseType: !955, size: 64, align: 64, offset: 5440)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1325, file: !25, line: 2735, baseType: !1174, size: 512, align: 64, offset: 5504)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1325, file: !25, line: 2742, baseType: !936, size: 32, align: 32, offset: 6016)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1325, file: !25, line: 2755, baseType: !936, size: 32, align: 32, offset: 6048)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1325, file: !25, line: 2776, baseType: !936, size: 32, align: 32, offset: 6080)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1325, file: !25, line: 2783, baseType: !936, size: 32, align: 32, offset: 6112)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1325, file: !25, line: 2791, baseType: !936, size: 32, align: 32, offset: 6144)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1325, file: !25, line: 2802, baseType: !1141, size: 64, align: 64, offset: 6208)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1325, file: !25, line: 2811, baseType: !936, size: 32, align: 32, offset: 6272)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1325, file: !25, line: 2821, baseType: !936, size: 32, align: 32, offset: 6304)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1325, file: !25, line: 2830, baseType: !936, size: 32, align: 32, offset: 6336)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1325, file: !25, line: 2840, baseType: !936, size: 32, align: 32, offset: 6368)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1325, file: !25, line: 2851, baseType: !1675, size: 64, align: 64, offset: 6400)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64, align: 64)
!1676 = !DISubroutineType(types: !1677)
!1677 = !{!936, !1496, !1678, !955, !1439, !936, !936}
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1679 = !DISubroutineType(types: !1680)
!1680 = !{!936, !1496, !955}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1325, file: !25, line: 2871, baseType: !1682, size: 64, align: 64, offset: 6464)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DISubroutineType(types: !1684)
!1684 = !{!936, !1496, !1685, !955, !1439, !936}
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!936, !1496, !955, !936, !936}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1325, file: !25, line: 2878, baseType: !936, size: 32, align: 32, offset: 6528)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1325, file: !25, line: 2885, baseType: !936, size: 32, align: 32, offset: 6560)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1325, file: !25, line: 3005, baseType: !936, size: 32, align: 32, offset: 6592)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1325, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1325, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1325, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1325, file: !25, line: 3037, baseType: !1048, size: 64, align: 64, offset: 6720)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1325, file: !25, line: 3038, baseType: !936, size: 32, align: 32, offset: 6784)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1325, file: !25, line: 3050, baseType: !1175, size: 64, align: 64, offset: 6848)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1325, file: !25, line: 3065, baseType: !936, size: 32, align: 32, offset: 6912)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1325, file: !25, line: 3083, baseType: !936, size: 32, align: 32, offset: 6944)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1325, file: !25, line: 3092, baseType: !1160, size: 64, align: 32, offset: 6976)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1325, file: !25, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1325, file: !25, line: 3106, baseType: !1160, size: 64, align: 32, offset: 7072)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1325, file: !25, line: 3113, baseType: !1703, size: 64, align: 64, offset: 7168)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1705)
!1705 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !25, line: 740, baseType: !1706)
!1706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !25, line: 712, size: 384, align: 64, elements: !1707)
!1707 = !{!1708, !1709, !1710, !1711, !1712, !1713, !1716}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1706, file: !25, line: 713, baseType: !24, size: 32, align: 32)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1706, file: !25, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1706, file: !25, line: 720, baseType: !948, size: 64, align: 64, offset: 64)
