; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg12dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg12dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecHWConfigInternal = type { %struct.AVCodecHWConfig, %struct.AVHWAccel* }
%struct.AVCodecHWConfig = type { i32, i32, i32 }
%struct.AVHWAccel = type { i8*, i32, i32, i32, i32, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, i32 (%struct.AVCodecContext*, i32, i8*, i32)*, i32 (%struct.AVCodecContext*, i8*, i32)*, {}*, i32, void (%struct.MpegEncContext*)*, {}*, {}*, i32, i32, i32 (%struct.AVCodecContext*, %struct.AVBufferRef*)* }

!958 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !959, line: 221, size: 32, align: 8, elements: !960)
!959 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !958, file: !959, line: 221, baseType: !962, size: 32, align: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !963, line: 51, baseType: !964)
!963 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!964 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !963, line: 48, baseType: !969)
!969 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!971 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !963, line: 40, baseType: !974)
!974 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "Mpeg1Context", file: !977, line: 72, baseType: !978)
!977 = !DIFile(filename: "libavcodec/mpeg12dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mpeg1Context", file: !977, line: 53, size: 87168, align: 64, elements: !979)
!979 = !{!980, !2643, !2644, !2645, !2655, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_enc_ctx", scope: !978, file: !977, line: 54, baseType: !981, size: 86208, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !982, line: 582, baseType: !983)
!982 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !982, line: 81, size: 86208, align: 64, elements: !984)
!984 = !{!985, !1066, !1067, !1068, !1069, !1073, !1074, !1084, !1085, !1086, !1087, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1807, !1808, !1863, !1865, !1866, !1867, !1868, !1869, !1880, !1881, !1882, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1898, !1900, !1902, !1903, !1904, !1905, !1906, !1907, !1912, !1914, !1915, !1916, !1917, !1918, !1919, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1946, !1947, !1948, !1949, !1965, !1972, !1984, !2000, !2022, !2062, !2075, !2102, !2117, !2131, !2144, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2165, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176, !2178, !2180, !2181, !2182, !2183, !2184, !2185, !2188, !2190, !2192, !2193, !2196, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2263, !2264, !2266, !2267, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2289, !2290, !2291, !2294, !2295, !2296, !2297, !2299, !2301, !2302, !2303, !2304, !2305, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2387, !2388, !2389, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2518, !2519, !2520, !2521, !2525, !2526, !2530, !2534, !2538, !2539, !2544, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2559, !2560, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2578, !2579, !2580, !2630, !2631, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !983, file: !982, line: 82, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !989)
!989 = !{!990, !994, !998, !1025, !1026, !1027, !1028, !1032, !1038, !1040, !1044}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !988, file: !713, line: 72, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !988, file: !713, line: 78, baseType: !995, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!991, !970}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !988, file: !713, line: 85, baseType: !999, size: 64, align: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1021, !1022, !1023, !1024}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1001, file: !691, line: 247, baseType: !991, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1001, file: !691, line: 253, baseType: !991, size: 64, align: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1001, file: !691, line: 259, baseType: !971, size: 32, align: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1001, file: !691, line: 271, baseType: !1008, size: 64, align: 64, offset: 192)
!1008 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1001, file: !691, line: 265, size: 64, align: 64, elements: !1009)
!1009 = !{!1010, !1011, !1013, !1014}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1008, file: !691, line: 266, baseType: !973, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1008, file: !691, line: 267, baseType: !1012, size: 64, align: 64)
!1012 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1008, file: !691, line: 268, baseType: !991, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1008, file: !691, line: 270, baseType: !1015, size: 64, align: 32)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1016, line: 61, baseType: !1017)
!1016 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1016, line: 58, size: 64, align: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !1016, line: 59, baseType: !971, size: 32, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1017, file: !1016, line: 60, baseType: !971, size: 32, align: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1001, file: !691, line: 272, baseType: !1012, size: 64, align: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1001, file: !691, line: 273, baseType: !1012, size: 64, align: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !691, line: 275, baseType: !971, size: 32, align: 32, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1001, file: !691, line: 300, baseType: !991, size: 64, align: 64, offset: 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !988, file: !713, line: 93, baseType: !971, size: 32, align: 32, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !988, file: !713, line: 99, baseType: !971, size: 32, align: 32, offset: 224)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !988, file: !713, line: 108, baseType: !971, size: 32, align: 32, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !988, file: !713, line: 113, baseType: !1029, size: 64, align: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!970, !970, !970}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !988, file: !713, line: 123, baseType: !1033, size: 64, align: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!1036, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !988, file: !713, line: 130, baseType: !1039, size: 32, align: 32, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !988, file: !713, line: 136, baseType: !1041, size: 64, align: 64, offset: 512)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!1039, !970}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !988, file: !713, line: 142, baseType: !1045, size: 64, align: 64, offset: 576)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!971, !1048, !970, !991, !971}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1051)
!1051 = !{!1052, !1064, !1065}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1050, file: !691, line: 360, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062, !1063}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1056, file: !691, line: 307, baseType: !991, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1056, file: !691, line: 313, baseType: !1012, size: 64, align: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1056, file: !691, line: 313, baseType: !1012, size: 64, align: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1056, file: !691, line: 318, baseType: !1012, size: 64, align: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1056, file: !691, line: 318, baseType: !1012, size: 64, align: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1056, file: !691, line: 323, baseType: !971, size: 32, align: 32, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1050, file: !691, line: 364, baseType: !971, size: 32, align: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1050, file: !691, line: 368, baseType: !971, size: 32, align: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !983, file: !982, line: 84, baseType: !971, size: 32, align: 32, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !983, file: !982, line: 84, baseType: !971, size: 32, align: 32, offset: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !983, file: !982, line: 85, baseType: !971, size: 32, align: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !983, file: !982, line: 86, baseType: !1070, size: 384, align: 32, offset: 160)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 384, align: 32, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 12)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !983, file: !982, line: 87, baseType: !971, size: 32, align: 32, offset: 544)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !983, file: !982, line: 90, baseType: !1075, size: 1088, align: 64, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1077)
!1077 = !{!1078, !1079, !1083}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1076, file: !902, line: 32, baseType: !966, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1076, file: !902, line: 33, baseType: !1080, size: 512, align: 8, offset: 64)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !968, size: 512, align: 8, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1076, file: !902, line: 34, baseType: !1080, size: 512, align: 8, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !983, file: !982, line: 91, baseType: !1075, size: 1088, align: 64, offset: 1664)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !983, file: !982, line: 92, baseType: !1075, size: 1088, align: 64, offset: 2752)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !983, file: !982, line: 93, baseType: !1075, size: 1088, align: 64, offset: 3840)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !983, file: !982, line: 98, baseType: !1088, size: 64, align: 64, offset: 4928)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1090)
!1090 = !{!1091, !1094, !1095, !1096, !1406, !1407, !1408, !1409, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1561, !1565, !1566, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1712, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1089, file: !14, line: 1561, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1089, file: !14, line: 1562, baseType: !971, size: 32, align: 32, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1089, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1089, file: !14, line: 1565, baseType: !1097, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1109, !1112, !1115, !1118, !1123, !1124, !1125, !1133, !1134, !1135, !1137, !1143, !1149, !1158, !1162, !1163, !1211, !1332, !1336, !1337, !1341, !1345, !1350, !1354, !1355, !1356}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1099, file: !14, line: 3475, baseType: !991, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1099, file: !14, line: 3480, baseType: !991, size: 64, align: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1099, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1099, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1099, file: !14, line: 3487, baseType: !971, size: 32, align: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1099, file: !14, line: 3488, baseType: !1107, size: 64, align: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1099, file: !14, line: 3489, baseType: !1110, size: 64, align: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1099, file: !14, line: 3490, baseType: !1113, size: 64, align: 64, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1099, file: !14, line: 3491, baseType: !1116, size: 64, align: 64, offset: 448)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1099, file: !14, line: 3492, baseType: !1119, size: 64, align: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !963, line: 55, baseType: !1122)
!1122 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1099, file: !14, line: 3493, baseType: !968, size: 8, align: 8, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1099, file: !14, line: 3494, baseType: !1092, size: 64, align: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1099, file: !14, line: 3495, baseType: !1126, size: 64, align: 64, offset: 704)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1129, file: !14, line: 3402, baseType: !971, size: 32, align: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1129, file: !14, line: 3403, baseType: !991, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1099, file: !14, line: 3507, baseType: !991, size: 64, align: 64, offset: 768)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1099, file: !14, line: 3516, baseType: !971, size: 32, align: 32, offset: 832)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1099, file: !14, line: 3517, baseType: !1136, size: 64, align: 64, offset: 896)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1099, file: !14, line: 3527, baseType: !1138, size: 64, align: 64, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!971, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1089)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1099, file: !14, line: 3535, baseType: !1144, size: 64, align: 64, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!971, !1141, !1147}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1099, file: !14, line: 3541, baseType: !1150, size: 64, align: 64, offset: 1088)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1154, line: 223, size: 128, align: 64, elements: !1155)
!1154 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1153, file: !1154, line: 224, baseType: !966, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1153, file: !1154, line: 225, baseType: !966, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1099, file: !14, line: 3549, baseType: !1159, size: 64, align: 64, offset: 1152)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1136}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1099, file: !14, line: 3551, baseType: !1138, size: 64, align: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1099, file: !14, line: 3552, baseType: !1164, size: 64, align: 64, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!971, !1141, !1167, !971, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1171)
!1171 = !{!1172, !1175, !1176, !1177, !1178, !1210}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1170, file: !14, line: 3921, baseType: !1173, size: 16, align: 16)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !963, line: 49, baseType: !1174)
!1174 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1170, file: !14, line: 3922, baseType: !962, size: 32, align: 32, offset: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1170, file: !14, line: 3923, baseType: !962, size: 32, align: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1170, file: !14, line: 3924, baseType: !964, size: 32, align: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1170, file: !14, line: 3925, baseType: !1179, size: 64, align: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1189, !1199, !1203, !1205, !1206, !1208, !1209}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1182, file: !14, line: 3886, baseType: !971, size: 32, align: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1182, file: !14, line: 3887, baseType: !971, size: 32, align: 32, offset: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1182, file: !14, line: 3888, baseType: !971, size: 32, align: 32, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1182, file: !14, line: 3889, baseType: !971, size: 32, align: 32, offset: 96)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1182, file: !14, line: 3890, baseType: !971, size: 32, align: 32, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1182, file: !14, line: 3897, baseType: !1190, size: 768, align: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1192)
!1192 = !{!1193, !1197}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !14, line: 3855, baseType: !1194, size: 512, align: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 512, align: 64, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 8)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1191, file: !14, line: 3857, baseType: !1198, size: 256, align: 32, offset: 512)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, align: 32, elements: !1195)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !14, line: 3903, baseType: !1200, size: 256, align: 64, offset: 960)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 256, align: 64, elements: !1201)
!1201 = !{!1202}
!1202 = !DISubrange(count: 4)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1182, file: !14, line: 3904, baseType: !1204, size: 128, align: 32, offset: 1216)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 128, align: 32, elements: !1201)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1182, file: !14, line: 3906, baseType: !919, size: 32, align: 32, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1182, file: !14, line: 3908, baseType: !1207, size: 64, align: 64, offset: 1408)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1182, file: !14, line: 3915, baseType: !1207, size: 64, align: 64, offset: 1472)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1182, file: !14, line: 3917, baseType: !971, size: 32, align: 32, offset: 1536)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1170, file: !14, line: 3926, baseType: !973, size: 64, align: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1099, file: !14, line: 3564, baseType: !1212, size: 64, align: 64, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!971, !1141, !1215, !1249, !1331}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1218)
!1218 = !{!1219, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1245, !1246, !1247, !1248}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !14, line: 1451, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1222, line: 94, baseType: !1223)
!1222 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1222, line: 81, size: 192, align: 64, elements: !1224)
!1224 = !{!1225, !1229, !1230}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1223, file: !1222, line: 82, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1222, line: 73, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1222, line: 73, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !1222, line: 89, baseType: !1167, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !1222, line: 93, baseType: !971, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1217, file: !14, line: 1461, baseType: !973, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1217, file: !14, line: 1467, baseType: !973, size: 64, align: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !14, line: 1468, baseType: !1167, size: 64, align: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !14, line: 1469, baseType: !971, size: 32, align: 32, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1217, file: !14, line: 1470, baseType: !971, size: 32, align: 32, offset: 288)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1217, file: !14, line: 1474, baseType: !971, size: 32, align: 32, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1217, file: !14, line: 1479, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !14, line: 1412, baseType: !1167, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !14, line: 1413, baseType: !971, size: 32, align: 32, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1240, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1217, file: !14, line: 1480, baseType: !971, size: 32, align: 32, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1217, file: !14, line: 1486, baseType: !973, size: 64, align: 64, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1217, file: !14, line: 1488, baseType: !973, size: 64, align: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1217, file: !14, line: 1497, baseType: !973, size: 64, align: 64, offset: 640)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1283, !1285, !1286, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1319, !1320, !1321, !1322, !1323, !1324, !1327, !1328, !1329, !1330}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !744, line: 282, baseType: !1194, size: 512, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1252, file: !744, line: 299, baseType: !1198, size: 256, align: 32, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1252, file: !744, line: 315, baseType: !1257, size: 64, align: 64, offset: 768)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1252, file: !744, line: 326, baseType: !971, size: 32, align: 32, offset: 832)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1252, file: !744, line: 326, baseType: !971, size: 32, align: 32, offset: 864)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1252, file: !744, line: 334, baseType: !971, size: 32, align: 32, offset: 896)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1252, file: !744, line: 341, baseType: !971, size: 32, align: 32, offset: 928)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1252, file: !744, line: 346, baseType: !971, size: 32, align: 32, offset: 960)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1252, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1252, file: !744, line: 356, baseType: !1015, size: 64, align: 32, offset: 1024)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1252, file: !744, line: 361, baseType: !973, size: 64, align: 64, offset: 1088)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1252, file: !744, line: 369, baseType: !973, size: 64, align: 64, offset: 1152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1252, file: !744, line: 377, baseType: !973, size: 64, align: 64, offset: 1216)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1252, file: !744, line: 382, baseType: !971, size: 32, align: 32, offset: 1280)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1252, file: !744, line: 386, baseType: !971, size: 32, align: 32, offset: 1312)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1252, file: !744, line: 391, baseType: !971, size: 32, align: 32, offset: 1344)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1252, file: !744, line: 396, baseType: !970, size: 64, align: 64, offset: 1408)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1252, file: !744, line: 403, baseType: !1273, size: 512, align: 64, offset: 1472)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 512, align: 64, elements: !1195)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1252, file: !744, line: 410, baseType: !971, size: 32, align: 32, offset: 1984)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1252, file: !744, line: 415, baseType: !971, size: 32, align: 32, offset: 2016)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1252, file: !744, line: 420, baseType: !971, size: 32, align: 32, offset: 2048)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1252, file: !744, line: 425, baseType: !971, size: 32, align: 32, offset: 2080)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1252, file: !744, line: 435, baseType: !973, size: 64, align: 64, offset: 2112)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1252, file: !744, line: 440, baseType: !971, size: 32, align: 32, offset: 2176)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1252, file: !744, line: 445, baseType: !1121, size: 64, align: 64, offset: 2240)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1252, file: !744, line: 459, baseType: !1282, size: 512, align: 64, offset: 2304)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 512, align: 64, elements: !1195)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1252, file: !744, line: 473, baseType: !1284, size: 64, align: 64, offset: 2816)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1252, file: !744, line: 477, baseType: !971, size: 32, align: 32, offset: 2880)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1252, file: !744, line: 479, baseType: !1287, size: 64, align: 64, offset: 2944)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295, !1300}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1290, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1290, file: !744, line: 203, baseType: !1167, size: 64, align: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1290, file: !744, line: 204, baseType: !971, size: 32, align: 32, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1290, file: !744, line: 205, baseType: !1296, size: 64, align: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1298, line: 86, baseType: !1299)
!1298 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1298, line: 86, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1290, file: !744, line: 206, baseType: !1220, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1252, file: !744, line: 480, baseType: !971, size: 32, align: 32, offset: 3008)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1252, file: !744, line: 505, baseType: !971, size: 32, align: 32, offset: 3040)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1252, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1252, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1252, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1252, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1252, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1252, file: !744, line: 532, baseType: !973, size: 64, align: 64, offset: 3264)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1252, file: !744, line: 539, baseType: !973, size: 64, align: 64, offset: 3328)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1252, file: !744, line: 547, baseType: !973, size: 64, align: 64, offset: 3392)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1252, file: !744, line: 554, baseType: !1296, size: 64, align: 64, offset: 3456)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1252, file: !744, line: 563, baseType: !971, size: 32, align: 32, offset: 3520)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1252, file: !744, line: 572, baseType: !971, size: 32, align: 32, offset: 3552)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1252, file: !744, line: 581, baseType: !971, size: 32, align: 32, offset: 3584)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1252, file: !744, line: 588, baseType: !1316, size: 64, align: 64, offset: 3648)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !963, line: 36, baseType: !1318)
!1318 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1252, file: !744, line: 593, baseType: !971, size: 32, align: 32, offset: 3712)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1252, file: !744, line: 596, baseType: !971, size: 32, align: 32, offset: 3744)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1252, file: !744, line: 599, baseType: !1220, size: 64, align: 64, offset: 3776)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1252, file: !744, line: 605, baseType: !1220, size: 64, align: 64, offset: 3840)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1252, file: !744, line: 616, baseType: !1220, size: 64, align: 64, offset: 3904)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1252, file: !744, line: 626, baseType: !1325, size: 64, align: 64, offset: 3968)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1326, line: 216, baseType: !1122)
!1326 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1252, file: !744, line: 627, baseType: !1325, size: 64, align: 64, offset: 4032)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1252, file: !744, line: 628, baseType: !1325, size: 64, align: 64, offset: 4096)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1252, file: !744, line: 629, baseType: !1325, size: 64, align: 64, offset: 4160)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1252, file: !744, line: 645, baseType: !1220, size: 64, align: 64, offset: 4224)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1099, file: !14, line: 3566, baseType: !1333, size: 64, align: 64, offset: 1408)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!971, !1141, !970, !1331, !1215}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1099, file: !14, line: 3567, baseType: !1138, size: 64, align: 64, offset: 1472)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1099, file: !14, line: 3576, baseType: !1338, size: 64, align: 64, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!971, !1141, !1249}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1099, file: !14, line: 3577, baseType: !1342, size: 64, align: 64, offset: 1600)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!971, !1141, !1215}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1099, file: !14, line: 3584, baseType: !1346, size: 64, align: 64, offset: 1664)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!971, !1141, !1349}
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1099, file: !14, line: 3589, baseType: !1351, size: 64, align: 64, offset: 1728)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1141}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1099, file: !14, line: 3594, baseType: !971, size: 32, align: 32, offset: 1792)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1099, file: !14, line: 3600, baseType: !991, size: 64, align: 64, offset: 1856)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1099, file: !14, line: 3609, baseType: !1357, size: 64, align: 64, offset: 1920)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !1361, line: 29, size: 192, align: 64, elements: !1362)
!1361 = !DIFile(filename: "libavcodec/hwaccel.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1362 = !{!1363, !1370}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "public", scope: !1360, file: !1361, line: 34, baseType: !1364, size: 96, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecHWConfig", file: !14, line: 3459, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfig", file: !14, line: 3442, size: 96, align: 32, elements: !1366)
!1366 = !{!1367, !1368, !1369}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1365, file: !14, line: 3446, baseType: !473, size: 32, align: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "methods", scope: !1365, file: !14, line: 3451, baseType: !971, size: 32, align: 32, offset: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "device_type", scope: !1365, file: !14, line: 3458, baseType: !925, size: 32, align: 32, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1360, file: !1361, line: 39, baseType: !1371, size: 64, align: 64, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1373)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWAccel", file: !14, line: 3796, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379, !1380, !1381, !1382, !1386, !1390, !1391, !1392, !1393, !1398, !1399, !1400, !1401, !1402}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1374, file: !14, line: 3642, baseType: !991, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1374, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1374, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1374, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1374, file: !14, line: 3669, baseType: !971, size: 32, align: 32, offset: 160)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1374, file: !14, line: 3682, baseType: !1346, size: 64, align: 64, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1374, file: !14, line: 3698, baseType: !1383, size: 64, align: 64, offset: 256)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{!971, !1141, !966, !962}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1374, file: !14, line: 3712, baseType: !1387, size: 64, align: 64, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DISubroutineType(types: !1389)
!1389 = !{!971, !1141, !971, !966, !962}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1374, file: !14, line: 3726, baseType: !1383, size: 64, align: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1374, file: !14, line: 3737, baseType: !1138, size: 64, align: 64, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1374, file: !14, line: 3746, baseType: !971, size: 32, align: 32, offset: 512)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1374, file: !14, line: 3757, baseType: !1394, size: 64, align: 64, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{null, !1397}
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1374, file: !14, line: 3766, baseType: !1138, size: 64, align: 64, offset: 640)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1374, file: !14, line: 3774, baseType: !1138, size: 64, align: 64, offset: 704)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1374, file: !14, line: 3780, baseType: !971, size: 32, align: 32, offset: 768)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1374, file: !14, line: 3785, baseType: !971, size: 32, align: 32, offset: 800)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1374, file: !14, line: 3795, baseType: !1403, size: 64, align: 64, offset: 832)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!971, !1141, !1220}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1089, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1089, file: !14, line: 1581, baseType: !964, size: 32, align: 32, offset: 224)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1089, file: !14, line: 1583, baseType: !970, size: 64, align: 64, offset: 256)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1089, file: !14, line: 1591, baseType: !1410, size: 64, align: 64, offset: 320)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1154, line: 129, size: 1664, align: 64, elements: !1412)
!1412 = !{!1413, !1414, !1415, !1416, !1417, !1435, !1436, !1442, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1411, file: !1154, line: 136, baseType: !971, size: 32, align: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1411, file: !1154, line: 151, baseType: !971, size: 32, align: 32, offset: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1411, file: !1154, line: 157, baseType: !971, size: 32, align: 32, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1411, file: !1154, line: 159, baseType: !1349, size: 64, align: 64, offset: 128)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1411, file: !1154, line: 161, baseType: !1418, size: 64, align: 64, offset: 192)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1154, line: 117, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1154, line: 100, size: 832, align: 64, elements: !1421)
!1421 = !{!1422, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1420, file: !1154, line: 105, baseType: !1423, size: 256, align: 64)
!1423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1424, size: 256, align: 64, elements: !1201)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1222, line: 238, baseType: !1426)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1222, line: 238, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1420, file: !1154, line: 110, baseType: !971, size: 32, align: 32, offset: 256)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1420, file: !1154, line: 111, baseType: !971, size: 32, align: 32, offset: 288)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1420, file: !1154, line: 111, baseType: !971, size: 32, align: 32, offset: 320)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1420, file: !1154, line: 112, baseType: !1198, size: 256, align: 32, offset: 352)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1420, file: !1154, line: 113, baseType: !1204, size: 128, align: 32, offset: 608)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1420, file: !1154, line: 114, baseType: !971, size: 32, align: 32, offset: 736)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1420, file: !1154, line: 115, baseType: !971, size: 32, align: 32, offset: 768)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1420, file: !1154, line: 116, baseType: !971, size: 32, align: 32, offset: 800)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1411, file: !1154, line: 163, baseType: !970, size: 64, align: 64, offset: 256)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1411, file: !1154, line: 165, baseType: !1437, size: 128, align: 64, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1154, line: 122, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1154, line: 119, size: 128, align: 64, elements: !1439)
!1439 = !{!1440, !1441}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1438, file: !1154, line: 120, baseType: !1215, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1438, file: !1154, line: 121, baseType: !1349, size: 64, align: 64, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1411, file: !1154, line: 166, baseType: !1443, size: 128, align: 64, offset: 448)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1154, line: 127, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1154, line: 124, size: 128, align: 64, elements: !1445)
!1445 = !{!1446, !1519}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1444, file: !1154, line: 125, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1451)
!1451 = !{!1452, !1453, !1477, !1481, !1482, !1516, !1517, !1518}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1450, file: !14, line: 5751, baseType: !1092, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1450, file: !14, line: 5756, baseType: !1454, size: 64, align: 64, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1456)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1457)
!1457 = !{!1458, !1459, !1462, !1463, !1464, !1468, !1472, !1476}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1456, file: !14, line: 5797, baseType: !991, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1456, file: !14, line: 5804, baseType: !1460, size: 64, align: 64, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1456, file: !14, line: 5815, baseType: !1092, size: 64, align: 64, offset: 128)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1456, file: !14, line: 5825, baseType: !971, size: 32, align: 32, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1456, file: !14, line: 5826, baseType: !1465, size: 64, align: 64, offset: 256)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!971, !1448}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1456, file: !14, line: 5827, baseType: !1469, size: 64, align: 64, offset: 320)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!971, !1448, !1215}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1456, file: !14, line: 5828, baseType: !1473, size: 64, align: 64, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{null, !1448}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1456, file: !14, line: 5829, baseType: !1473, size: 64, align: 64, offset: 448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1450, file: !14, line: 5762, baseType: !1478, size: 64, align: 64, offset: 128)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1480)
!1480 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1450, file: !14, line: 5768, baseType: !970, size: 64, align: 64, offset: 192)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1450, file: !14, line: 5775, baseType: !1483, size: 64, align: 64, offset: 256)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1486)
!1486 = !{!1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1485, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1485, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1485, file: !14, line: 3948, baseType: !962, size: 32, align: 32, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1485, file: !14, line: 3958, baseType: !1167, size: 64, align: 64, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1485, file: !14, line: 3962, baseType: !971, size: 32, align: 32, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1485, file: !14, line: 3968, baseType: !971, size: 32, align: 32, offset: 224)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1485, file: !14, line: 3973, baseType: !973, size: 64, align: 64, offset: 256)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1485, file: !14, line: 3986, baseType: !971, size: 32, align: 32, offset: 320)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1485, file: !14, line: 3999, baseType: !971, size: 32, align: 32, offset: 352)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1485, file: !14, line: 4004, baseType: !971, size: 32, align: 32, offset: 384)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1485, file: !14, line: 4005, baseType: !971, size: 32, align: 32, offset: 416)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1485, file: !14, line: 4010, baseType: !971, size: 32, align: 32, offset: 448)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1485, file: !14, line: 4011, baseType: !971, size: 32, align: 32, offset: 480)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1485, file: !14, line: 4020, baseType: !1015, size: 64, align: 32, offset: 512)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1485, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1485, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1485, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1485, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1485, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1485, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1485, file: !14, line: 4039, baseType: !971, size: 32, align: 32, offset: 768)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1485, file: !14, line: 4046, baseType: !1121, size: 64, align: 64, offset: 832)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1485, file: !14, line: 4050, baseType: !971, size: 32, align: 32, offset: 896)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1485, file: !14, line: 4054, baseType: !971, size: 32, align: 32, offset: 928)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1485, file: !14, line: 4061, baseType: !971, size: 32, align: 32, offset: 960)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1485, file: !14, line: 4065, baseType: !971, size: 32, align: 32, offset: 992)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1485, file: !14, line: 4073, baseType: !971, size: 32, align: 32, offset: 1024)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1485, file: !14, line: 4080, baseType: !971, size: 32, align: 32, offset: 1056)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1485, file: !14, line: 4084, baseType: !971, size: 32, align: 32, offset: 1088)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1450, file: !14, line: 5781, baseType: !1483, size: 64, align: 64, offset: 320)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1450, file: !14, line: 5787, baseType: !1015, size: 64, align: 32, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1450, file: !14, line: 5793, baseType: !1015, size: 64, align: 32, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1444, file: !1154, line: 126, baseType: !971, size: 32, align: 32, offset: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1411, file: !1154, line: 172, baseType: !1215, size: 64, align: 64, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1411, file: !1154, line: 177, baseType: !1167, size: 64, align: 64, offset: 640)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1411, file: !1154, line: 178, baseType: !964, size: 32, align: 32, offset: 704)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1411, file: !1154, line: 180, baseType: !970, size: 64, align: 64, offset: 768)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1411, file: !1154, line: 185, baseType: !971, size: 32, align: 32, offset: 832)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1411, file: !1154, line: 190, baseType: !970, size: 64, align: 64, offset: 896)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1411, file: !1154, line: 195, baseType: !971, size: 32, align: 32, offset: 960)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1411, file: !1154, line: 200, baseType: !1215, size: 64, align: 64, offset: 1024)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1411, file: !1154, line: 201, baseType: !971, size: 32, align: 32, offset: 1088)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1411, file: !1154, line: 202, baseType: !1349, size: 64, align: 64, offset: 1152)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1411, file: !1154, line: 203, baseType: !971, size: 32, align: 32, offset: 1216)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1411, file: !1154, line: 205, baseType: !971, size: 32, align: 32, offset: 1248)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1411, file: !1154, line: 206, baseType: !971, size: 32, align: 32, offset: 1280)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1411, file: !1154, line: 209, baseType: !1325, size: 64, align: 64, offset: 1344)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1411, file: !1154, line: 212, baseType: !1325, size: 64, align: 64, offset: 1408)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1411, file: !1154, line: 213, baseType: !1349, size: 64, align: 64, offset: 1472)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1411, file: !1154, line: 215, baseType: !971, size: 32, align: 32, offset: 1536)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1411, file: !1154, line: 217, baseType: !971, size: 32, align: 32, offset: 1568)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1411, file: !1154, line: 220, baseType: !971, size: 32, align: 32, offset: 1600)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1089, file: !14, line: 1598, baseType: !970, size: 64, align: 64, offset: 384)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1089, file: !14, line: 1606, baseType: !973, size: 64, align: 64, offset: 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1089, file: !14, line: 1614, baseType: !971, size: 32, align: 32, offset: 512)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1089, file: !14, line: 1622, baseType: !971, size: 32, align: 32, offset: 544)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1089, file: !14, line: 1628, baseType: !971, size: 32, align: 32, offset: 576)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !14, line: 1636, baseType: !971, size: 32, align: 32, offset: 608)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1089, file: !14, line: 1643, baseType: !971, size: 32, align: 32, offset: 640)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1089, file: !14, line: 1657, baseType: !1167, size: 64, align: 64, offset: 704)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1089, file: !14, line: 1658, baseType: !971, size: 32, align: 32, offset: 768)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1089, file: !14, line: 1679, baseType: !1015, size: 64, align: 32, offset: 800)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1089, file: !14, line: 1688, baseType: !971, size: 32, align: 32, offset: 864)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1089, file: !14, line: 1712, baseType: !971, size: 32, align: 32, offset: 896)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1089, file: !14, line: 1729, baseType: !971, size: 32, align: 32, offset: 928)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1089, file: !14, line: 1729, baseType: !971, size: 32, align: 32, offset: 960)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1089, file: !14, line: 1744, baseType: !971, size: 32, align: 32, offset: 992)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1089, file: !14, line: 1744, baseType: !971, size: 32, align: 32, offset: 1024)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1089, file: !14, line: 1751, baseType: !971, size: 32, align: 32, offset: 1056)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1089, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1089, file: !14, line: 1791, baseType: !1558, size: 64, align: 64, offset: 1152)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{null, !1088, !1249, !1331, !971, !971, !971}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1089, file: !14, line: 1808, baseType: !1562, size: 64, align: 64, offset: 1216)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!473, !1088, !1110}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1089, file: !14, line: 1816, baseType: !971, size: 32, align: 32, offset: 1280)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1089, file: !14, line: 1825, baseType: !1567, size: 32, align: 32, offset: 1312)
!1567 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1089, file: !14, line: 1830, baseType: !971, size: 32, align: 32, offset: 1344)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1089, file: !14, line: 1838, baseType: !1567, size: 32, align: 32, offset: 1376)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1089, file: !14, line: 1846, baseType: !971, size: 32, align: 32, offset: 1408)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1089, file: !14, line: 1851, baseType: !971, size: 32, align: 32, offset: 1440)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1089, file: !14, line: 1861, baseType: !1567, size: 32, align: 32, offset: 1472)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1089, file: !14, line: 1868, baseType: !1567, size: 32, align: 32, offset: 1504)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1089, file: !14, line: 1875, baseType: !1567, size: 32, align: 32, offset: 1536)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1089, file: !14, line: 1882, baseType: !1567, size: 32, align: 32, offset: 1568)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1089, file: !14, line: 1889, baseType: !1567, size: 32, align: 32, offset: 1600)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1089, file: !14, line: 1896, baseType: !1567, size: 32, align: 32, offset: 1632)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1089, file: !14, line: 1903, baseType: !1567, size: 32, align: 32, offset: 1664)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1089, file: !14, line: 1910, baseType: !971, size: 32, align: 32, offset: 1696)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1089, file: !14, line: 1915, baseType: !971, size: 32, align: 32, offset: 1728)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1089, file: !14, line: 1926, baseType: !1331, size: 64, align: 64, offset: 1792)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1089, file: !14, line: 1935, baseType: !1015, size: 64, align: 32, offset: 1856)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1089, file: !14, line: 1942, baseType: !971, size: 32, align: 32, offset: 1920)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1089, file: !14, line: 1948, baseType: !971, size: 32, align: 32, offset: 1952)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1089, file: !14, line: 1954, baseType: !971, size: 32, align: 32, offset: 1984)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1089, file: !14, line: 1960, baseType: !971, size: 32, align: 32, offset: 2016)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1089, file: !14, line: 1984, baseType: !971, size: 32, align: 32, offset: 2048)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1089, file: !14, line: 1991, baseType: !971, size: 32, align: 32, offset: 2080)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1089, file: !14, line: 1996, baseType: !971, size: 32, align: 32, offset: 2112)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1089, file: !14, line: 2004, baseType: !971, size: 32, align: 32, offset: 2144)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1089, file: !14, line: 2011, baseType: !971, size: 32, align: 32, offset: 2176)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1089, file: !14, line: 2018, baseType: !971, size: 32, align: 32, offset: 2208)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1089, file: !14, line: 2027, baseType: !971, size: 32, align: 32, offset: 2240)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1089, file: !14, line: 2034, baseType: !971, size: 32, align: 32, offset: 2272)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1089, file: !14, line: 2044, baseType: !971, size: 32, align: 32, offset: 2304)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1089, file: !14, line: 2054, baseType: !1597, size: 64, align: 64, offset: 2368)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1089, file: !14, line: 2061, baseType: !1597, size: 64, align: 64, offset: 2432)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1089, file: !14, line: 2066, baseType: !971, size: 32, align: 32, offset: 2496)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1089, file: !14, line: 2070, baseType: !971, size: 32, align: 32, offset: 2528)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1089, file: !14, line: 2078, baseType: !971, size: 32, align: 32, offset: 2560)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1089, file: !14, line: 2085, baseType: !971, size: 32, align: 32, offset: 2592)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1089, file: !14, line: 2092, baseType: !971, size: 32, align: 32, offset: 2624)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1089, file: !14, line: 2099, baseType: !971, size: 32, align: 32, offset: 2656)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1089, file: !14, line: 2106, baseType: !971, size: 32, align: 32, offset: 2688)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1089, file: !14, line: 2113, baseType: !971, size: 32, align: 32, offset: 2720)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1089, file: !14, line: 2120, baseType: !971, size: 32, align: 32, offset: 2752)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1089, file: !14, line: 2125, baseType: !971, size: 32, align: 32, offset: 2784)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1089, file: !14, line: 2133, baseType: !971, size: 32, align: 32, offset: 2816)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1089, file: !14, line: 2140, baseType: !971, size: 32, align: 32, offset: 2848)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1089, file: !14, line: 2145, baseType: !971, size: 32, align: 32, offset: 2880)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1089, file: !14, line: 2153, baseType: !971, size: 32, align: 32, offset: 2912)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1089, file: !14, line: 2158, baseType: !971, size: 32, align: 32, offset: 2944)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1089, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1089, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1089, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1089, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1089, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1089, file: !14, line: 2203, baseType: !971, size: 32, align: 32, offset: 3136)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1089, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1089, file: !14, line: 2212, baseType: !971, size: 32, align: 32, offset: 3200)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1089, file: !14, line: 2213, baseType: !971, size: 32, align: 32, offset: 3232)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1089, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1089, file: !14, line: 2232, baseType: !971, size: 32, align: 32, offset: 3296)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1089, file: !14, line: 2243, baseType: !971, size: 32, align: 32, offset: 3328)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1089, file: !14, line: 2249, baseType: !971, size: 32, align: 32, offset: 3360)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1089, file: !14, line: 2256, baseType: !971, size: 32, align: 32, offset: 3392)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1089, file: !14, line: 2263, baseType: !1121, size: 64, align: 64, offset: 3456)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1089, file: !14, line: 2270, baseType: !1121, size: 64, align: 64, offset: 3520)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1089, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1089, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1089, file: !14, line: 2367, baseType: !1633, size: 64, align: 64, offset: 3648)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!971, !1088, !1349, !971}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1089, file: !14, line: 2383, baseType: !971, size: 32, align: 32, offset: 3712)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1089, file: !14, line: 2386, baseType: !1567, size: 32, align: 32, offset: 3744)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1089, file: !14, line: 2387, baseType: !1567, size: 32, align: 32, offset: 3776)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1089, file: !14, line: 2394, baseType: !971, size: 32, align: 32, offset: 3808)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1089, file: !14, line: 2401, baseType: !971, size: 32, align: 32, offset: 3840)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1089, file: !14, line: 2408, baseType: !971, size: 32, align: 32, offset: 3872)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1089, file: !14, line: 2415, baseType: !971, size: 32, align: 32, offset: 3904)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1089, file: !14, line: 2422, baseType: !971, size: 32, align: 32, offset: 3936)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1089, file: !14, line: 2423, baseType: !1645, size: 64, align: 64, offset: 3968)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1648)
!1648 = !{!1649, !1650, !1651, !1652}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1647, file: !14, line: 827, baseType: !971, size: 32, align: 32)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1647, file: !14, line: 828, baseType: !971, size: 32, align: 32, offset: 32)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1647, file: !14, line: 829, baseType: !971, size: 32, align: 32, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1647, file: !14, line: 830, baseType: !1567, size: 32, align: 32, offset: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1089, file: !14, line: 2430, baseType: !973, size: 64, align: 64, offset: 4032)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1089, file: !14, line: 2437, baseType: !973, size: 64, align: 64, offset: 4096)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1089, file: !14, line: 2444, baseType: !1567, size: 32, align: 32, offset: 4160)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1089, file: !14, line: 2451, baseType: !1567, size: 32, align: 32, offset: 4192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1089, file: !14, line: 2458, baseType: !971, size: 32, align: 32, offset: 4224)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1089, file: !14, line: 2469, baseType: !971, size: 32, align: 32, offset: 4256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1089, file: !14, line: 2475, baseType: !971, size: 32, align: 32, offset: 4288)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1089, file: !14, line: 2481, baseType: !971, size: 32, align: 32, offset: 4320)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1089, file: !14, line: 2485, baseType: !971, size: 32, align: 32, offset: 4352)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1089, file: !14, line: 2489, baseType: !971, size: 32, align: 32, offset: 4384)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1089, file: !14, line: 2493, baseType: !971, size: 32, align: 32, offset: 4416)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1089, file: !14, line: 2501, baseType: !971, size: 32, align: 32, offset: 4448)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1089, file: !14, line: 2506, baseType: !971, size: 32, align: 32, offset: 4480)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1089, file: !14, line: 2510, baseType: !971, size: 32, align: 32, offset: 4512)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1089, file: !14, line: 2514, baseType: !973, size: 64, align: 64, offset: 4544)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1089, file: !14, line: 2528, baseType: !1669, size: 64, align: 64, offset: 4608)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{null, !1088, !970, !971, !971}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1089, file: !14, line: 2534, baseType: !971, size: 32, align: 32, offset: 4672)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1089, file: !14, line: 2545, baseType: !971, size: 32, align: 32, offset: 4704)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1089, file: !14, line: 2547, baseType: !971, size: 32, align: 32, offset: 4736)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1089, file: !14, line: 2549, baseType: !971, size: 32, align: 32, offset: 4768)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1089, file: !14, line: 2551, baseType: !971, size: 32, align: 32, offset: 4800)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1089, file: !14, line: 2553, baseType: !971, size: 32, align: 32, offset: 4832)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1089, file: !14, line: 2555, baseType: !971, size: 32, align: 32, offset: 4864)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1089, file: !14, line: 2557, baseType: !971, size: 32, align: 32, offset: 4896)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1089, file: !14, line: 2559, baseType: !971, size: 32, align: 32, offset: 4928)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1089, file: !14, line: 2563, baseType: !971, size: 32, align: 32, offset: 4960)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1089, file: !14, line: 2571, baseType: !1207, size: 64, align: 64, offset: 4992)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1089, file: !14, line: 2579, baseType: !1207, size: 64, align: 64, offset: 5056)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1089, file: !14, line: 2586, baseType: !971, size: 32, align: 32, offset: 5120)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1089, file: !14, line: 2615, baseType: !971, size: 32, align: 32, offset: 5152)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1089, file: !14, line: 2627, baseType: !971, size: 32, align: 32, offset: 5184)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1089, file: !14, line: 2637, baseType: !971, size: 32, align: 32, offset: 5216)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1089, file: !14, line: 2681, baseType: !971, size: 32, align: 32, offset: 5248)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1089, file: !14, line: 2709, baseType: !973, size: 64, align: 64, offset: 5312)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1089, file: !14, line: 2716, baseType: !1691, size: 64, align: 64, offset: 5376)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1089, file: !14, line: 2728, baseType: !970, size: 64, align: 64, offset: 5440)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1089, file: !14, line: 2735, baseType: !1273, size: 512, align: 64, offset: 5504)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1089, file: !14, line: 2742, baseType: !971, size: 32, align: 32, offset: 6016)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1089, file: !14, line: 2755, baseType: !971, size: 32, align: 32, offset: 6048)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1089, file: !14, line: 2776, baseType: !971, size: 32, align: 32, offset: 6080)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1089, file: !14, line: 2783, baseType: !971, size: 32, align: 32, offset: 6112)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1089, file: !14, line: 2791, baseType: !971, size: 32, align: 32, offset: 6144)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1089, file: !14, line: 2802, baseType: !1349, size: 64, align: 64, offset: 6208)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1089, file: !14, line: 2811, baseType: !971, size: 32, align: 32, offset: 6272)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1089, file: !14, line: 2821, baseType: !971, size: 32, align: 32, offset: 6304)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1089, file: !14, line: 2830, baseType: !971, size: 32, align: 32, offset: 6336)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1089, file: !14, line: 2840, baseType: !971, size: 32, align: 32, offset: 6368)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1089, file: !14, line: 2851, baseType: !1706, size: 64, align: 64, offset: 6400)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!971, !1088, !1709, !970, !1331, !971, !971}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!971, !1088, !970}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1089, file: !14, line: 2871, baseType: !1713, size: 64, align: 64, offset: 6464)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{!971, !1088, !1716, !970, !1331, !971}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!971, !1088, !970, !971, !971}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1089, file: !14, line: 2878, baseType: !971, size: 32, align: 32, offset: 6528)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1089, file: !14, line: 2885, baseType: !971, size: 32, align: 32, offset: 6560)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1089, file: !14, line: 3005, baseType: !971, size: 32, align: 32, offset: 6592)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1089, file: !14, line: 3013, baseType: !910, size: 32, align: 32, offset: 6624)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1089, file: !14, line: 3020, baseType: !910, size: 32, align: 32, offset: 6656)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1089, file: !14, line: 3027, baseType: !910, size: 32, align: 32, offset: 6688)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1089, file: !14, line: 3037, baseType: !1167, size: 64, align: 64, offset: 6720)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1089, file: !14, line: 3038, baseType: !971, size: 32, align: 32, offset: 6784)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1089, file: !14, line: 3050, baseType: !1121, size: 64, align: 64, offset: 6848)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1089, file: !14, line: 3065, baseType: !971, size: 32, align: 32, offset: 6912)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1089, file: !14, line: 3083, baseType: !971, size: 32, align: 32, offset: 6944)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1089, file: !14, line: 3092, baseType: !1015, size: 64, align: 32, offset: 6976)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1089, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1089, file: !14, line: 3106, baseType: !1015, size: 64, align: 32, offset: 7072)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1089, file: !14, line: 3113, baseType: !1734, size: 64, align: 64, offset: 7168)
