; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rdft.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rdft.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RDFTContext = type { i32, i32, i32, float*, float*, i32, %struct.FFTContext, void (%struct.RDFTContext*, float*)* }
%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, float*, float*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, i32, i32, i32* }
%struct.FFTComplex = type { float, float }

@ff_cos_tabs = external constant [18 x float*], align 16

; Function Attrs: cold nounwind optsize uwtable
define i32 @ff_rdft_init(%struct.RDFTContext* %s, i32 %nbits, i32 %trans) #0 !dbg !32 {
entry:
  %retval = alloca i32, align 4
  %s.addr = alloca %struct.RDFTContext*, align 8
  %nbits.addr = alloca i32, align 4
  %trans.addr = alloca i32, align 4
  %n = alloca i32, align 4
  %ret = alloca i32, align 4
  store %struct.RDFTContext* %s, %struct.RDFTContext** %s.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.RDFTContext** %s.addr, metadata !97, metadata !98), !dbg !99
  store i32 %nbits, i32* %nbits.addr, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !20)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rdft.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !9, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "RDFTransformType", file: !14, line: 71, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DFT_R2C", value: 0)
!17 = !DIEnumerator(name: "IDFT_C2R", value: 1)
!18 = !DIEnumerator(name: "IDFT_R2C", value: 2)
!19 = !DIEnumerator(name: "DFT_C2R", value: 3)
!20 = !{!21}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !14, line: 39, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !14, line: 37, size: 64, align: 32, elements: !24)
!24 = !{!25, !28}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !23, file: !14, line: 38, baseType: !26, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !14, line: 35, baseType: !27)
!27 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !23, file: !14, line: 38, baseType: !26, size: 32, align: 32, offset: 32)
!29 = !{i32 2, !"Dwarf Version", i32 4}
!30 = !{i32 2, !"Debug Info Version", i32 3}
!31 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!32 = distinct !DISubprogram(name: "ff_rdft_init", scope: !33, file: !33, line: 88, type: !34, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !96)
!33 = !DIFile(filename: "libavcodec/rdft.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !37, !36, !13}
!36 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDFTContext", file: !14, line: 78, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RDFTContext", file: !40, line: 28, size: 1280, align: 64, elements: !41)
!40 = !DIFile(filename: "libavcodec/rdft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!41 = !{!42, !43, !44, !45, !48, !49, !50, !91}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !39, file: !40, line: 29, baseType: !36, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !39, file: !40, line: 30, baseType: !36, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "sign_convention", scope: !39, file: !40, line: 31, baseType: !36, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !39, file: !40, line: 34, baseType: !46, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !39, file: !40, line: 35, baseType: !46, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sin", scope: !39, file: !40, line: 36, baseType: !36, size: 32, align: 32, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fft", scope: !39, file: !40, line: 37, baseType: !51, size: 896, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !14, line: 41, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !53)
!53 = !{!54, !55, !56, !61, !62, !63, !64, !66, !67, !72, !73, !77, !78, !79, !85, !86, !87}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !52, file: !4, line: 89, baseType: !36, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !52, file: !4, line: 90, baseType: !36, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !52, file: !4, line: 91, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !59, line: 49, baseType: !60)
!59 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!60 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !52, file: !4, line: 92, baseType: !21, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !52, file: !4, line: 93, baseType: !36, size: 32, align: 32, offset: 192)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !52, file: !4, line: 94, baseType: !36, size: 32, align: 32, offset: 224)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !52, file: !4, line: 96, baseType: !65, size: 64, align: 64, offset: 256)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !52, file: !4, line: 97, baseType: !65, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !52, file: !4, line: 101, baseType: !68, size: 64, align: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !71, !21}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !52, file: !4, line: 106, baseType: !68, size: 64, align: 64, offset: 448)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !52, file: !4, line: 107, baseType: !74, size: 64, align: 64, offset: 512)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !71, !65, !46}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !52, file: !4, line: 108, baseType: !74, size: 64, align: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !52, file: !4, line: 109, baseType: !74, size: 64, align: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !52, file: !4, line: 110, baseType: !80, size: 64, align: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !71, !83, !46}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 43, baseType: !27)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !52, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !52, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !52, file: !4, line: 113, baseType: !88, size: 64, align: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !59, line: 51, baseType: !90)
!90 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rdft_calc", scope: !39, file: !40, line: 38, baseType: !92, size: 64, align: 64, offset: 1216)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !95, !65}
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!96 = !{}
!97 = !DILocalVariable(name: "s", arg: 1, scope: !32, file: !33, line: 88, type: !37)
!98 = !DIExpression()
!99 = !DILocation(line: 88, column: 53, scope: !32)
!100 = !DILocalVariable(name: "nbits", arg: 2, scope: !32, file: !33, line: 88, type: !36)
!101 = !DILocation(line: 88, column: 60, scope: !32)
!102 = !DILocalVariable(name: "trans", arg: 3, scope: !32, file: !33, line: 88, type: !13)
!103 = !DILocation(line: 88, column: 89, scope: !32)
!104 = !DILocalVariable(name: "n", scope: !32, file: !33, line: 90, type: !36)
!105 = !DILocation(line: 90, column: 9, scope: !32)
!106 = !DILocation(line: 90, column: 18, scope: !32)
!107 = !DILocation(line: 90, column: 15, scope: !32)
!108 = !DILocalVariable(name: "ret", scope: !32, file: !33, line: 91, type: !36)
!109 = !DILocation(line: 91, column: 9, scope: !32)
!110 = !DILocation(line: 93, column: 16, scope: !32)
!111 = !DILocation(line: 93, column: 5, scope: !32)
!112 = !DILocation(line: 93, column: 8, scope: !32)
!113 = !DILocation(line: 93, column: 14, scope: !32)
!114 = !DILocation(line: 94, column: 18, scope: !32)
!115 = !DILocation(line: 94, column: 24, scope: !32)
!116 = !DILocation(line: 94, column: 36, scope: !32)
!117 = !DILocation(line: 94, column: 39, scope: !118)
!118 = !DILexicalBlockFile(scope: !32, file: !33, discriminator: 1)
!119 = !DILocation(line: 94, column: 45, scope: !118)
!120 = !DILocation(line: 94, column: 36, scope: !118)
!121 = !DILocation(line: 94, column: 36, scope: !122)
!122 = !DILexicalBlockFile(scope: !32, file: !33, discriminator: 2)
!123 = !DILocation(line: 94, column: 5, scope: !122)
!124 = !DILocation(line: 94, column: 8, scope: !122)
!125 = !DILocation(line: 94, column: 16, scope: !122)
!126 = !DILocation(line: 95, column: 26, scope: !32)
!127 = !DILocation(line: 95, column: 32, scope: !32)
!128 = !DILocation(line: 95, column: 44, scope: !32)
!129 = !DILocation(line: 95, column: 47, scope: !118)
!130 = !DILocation(line: 95, column: 53, scope: !118)
!131 = !DILocation(line: 95, column: 44, scope: !118)
!132 = !DILocation(line: 95, column: 26, scope: !122)
!133 = !DILocation(line: 95, column: 5, scope: !122)
!134 = !DILocation(line: 95, column: 8, scope: !122)
!135 = !DILocation(line: 95, column: 24, scope: !122)
!136 = !DILocation(line: 96, column: 23, scope: !32)
!137 = !DILocation(line: 96, column: 29, scope: !32)
!138 = !DILocation(line: 96, column: 40, scope: !32)
!139 = !DILocation(line: 96, column: 43, scope: !118)
!140 = !DILocation(line: 96, column: 49, scope: !118)
!141 = !DILocation(line: 96, column: 40, scope: !118)
!142 = !DILocation(line: 96, column: 40, scope: !122)
!143 = !DILocation(line: 96, column: 5, scope: !122)
!144 = !DILocation(line: 96, column: 8, scope: !122)
!145 = !DILocation(line: 96, column: 21, scope: !122)
!146 = !DILocation(line: 98, column: 9, scope: !147)
!147 = distinct !DILexicalBlock(scope: !32, file: !33, line: 98, column: 9)
!148 = !DILocation(line: 98, column: 15, scope: !147)
!149 = !DILocation(line: 98, column: 19, scope: !147)
!150 = !DILocation(line: 98, column: 22, scope: !151)
!151 = !DILexicalBlockFile(scope: !147, file: !33, discriminator: 1)
!152 = !DILocation(line: 98, column: 28, scope: !151)
!153 = !DILocation(line: 98, column: 9, scope: !151)
!154 = !DILocation(line: 99, column: 9, scope: !147)
!155 = !DILocation(line: 101, column: 29, scope: !156)
!156 = distinct !DILexicalBlock(scope: !32, file: !33, line: 101, column: 9)
!157 = !DILocation(line: 101, column: 32, scope: !156)
!158 = !DILocation(line: 101, column: 37, scope: !156)
!159 = !DILocation(line: 101, column: 42, scope: !156)
!160 = !DILocation(line: 101, column: 46, scope: !156)
