; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h263.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h263.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926}
!926 = distinct !DIGlobalVariable(name: "off", scope: !927, file: !928, line: 312, type: !2593, isLocal: true, isDefinition: true, variable: [4 x i32]* @ff_h263_pred_motion.off)
!927 = distinct !DISubprogram(name: "ff_h263_pred_motion", scope: !928, file: !928, line: 307, type: !929, isLocal: false, isDefinition: true, scopeLine: 309, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2592)
!928 = !DIFile(filename: "libavcodec/h263.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = !DISubroutineType(types: !930)
!930 = !{!931, !935, !962, !962, !1296, !1296}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !933, line: 37, baseType: !934)
!933 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!934 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !937, line: 582, baseType: !938)
!937 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !937, line: 81, size: 86208, align: 64, elements: !939)
!939 = !{!940, !1025, !1026, !1027, !1028, !1032, !1033, !1047, !1048, !1049, !1050, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1759, !1760, !1813, !1815, !1816, !1817, !1818, !1819, !1830, !1831, !1832, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1848, !1849, !1851, !1852, !1853, !1854, !1855, !1856, !1861, !1863, !1864, !1865, !1866, !1867, !1868, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1895, !1896, !1897, !1898, !1914, !1921, !1933, !1949, !1971, !2011, !2024, !2051, !2066, !2080, !2093, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2114, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2127, !2129, !2130, !2131, !2132, !2133, !2134, !2137, !2139, !2141, !2142, !2145, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2212, !2213, !2215, !2216, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2238, !2239, !2240, !2243, !2244, !2245, !2246, !2248, !2250, !2251, !2252, !2253, !2254, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2336, !2337, !2338, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2467, !2468, !2469, !2470, !2474, !2475, !2479, !2483, !2487, !2488, !2493, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2508, !2509, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2527, !2528, !2529, !2579, !2580, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !938, file: !937, line: 82, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !944)
!944 = !{!945, !949, !954, !984, !985, !986, !987, !991, !997, !999, !1003}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !943, file: !26, line: 72, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !943, file: !26, line: 78, baseType: !950, size: 64, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!946, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !943, file: !26, line: 85, baseType: !955, size: 64, align: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !958)
!958 = !{!959, !960, !961, !963, !964, !980, !981, !982, !983}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !957, file: !4, line: 247, baseType: !946, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !957, file: !4, line: 253, baseType: !946, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !957, file: !4, line: 259, baseType: !962, size: 32, align: 32, offset: 128)
!962 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !957, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !957, file: !4, line: 271, baseType: !965, size: 64, align: 64, offset: 192)
!965 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !957, file: !4, line: 265, size: 64, align: 64, elements: !966)
!966 = !{!967, !970, !972, !973}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !965, file: !4, line: 266, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !933, line: 40, baseType: !969)
!969 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !965, file: !4, line: 267, baseType: !971, size: 64, align: 64)
!971 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !965, file: !4, line: 268, baseType: !946, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !965, file: !4, line: 270, baseType: !974, size: 64, align: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !975, line: 61, baseType: !976)
!975 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !975, line: 58, size: 64, align: 32, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !976, file: !975, line: 59, baseType: !962, size: 32, align: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !976, file: !975, line: 60, baseType: !962, size: 32, align: 32, offset: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !957, file: !4, line: 272, baseType: !971, size: 64, align: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !957, file: !4, line: 273, baseType: !971, size: 64, align: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !957, file: !4, line: 275, baseType: !962, size: 32, align: 32, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !957, file: !4, line: 300, baseType: !946, size: 64, align: 64, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !943, file: !26, line: 93, baseType: !962, size: 32, align: 32, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !943, file: !26, line: 99, baseType: !962, size: 32, align: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !943, file: !26, line: 108, baseType: !962, size: 32, align: 32, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !943, file: !26, line: 113, baseType: !988, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!953, !953, !953}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !943, file: !26, line: 123, baseType: !992, size: 64, align: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !943, file: !26, line: 130, baseType: !998, size: 32, align: 32, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !943, file: !26, line: 136, baseType: !1000, size: 64, align: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!998, !953}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !943, file: !26, line: 142, baseType: !1004, size: 64, align: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!962, !1007, !953, !946, !962}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1010)
!1010 = !{!1011, !1023, !1024}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1009, file: !4, line: 360, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1015, file: !4, line: 307, baseType: !946, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1015, file: !4, line: 313, baseType: !971, size: 64, align: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1015, file: !4, line: 313, baseType: !971, size: 64, align: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1015, file: !4, line: 318, baseType: !971, size: 64, align: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1015, file: !4, line: 318, baseType: !971, size: 64, align: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1015, file: !4, line: 323, baseType: !962, size: 32, align: 32, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1009, file: !4, line: 364, baseType: !962, size: 32, align: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1009, file: !4, line: 368, baseType: !962, size: 32, align: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !938, file: !937, line: 84, baseType: !962, size: 32, align: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !938, file: !937, line: 84, baseType: !962, size: 32, align: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !938, file: !937, line: 85, baseType: !962, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !938, file: !937, line: 86, baseType: !1029, size: 384, align: 32, offset: 160)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 384, align: 32, elements: !1030)
!1030 = !{!1031}
!1031 = !DISubrange(count: 12)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !938, file: !937, line: 87, baseType: !962, size: 32, align: 32, offset: 544)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !938, file: !937, line: 90, baseType: !1034, size: 1088, align: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1036)
!1036 = !{!1037, !1042, !1046}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1035, file: !917, line: 32, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !933, line: 48, baseType: !1041)
!1041 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1035, file: !917, line: 33, baseType: !1043, size: 512, align: 8, offset: 64)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 512, align: 8, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1035, file: !917, line: 34, baseType: !1043, size: 512, align: 8, offset: 576)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !938, file: !937, line: 91, baseType: !1034, size: 1088, align: 64, offset: 1664)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !938, file: !937, line: 92, baseType: !1034, size: 1088, align: 64, offset: 2752)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !938, file: !937, line: 93, baseType: !1034, size: 1088, align: 64, offset: 3840)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !938, file: !937, line: 98, baseType: !1051, size: 64, align: 64, offset: 4928)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1053)
!1053 = !{!1054, !1057, !1058, !1059, !1326, !1327, !1328, !1329, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1481, !1485, !1486, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1664, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1052, file: !57, line: 1561, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1052, file: !57, line: 1562, baseType: !962, size: 32, align: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1052, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1052, file: !57, line: 1565, baseType: !1060, size: 64, align: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069, !1072, !1075, !1078, !1081, !1086, !1087, !1088, !1096, !1097, !1098, !1100, !1106, !1112, !1121, !1125, !1126, !1176, !1297, !1301, !1302, !1306, !1310, !1315, !1319, !1320, !1321}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1062, file: !57, line: 3475, baseType: !946, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1062, file: !57, line: 3480, baseType: !946, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1062, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1062, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1062, file: !57, line: 3487, baseType: !962, size: 32, align: 32, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1062, file: !57, line: 3488, baseType: !1070, size: 64, align: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1062, file: !57, line: 3489, baseType: !1073, size: 64, align: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1062, file: !57, line: 3490, baseType: !1076, size: 64, align: 64, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1062, file: !57, line: 3491, baseType: !1079, size: 64, align: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1062, file: !57, line: 3492, baseType: !1082, size: 64, align: 64, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !933, line: 55, baseType: !1085)
!1085 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1062, file: !57, line: 3493, baseType: !1040, size: 8, align: 8, offset: 576)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1062, file: !57, line: 3494, baseType: !1055, size: 64, align: 64, offset: 640)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1062, file: !57, line: 3495, baseType: !1089, size: 64, align: 64, offset: 704)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1092, file: !57, line: 3402, baseType: !962, size: 32, align: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1092, file: !57, line: 3403, baseType: !946, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1062, file: !57, line: 3507, baseType: !946, size: 64, align: 64, offset: 768)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1062, file: !57, line: 3516, baseType: !962, size: 32, align: 32, offset: 832)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1062, file: !57, line: 3517, baseType: !1099, size: 64, align: 64, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1062, file: !57, line: 3527, baseType: !1101, size: 64, align: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!962, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1052)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1062, file: !57, line: 3535, baseType: !1107, size: 64, align: 64, offset: 1024)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!962, !1104, !1110}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1105)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1062, file: !57, line: 3541, baseType: !1113, size: 64, align: 64, offset: 1088)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1117, line: 223, size: 128, align: 64, elements: !1118)
!1117 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1116, file: !1117, line: 224, baseType: !1038, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1116, file: !1117, line: 225, baseType: !1038, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1062, file: !57, line: 3549, baseType: !1122, size: 64, align: 64, offset: 1152)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !1099}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1062, file: !57, line: 3551, baseType: !1101, size: 64, align: 64, offset: 1216)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1062, file: !57, line: 3552, baseType: !1127, size: 64, align: 64, offset: 1280)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DISubroutineType(types: !1129)
!1129 = !{!962, !1104, !1130, !962, !1131}
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1134)
!1134 = !{!1135, !1138, !1141, !1142, !1143, !1175}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1133, file: !57, line: 3921, baseType: !1136, size: 16, align: 16)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !933, line: 49, baseType: !1137)
!1137 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1133, file: !57, line: 3922, baseType: !1139, size: 32, align: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !933, line: 51, baseType: !1140)
!1140 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1133, file: !57, line: 3923, baseType: !1139, size: 32, align: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1133, file: !57, line: 3924, baseType: !1140, size: 32, align: 32, offset: 96)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1133, file: !57, line: 3925, baseType: !1144, size: 64, align: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1152, !1153, !1154, !1164, !1168, !1170, !1171, !1173, !1174}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1147, file: !57, line: 3886, baseType: !962, size: 32, align: 32)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1147, file: !57, line: 3887, baseType: !962, size: 32, align: 32, offset: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1147, file: !57, line: 3888, baseType: !962, size: 32, align: 32, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1147, file: !57, line: 3889, baseType: !962, size: 32, align: 32, offset: 96)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1147, file: !57, line: 3890, baseType: !962, size: 32, align: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1147, file: !57, line: 3897, baseType: !1155, size: 768, align: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1157)
!1157 = !{!1158, !1162}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !57, line: 3855, baseType: !1159, size: 512, align: 64)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 512, align: 64, elements: !1160)
!1160 = !{!1161}
!1161 = !DISubrange(count: 8)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1156, file: !57, line: 3857, baseType: !1163, size: 256, align: 32, offset: 512)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 256, align: 32, elements: !1160)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !57, line: 3903, baseType: !1165, size: 256, align: 64, offset: 960)
!1165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 256, align: 64, elements: !1166)
!1166 = !{!1167}
!1167 = !DISubrange(count: 4)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1147, file: !57, line: 3904, baseType: !1169, size: 128, align: 32, offset: 1216)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 128, align: 32, elements: !1166)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1147, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1147, file: !57, line: 3908, baseType: !1172, size: 64, align: 64, offset: 1408)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1147, file: !57, line: 3915, baseType: !1172, size: 64, align: 64, offset: 1472)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1147, file: !57, line: 3917, baseType: !962, size: 32, align: 32, offset: 1536)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1133, file: !57, line: 3926, baseType: !968, size: 64, align: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1062, file: !57, line: 3564, baseType: !1177, size: 64, align: 64, offset: 1344)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DISubroutineType(types: !1179)
!1179 = !{!962, !1104, !1180, !1214, !1296}
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1183)
!1183 = !{!1184, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1210, !1211, !1212, !1213}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1182, file: !57, line: 1451, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1187, line: 94, baseType: !1188)
!1187 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1187, line: 81, size: 192, align: 64, elements: !1189)
!1189 = !{!1190, !1194, !1195}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1188, file: !1187, line: 82, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1187, line: 73, baseType: !1193)
!1193 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1187, line: 73, flags: DIFlagFwdDecl)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1188, file: !1187, line: 89, baseType: !1130, size: 64, align: 64, offset: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1188, file: !1187, line: 93, baseType: !962, size: 32, align: 32, offset: 128)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1182, file: !57, line: 1461, baseType: !968, size: 64, align: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1182, file: !57, line: 1467, baseType: !968, size: 64, align: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !57, line: 1468, baseType: !1130, size: 64, align: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1182, file: !57, line: 1469, baseType: !962, size: 32, align: 32, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1182, file: !57, line: 1470, baseType: !962, size: 32, align: 32, offset: 288)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1182, file: !57, line: 1474, baseType: !962, size: 32, align: 32, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1182, file: !57, line: 1479, baseType: !1203, size: 64, align: 64, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1206)
!1206 = !{!1207, !1208, !1209}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1205, file: !57, line: 1412, baseType: !1130, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !57, line: 1413, baseType: !962, size: 32, align: 32, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1205, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1182, file: !57, line: 1480, baseType: !962, size: 32, align: 32, offset: 448)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1182, file: !57, line: 1486, baseType: !968, size: 64, align: 64, offset: 512)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1182, file: !57, line: 1488, baseType: !968, size: 64, align: 64, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1182, file: !57, line: 1497, baseType: !968, size: 64, align: 64, offset: 640)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1216)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1248, !1250, !1251, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1284, !1285, !1286, !1287, !1288, !1289, !1292, !1293, !1294, !1295}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !780, line: 282, baseType: !1159, size: 512, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1217, file: !780, line: 299, baseType: !1163, size: 256, align: 32, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1217, file: !780, line: 315, baseType: !1222, size: 64, align: 64, offset: 768)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1217, file: !780, line: 326, baseType: !962, size: 32, align: 32, offset: 832)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1217, file: !780, line: 326, baseType: !962, size: 32, align: 32, offset: 864)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1217, file: !780, line: 334, baseType: !962, size: 32, align: 32, offset: 896)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1217, file: !780, line: 341, baseType: !962, size: 32, align: 32, offset: 928)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1217, file: !780, line: 346, baseType: !962, size: 32, align: 32, offset: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1217, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1217, file: !780, line: 356, baseType: !974, size: 64, align: 32, offset: 1024)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1217, file: !780, line: 361, baseType: !968, size: 64, align: 64, offset: 1088)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1217, file: !780, line: 369, baseType: !968, size: 64, align: 64, offset: 1152)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1217, file: !780, line: 377, baseType: !968, size: 64, align: 64, offset: 1216)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1217, file: !780, line: 382, baseType: !962, size: 32, align: 32, offset: 1280)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1217, file: !780, line: 386, baseType: !962, size: 32, align: 32, offset: 1312)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1217, file: !780, line: 391, baseType: !962, size: 32, align: 32, offset: 1344)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1217, file: !780, line: 396, baseType: !953, size: 64, align: 64, offset: 1408)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1217, file: !780, line: 403, baseType: !1238, size: 512, align: 64, offset: 1472)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 512, align: 64, elements: !1160)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1217, file: !780, line: 410, baseType: !962, size: 32, align: 32, offset: 1984)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1217, file: !780, line: 415, baseType: !962, size: 32, align: 32, offset: 2016)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1217, file: !780, line: 420, baseType: !962, size: 32, align: 32, offset: 2048)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1217, file: !780, line: 425, baseType: !962, size: 32, align: 32, offset: 2080)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1217, file: !780, line: 435, baseType: !968, size: 64, align: 64, offset: 2112)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1217, file: !780, line: 440, baseType: !962, size: 32, align: 32, offset: 2176)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1217, file: !780, line: 445, baseType: !1084, size: 64, align: 64, offset: 2240)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !780, line: 459, baseType: !1247, size: 512, align: 64, offset: 2304)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 512, align: 64, elements: !1160)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1217, file: !780, line: 473, baseType: !1249, size: 64, align: 64, offset: 2816)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1217, file: !780, line: 477, baseType: !962, size: 32, align: 32, offset: 2880)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1217, file: !780, line: 479, baseType: !1252, size: 64, align: 64, offset: 2944)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1256)
!1256 = !{!1257, !1258, !1259, !1260, !1265}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1255, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1255, file: !780, line: 203, baseType: !1130, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1255, file: !780, line: 204, baseType: !962, size: 32, align: 32, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1255, file: !780, line: 205, baseType: !1261, size: 64, align: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1263, line: 86, baseType: !1264)
!1263 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1263, line: 86, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1255, file: !780, line: 206, baseType: !1185, size: 64, align: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1217, file: !780, line: 480, baseType: !962, size: 32, align: 32, offset: 3008)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1217, file: !780, line: 505, baseType: !962, size: 32, align: 32, offset: 3040)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1217, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1217, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1217, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1217, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1217, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1217, file: !780, line: 532, baseType: !968, size: 64, align: 64, offset: 3264)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1217, file: !780, line: 539, baseType: !968, size: 64, align: 64, offset: 3328)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1217, file: !780, line: 547, baseType: !968, size: 64, align: 64, offset: 3392)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1217, file: !780, line: 554, baseType: !1261, size: 64, align: 64, offset: 3456)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1217, file: !780, line: 563, baseType: !962, size: 32, align: 32, offset: 3520)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1217, file: !780, line: 572, baseType: !962, size: 32, align: 32, offset: 3552)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1217, file: !780, line: 581, baseType: !962, size: 32, align: 32, offset: 3584)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1217, file: !780, line: 588, baseType: !1281, size: 64, align: 64, offset: 3648)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !933, line: 36, baseType: !1283)
!1283 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1217, file: !780, line: 593, baseType: !962, size: 32, align: 32, offset: 3712)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1217, file: !780, line: 596, baseType: !962, size: 32, align: 32, offset: 3744)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1217, file: !780, line: 599, baseType: !1185, size: 64, align: 64, offset: 3776)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1217, file: !780, line: 605, baseType: !1185, size: 64, align: 64, offset: 3840)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1217, file: !780, line: 616, baseType: !1185, size: 64, align: 64, offset: 3904)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1217, file: !780, line: 626, baseType: !1290, size: 64, align: 64, offset: 3968)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1291, line: 216, baseType: !1085)
!1291 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1217, file: !780, line: 627, baseType: !1290, size: 64, align: 64, offset: 4032)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1217, file: !780, line: 628, baseType: !1290, size: 64, align: 64, offset: 4096)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1217, file: !780, line: 629, baseType: !1290, size: 64, align: 64, offset: 4160)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1217, file: !780, line: 645, baseType: !1185, size: 64, align: 64, offset: 4224)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1062, file: !57, line: 3566, baseType: !1298, size: 64, align: 64, offset: 1408)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!962, !1104, !953, !1296, !1180}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1062, file: !57, line: 3567, baseType: !1101, size: 64, align: 64, offset: 1472)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1062, file: !57, line: 3576, baseType: !1303, size: 64, align: 64, offset: 1536)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!962, !1104, !1214}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1062, file: !57, line: 3577, baseType: !1307, size: 64, align: 64, offset: 1600)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!962, !1104, !1180}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1062, file: !57, line: 3584, baseType: !1311, size: 64, align: 64, offset: 1664)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!962, !1104, !1314}
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1062, file: !57, line: 3589, baseType: !1316, size: 64, align: 64, offset: 1728)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{null, !1104}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1062, file: !57, line: 3594, baseType: !962, size: 32, align: 32, offset: 1792)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1062, file: !57, line: 3600, baseType: !946, size: 64, align: 64, offset: 1856)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1062, file: !57, line: 3609, baseType: !1322, size: 64, align: 64, offset: 1920)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1325 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1052, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1052, file: !57, line: 1581, baseType: !1140, size: 32, align: 32, offset: 224)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1052, file: !57, line: 1583, baseType: !953, size: 64, align: 64, offset: 256)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1052, file: !57, line: 1591, baseType: !1330, size: 64, align: 64, offset: 320)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1117, line: 129, size: 1664, align: 64, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1337, !1355, !1356, !1362, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1331, file: !1117, line: 136, baseType: !962, size: 32, align: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1331, file: !1117, line: 151, baseType: !962, size: 32, align: 32, offset: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1331, file: !1117, line: 157, baseType: !962, size: 32, align: 32, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1331, file: !1117, line: 159, baseType: !1314, size: 64, align: 64, offset: 128)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1331, file: !1117, line: 161, baseType: !1338, size: 64, align: 64, offset: 192)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1117, line: 117, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1117, line: 100, size: 832, align: 64, elements: !1341)
!1341 = !{!1342, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1340, file: !1117, line: 105, baseType: !1343, size: 256, align: 64)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1344, size: 256, align: 64, elements: !1166)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1187, line: 238, baseType: !1346)
!1346 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1187, line: 238, flags: DIFlagFwdDecl)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1340, file: !1117, line: 110, baseType: !962, size: 32, align: 32, offset: 256)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1340, file: !1117, line: 111, baseType: !962, size: 32, align: 32, offset: 288)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1340, file: !1117, line: 111, baseType: !962, size: 32, align: 32, offset: 320)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1340, file: !1117, line: 112, baseType: !1163, size: 256, align: 32, offset: 352)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1340, file: !1117, line: 113, baseType: !1169, size: 128, align: 32, offset: 608)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1340, file: !1117, line: 114, baseType: !962, size: 32, align: 32, offset: 736)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1340, file: !1117, line: 115, baseType: !962, size: 32, align: 32, offset: 768)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1340, file: !1117, line: 116, baseType: !962, size: 32, align: 32, offset: 800)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1331, file: !1117, line: 163, baseType: !953, size: 64, align: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1331, file: !1117, line: 165, baseType: !1357, size: 128, align: 64, offset: 320)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1117, line: 122, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1117, line: 119, size: 128, align: 64, elements: !1359)
!1359 = !{!1360, !1361}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1358, file: !1117, line: 120, baseType: !1180, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1358, file: !1117, line: 121, baseType: !1314, size: 64, align: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1331, file: !1117, line: 166, baseType: !1363, size: 128, align: 64, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1117, line: 127, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1117, line: 124, size: 128, align: 64, elements: !1365)
!1365 = !{!1366, !1439}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1364, file: !1117, line: 125, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1371)
!1371 = !{!1372, !1373, !1397, !1401, !1402, !1436, !1437, !1438}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1370, file: !57, line: 5751, baseType: !1055, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1370, file: !57, line: 5756, baseType: !1374, size: 64, align: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1382, !1383, !1384, !1388, !1392, !1396}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1376, file: !57, line: 5797, baseType: !946, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1376, file: !57, line: 5804, baseType: !1380, size: 64, align: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1376, file: !57, line: 5815, baseType: !1055, size: 64, align: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1376, file: !57, line: 5825, baseType: !962, size: 32, align: 32, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1376, file: !57, line: 5826, baseType: !1385, size: 64, align: 64, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!962, !1368}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1376, file: !57, line: 5827, baseType: !1389, size: 64, align: 64, offset: 320)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!962, !1368, !1180}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1376, file: !57, line: 5828, baseType: !1393, size: 64, align: 64, offset: 384)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{null, !1368}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1376, file: !57, line: 5829, baseType: !1393, size: 64, align: 64, offset: 448)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1370, file: !57, line: 5762, baseType: !1398, size: 64, align: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1400)
!1400 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1370, file: !57, line: 5768, baseType: !953, size: 64, align: 64, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1370, file: !57, line: 5775, baseType: !1403, size: 64, align: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1405, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1405, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1405, file: !57, line: 3948, baseType: !1139, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1405, file: !57, line: 3958, baseType: !1130, size: 64, align: 64, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1405, file: !57, line: 3962, baseType: !962, size: 32, align: 32, offset: 192)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1405, file: !57, line: 3968, baseType: !962, size: 32, align: 32, offset: 224)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1405, file: !57, line: 3973, baseType: !968, size: 64, align: 64, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1405, file: !57, line: 3986, baseType: !962, size: 32, align: 32, offset: 320)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1405, file: !57, line: 3999, baseType: !962, size: 32, align: 32, offset: 352)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1405, file: !57, line: 4004, baseType: !962, size: 32, align: 32, offset: 384)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1405, file: !57, line: 4005, baseType: !962, size: 32, align: 32, offset: 416)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1405, file: !57, line: 4010, baseType: !962, size: 32, align: 32, offset: 448)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1405, file: !57, line: 4011, baseType: !962, size: 32, align: 32, offset: 480)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1405, file: !57, line: 4020, baseType: !974, size: 64, align: 32, offset: 512)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1405, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1405, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1405, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1405, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1405, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1405, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1405, file: !57, line: 4039, baseType: !962, size: 32, align: 32, offset: 768)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1405, file: !57, line: 4046, baseType: !1084, size: 64, align: 64, offset: 832)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1405, file: !57, line: 4050, baseType: !962, size: 32, align: 32, offset: 896)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1405, file: !57, line: 4054, baseType: !962, size: 32, align: 32, offset: 928)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1405, file: !57, line: 4061, baseType: !962, size: 32, align: 32, offset: 960)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1405, file: !57, line: 4065, baseType: !962, size: 32, align: 32, offset: 992)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1405, file: !57, line: 4073, baseType: !962, size: 32, align: 32, offset: 1024)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1405, file: !57, line: 4080, baseType: !962, size: 32, align: 32, offset: 1056)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1405, file: !57, line: 4084, baseType: !962, size: 32, align: 32, offset: 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1370, file: !57, line: 5781, baseType: !1403, size: 64, align: 64, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1370, file: !57, line: 5787, baseType: !974, size: 64, align: 32, offset: 384)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1370, file: !57, line: 5793, baseType: !974, size: 64, align: 32, offset: 448)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1364, file: !1117, line: 126, baseType: !962, size: 32, align: 32, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1331, file: !1117, line: 172, baseType: !1180, size: 64, align: 64, offset: 576)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1331, file: !1117, line: 177, baseType: !1130, size: 64, align: 64, offset: 640)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1331, file: !1117, line: 178, baseType: !1140, size: 32, align: 32, offset: 704)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1331, file: !1117, line: 180, baseType: !953, size: 64, align: 64, offset: 768)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1331, file: !1117, line: 185, baseType: !962, size: 32, align: 32, offset: 832)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1331, file: !1117, line: 190, baseType: !953, size: 64, align: 64, offset: 896)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1331, file: !1117, line: 195, baseType: !962, size: 32, align: 32, offset: 960)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1331, file: !1117, line: 200, baseType: !1180, size: 64, align: 64, offset: 1024)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1331, file: !1117, line: 201, baseType: !962, size: 32, align: 32, offset: 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1331, file: !1117, line: 202, baseType: !1314, size: 64, align: 64, offset: 1152)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1331, file: !1117, line: 203, baseType: !962, size: 32, align: 32, offset: 1216)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1331, file: !1117, line: 205, baseType: !962, size: 32, align: 32, offset: 1248)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1331, file: !1117, line: 206, baseType: !962, size: 32, align: 32, offset: 1280)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1331, file: !1117, line: 209, baseType: !1290, size: 64, align: 64, offset: 1344)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1331, file: !1117, line: 212, baseType: !1290, size: 64, align: 64, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1331, file: !1117, line: 213, baseType: !1314, size: 64, align: 64, offset: 1472)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1331, file: !1117, line: 215, baseType: !962, size: 32, align: 32, offset: 1536)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1331, file: !1117, line: 217, baseType: !962, size: 32, align: 32, offset: 1568)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1331, file: !1117, line: 220, baseType: !962, size: 32, align: 32, offset: 1600)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1052, file: !57, line: 1598, baseType: !953, size: 64, align: 64, offset: 384)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1052, file: !57, line: 1606, baseType: !968, size: 64, align: 64, offset: 448)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1052, file: !57, line: 1614, baseType: !962, size: 32, align: 32, offset: 512)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1052, file: !57, line: 1622, baseType: !962, size: 32, align: 32, offset: 544)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1052, file: !57, line: 1628, baseType: !962, size: 32, align: 32, offset: 576)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !57, line: 1636, baseType: !962, size: 32, align: 32, offset: 608)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1052, file: !57, line: 1643, baseType: !962, size: 32, align: 32, offset: 640)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1052, file: !57, line: 1657, baseType: !1130, size: 64, align: 64, offset: 704)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1052, file: !57, line: 1658, baseType: !962, size: 32, align: 32, offset: 768)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1052, file: !57, line: 1679, baseType: !974, size: 64, align: 32, offset: 800)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1052, file: !57, line: 1688, baseType: !962, size: 32, align: 32, offset: 864)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1052, file: !57, line: 1712, baseType: !962, size: 32, align: 32, offset: 896)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1052, file: !57, line: 1729, baseType: !962, size: 32, align: 32, offset: 928)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1052, file: !57, line: 1729, baseType: !962, size: 32, align: 32, offset: 960)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1052, file: !57, line: 1744, baseType: !962, size: 32, align: 32, offset: 992)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1052, file: !57, line: 1744, baseType: !962, size: 32, align: 32, offset: 1024)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1052, file: !57, line: 1751, baseType: !962, size: 32, align: 32, offset: 1056)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1052, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1052, file: !57, line: 1791, baseType: !1478, size: 64, align: 64, offset: 1152)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{null, !1051, !1214, !1296, !962, !962, !962}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1052, file: !57, line: 1808, baseType: !1482, size: 64, align: 64, offset: 1216)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!516, !1051, !1073}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1052, file: !57, line: 1816, baseType: !962, size: 32, align: 32, offset: 1280)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1052, file: !57, line: 1825, baseType: !1487, size: 32, align: 32, offset: 1312)
!1487 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1052, file: !57, line: 1830, baseType: !962, size: 32, align: 32, offset: 1344)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1052, file: !57, line: 1838, baseType: !1487, size: 32, align: 32, offset: 1376)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1052, file: !57, line: 1846, baseType: !962, size: 32, align: 32, offset: 1408)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1052, file: !57, line: 1851, baseType: !962, size: 32, align: 32, offset: 1440)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1052, file: !57, line: 1861, baseType: !1487, size: 32, align: 32, offset: 1472)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1052, file: !57, line: 1868, baseType: !1487, size: 32, align: 32, offset: 1504)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1052, file: !57, line: 1875, baseType: !1487, size: 32, align: 32, offset: 1536)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1052, file: !57, line: 1882, baseType: !1487, size: 32, align: 32, offset: 1568)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1052, file: !57, line: 1889, baseType: !1487, size: 32, align: 32, offset: 1600)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1052, file: !57, line: 1896, baseType: !1487, size: 32, align: 32, offset: 1632)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1052, file: !57, line: 1903, baseType: !1487, size: 32, align: 32, offset: 1664)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1052, file: !57, line: 1910, baseType: !962, size: 32, align: 32, offset: 1696)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1052, file: !57, line: 1915, baseType: !962, size: 32, align: 32, offset: 1728)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1052, file: !57, line: 1926, baseType: !1296, size: 64, align: 64, offset: 1792)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1052, file: !57, line: 1935, baseType: !974, size: 64, align: 32, offset: 1856)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1052, file: !57, line: 1942, baseType: !962, size: 32, align: 32, offset: 1920)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1052, file: !57, line: 1948, baseType: !962, size: 32, align: 32, offset: 1952)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1052, file: !57, line: 1954, baseType: !962, size: 32, align: 32, offset: 1984)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1052, file: !57, line: 1960, baseType: !962, size: 32, align: 32, offset: 2016)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1052, file: !57, line: 1984, baseType: !962, size: 32, align: 32, offset: 2048)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1052, file: !57, line: 1991, baseType: !962, size: 32, align: 32, offset: 2080)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1052, file: !57, line: 1996, baseType: !962, size: 32, align: 32, offset: 2112)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1052, file: !57, line: 2004, baseType: !962, size: 32, align: 32, offset: 2144)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1052, file: !57, line: 2011, baseType: !962, size: 32, align: 32, offset: 2176)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1052, file: !57, line: 2018, baseType: !962, size: 32, align: 32, offset: 2208)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1052, file: !57, line: 2027, baseType: !962, size: 32, align: 32, offset: 2240)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1052, file: !57, line: 2034, baseType: !962, size: 32, align: 32, offset: 2272)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1052, file: !57, line: 2044, baseType: !962, size: 32, align: 32, offset: 2304)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1052, file: !57, line: 2054, baseType: !1517, size: 64, align: 64, offset: 2368)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1052, file: !57, line: 2061, baseType: !1517, size: 64, align: 64, offset: 2432)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1052, file: !57, line: 2066, baseType: !962, size: 32, align: 32, offset: 2496)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1052, file: !57, line: 2070, baseType: !962, size: 32, align: 32, offset: 2528)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1052, file: !57, line: 2078, baseType: !962, size: 32, align: 32, offset: 2560)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1052, file: !57, line: 2085, baseType: !962, size: 32, align: 32, offset: 2592)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1052, file: !57, line: 2092, baseType: !962, size: 32, align: 32, offset: 2624)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1052, file: !57, line: 2099, baseType: !962, size: 32, align: 32, offset: 2656)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1052, file: !57, line: 2106, baseType: !962, size: 32, align: 32, offset: 2688)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1052, file: !57, line: 2113, baseType: !962, size: 32, align: 32, offset: 2720)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1052, file: !57, line: 2120, baseType: !962, size: 32, align: 32, offset: 2752)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1052, file: !57, line: 2125, baseType: !962, size: 32, align: 32, offset: 2784)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1052, file: !57, line: 2133, baseType: !962, size: 32, align: 32, offset: 2816)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1052, file: !57, line: 2140, baseType: !962, size: 32, align: 32, offset: 2848)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1052, file: !57, line: 2145, baseType: !962, size: 32, align: 32, offset: 2880)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1052, file: !57, line: 2153, baseType: !962, size: 32, align: 32, offset: 2912)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1052, file: !57, line: 2158, baseType: !962, size: 32, align: 32, offset: 2944)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1052, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1052, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1052, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1052, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1052, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1052, file: !57, line: 2203, baseType: !962, size: 32, align: 32, offset: 3136)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1052, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1052, file: !57, line: 2212, baseType: !962, size: 32, align: 32, offset: 3200)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1052, file: !57, line: 2213, baseType: !962, size: 32, align: 32, offset: 3232)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1052, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1052, file: !57, line: 2232, baseType: !962, size: 32, align: 32, offset: 3296)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1052, file: !57, line: 2243, baseType: !962, size: 32, align: 32, offset: 3328)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1052, file: !57, line: 2249, baseType: !962, size: 32, align: 32, offset: 3360)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1052, file: !57, line: 2256, baseType: !962, size: 32, align: 32, offset: 3392)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1052, file: !57, line: 2263, baseType: !1084, size: 64, align: 64, offset: 3456)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1052, file: !57, line: 2270, baseType: !1084, size: 64, align: 64, offset: 3520)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1052, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1052, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1052, file: !57, line: 2367, baseType: !1553, size: 64, align: 64, offset: 3648)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!962, !1051, !1314, !962}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1052, file: !57, line: 2383, baseType: !962, size: 32, align: 32, offset: 3712)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1052, file: !57, line: 2386, baseType: !1487, size: 32, align: 32, offset: 3744)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1052, file: !57, line: 2387, baseType: !1487, size: 32, align: 32, offset: 3776)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1052, file: !57, line: 2394, baseType: !962, size: 32, align: 32, offset: 3808)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1052, file: !57, line: 2401, baseType: !962, size: 32, align: 32, offset: 3840)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1052, file: !57, line: 2408, baseType: !962, size: 32, align: 32, offset: 3872)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1052, file: !57, line: 2415, baseType: !962, size: 32, align: 32, offset: 3904)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1052, file: !57, line: 2422, baseType: !962, size: 32, align: 32, offset: 3936)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1052, file: !57, line: 2423, baseType: !1565, size: 64, align: 64, offset: 3968)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1568)
!1568 = !{!1569, !1570, !1571, !1572}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1567, file: !57, line: 827, baseType: !962, size: 32, align: 32)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1567, file: !57, line: 828, baseType: !962, size: 32, align: 32, offset: 32)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1567, file: !57, line: 829, baseType: !962, size: 32, align: 32, offset: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1567, file: !57, line: 830, baseType: !1487, size: 32, align: 32, offset: 96)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1052, file: !57, line: 2430, baseType: !968, size: 64, align: 64, offset: 4032)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1052, file: !57, line: 2437, baseType: !968, size: 64, align: 64, offset: 4096)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1052, file: !57, line: 2444, baseType: !1487, size: 32, align: 32, offset: 4160)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1052, file: !57, line: 2451, baseType: !1487, size: 32, align: 32, offset: 4192)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1052, file: !57, line: 2458, baseType: !962, size: 32, align: 32, offset: 4224)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1052, file: !57, line: 2469, baseType: !962, size: 32, align: 32, offset: 4256)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1052, file: !57, line: 2475, baseType: !962, size: 32, align: 32, offset: 4288)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1052, file: !57, line: 2481, baseType: !962, size: 32, align: 32, offset: 4320)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1052, file: !57, line: 2485, baseType: !962, size: 32, align: 32, offset: 4352)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1052, file: !57, line: 2489, baseType: !962, size: 32, align: 32, offset: 4384)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1052, file: !57, line: 2493, baseType: !962, size: 32, align: 32, offset: 4416)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1052, file: !57, line: 2501, baseType: !962, size: 32, align: 32, offset: 4448)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1052, file: !57, line: 2506, baseType: !962, size: 32, align: 32, offset: 4480)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1052, file: !57, line: 2510, baseType: !962, size: 32, align: 32, offset: 4512)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1052, file: !57, line: 2514, baseType: !968, size: 64, align: 64, offset: 4544)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1052, file: !57, line: 2528, baseType: !1589, size: 64, align: 64, offset: 4608)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{null, !1051, !953, !962, !962}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1052, file: !57, line: 2534, baseType: !962, size: 32, align: 32, offset: 4672)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1052, file: !57, line: 2545, baseType: !962, size: 32, align: 32, offset: 4704)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1052, file: !57, line: 2547, baseType: !962, size: 32, align: 32, offset: 4736)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1052, file: !57, line: 2549, baseType: !962, size: 32, align: 32, offset: 4768)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1052, file: !57, line: 2551, baseType: !962, size: 32, align: 32, offset: 4800)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1052, file: !57, line: 2553, baseType: !962, size: 32, align: 32, offset: 4832)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1052, file: !57, line: 2555, baseType: !962, size: 32, align: 32, offset: 4864)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1052, file: !57, line: 2557, baseType: !962, size: 32, align: 32, offset: 4896)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1052, file: !57, line: 2559, baseType: !962, size: 32, align: 32, offset: 4928)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1052, file: !57, line: 2563, baseType: !962, size: 32, align: 32, offset: 4960)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1052, file: !57, line: 2571, baseType: !1172, size: 64, align: 64, offset: 4992)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1052, file: !57, line: 2579, baseType: !1172, size: 64, align: 64, offset: 5056)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1052, file: !57, line: 2586, baseType: !962, size: 32, align: 32, offset: 5120)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1052, file: !57, line: 2615, baseType: !962, size: 32, align: 32, offset: 5152)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1052, file: !57, line: 2627, baseType: !962, size: 32, align: 32, offset: 5184)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1052, file: !57, line: 2637, baseType: !962, size: 32, align: 32, offset: 5216)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1052, file: !57, line: 2681, baseType: !962, size: 32, align: 32, offset: 5248)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1052, file: !57, line: 2709, baseType: !968, size: 64, align: 64, offset: 5312)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1052, file: !57, line: 2716, baseType: !1611, size: 64, align: 64, offset: 5376)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1613)
!1613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1614)
!1614 = !{!1615, !1616, !1617, !1618, !1619, !1620, !1621, !1625, !1629, !1630, !1631, !1632, !1637, !1638, !1639, !1640, !1641}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1613, file: !57, line: 3642, baseType: !946, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1613, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1613, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1613, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1613, file: !57, line: 3669, baseType: !962, size: 32, align: 32, offset: 160)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1613, file: !57, line: 3682, baseType: !1311, size: 64, align: 64, offset: 192)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1613, file: !57, line: 3698, baseType: !1622, size: 64, align: 64, offset: 256)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!962, !1104, !1038, !1139}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1613, file: !57, line: 3712, baseType: !1626, size: 64, align: 64, offset: 320)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!962, !1104, !962, !1038, !1139}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1613, file: !57, line: 3726, baseType: !1622, size: 64, align: 64, offset: 384)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1613, file: !57, line: 3737, baseType: !1101, size: 64, align: 64, offset: 448)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1613, file: !57, line: 3746, baseType: !962, size: 32, align: 32, offset: 512)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1613, file: !57, line: 3757, baseType: !1633, size: 64, align: 64, offset: 576)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{null, !1636}
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1613, file: !57, line: 3766, baseType: !1101, size: 64, align: 64, offset: 640)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1613, file: !57, line: 3774, baseType: !1101, size: 64, align: 64, offset: 704)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1613, file: !57, line: 3780, baseType: !962, size: 32, align: 32, offset: 768)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1613, file: !57, line: 3785, baseType: !962, size: 32, align: 32, offset: 800)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1613, file: !57, line: 3795, baseType: !1642, size: 64, align: 64, offset: 832)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!962, !1104, !1185}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1052, file: !57, line: 2728, baseType: !953, size: 64, align: 64, offset: 5440)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1052, file: !57, line: 2735, baseType: !1238, size: 512, align: 64, offset: 5504)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1052, file: !57, line: 2742, baseType: !962, size: 32, align: 32, offset: 6016)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1052, file: !57, line: 2755, baseType: !962, size: 32, align: 32, offset: 6048)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1052, file: !57, line: 2776, baseType: !962, size: 32, align: 32, offset: 6080)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1052, file: !57, line: 2783, baseType: !962, size: 32, align: 32, offset: 6112)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1052, file: !57, line: 2791, baseType: !962, size: 32, align: 32, offset: 6144)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1052, file: !57, line: 2802, baseType: !1314, size: 64, align: 64, offset: 6208)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1052, file: !57, line: 2811, baseType: !962, size: 32, align: 32, offset: 6272)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1052, file: !57, line: 2821, baseType: !962, size: 32, align: 32, offset: 6304)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1052, file: !57, line: 2830, baseType: !962, size: 32, align: 32, offset: 6336)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1052, file: !57, line: 2840, baseType: !962, size: 32, align: 32, offset: 6368)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1052, file: !57, line: 2851, baseType: !1658, size: 64, align: 64, offset: 6400)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!962, !1051, !1661, !953, !1296, !962, !962}
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!962, !1051, !953}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1052, file: !57, line: 2871, baseType: !1665, size: 64, align: 64, offset: 6464)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!962, !1051, !1668, !953, !1296, !962}
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!962, !1051, !953, !962, !962}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1052, file: !57, line: 2878, baseType: !962, size: 32, align: 32, offset: 6528)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1052, file: !57, line: 2885, baseType: !962, size: 32, align: 32, offset: 6560)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1052, file: !57, line: 3005, baseType: !962, size: 32, align: 32, offset: 6592)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1052, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1052, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1052, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1052, file: !57, line: 3037, baseType: !1130, size: 64, align: 64, offset: 6720)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1052, file: !57, line: 3038, baseType: !962, size: 32, align: 32, offset: 6784)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1052, file: !57, line: 3050, baseType: !1084, size: 64, align: 64, offset: 6848)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1052, file: !57, line: 3065, baseType: !962, size: 32, align: 32, offset: 6912)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1052, file: !57, line: 3083, baseType: !962, size: 32, align: 32, offset: 6944)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1052, file: !57, line: 3092, baseType: !974, size: 64, align: 32, offset: 6976)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1052, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1052, file: !57, line: 3106, baseType: !974, size: 64, align: 32, offset: 7072)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1052, file: !57, line: 3113, baseType: !1686, size: 64, align: 64, offset: 7168)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1688)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1689)
!1689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1690)
!1690 = !{!1691, !1692, !1693, !1694, !1695, !1696, !1699}
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1689, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1689, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1689, file: !57, line: 720, baseType: !946, size: 64, align: 64, offset: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1689, file: !57, line: 724, baseType: !946, size: 64, align: 64, offset: 128)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1689, file: !57, line: 728, baseType: !962, size: 32, align: 32, offset: 192)
