; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--iff.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--iff.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!893 = !DIEnumerator(name: "MASK_LASSO", value: 3)
!894 = !{!895, !904, !905, !906, !910, !916, !917, !918, !943, !944, !947, !948, !949, !950}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !898, line: 222, size: 16, align: 8, elements: !899)
!898 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !897, file: !898, line: 222, baseType: !901, size: 16, align: 16)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !902, line: 49, baseType: !903)
!902 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!904 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!905 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !902, line: 48, baseType: !909)
!909 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !898, line: 221, size: 32, align: 8, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !912, file: !898, line: 221, baseType: !915, size: 32, align: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !902, line: 51, baseType: !904)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias64", file: !898, line: 34, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !898, line: 27, size: 64, align: 64, elements: !922)
!922 = !{!923, !926, !930, !934, !938, !940}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !921, file: !898, line: 28, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !902, line: 55, baseType: !925)
!925 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !921, file: !898, line: 29, baseType: !927, size: 64, align: 32)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 64, align: 32, elements: !928)
!928 = !{!929}
!929 = !DISubrange(count: 2)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !921, file: !898, line: 30, baseType: !931, size: 64, align: 16)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 64, align: 16, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 4)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !921, file: !898, line: 31, baseType: !935, size: 64, align: 8)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 64, align: 8, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "f64", scope: !921, file: !898, line: 32, baseType: !939, size: 64, align: 64)
!939 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !921, file: !898, line: 33, baseType: !941, size: 64, align: 32)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 64, align: 32, elements: !928)
!942 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !902, line: 36, baseType: !946)
!946 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!951 = !{!952, !1663, !1667}
!952 = distinct !DIGlobalVariable(name: "ff_iff_ilbm_decoder", scope: !0, file: !888, line: 1872, type: !953, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_iff_ilbm_decoder)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !955)
!955 = !{!956, !960, !961, !962, !963, !964, !973, !976, !979, !982, !985, !986, !1027, !1035, !1036, !1037, !1039, !1578, !1584, !1592, !1596, !1597, !1634, !1638, !1642, !1643, !1647, !1651, !1652, !1656, !1657, !1658}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !14, line: 3475, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !954, file: !14, line: 3480, baseType: !957, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !954, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !954, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !954, file: !14, line: 3487, baseType: !905, size: 32, align: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !954, file: !14, line: 3488, baseType: !965, size: 64, align: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !968, line: 61, baseType: !969)
!968 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !968, line: 58, size: 64, align: 32, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !969, file: !968, line: 59, baseType: !905, size: 32, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !969, file: !968, line: 60, baseType: !905, size: 32, align: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !954, file: !14, line: 3489, baseType: !974, size: 64, align: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !954, file: !14, line: 3490, baseType: !977, size: 64, align: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !954, file: !14, line: 3491, baseType: !980, size: 64, align: 64, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !954, file: !14, line: 3492, baseType: !983, size: 64, align: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !954, file: !14, line: 3493, baseType: !908, size: 8, align: 8, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !954, file: !14, line: 3494, baseType: !987, size: 64, align: 64, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !991)
!991 = !{!992, !993, !997, !1001, !1002, !1003, !1004, !1008, !1014, !1016, !1020}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !990, file: !691, line: 72, baseType: !957, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !990, file: !691, line: 78, baseType: !994, size: 64, align: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!957, !917}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !990, file: !691, line: 85, baseType: !998, size: 64, align: 64, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !990, file: !691, line: 93, baseType: !905, size: 32, align: 32, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !990, file: !691, line: 99, baseType: !905, size: 32, align: 32, offset: 224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !990, file: !691, line: 108, baseType: !905, size: 32, align: 32, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !990, file: !691, line: 113, baseType: !1005, size: 64, align: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!917, !917, !917}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !990, file: !691, line: 123, baseType: !1009, size: 64, align: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1012, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !990, file: !691, line: 130, baseType: !1015, size: 32, align: 32, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !990, file: !691, line: 136, baseType: !1017, size: 64, align: 64, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1015, !917}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !990, file: !691, line: 142, baseType: !1021, size: 64, align: 64, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!905, !1024, !917, !957, !905}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !954, file: !14, line: 3495, baseType: !1028, size: 64, align: 64, offset: 704)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1031)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1031, file: !14, line: 3402, baseType: !905, size: 32, align: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1031, file: !14, line: 3403, baseType: !957, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !954, file: !14, line: 3507, baseType: !957, size: 64, align: 64, offset: 768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !954, file: !14, line: 3516, baseType: !905, size: 32, align: 32, offset: 832)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !954, file: !14, line: 3517, baseType: !1038, size: 64, align: 64, offset: 896)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !954, file: !14, line: 3527, baseType: !1040, size: 64, align: 64, offset: 960)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!905, !1043}
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1053, !1054, !1055, !1056, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1330, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1516, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1045, file: !14, line: 1561, baseType: !987, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1045, file: !14, line: 1562, baseType: !905, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1045, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1045, file: !14, line: 1565, baseType: !1051, size: 64, align: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1045, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1045, file: !14, line: 1581, baseType: !904, size: 32, align: 32, offset: 224)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1045, file: !14, line: 1583, baseType: !917, size: 64, align: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1045, file: !14, line: 1591, baseType: !1057, size: 64, align: 64, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1059, line: 129, size: 1664, align: 64, elements: !1060)
!1059 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1060 = !{!1061, !1062, !1063, !1064, !1158, !1177, !1178, !1207, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1058, file: !1059, line: 136, baseType: !905, size: 32, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1058, file: !1059, line: 151, baseType: !905, size: 32, align: 32, offset: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1058, file: !1059, line: 157, baseType: !905, size: 32, align: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1058, file: !1059, line: 159, baseType: !1065, size: 64, align: 64, offset: 128)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1068)
!1068 = !{!1069, !1071, !1073, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1113, !1115, !1116, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1154, !1155, !1156, !1157}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1067, file: !722, line: 282, baseType: !1070, size: 512, align: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 512, align: 64, elements: !936)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1067, file: !722, line: 299, baseType: !1072, size: 256, align: 32, offset: 512)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 256, align: 32, elements: !936)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1067, file: !722, line: 315, baseType: !1074, size: 64, align: 64, offset: 768)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1067, file: !722, line: 326, baseType: !905, size: 32, align: 32, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1067, file: !722, line: 326, baseType: !905, size: 32, align: 32, offset: 864)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1067, file: !722, line: 334, baseType: !905, size: 32, align: 32, offset: 896)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1067, file: !722, line: 341, baseType: !905, size: 32, align: 32, offset: 928)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1067, file: !722, line: 346, baseType: !905, size: 32, align: 32, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1067, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1067, file: !722, line: 356, baseType: !967, size: 64, align: 32, offset: 1024)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1067, file: !722, line: 361, baseType: !1083, size: 64, align: 64, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !902, line: 40, baseType: !1084)
!1084 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1067, file: !722, line: 369, baseType: !1083, size: 64, align: 64, offset: 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1067, file: !722, line: 377, baseType: !1083, size: 64, align: 64, offset: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1067, file: !722, line: 382, baseType: !905, size: 32, align: 32, offset: 1280)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1067, file: !722, line: 386, baseType: !905, size: 32, align: 32, offset: 1312)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1067, file: !722, line: 391, baseType: !905, size: 32, align: 32, offset: 1344)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1067, file: !722, line: 396, baseType: !917, size: 64, align: 64, offset: 1408)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1067, file: !722, line: 403, baseType: !1092, size: 512, align: 64, offset: 1472)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 512, align: 64, elements: !936)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1067, file: !722, line: 410, baseType: !905, size: 32, align: 32, offset: 1984)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1067, file: !722, line: 415, baseType: !905, size: 32, align: 32, offset: 2016)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1067, file: !722, line: 420, baseType: !905, size: 32, align: 32, offset: 2048)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1067, file: !722, line: 425, baseType: !905, size: 32, align: 32, offset: 2080)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1067, file: !722, line: 435, baseType: !1083, size: 64, align: 64, offset: 2112)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1067, file: !722, line: 440, baseType: !905, size: 32, align: 32, offset: 2176)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1067, file: !722, line: 445, baseType: !924, size: 64, align: 64, offset: 2240)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1067, file: !722, line: 459, baseType: !1101, size: 512, align: 64, offset: 2304)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 512, align: 64, elements: !936)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1104, line: 94, baseType: !1105)
!1104 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1104, line: 81, size: 192, align: 64, elements: !1106)
!1106 = !{!1107, !1111, !1112}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1105, file: !1104, line: 82, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1104, line: 73, baseType: !1110)
!1110 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1104, line: 73, flags: DIFlagFwdDecl)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1105, file: !1104, line: 89, baseType: !949, size: 64, align: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !1104, line: 93, baseType: !905, size: 32, align: 32, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1067, file: !722, line: 473, baseType: !1114, size: 64, align: 64, offset: 2816)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1067, file: !722, line: 477, baseType: !905, size: 32, align: 32, offset: 2880)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1067, file: !722, line: 479, baseType: !1117, size: 64, align: 64, offset: 2944)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1130}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1120, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !722, line: 203, baseType: !949, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1120, file: !722, line: 204, baseType: !905, size: 32, align: 32, offset: 128)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1120, file: !722, line: 205, baseType: !1126, size: 64, align: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1128, line: 86, baseType: !1129)
!1128 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1128, line: 86, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1120, file: !722, line: 206, baseType: !1102, size: 64, align: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1067, file: !722, line: 480, baseType: !905, size: 32, align: 32, offset: 3008)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1067, file: !722, line: 505, baseType: !905, size: 32, align: 32, offset: 3040)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1067, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1067, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1067, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1067, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1067, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1067, file: !722, line: 532, baseType: !1083, size: 64, align: 64, offset: 3264)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1067, file: !722, line: 539, baseType: !1083, size: 64, align: 64, offset: 3328)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1067, file: !722, line: 547, baseType: !1083, size: 64, align: 64, offset: 3392)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1067, file: !722, line: 554, baseType: !1126, size: 64, align: 64, offset: 3456)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1067, file: !722, line: 563, baseType: !905, size: 32, align: 32, offset: 3520)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1067, file: !722, line: 572, baseType: !905, size: 32, align: 32, offset: 3552)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1067, file: !722, line: 581, baseType: !905, size: 32, align: 32, offset: 3584)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1067, file: !722, line: 588, baseType: !944, size: 64, align: 64, offset: 3648)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1067, file: !722, line: 593, baseType: !905, size: 32, align: 32, offset: 3712)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1067, file: !722, line: 596, baseType: !905, size: 32, align: 32, offset: 3744)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1067, file: !722, line: 599, baseType: !1102, size: 64, align: 64, offset: 3776)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1067, file: !722, line: 605, baseType: !1102, size: 64, align: 64, offset: 3840)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1067, file: !722, line: 616, baseType: !1102, size: 64, align: 64, offset: 3904)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1067, file: !722, line: 626, baseType: !1152, size: 64, align: 64, offset: 3968)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1153, line: 216, baseType: !925)
!1153 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1067, file: !722, line: 627, baseType: !1152, size: 64, align: 64, offset: 4032)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1067, file: !722, line: 628, baseType: !1152, size: 64, align: 64, offset: 4096)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1067, file: !722, line: 629, baseType: !1152, size: 64, align: 64, offset: 4160)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1067, file: !722, line: 645, baseType: !1102, size: 64, align: 64, offset: 4224)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1058, file: !1059, line: 161, baseType: !1159, size: 64, align: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1059, line: 117, baseType: !1161)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1059, line: 100, size: 832, align: 64, elements: !1162)
!1162 = !{!1163, !1168, !1169, !1170, !1171, !1172, !1174, !1175, !1176}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1161, file: !1059, line: 105, baseType: !1164, size: 256, align: 64)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 256, align: 64, elements: !932)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1104, line: 238, baseType: !1167)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1104, line: 238, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1161, file: !1059, line: 110, baseType: !905, size: 32, align: 32, offset: 256)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1161, file: !1059, line: 111, baseType: !905, size: 32, align: 32, offset: 288)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1161, file: !1059, line: 111, baseType: !905, size: 32, align: 32, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1161, file: !1059, line: 112, baseType: !1072, size: 256, align: 32, offset: 352)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1161, file: !1059, line: 113, baseType: !1173, size: 128, align: 32, offset: 608)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 128, align: 32, elements: !932)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1161, file: !1059, line: 114, baseType: !905, size: 32, align: 32, offset: 736)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1161, file: !1059, line: 115, baseType: !905, size: 32, align: 32, offset: 768)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1161, file: !1059, line: 116, baseType: !905, size: 32, align: 32, offset: 800)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1058, file: !1059, line: 163, baseType: !917, size: 64, align: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1058, file: !1059, line: 165, baseType: !1179, size: 128, align: 64, offset: 320)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1059, line: 122, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1059, line: 119, size: 128, align: 64, elements: !1181)
!1181 = !{!1182, !1206}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1180, file: !1059, line: 120, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1202, !1203, !1204, !1205}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !14, line: 1451, baseType: !1102, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1185, file: !14, line: 1461, baseType: !1083, size: 64, align: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1185, file: !14, line: 1467, baseType: !1083, size: 64, align: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !14, line: 1468, baseType: !949, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !14, line: 1469, baseType: !905, size: 32, align: 32, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1185, file: !14, line: 1470, baseType: !905, size: 32, align: 32, offset: 288)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1185, file: !14, line: 1474, baseType: !905, size: 32, align: 32, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1185, file: !14, line: 1479, baseType: !1195, size: 64, align: 64, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1197, file: !14, line: 1412, baseType: !949, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !14, line: 1413, baseType: !905, size: 32, align: 32, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1197, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1185, file: !14, line: 1480, baseType: !905, size: 32, align: 32, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1185, file: !14, line: 1486, baseType: !1083, size: 64, align: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1185, file: !14, line: 1488, baseType: !1083, size: 64, align: 64, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1185, file: !14, line: 1497, baseType: !1083, size: 64, align: 64, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1180, file: !1059, line: 121, baseType: !1065, size: 64, align: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1058, file: !1059, line: 166, baseType: !1208, size: 128, align: 64, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1059, line: 127, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1059, line: 124, size: 128, align: 64, elements: !1210)
!1210 = !{!1211, !1284}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1209, file: !1059, line: 125, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1242, !1246, !1247, !1281, !1282, !1283}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1215, file: !14, line: 5751, baseType: !987, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1215, file: !14, line: 5756, baseType: !1219, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1227, !1228, !1229, !1233, !1237, !1241}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1221, file: !14, line: 5797, baseType: !957, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1221, file: !14, line: 5804, baseType: !1225, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1221, file: !14, line: 5815, baseType: !987, size: 64, align: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1221, file: !14, line: 5825, baseType: !905, size: 32, align: 32, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1221, file: !14, line: 5826, baseType: !1230, size: 64, align: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!905, !1213}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1221, file: !14, line: 5827, baseType: !1234, size: 64, align: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{!905, !1213, !1183}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1221, file: !14, line: 5828, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{null, !1213}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1221, file: !14, line: 5829, baseType: !1238, size: 64, align: 64, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1215, file: !14, line: 5762, baseType: !1243, size: 64, align: 64, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1245)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1215, file: !14, line: 5768, baseType: !917, size: 64, align: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1215, file: !14, line: 5775, baseType: !1248, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1250, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1250, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1250, file: !14, line: 3948, baseType: !915, size: 32, align: 32, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1250, file: !14, line: 3958, baseType: !949, size: 64, align: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1250, file: !14, line: 3962, baseType: !905, size: 32, align: 32, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1250, file: !14, line: 3968, baseType: !905, size: 32, align: 32, offset: 224)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1250, file: !14, line: 3973, baseType: !1083, size: 64, align: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1250, file: !14, line: 3986, baseType: !905, size: 32, align: 32, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1250, file: !14, line: 3999, baseType: !905, size: 32, align: 32, offset: 352)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1250, file: !14, line: 4004, baseType: !905, size: 32, align: 32, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1250, file: !14, line: 4005, baseType: !905, size: 32, align: 32, offset: 416)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1250, file: !14, line: 4010, baseType: !905, size: 32, align: 32, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1250, file: !14, line: 4011, baseType: !905, size: 32, align: 32, offset: 480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1250, file: !14, line: 4020, baseType: !967, size: 64, align: 32, offset: 512)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1250, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1250, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1250, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1250, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1250, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1250, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1250, file: !14, line: 4039, baseType: !905, size: 32, align: 32, offset: 768)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1250, file: !14, line: 4046, baseType: !924, size: 64, align: 64, offset: 832)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1250, file: !14, line: 4050, baseType: !905, size: 32, align: 32, offset: 896)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1250, file: !14, line: 4054, baseType: !905, size: 32, align: 32, offset: 928)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1250, file: !14, line: 4061, baseType: !905, size: 32, align: 32, offset: 960)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1250, file: !14, line: 4065, baseType: !905, size: 32, align: 32, offset: 992)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1250, file: !14, line: 4073, baseType: !905, size: 32, align: 32, offset: 1024)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1250, file: !14, line: 4080, baseType: !905, size: 32, align: 32, offset: 1056)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1250, file: !14, line: 4084, baseType: !905, size: 32, align: 32, offset: 1088)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1215, file: !14, line: 5781, baseType: !1248, size: 64, align: 64, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1215, file: !14, line: 5787, baseType: !967, size: 64, align: 32, offset: 384)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1215, file: !14, line: 5793, baseType: !967, size: 64, align: 32, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1209, file: !1059, line: 126, baseType: !905, size: 32, align: 32, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1058, file: !1059, line: 172, baseType: !1183, size: 64, align: 64, offset: 576)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1058, file: !1059, line: 177, baseType: !949, size: 64, align: 64, offset: 640)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1058, file: !1059, line: 178, baseType: !904, size: 32, align: 32, offset: 704)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1058, file: !1059, line: 180, baseType: !917, size: 64, align: 64, offset: 768)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1058, file: !1059, line: 185, baseType: !905, size: 32, align: 32, offset: 832)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1058, file: !1059, line: 190, baseType: !917, size: 64, align: 64, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1058, file: !1059, line: 195, baseType: !905, size: 32, align: 32, offset: 960)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1058, file: !1059, line: 200, baseType: !1183, size: 64, align: 64, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1058, file: !1059, line: 201, baseType: !905, size: 32, align: 32, offset: 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1058, file: !1059, line: 202, baseType: !1065, size: 64, align: 64, offset: 1152)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1058, file: !1059, line: 203, baseType: !905, size: 32, align: 32, offset: 1216)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1058, file: !1059, line: 205, baseType: !905, size: 32, align: 32, offset: 1248)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1058, file: !1059, line: 206, baseType: !905, size: 32, align: 32, offset: 1280)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1058, file: !1059, line: 209, baseType: !1152, size: 64, align: 64, offset: 1344)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1058, file: !1059, line: 212, baseType: !1152, size: 64, align: 64, offset: 1408)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1058, file: !1059, line: 213, baseType: !1065, size: 64, align: 64, offset: 1472)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1058, file: !1059, line: 215, baseType: !905, size: 32, align: 32, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1058, file: !1059, line: 217, baseType: !905, size: 32, align: 32, offset: 1568)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1058, file: !1059, line: 220, baseType: !905, size: 32, align: 32, offset: 1600)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1045, file: !14, line: 1598, baseType: !917, size: 64, align: 64, offset: 384)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1045, file: !14, line: 1606, baseType: !1083, size: 64, align: 64, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1045, file: !14, line: 1614, baseType: !905, size: 32, align: 32, offset: 512)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1045, file: !14, line: 1622, baseType: !905, size: 32, align: 32, offset: 544)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1045, file: !14, line: 1628, baseType: !905, size: 32, align: 32, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1045, file: !14, line: 1636, baseType: !905, size: 32, align: 32, offset: 608)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1045, file: !14, line: 1643, baseType: !905, size: 32, align: 32, offset: 640)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1045, file: !14, line: 1657, baseType: !949, size: 64, align: 64, offset: 704)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1045, file: !14, line: 1658, baseType: !905, size: 32, align: 32, offset: 768)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1045, file: !14, line: 1679, baseType: !967, size: 64, align: 32, offset: 800)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1045, file: !14, line: 1688, baseType: !905, size: 32, align: 32, offset: 864)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1045, file: !14, line: 1712, baseType: !905, size: 32, align: 32, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1045, file: !14, line: 1729, baseType: !905, size: 32, align: 32, offset: 928)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1045, file: !14, line: 1729, baseType: !905, size: 32, align: 32, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1045, file: !14, line: 1744, baseType: !905, size: 32, align: 32, offset: 992)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1045, file: !14, line: 1744, baseType: !905, size: 32, align: 32, offset: 1024)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1045, file: !14, line: 1751, baseType: !905, size: 32, align: 32, offset: 1056)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1045, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1045, file: !14, line: 1791, baseType: !1323, size: 64, align: 64, offset: 1152)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{null, !1326, !1327, !1329, !905, !905, !905}
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1045, file: !14, line: 1808, baseType: !1331, size: 64, align: 64, offset: 1216)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!473, !1326, !974}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1045, file: !14, line: 1816, baseType: !905, size: 32, align: 32, offset: 1280)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1045, file: !14, line: 1825, baseType: !942, size: 32, align: 32, offset: 1312)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1045, file: !14, line: 1830, baseType: !905, size: 32, align: 32, offset: 1344)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1045, file: !14, line: 1838, baseType: !942, size: 32, align: 32, offset: 1376)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1045, file: !14, line: 1846, baseType: !905, size: 32, align: 32, offset: 1408)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1045, file: !14, line: 1851, baseType: !905, size: 32, align: 32, offset: 1440)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1045, file: !14, line: 1861, baseType: !942, size: 32, align: 32, offset: 1472)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1045, file: !14, line: 1868, baseType: !942, size: 32, align: 32, offset: 1504)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1045, file: !14, line: 1875, baseType: !942, size: 32, align: 32, offset: 1536)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1045, file: !14, line: 1882, baseType: !942, size: 32, align: 32, offset: 1568)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1045, file: !14, line: 1889, baseType: !942, size: 32, align: 32, offset: 1600)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1045, file: !14, line: 1896, baseType: !942, size: 32, align: 32, offset: 1632)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1045, file: !14, line: 1903, baseType: !942, size: 32, align: 32, offset: 1664)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1045, file: !14, line: 1910, baseType: !905, size: 32, align: 32, offset: 1696)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1045, file: !14, line: 1915, baseType: !905, size: 32, align: 32, offset: 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1045, file: !14, line: 1926, baseType: !1329, size: 64, align: 64, offset: 1792)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1045, file: !14, line: 1935, baseType: !967, size: 64, align: 32, offset: 1856)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1045, file: !14, line: 1942, baseType: !905, size: 32, align: 32, offset: 1920)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1045, file: !14, line: 1948, baseType: !905, size: 32, align: 32, offset: 1952)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1045, file: !14, line: 1954, baseType: !905, size: 32, align: 32, offset: 1984)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1045, file: !14, line: 1960, baseType: !905, size: 32, align: 32, offset: 2016)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1045, file: !14, line: 1984, baseType: !905, size: 32, align: 32, offset: 2048)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1045, file: !14, line: 1991, baseType: !905, size: 32, align: 32, offset: 2080)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1045, file: !14, line: 1996, baseType: !905, size: 32, align: 32, offset: 2112)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1045, file: !14, line: 2004, baseType: !905, size: 32, align: 32, offset: 2144)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1045, file: !14, line: 2011, baseType: !905, size: 32, align: 32, offset: 2176)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1045, file: !14, line: 2018, baseType: !905, size: 32, align: 32, offset: 2208)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1045, file: !14, line: 2027, baseType: !905, size: 32, align: 32, offset: 2240)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1045, file: !14, line: 2034, baseType: !905, size: 32, align: 32, offset: 2272)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1045, file: !14, line: 2044, baseType: !905, size: 32, align: 32, offset: 2304)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1045, file: !14, line: 2054, baseType: !947, size: 64, align: 64, offset: 2368)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1045, file: !14, line: 2061, baseType: !947, size: 64, align: 64, offset: 2432)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1045, file: !14, line: 2066, baseType: !905, size: 32, align: 32, offset: 2496)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1045, file: !14, line: 2070, baseType: !905, size: 32, align: 32, offset: 2528)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1045, file: !14, line: 2078, baseType: !905, size: 32, align: 32, offset: 2560)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1045, file: !14, line: 2085, baseType: !905, size: 32, align: 32, offset: 2592)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1045, file: !14, line: 2092, baseType: !905, size: 32, align: 32, offset: 2624)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1045, file: !14, line: 2099, baseType: !905, size: 32, align: 32, offset: 2656)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1045, file: !14, line: 2106, baseType: !905, size: 32, align: 32, offset: 2688)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1045, file: !14, line: 2113, baseType: !905, size: 32, align: 32, offset: 2720)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1045, file: !14, line: 2120, baseType: !905, size: 32, align: 32, offset: 2752)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1045, file: !14, line: 2125, baseType: !905, size: 32, align: 32, offset: 2784)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1045, file: !14, line: 2133, baseType: !905, size: 32, align: 32, offset: 2816)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1045, file: !14, line: 2140, baseType: !905, size: 32, align: 32, offset: 2848)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1045, file: !14, line: 2145, baseType: !905, size: 32, align: 32, offset: 2880)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1045, file: !14, line: 2153, baseType: !905, size: 32, align: 32, offset: 2912)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1045, file: !14, line: 2158, baseType: !905, size: 32, align: 32, offset: 2944)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1045, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1045, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1045, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1045, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1045, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1045, file: !14, line: 2203, baseType: !905, size: 32, align: 32, offset: 3136)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1045, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1045, file: !14, line: 2212, baseType: !905, size: 32, align: 32, offset: 3200)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1045, file: !14, line: 2213, baseType: !905, size: 32, align: 32, offset: 3232)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1045, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1045, file: !14, line: 2232, baseType: !905, size: 32, align: 32, offset: 3296)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1045, file: !14, line: 2243, baseType: !905, size: 32, align: 32, offset: 3328)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1045, file: !14, line: 2249, baseType: !905, size: 32, align: 32, offset: 3360)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1045, file: !14, line: 2256, baseType: !905, size: 32, align: 32, offset: 3392)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1045, file: !14, line: 2263, baseType: !924, size: 64, align: 64, offset: 3456)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1045, file: !14, line: 2270, baseType: !924, size: 64, align: 64, offset: 3520)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1045, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1045, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1045, file: !14, line: 2367, baseType: !1400, size: 64, align: 64, offset: 3648)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!905, !1326, !1065, !905}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1045, file: !14, line: 2383, baseType: !905, size: 32, align: 32, offset: 3712)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1045, file: !14, line: 2386, baseType: !942, size: 32, align: 32, offset: 3744)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1045, file: !14, line: 2387, baseType: !942, size: 32, align: 32, offset: 3776)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1045, file: !14, line: 2394, baseType: !905, size: 32, align: 32, offset: 3808)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1045, file: !14, line: 2401, baseType: !905, size: 32, align: 32, offset: 3840)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1045, file: !14, line: 2408, baseType: !905, size: 32, align: 32, offset: 3872)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1045, file: !14, line: 2415, baseType: !905, size: 32, align: 32, offset: 3904)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1045, file: !14, line: 2422, baseType: !905, size: 32, align: 32, offset: 3936)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1045, file: !14, line: 2423, baseType: !1412, size: 64, align: 64, offset: 3968)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1414, file: !14, line: 827, baseType: !905, size: 32, align: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1414, file: !14, line: 828, baseType: !905, size: 32, align: 32, offset: 32)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1414, file: !14, line: 829, baseType: !905, size: 32, align: 32, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1414, file: !14, line: 830, baseType: !942, size: 32, align: 32, offset: 96)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1045, file: !14, line: 2430, baseType: !1083, size: 64, align: 64, offset: 4032)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1045, file: !14, line: 2437, baseType: !1083, size: 64, align: 64, offset: 4096)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1045, file: !14, line: 2444, baseType: !942, size: 32, align: 32, offset: 4160)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1045, file: !14, line: 2451, baseType: !942, size: 32, align: 32, offset: 4192)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1045, file: !14, line: 2458, baseType: !905, size: 32, align: 32, offset: 4224)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1045, file: !14, line: 2469, baseType: !905, size: 32, align: 32, offset: 4256)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1045, file: !14, line: 2475, baseType: !905, size: 32, align: 32, offset: 4288)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1045, file: !14, line: 2481, baseType: !905, size: 32, align: 32, offset: 4320)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1045, file: !14, line: 2485, baseType: !905, size: 32, align: 32, offset: 4352)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1045, file: !14, line: 2489, baseType: !905, size: 32, align: 32, offset: 4384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1045, file: !14, line: 2493, baseType: !905, size: 32, align: 32, offset: 4416)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1045, file: !14, line: 2501, baseType: !905, size: 32, align: 32, offset: 4448)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1045, file: !14, line: 2506, baseType: !905, size: 32, align: 32, offset: 4480)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1045, file: !14, line: 2510, baseType: !905, size: 32, align: 32, offset: 4512)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1045, file: !14, line: 2514, baseType: !1083, size: 64, align: 64, offset: 4544)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1045, file: !14, line: 2528, baseType: !1436, size: 64, align: 64, offset: 4608)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DISubroutineType(types: !1438)
!1438 = !{null, !1326, !917, !905, !905}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1045, file: !14, line: 2534, baseType: !905, size: 32, align: 32, offset: 4672)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1045, file: !14, line: 2545, baseType: !905, size: 32, align: 32, offset: 4704)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1045, file: !14, line: 2547, baseType: !905, size: 32, align: 32, offset: 4736)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1045, file: !14, line: 2549, baseType: !905, size: 32, align: 32, offset: 4768)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1045, file: !14, line: 2551, baseType: !905, size: 32, align: 32, offset: 4800)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1045, file: !14, line: 2553, baseType: !905, size: 32, align: 32, offset: 4832)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1045, file: !14, line: 2555, baseType: !905, size: 32, align: 32, offset: 4864)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1045, file: !14, line: 2557, baseType: !905, size: 32, align: 32, offset: 4896)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1045, file: !14, line: 2559, baseType: !905, size: 32, align: 32, offset: 4928)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1045, file: !14, line: 2563, baseType: !905, size: 32, align: 32, offset: 4960)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1045, file: !14, line: 2571, baseType: !1450, size: 64, align: 64, offset: 4992)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1045, file: !14, line: 2579, baseType: !1450, size: 64, align: 64, offset: 5056)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1045, file: !14, line: 2586, baseType: !905, size: 32, align: 32, offset: 5120)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1045, file: !14, line: 2615, baseType: !905, size: 32, align: 32, offset: 5152)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1045, file: !14, line: 2627, baseType: !905, size: 32, align: 32, offset: 5184)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1045, file: !14, line: 2637, baseType: !905, size: 32, align: 32, offset: 5216)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1045, file: !14, line: 2681, baseType: !905, size: 32, align: 32, offset: 5248)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1045, file: !14, line: 2709, baseType: !1083, size: 64, align: 64, offset: 5312)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1045, file: !14, line: 2716, baseType: !1459, size: 64, align: 64, offset: 5376)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1461)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1467, !1468, !1472, !1476, !1480, !1481, !1482, !1483, !1489, !1490, !1491, !1492, !1493}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1461, file: !14, line: 3642, baseType: !957, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1461, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1461, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1461, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1461, file: !14, line: 3669, baseType: !905, size: 32, align: 32, offset: 160)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1461, file: !14, line: 3682, baseType: !1469, size: 64, align: 64, offset: 192)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64, align: 64)
!1470 = !DISubroutineType(types: !1471)
!1471 = !{!905, !1043, !1065}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1461, file: !14, line: 3698, baseType: !1473, size: 64, align: 64, offset: 256)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{!905, !1043, !906, !915}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1461, file: !14, line: 3712, baseType: !1477, size: 64, align: 64, offset: 320)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!905, !1043, !905, !906, !915}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1461, file: !14, line: 3726, baseType: !1473, size: 64, align: 64, offset: 384)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1461, file: !14, line: 3737, baseType: !1040, size: 64, align: 64, offset: 448)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1461, file: !14, line: 3746, baseType: !905, size: 32, align: 32, offset: 512)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1461, file: !14, line: 3757, baseType: !1484, size: 64, align: 64, offset: 576)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{null, !1487}
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1461, file: !14, line: 3766, baseType: !1040, size: 64, align: 64, offset: 640)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1461, file: !14, line: 3774, baseType: !1040, size: 64, align: 64, offset: 704)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1461, file: !14, line: 3780, baseType: !905, size: 32, align: 32, offset: 768)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1461, file: !14, line: 3785, baseType: !905, size: 32, align: 32, offset: 800)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1461, file: !14, line: 3795, baseType: !1494, size: 64, align: 64, offset: 832)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!905, !1043, !1102}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1045, file: !14, line: 2728, baseType: !917, size: 64, align: 64, offset: 5440)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1045, file: !14, line: 2735, baseType: !1092, size: 512, align: 64, offset: 5504)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1045, file: !14, line: 2742, baseType: !905, size: 32, align: 32, offset: 6016)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1045, file: !14, line: 2755, baseType: !905, size: 32, align: 32, offset: 6048)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1045, file: !14, line: 2776, baseType: !905, size: 32, align: 32, offset: 6080)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1045, file: !14, line: 2783, baseType: !905, size: 32, align: 32, offset: 6112)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1045, file: !14, line: 2791, baseType: !905, size: 32, align: 32, offset: 6144)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1045, file: !14, line: 2802, baseType: !1065, size: 64, align: 64, offset: 6208)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1045, file: !14, line: 2811, baseType: !905, size: 32, align: 32, offset: 6272)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1045, file: !14, line: 2821, baseType: !905, size: 32, align: 32, offset: 6304)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1045, file: !14, line: 2830, baseType: !905, size: 32, align: 32, offset: 6336)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1045, file: !14, line: 2840, baseType: !905, size: 32, align: 32, offset: 6368)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1045, file: !14, line: 2851, baseType: !1510, size: 64, align: 64, offset: 6400)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!905, !1326, !1513, !917, !1329, !905, !905}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!905, !1326, !917}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1045, file: !14, line: 2871, baseType: !1517, size: 64, align: 64, offset: 6464)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!905, !1326, !1520, !917, !1329, !905}
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!905, !1326, !917, !905, !905}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1045, file: !14, line: 2878, baseType: !905, size: 32, align: 32, offset: 6528)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1045, file: !14, line: 2885, baseType: !905, size: 32, align: 32, offset: 6560)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1045, file: !14, line: 3005, baseType: !905, size: 32, align: 32, offset: 6592)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1045, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1045, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1045, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1045, file: !14, line: 3037, baseType: !949, size: 64, align: 64, offset: 6720)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1045, file: !14, line: 3038, baseType: !905, size: 32, align: 32, offset: 6784)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1045, file: !14, line: 3050, baseType: !924, size: 64, align: 64, offset: 6848)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1045, file: !14, line: 3065, baseType: !905, size: 32, align: 32, offset: 6912)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1045, file: !14, line: 3083, baseType: !905, size: 32, align: 32, offset: 6944)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1045, file: !14, line: 3092, baseType: !967, size: 64, align: 32, offset: 6976)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1045, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1045, file: !14, line: 3106, baseType: !967, size: 64, align: 32, offset: 7072)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1045, file: !14, line: 3113, baseType: !1538, size: 64, align: 64, offset: 7168)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1540)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1541)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1542)
!1542 = !{!1543, !1544, !1545, !1546, !1547, !1548, !1551}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1541, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1541, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1541, file: !14, line: 720, baseType: !957, size: 64, align: 64, offset: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1541, file: !14, line: 724, baseType: !957, size: 64, align: 64, offset: 128)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1541, file: !14, line: 728, baseType: !905, size: 32, align: 32, offset: 192)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1541, file: !14, line: 734, baseType: !1549, size: 64, align: 64, offset: 256)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1541, file: !14, line: 739, baseType: !1552, size: 64, align: 64, offset: 320)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1045, file: !14, line: 3129, baseType: !1083, size: 64, align: 64, offset: 7232)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1045, file: !14, line: 3130, baseType: !1083, size: 64, align: 64, offset: 7296)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1045, file: !14, line: 3131, baseType: !1083, size: 64, align: 64, offset: 7360)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1045, file: !14, line: 3132, baseType: !1083, size: 64, align: 64, offset: 7424)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1045, file: !14, line: 3139, baseType: !1450, size: 64, align: 64, offset: 7488)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1045, file: !14, line: 3147, baseType: !905, size: 32, align: 32, offset: 7552)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1045, file: !14, line: 3165, baseType: !905, size: 32, align: 32, offset: 7584)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1045, file: !14, line: 3172, baseType: !905, size: 32, align: 32, offset: 7616)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1045, file: !14, line: 3180, baseType: !905, size: 32, align: 32, offset: 7648)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1045, file: !14, line: 3191, baseType: !947, size: 64, align: 64, offset: 7680)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1045, file: !14, line: 3199, baseType: !949, size: 64, align: 64, offset: 7744)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1045, file: !14, line: 3207, baseType: !1450, size: 64, align: 64, offset: 7808)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1045, file: !14, line: 3214, baseType: !904, size: 32, align: 32, offset: 7872)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1045, file: !14, line: 3224, baseType: !1195, size: 64, align: 64, offset: 7936)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1045, file: !14, line: 3225, baseType: !905, size: 32, align: 32, offset: 8000)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1045, file: !14, line: 3249, baseType: !1102, size: 64, align: 64, offset: 8064)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1045, file: !14, line: 3256, baseType: !905, size: 32, align: 32, offset: 8128)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1045, file: !14, line: 3271, baseType: !905, size: 32, align: 32, offset: 8160)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1045, file: !14, line: 3279, baseType: !1083, size: 64, align: 64, offset: 8192)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1045, file: !14, line: 3301, baseType: !1102, size: 64, align: 64, offset: 8256)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1045, file: !14, line: 3310, baseType: !905, size: 32, align: 32, offset: 8320)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1045, file: !14, line: 3337, baseType: !905, size: 32, align: 32, offset: 8352)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1045, file: !14, line: 3351, baseType: !905, size: 32, align: 32, offset: 8384)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1045, file: !14, line: 3359, baseType: !905, size: 32, align: 32, offset: 8416)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !954, file: !14, line: 3535, baseType: !1579, size: 64, align: 64, offset: 1024)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{!905, !1043, !1582}
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !954, file: !14, line: 3541, baseType: !1585, size: 64, align: 64, offset: 1088)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1586, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1587)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1059, line: 223, size: 128, align: 64, elements: !1589)
!1589 = !{!1590, !1591}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1588, file: !1059, line: 224, baseType: !906, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1588, file: !1059, line: 225, baseType: !906, size: 64, align: 64, offset: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !954, file: !14, line: 3549, baseType: !1593, size: 64, align: 64, offset: 1152)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1038}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !954, file: !14, line: 3551, baseType: !1040, size: 64, align: 64, offset: 1216)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !954, file: !14, line: 3552, baseType: !1598, size: 64, align: 64, offset: 1280)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{!905, !1043, !949, !905, !1601}
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1603)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1604)
!1604 = !{!1605, !1606, !1607, !1608, !1609, !1633}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1603, file: !14, line: 3921, baseType: !901, size: 16, align: 16)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1603, file: !14, line: 3922, baseType: !915, size: 32, align: 32, offset: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1603, file: !14, line: 3923, baseType: !915, size: 32, align: 32, offset: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1603, file: !14, line: 3924, baseType: !904, size: 32, align: 32, offset: 96)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1603, file: !14, line: 3925, baseType: !1610, size: 64, align: 64, offset: 128)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1613)
!1613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1614)
!1614 = !{!1615, !1616, !1617, !1618, !1619, !1620, !1626, !1628, !1629, !1630, !1631, !1632}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1613, file: !14, line: 3886, baseType: !905, size: 32, align: 32)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1613, file: !14, line: 3887, baseType: !905, size: 32, align: 32, offset: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1613, file: !14, line: 3888, baseType: !905, size: 32, align: 32, offset: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1613, file: !14, line: 3889, baseType: !905, size: 32, align: 32, offset: 96)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1613, file: !14, line: 3890, baseType: !905, size: 32, align: 32, offset: 128)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1613, file: !14, line: 3897, baseType: !1621, size: 768, align: 64, offset: 192)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1623)
!1623 = !{!1624, !1625}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1622, file: !14, line: 3855, baseType: !1070, size: 512, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1622, file: !14, line: 3857, baseType: !1072, size: 256, align: 32, offset: 512)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1613, file: !14, line: 3903, baseType: !1627, size: 256, align: 64, offset: 960)
!1627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 64, elements: !932)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1613, file: !14, line: 3904, baseType: !1173, size: 128, align: 32, offset: 1216)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1613, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1613, file: !14, line: 3908, baseType: !1450, size: 64, align: 64, offset: 1408)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1613, file: !14, line: 3915, baseType: !1450, size: 64, align: 64, offset: 1472)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1613, file: !14, line: 3917, baseType: !905, size: 32, align: 32, offset: 1536)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1603, file: !14, line: 3926, baseType: !1083, size: 64, align: 64, offset: 192)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !954, file: !14, line: 3564, baseType: !1635, size: 64, align: 64, offset: 1344)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{!905, !1043, !1183, !1327, !1329}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !954, file: !14, line: 3566, baseType: !1639, size: 64, align: 64, offset: 1408)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!905, !1043, !917, !1329, !1183}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !954, file: !14, line: 3567, baseType: !1040, size: 64, align: 64, offset: 1472)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !954, file: !14, line: 3576, baseType: !1644, size: 64, align: 64, offset: 1536)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!905, !1043, !1327}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !954, file: !14, line: 3577, baseType: !1648, size: 64, align: 64, offset: 1600)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!905, !1043, !1183}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !954, file: !14, line: 3584, baseType: !1469, size: 64, align: 64, offset: 1664)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !954, file: !14, line: 3589, baseType: !1653, size: 64, align: 64, offset: 1728)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{null, !1043}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !954, file: !14, line: 3594, baseType: !905, size: 32, align: 32, offset: 1792)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !954, file: !14, line: 3600, baseType: !957, size: 64, align: 64, offset: 1856)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !954, file: !14, line: 3609, baseType: !1659, size: 64, align: 64, offset: 1920)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1662)
!1662 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1663 = distinct !DIGlobalVariable(name: "plane8_lut", scope: !0, file: !888, line: 109, type: !1664, isLocal: true, isDefinition: true, variable: [8 x [256 x i64]]* @plane8_lut)
!1664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 131072, align: 64, elements: !1665)
!1665 = !{!937, !1666}
!1666 = !DISubrange(count: 256)
!1667 = distinct !DIGlobalVariable(name: "plane32_lut", scope: !0, file: !888, line: 134, type: !1668, isLocal: true, isDefinition: true, variable: [32 x [64 x i32]]* @plane32_lut)
!1668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1669, size: 65536, align: 32, elements: !1670)
!1669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!1670 = !{!1671, !1672}
!1671 = !DISubrange(count: 32)
!1672 = !DISubrange(count: 64)
!1673 = !{i32 2, !"Dwarf Version", i32 4}
!1674 = !{i32 2, !"Debug Info Version", i32 3}
!1675 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1676 = distinct !DISubprogram(name: "decode_init", scope: !888, file: !888, line: 380, type: !1041, isLocal: true, isDefinition: true, scopeLine: 381, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1677)
!1677 = !{}
!1678 = !DILocalVariable(name: "x", arg: 1, scope: !1679, file: !1680, line: 58, type: !901)
!1679 = distinct !DISubprogram(name: "av_bswap16", scope: !1680, file: !1680, line: 58, type: !1681, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1677)
!1680 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!901, !901}
!1683 = !DIExpression()
!1684 = !DILocation(line: 58, column: 98, scope: !1679, inlinedAt: !1685)
!1685 = distinct !DILocation(line: 389, column: 52, scope: !1686)
!1686 = distinct !DILexicalBlock(scope: !1687, file: !888, line: 388, column: 13)
!1687 = distinct !DILexicalBlock(scope: !1688, file: !888, line: 385, column: 44)
!1688 = distinct !DILexicalBlock(scope: !1676, file: !888, line: 385, column: 9)
!1689 = !DILocalVariable(name: "avctx", arg: 1, scope: !1676, file: !888, line: 380, type: !1043)
!1690 = !DILocation(line: 380, column: 62, scope: !1676)
!1691 = !DILocalVariable(name: "s", scope: !1676, file: !888, line: 382, type: !1692)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "IffContext", file: !888, line: 69, baseType: !1694)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IffContext", file: !888, line: 46, size: 1472, align: 64, elements: !1695)
