; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg12.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg12.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }

!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !57, line: 5085, size: 32, align: 32, elements: !926)
!926 = !{!927, !928, !929, !930}
!927 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!928 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!931 = !{!932, !933, !934, !935, !943, !941, !945}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!933 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!934 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !938, line: 221, size: 32, align: 8, elements: !939)
!938 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !937, file: !938, line: 221, baseType: !941, size: 32, align: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !942, line: 51, baseType: !934)
!942 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !944, line: 196, baseType: !933)
!944 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !942, line: 48, baseType: !946)
!946 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!947 = !{!948, !954, !961, !965, !969, !973, !974, !978, !979, !992, !996, !1000, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1022}
!948 = distinct !DIGlobalVariable(name: "done", scope: !949, file: !950, line: 139, type: !933, isLocal: true, isDefinition: true, variable: i32* @ff_mpeg12_init_vlcs.done)
!949 = distinct !DISubprogram(name: "ff_mpeg12_init_vlcs", scope: !950, file: !950, line: 137, type: !951, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !953)
!950 = !DIFile(filename: "libavcodec/mpeg12.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !DISubroutineType(types: !952)
!952 = !{null}
!953 = !{}
!954 = distinct !DIGlobalVariable(name: "table", scope: !949, file: !950, line: 144, type: !955, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_mpeg12_init_vlcs.table)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 16384, align: 16, elements: !958)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !944, line: 195, baseType: !957)
!957 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!958 = !{!959, !960}
!959 = !DISubrange(count: 512)
!960 = !DISubrange(count: 2)
!961 = distinct !DIGlobalVariable(name: "table", scope: !949, file: !950, line: 147, type: !962, isLocal: true, isDefinition: true, variable: [514 x [2 x i16]]* @ff_mpeg12_init_vlcs.table.3)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 16448, align: 16, elements: !963)
!963 = !{!964, !960}
!964 = !DISubrange(count: 514)
!965 = distinct !DIGlobalVariable(name: "table", scope: !949, file: !950, line: 150, type: !966, isLocal: true, isDefinition: true, variable: [518 x [2 x i16]]* @ff_mpeg12_init_vlcs.table.4)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 16576, align: 16, elements: !967)
!967 = !{!968, !960}
!968 = !DISubrange(count: 518)
!969 = distinct !DIGlobalVariable(name: "table", scope: !949, file: !950, line: 153, type: !970, isLocal: true, isDefinition: true, variable: [538 x [2 x i16]]* @ff_mpeg12_init_vlcs.table.5)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 17216, align: 16, elements: !971)
!971 = !{!972, !960}
!972 = !DISubrange(count: 538)
!973 = distinct !DIGlobalVariable(name: "table", scope: !949, file: !950, line: 156, type: !955, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @ff_mpeg12_init_vlcs.table.6)
!974 = distinct !DIGlobalVariable(name: "table", scope: !949, file: !950, line: 160, type: !975, isLocal: true, isDefinition: true, variable: [64 x [2 x i16]]* @ff_mpeg12_init_vlcs.table.7)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 2048, align: 16, elements: !976)
!976 = !{!977, !960}
!977 = !DISubrange(count: 64)
!978 = distinct !DIGlobalVariable(name: "table", scope: !949, file: !950, line: 163, type: !975, isLocal: true, isDefinition: true, variable: [64 x [2 x i16]]* @ff_mpeg12_init_vlcs.table.8)
!979 = distinct !DIGlobalVariable(name: "rl_vlc_table", scope: !949, file: !950, line: 169, type: !980, isLocal: true, isDefinition: true, variable: [680 x %struct.RL_VLC_ELEM]* @ff_mpeg12_init_vlcs.rl_vlc_table)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 21760, align: 16, elements: !990)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "RL_VLC_ELEM", file: !982, line: 36, baseType: !983)
!982 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RL_VLC_ELEM", file: !982, line: 32, size: 32, align: 16, elements: !984)
!984 = !{!985, !986, !989}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !983, file: !982, line: 33, baseType: !956, size: 16, align: 16)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !983, file: !982, line: 34, baseType: !987, size: 8, align: 8, offset: 16)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !944, line: 194, baseType: !988)
!988 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !983, file: !982, line: 35, baseType: !945, size: 8, align: 8, offset: 24)
!990 = !{!991}
!991 = !DISubrange(count: 680)
!992 = distinct !DIGlobalVariable(name: "rl_vlc_table", scope: !949, file: !950, line: 170, type: !993, isLocal: true, isDefinition: true, variable: [674 x %struct.RL_VLC_ELEM]* @ff_mpeg12_init_vlcs.rl_vlc_table.9)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 21568, align: 16, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 674)
!996 = distinct !DIGlobalVariable(name: "ff_mpeg12_static_rl_table_store", scope: !0, file: !950, line: 44, type: !997, isLocal: false, isDefinition: true, variable: [2 x [2 x [195 x i8]]]* @ff_mpeg12_static_rl_table_store)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 6240, align: 8, elements: !998)
!998 = !{!960, !960, !999}
!999 = !DISubrange(count: 195)
!1000 = distinct !DIGlobalVariable(name: "ff_mv_vlc", scope: !0, file: !950, line: 127, type: !1001, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_mv_vlc)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !982, line: 30, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VLC", file: !982, line: 26, size: 192, align: 64, elements: !1003)
!1003 = !{!1004, !1005, !1009, !1010}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1002, file: !982, line: 27, baseType: !933, size: 32, align: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "table", scope: !1002, file: !982, line: 28, baseType: !1006, size: 64, align: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 32, align: 16, elements: !1008)
!1008 = !{!960}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "table_size", scope: !1002, file: !982, line: 29, baseType: !933, size: 32, align: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "table_allocated", scope: !1002, file: !982, line: 29, baseType: !933, size: 32, align: 32, offset: 160)
!1011 = distinct !DIGlobalVariable(name: "ff_dc_lum_vlc", scope: !0, file: !950, line: 129, type: !1001, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_dc_lum_vlc)
!1012 = distinct !DIGlobalVariable(name: "ff_dc_chroma_vlc", scope: !0, file: !950, line: 130, type: !1001, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_dc_chroma_vlc)
!1013 = distinct !DIGlobalVariable(name: "ff_mbincr_vlc", scope: !0, file: !950, line: 132, type: !1001, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_mbincr_vlc)
!1014 = distinct !DIGlobalVariable(name: "ff_mb_ptype_vlc", scope: !0, file: !950, line: 133, type: !1001, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_mb_ptype_vlc)
!1015 = distinct !DIGlobalVariable(name: "ff_mb_btype_vlc", scope: !0, file: !950, line: 134, type: !1001, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_mb_btype_vlc)
!1016 = distinct !DIGlobalVariable(name: "ff_mb_pat_vlc", scope: !0, file: !950, line: 135, type: !1001, isLocal: false, isDefinition: true, variable: %struct.VLC* @ff_mb_pat_vlc)
!1017 = distinct !DIGlobalVariable(name: "table_mb_ptype", scope: !0, file: !950, line: 46, type: !1018, isLocal: true, isDefinition: true, variable: [7 x [2 x i8]]* @table_mb_ptype)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 112, align: 8, elements: !1020)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1020 = !{!1021, !960}
!1021 = !DISubrange(count: 7)
!1022 = distinct !DIGlobalVariable(name: "table_mb_btype", scope: !0, file: !950, line: 56, type: !1023, isLocal: true, isDefinition: true, variable: [11 x [2 x i8]]* @table_mb_btype)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1019, size: 176, align: 8, elements: !1024)
!1024 = !{!1025, !960}
!1025 = !DISubrange(count: 11)
!1026 = !{i32 2, !"Dwarf Version", i32 4}
!1027 = !{i32 2, !"Debug Info Version", i32 3}
!1028 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1029 = distinct !DISubprogram(name: "ff_init_2d_vlc_rl", scope: !950, file: !950, line: 70, type: !1030, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !953)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !1032, !934, !933}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "RLTable", file: !1034, line: 49, baseType: !1035)
!1034 = !DIFile(filename: "libavcodec/rl.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RLTable", file: !1034, line: 39, size: 2688, align: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1045, !1048, !1049, !1052, !1055, !1056}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1035, file: !1034, line: 40, baseType: !933, size: 32, align: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1035, file: !1034, line: 41, baseType: !933, size: 32, align: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "table_vlc", scope: !1035, file: !1034, line: 42, baseType: !1040, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 32, align: 16, elements: !1008)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !942, line: 49, baseType: !1044)
!1044 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "table_run", scope: !1035, file: !1034, line: 43, baseType: !1046, size: 64, align: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "table_level", scope: !1035, file: !1034, line: 44, baseType: !1046, size: 64, align: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "index_run", scope: !1035, file: !1034, line: 45, baseType: !1050, size: 128, align: 64, offset: 256)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 128, align: 64, elements: !1008)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "max_level", scope: !1035, file: !1034, line: 46, baseType: !1053, size: 128, align: 64, offset: 384)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 128, align: 64, elements: !1008)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "max_run", scope: !1035, file: !1034, line: 47, baseType: !1053, size: 128, align: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "rl_vlc", scope: !1035, file: !1034, line: 48, baseType: !1057, size: 2048, align: 64, offset: 640)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 2048, align: 64, elements: !1059)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1059 = !{!1060}
!1060 = !DISubrange(count: 32)
!1061 = !DILocalVariable(name: "rl", arg: 1, scope: !1029, file: !950, line: 70, type: !1032)
!1062 = !DIExpression()
!1063 = !DILocation(line: 70, column: 55, scope: !1029)
!1064 = !DILocalVariable(name: "static_size", arg: 2, scope: !1029, file: !950, line: 70, type: !934)
!1065 = !DILocation(line: 70, column: 68, scope: !1029)
!1066 = !DILocalVariable(name: "flags", arg: 3, scope: !1029, file: !950, line: 70, type: !933)
!1067 = !DILocation(line: 70, column: 85, scope: !1029)
!1068 = !DILocalVariable(name: "i", scope: !1029, file: !950, line: 72, type: !933)
!1069 = !DILocation(line: 72, column: 9, scope: !1029)
!1070 = !DILocalVariable(name: "table", scope: !1029, file: !950, line: 73, type: !1071)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 21760, align: 16, elements: !1072)
!1072 = !{!991, !960}
!1073 = !DILocation(line: 73, column: 13, scope: !1029)
!1074 = !DILocalVariable(name: "vlc", scope: !1029, file: !950, line: 74, type: !1001)
!1075 = !DILocation(line: 74, column: 9, scope: !1029)
!1076 = !DILocation(line: 74, column: 15, scope: !1029)
!1077 = !DILocation(line: 74, column: 26, scope: !1029)
!1078 = !DILocation(line: 74, column: 52, scope: !1029)
!1079 = !DILocation(line: 75, column: 5, scope: !1029)
!1080 = distinct !{!1080, !1079}
!1081 = !DILocation(line: 75, column: 16, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1083, file: !950, discriminator: 1)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !950, line: 75, column: 14)
!1084 = distinct !DILexicalBlock(scope: !1029, file: !950, line: 75, column: 8)
!1085 = !DILocation(line: 75, column: 28, scope: !1082)
!1086 = !DILocation(line: 75, column: 14, scope: !1082)
!1087 = !DILocation(line: 75, column: 72, scope: !1088)
!1088 = !DILexicalBlockFile(scope: !1089, file: !950, discriminator: 2)
!1089 = distinct !DILexicalBlock(scope: !1083, file: !950, line: 75, column: 70)
!1090 = !DILocation(line: 75, column: 126, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1088, file: !950, discriminator: 4)
!1092 = !DILocation(line: 75, column: 126, scope: !1088)
!1093 = !DILocation(line: 75, column: 137, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1084, file: !950, discriminator: 3)
!1095 = !DILocation(line: 76, column: 33, scope: !1029)
!1096 = !DILocation(line: 76, column: 37, scope: !1029)
!1097 = !DILocation(line: 76, column: 39, scope: !1029)
!1098 = !DILocation(line: 76, column: 45, scope: !1029)
!1099 = !DILocation(line: 76, column: 49, scope: !1029)
!1100 = !DILocation(line: 76, column: 44, scope: !1029)
!1101 = !DILocation(line: 76, column: 73, scope: !1029)
!1102 = !DILocation(line: 76, column: 77, scope: !1029)
!1103 = !DILocation(line: 76, column: 72, scope: !1029)
!1104 = !DILocation(line: 76, column: 16, scope: !1029)
!1105 = !DILocation(line: 76, column: 14, scope: !1029)
!1106 = !DILocation(line: 76, column: 5, scope: !1029)
!1107 = !DILocation(line: 78, column: 12, scope: !1108)
!1108 = distinct !DILexicalBlock(scope: !1029, file: !950, line: 78, column: 5)
!1109 = !DILocation(line: 78, column: 10, scope: !1108)
!1110 = !DILocation(line: 78, column: 17, scope: !1111)
!1111 = !DILexicalBlockFile(scope: !1112, file: !950, discriminator: 1)
!1112 = distinct !DILexicalBlock(scope: !1108, file: !950, line: 78, column: 5)
!1113 = !DILocation(line: 78, column: 25, scope: !1111)
!1114 = !DILocation(line: 78, column: 19, scope: !1111)
!1115 = !DILocation(line: 78, column: 5, scope: !1111)
!1116 = !DILocalVariable(name: "code", scope: !1117, file: !950, line: 79, type: !933)
!1117 = distinct !DILexicalBlock(scope: !1112, file: !950, line: 78, column: 42)
!1118 = !DILocation(line: 79, column: 13, scope: !1117)
!1119 = !DILocation(line: 79, column: 30, scope: !1117)
!1120 = !DILocation(line: 79, column: 20, scope: !1117)
!1121 = !DILocation(line: 79, column: 24, scope: !1117)
!1122 = !DILocalVariable(name: "len", scope: !1117, file: !950, line: 80, type: !933)
!1123 = !DILocation(line: 80, column: 13, scope: !1117)
!1124 = !DILocation(line: 80, column: 29, scope: !1117)
!1125 = !DILocation(line: 80, column: 19, scope: !1117)
!1126 = !DILocation(line: 80, column: 23, scope: !1117)
!1127 = !DILocalVariable(name: "level", scope: !1117, file: !950, line: 81, type: !933)
!1128 = !DILocation(line: 81, column: 13, scope: !1117)
!1129 = !DILocalVariable(name: "run", scope: !1117, file: !950, line: 81, type: !933)
!1130 = !DILocation(line: 81, column: 20, scope: !1117)
!1131 = !DILocation(line: 83, column: 13, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1117, file: !950, line: 83, column: 13)
!1133 = !DILocation(line: 83, column: 17, scope: !1132)
!1134 = !DILocation(line: 83, column: 13, scope: !1117)
!1135 = !DILocation(line: 84, column: 17, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !950, line: 83, column: 23)
!1137 = !DILocation(line: 85, column: 19, scope: !1136)
!1138 = !DILocation(line: 86, column: 9, scope: !1136)
!1139 = !DILocation(line: 86, column: 20, scope: !1140)
!1140 = !DILexicalBlockFile(scope: !1141, file: !950, discriminator: 1)
!1141 = distinct !DILexicalBlock(scope: !1132, file: !950, line: 86, column: 20)
!1142 = !DILocation(line: 86, column: 23, scope: !1140)
!1143 = !DILocation(line: 87, column: 17, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1141, file: !950, line: 86, column: 27)
!1145 = !DILocation(line: 88, column: 21, scope: !1144)
!1146 = !DILocation(line: 88, column: 19, scope: !1144)
!1147 = !DILocation(line: 89, column: 9, scope: !1144)
!1148 = !DILocation(line: 90, column: 17, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1150, file: !950, line: 90, column: 17)
!1150 = distinct !DILexicalBlock(scope: !1141, file: !950, line: 89, column: 16)
!1151 = !DILocation(line: 90, column: 25, scope: !1149)
!1152 = !DILocation(line: 90, column: 29, scope: !1149)
!1153 = !DILocation(line: 90, column: 22, scope: !1149)
!1154 = !DILocation(line: 90, column: 17, scope: !1150)
!1155 = !DILocation(line: 91, column: 21, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !1149, file: !950, line: 90, column: 32)
!1157 = !DILocation(line: 92, column: 23, scope: !1156)
!1158 = !DILocation(line: 93, column: 13, scope: !1156)
!1159 = !DILocation(line: 93, column: 24, scope: !1160)
!1160 = !DILexicalBlockFile(scope: !1161, file: !950, discriminator: 1)
!1161 = distinct !DILexicalBlock(scope: !1149, file: !950, line: 93, column: 24)
!1162 = !DILocation(line: 93, column: 32, scope: !1160)
!1163 = !DILocation(line: 93, column: 36, scope: !1160)
!1164 = !DILocation(line: 93, column: 37, scope: !1160)
!1165 = !DILocation(line: 93, column: 29, scope: !1160)
!1166 = !DILocation(line: 94, column: 21, scope: !1167)
!1167 = distinct !DILexicalBlock(scope: !1161, file: !950, line: 93, column: 41)
!1168 = !DILocation(line: 95, column: 23, scope: !1167)
!1169 = !DILocation(line: 96, column: 13, scope: !1167)
!1170 = !DILocation(line: 97, column: 38, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1161, file: !950, line: 96, column: 20)
!1172 = !DILocation(line: 97, column: 23, scope: !1171)
!1173 = !DILocation(line: 97, column: 27, scope: !1171)
!1174 = !DILocation(line: 97, column: 44, scope: !1171)
!1175 = !DILocation(line: 97, column: 21, scope: !1171)
!1176 = !DILocation(line: 98, column: 41, scope: !1171)
!1177 = !DILocation(line: 98, column: 25, scope: !1171)
!1178 = !DILocation(line: 98, column: 29, scope: !1171)
!1179 = !DILocation(line: 98, column: 23, scope: !1171)
!1180 = !DILocation(line: 101, column: 32, scope: !1117)
!1181 = !DILocation(line: 101, column: 23, scope: !1117)
!1182 = !DILocation(line: 101, column: 9, scope: !1117)
!1183 = !DILocation(line: 101, column: 13, scope: !1117)
!1184 = !DILocation(line: 101, column: 26, scope: !1117)
!1185 = !DILocation(line: 101, column: 30, scope: !1117)
!1186 = !DILocation(line: 102, column: 34, scope: !1117)
!1187 = !DILocation(line: 102, column: 23, scope: !1117)
!1188 = !DILocation(line: 102, column: 9, scope: !1117)
!1189 = !DILocation(line: 102, column: 13, scope: !1117)
!1190 = !DILocation(line: 102, column: 26, scope: !1117)
!1191 = !DILocation(line: 102, column: 32, scope: !1117)
!1192 = !DILocation(line: 103, column: 32, scope: !1117)
!1193 = !DILocation(line: 103, column: 23, scope: !1117)
!1194 = !DILocation(line: 103, column: 9, scope: !1117)
!1195 = !DILocation(line: 103, column: 13, scope: !1117)
!1196 = !DILocation(line: 103, column: 26, scope: !1117)
!1197 = !DILocation(line: 103, column: 30, scope: !1117)
!1198 = !DILocation(line: 104, column: 5, scope: !1117)
!1199 = !DILocation(line: 78, column: 38, scope: !1200)
!1200 = !DILexicalBlockFile(scope: !1112, file: !950, discriminator: 2)
!1201 = !DILocation(line: 78, column: 5, scope: !1200)
!1202 = distinct !{!1202, !1203}
!1203 = !DILocation(line: 78, column: 5, scope: !1029)
!1204 = !DILocation(line: 105, column: 1, scope: !1029)
!1205 = distinct !DISubprogram(name: "ff_mpeg12_common_init", scope: !950, file: !950, line: 107, type: !1206, isLocal: false, isDefinition: true, scopeLine: 108, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !953)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{null, !1208}
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !1210, line: 582, baseType: !1211)
!1210 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1210, line: 81, size: 86208, align: 64, elements: !1212)
!1212 = !{!1213, !1296, !1297, !1298, !1299, !1303, !1304, !1314, !1315, !1316, !1317, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2018, !2019, !2067, !2069, !2070, !2071, !2072, !2073, !2084, !2085, !2086, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2100, !2102, !2104, !2105, !2106, !2107, !2108, !2109, !2114, !2116, !2117, !2118, !2119, !2120, !2121, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2148, !2149, !2150, !2151, !2167, !2174, !2186, !2202, !2224, !2264, !2277, !2304, !2319, !2333, !2346, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2367, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2381, !2382, !2383, !2384, !2385, !2386, !2389, !2391, !2393, !2394, !2397, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2464, !2465, !2467, !2468, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2490, !2491, !2492, !2495, !2496, !2497, !2498, !2500, !2502, !2503, !2504, !2505, !2506, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2588, !2589, !2590, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2653, !2656, !2657, !2658, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2676, !2677, !2678, !2679, !2680, !2681, !2682, !2683, !2684, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708, !2709, !2710, !2719, !2720, !2721, !2722, !2726, !2727, !2731, !2735, !2738, !2739, !2744, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2759, !2760, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2778, !2779, !2780, !2830, !2831, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1211, file: !1210, line: 82, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1217)
!1217 = !{!1218, !1222, !1226, !1255, !1256, !1257, !1258, !1262, !1268, !1270, !1274}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1216, file: !26, line: 72, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1221 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1216, file: !26, line: 78, baseType: !1223, size: 64, align: 64, offset: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!1219, !932}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1216, file: !26, line: 85, baseType: !1227, size: 64, align: 64, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234, !1235, !1251, !1252, !1253, !1254}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1229, file: !4, line: 247, baseType: !1219, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1229, file: !4, line: 253, baseType: !1219, size: 64, align: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1229, file: !4, line: 259, baseType: !933, size: 32, align: 32, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1229, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1229, file: !4, line: 271, baseType: !1236, size: 64, align: 64, offset: 192)
!1236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1229, file: !4, line: 265, size: 64, align: 64, elements: !1237)
!1237 = !{!1238, !1241, !1243, !1244}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1236, file: !4, line: 266, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !944, line: 197, baseType: !1240)
!1240 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1236, file: !4, line: 267, baseType: !1242, size: 64, align: 64)
!1242 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1236, file: !4, line: 268, baseType: !1219, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1236, file: !4, line: 270, baseType: !1245, size: 64, align: 32)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1246, line: 61, baseType: !1247)
!1246 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1246, line: 58, size: 64, align: 32, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1247, file: !1246, line: 59, baseType: !933, size: 32, align: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1247, file: !1246, line: 60, baseType: !933, size: 32, align: 32, offset: 32)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1229, file: !4, line: 272, baseType: !1242, size: 64, align: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1229, file: !4, line: 273, baseType: !1242, size: 64, align: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1229, file: !4, line: 275, baseType: !933, size: 32, align: 32, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1229, file: !4, line: 300, baseType: !1219, size: 64, align: 64, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1216, file: !26, line: 93, baseType: !933, size: 32, align: 32, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1216, file: !26, line: 99, baseType: !933, size: 32, align: 32, offset: 224)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1216, file: !26, line: 108, baseType: !933, size: 32, align: 32, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1216, file: !26, line: 113, baseType: !1259, size: 64, align: 64, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!932, !932, !932}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1216, file: !26, line: 123, baseType: !1263, size: 64, align: 64, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!1266, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1216)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1216, file: !26, line: 130, baseType: !1269, size: 32, align: 32, offset: 448)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1216, file: !26, line: 136, baseType: !1271, size: 64, align: 64, offset: 512)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!1269, !932}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1216, file: !26, line: 142, baseType: !1275, size: 64, align: 64, offset: 576)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!933, !1278, !932, !1219, !933}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1281)
!1281 = !{!1282, !1294, !1295}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1280, file: !4, line: 360, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1287)
!1287 = !{!1288, !1289, !1290, !1291, !1292, !1293}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1286, file: !4, line: 307, baseType: !1219, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1286, file: !4, line: 313, baseType: !1242, size: 64, align: 64, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1286, file: !4, line: 313, baseType: !1242, size: 64, align: 64, offset: 128)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1286, file: !4, line: 318, baseType: !1242, size: 64, align: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1286, file: !4, line: 318, baseType: !1242, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1286, file: !4, line: 323, baseType: !933, size: 32, align: 32, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1280, file: !4, line: 364, baseType: !933, size: 32, align: 32, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1280, file: !4, line: 368, baseType: !933, size: 32, align: 32, offset: 96)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1211, file: !1210, line: 84, baseType: !933, size: 32, align: 32, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1211, file: !1210, line: 84, baseType: !933, size: 32, align: 32, offset: 96)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1211, file: !1210, line: 85, baseType: !933, size: 32, align: 32, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1211, file: !1210, line: 86, baseType: !1300, size: 384, align: 32, offset: 160)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 384, align: 32, elements: !1301)
!1301 = !{!1302}
!1302 = !DISubrange(count: 12)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1211, file: !1210, line: 87, baseType: !933, size: 32, align: 32, offset: 544)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1211, file: !1210, line: 90, baseType: !1305, size: 1088, align: 64, offset: 576)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1307)
!1307 = !{!1308, !1310, !1313}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1306, file: !917, line: 32, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1306, file: !917, line: 33, baseType: !1311, size: 512, align: 8, offset: 64)
!1311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 8, elements: !1312)
!1312 = !{!977}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1306, file: !917, line: 34, baseType: !1311, size: 512, align: 8, offset: 576)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1211, file: !1210, line: 91, baseType: !1305, size: 1088, align: 64, offset: 1664)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1211, file: !1210, line: 92, baseType: !1305, size: 1088, align: 64, offset: 2752)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1211, file: !1210, line: 93, baseType: !1305, size: 1088, align: 64, offset: 3840)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1211, file: !1210, line: 98, baseType: !1318, size: 64, align: 64, offset: 4928)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1320)
!1320 = !{!1321, !1324, !1325, !1326, !1585, !1586, !1587, !1588, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1740, !1744, !1745, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1923, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1319, file: !57, line: 1561, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1215)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1319, file: !57, line: 1562, baseType: !933, size: 32, align: 32, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1319, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1319, file: !57, line: 1565, baseType: !1327, size: 64, align: 64, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1339, !1342, !1345, !1348, !1353, !1354, !1355, !1363, !1364, !1365, !1367, !1373, !1379, !1388, !1392, !1393, !1438, !1556, !1560, !1561, !1565, !1569, !1574, !1578, !1579, !1580}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1329, file: !57, line: 3475, baseType: !1219, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1329, file: !57, line: 3480, baseType: !1219, size: 64, align: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1329, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1329, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1329, file: !57, line: 3487, baseType: !933, size: 32, align: 32, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1329, file: !57, line: 3488, baseType: !1337, size: 64, align: 64, offset: 256)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1329, file: !57, line: 3489, baseType: !1340, size: 64, align: 64, offset: 320)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1329, file: !57, line: 3490, baseType: !1343, size: 64, align: 64, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1329, file: !57, line: 3491, baseType: !1346, size: 64, align: 64, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1329, file: !57, line: 3492, baseType: !1349, size: 64, align: 64, offset: 512)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1351)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !942, line: 55, baseType: !1352)
!1352 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1329, file: !57, line: 3493, baseType: !945, size: 8, align: 8, offset: 576)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1329, file: !57, line: 3494, baseType: !1322, size: 64, align: 64, offset: 640)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1329, file: !57, line: 3495, baseType: !1356, size: 64, align: 64, offset: 704)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1358)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1359)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1360)
!1360 = !{!1361, !1362}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1359, file: !57, line: 3402, baseType: !933, size: 32, align: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1359, file: !57, line: 3403, baseType: !1219, size: 64, align: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1329, file: !57, line: 3507, baseType: !1219, size: 64, align: 64, offset: 768)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1329, file: !57, line: 3516, baseType: !933, size: 32, align: 32, offset: 832)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1329, file: !57, line: 3517, baseType: !1366, size: 64, align: 64, offset: 896)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1329, file: !57, line: 3527, baseType: !1368, size: 64, align: 64, offset: 960)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!933, !1371}
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1319)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1329, file: !57, line: 3535, baseType: !1374, size: 64, align: 64, offset: 1024)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!933, !1371, !1377}
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1372)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1329, file: !57, line: 3541, baseType: !1380, size: 64, align: 64, offset: 1088)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1382)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1384, line: 223, size: 128, align: 64, elements: !1385)
!1384 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1385 = !{!1386, !1387}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1383, file: !1384, line: 224, baseType: !1309, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1383, file: !1384, line: 225, baseType: !1309, size: 64, align: 64, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1329, file: !57, line: 3549, baseType: !1389, size: 64, align: 64, offset: 1152)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{null, !1366}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1329, file: !57, line: 3551, baseType: !1368, size: 64, align: 64, offset: 1216)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1329, file: !57, line: 3552, baseType: !1394, size: 64, align: 64, offset: 1280)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!933, !1371, !1051, !933, !1397}
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1400)
!1400 = !{!1401, !1402, !1403, !1404, !1405, !1437}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1399, file: !57, line: 3921, baseType: !1043, size: 16, align: 16)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1399, file: !57, line: 3922, baseType: !941, size: 32, align: 32, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1399, file: !57, line: 3923, baseType: !941, size: 32, align: 32, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1399, file: !57, line: 3924, baseType: !934, size: 32, align: 32, offset: 96)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1399, file: !57, line: 3925, baseType: !1406, size: 64, align: 64, offset: 128)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1415, !1416, !1426, !1430, !1432, !1433, !1435, !1436}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1409, file: !57, line: 3886, baseType: !933, size: 32, align: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1409, file: !57, line: 3887, baseType: !933, size: 32, align: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1409, file: !57, line: 3888, baseType: !933, size: 32, align: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1409, file: !57, line: 3889, baseType: !933, size: 32, align: 32, offset: 96)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1409, file: !57, line: 3890, baseType: !933, size: 32, align: 32, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1409, file: !57, line: 3897, baseType: !1417, size: 768, align: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1419)
!1419 = !{!1420, !1424}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1418, file: !57, line: 3855, baseType: !1421, size: 512, align: 64)
!1421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 512, align: 64, elements: !1422)
!1422 = !{!1423}
!1423 = !DISubrange(count: 8)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1418, file: !57, line: 3857, baseType: !1425, size: 256, align: 32, offset: 512)
!1425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 256, align: 32, elements: !1422)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1409, file: !57, line: 3903, baseType: !1427, size: 256, align: 64, offset: 960)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 256, align: 64, elements: !1428)
!1428 = !{!1429}
!1429 = !DISubrange(count: 4)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1409, file: !57, line: 3904, baseType: !1431, size: 128, align: 32, offset: 1216)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 128, align: 32, elements: !1428)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1409, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1409, file: !57, line: 3908, baseType: !1434, size: 64, align: 64, offset: 1408)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1409, file: !57, line: 3915, baseType: !1434, size: 64, align: 64, offset: 1472)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1409, file: !57, line: 3917, baseType: !933, size: 32, align: 32, offset: 1536)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1399, file: !57, line: 3926, baseType: !1239, size: 64, align: 64, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1329, file: !57, line: 3564, baseType: !1439, size: 64, align: 64, offset: 1344)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!933, !1371, !1442, !1476, !1555}
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1444)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1445)
!1445 = !{!1446, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1472, !1473, !1474, !1475}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1444, file: !57, line: 1451, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1449, line: 94, baseType: !1450)
!1449 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1449, line: 81, size: 192, align: 64, elements: !1451)
!1451 = !{!1452, !1456, !1457}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1450, file: !1449, line: 82, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1449, line: 73, baseType: !1455)
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1449, line: 73, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1450, file: !1449, line: 89, baseType: !1051, size: 64, align: 64, offset: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1450, file: !1449, line: 93, baseType: !933, size: 32, align: 32, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1444, file: !57, line: 1461, baseType: !1239, size: 64, align: 64, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1444, file: !57, line: 1467, baseType: !1239, size: 64, align: 64, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1444, file: !57, line: 1468, baseType: !1051, size: 64, align: 64, offset: 192)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1444, file: !57, line: 1469, baseType: !933, size: 32, align: 32, offset: 256)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1444, file: !57, line: 1470, baseType: !933, size: 32, align: 32, offset: 288)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1444, file: !57, line: 1474, baseType: !933, size: 32, align: 32, offset: 320)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1444, file: !57, line: 1479, baseType: !1465, size: 64, align: 64, offset: 384)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1468)
!1468 = !{!1469, !1470, !1471}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1467, file: !57, line: 1412, baseType: !1051, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1467, file: !57, line: 1413, baseType: !933, size: 32, align: 32, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1467, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1444, file: !57, line: 1480, baseType: !933, size: 32, align: 32, offset: 448)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1444, file: !57, line: 1486, baseType: !1239, size: 64, align: 64, offset: 512)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1444, file: !57, line: 1488, baseType: !1239, size: 64, align: 64, offset: 576)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1444, file: !57, line: 1497, baseType: !1239, size: 64, align: 64, offset: 640)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1478)
!1478 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1479)
!1479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1480)
!1480 = !{!1481, !1482, !1483, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1510, !1512, !1513, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1551, !1552, !1553, !1554}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1479, file: !780, line: 282, baseType: !1421, size: 512, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1479, file: !780, line: 299, baseType: !1425, size: 256, align: 32, offset: 512)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1479, file: !780, line: 315, baseType: !1484, size: 64, align: 64, offset: 768)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1479, file: !780, line: 326, baseType: !933, size: 32, align: 32, offset: 832)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1479, file: !780, line: 326, baseType: !933, size: 32, align: 32, offset: 864)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1479, file: !780, line: 334, baseType: !933, size: 32, align: 32, offset: 896)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1479, file: !780, line: 341, baseType: !933, size: 32, align: 32, offset: 928)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1479, file: !780, line: 346, baseType: !933, size: 32, align: 32, offset: 960)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1479, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1479, file: !780, line: 356, baseType: !1245, size: 64, align: 32, offset: 1024)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1479, file: !780, line: 361, baseType: !1239, size: 64, align: 64, offset: 1088)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1479, file: !780, line: 369, baseType: !1239, size: 64, align: 64, offset: 1152)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1479, file: !780, line: 377, baseType: !1239, size: 64, align: 64, offset: 1216)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1479, file: !780, line: 382, baseType: !933, size: 32, align: 32, offset: 1280)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1479, file: !780, line: 386, baseType: !933, size: 32, align: 32, offset: 1312)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1479, file: !780, line: 391, baseType: !933, size: 32, align: 32, offset: 1344)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1479, file: !780, line: 396, baseType: !932, size: 64, align: 64, offset: 1408)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1479, file: !780, line: 403, baseType: !1500, size: 512, align: 64, offset: 1472)
!1500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1351, size: 512, align: 64, elements: !1422)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1479, file: !780, line: 410, baseType: !933, size: 32, align: 32, offset: 1984)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1479, file: !780, line: 415, baseType: !933, size: 32, align: 32, offset: 2016)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1479, file: !780, line: 420, baseType: !933, size: 32, align: 32, offset: 2048)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1479, file: !780, line: 425, baseType: !933, size: 32, align: 32, offset: 2080)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1479, file: !780, line: 435, baseType: !1239, size: 64, align: 64, offset: 2112)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1479, file: !780, line: 440, baseType: !933, size: 32, align: 32, offset: 2176)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1479, file: !780, line: 445, baseType: !1351, size: 64, align: 64, offset: 2240)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1479, file: !780, line: 459, baseType: !1509, size: 512, align: 64, offset: 2304)
!1509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1447, size: 512, align: 64, elements: !1422)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1479, file: !780, line: 473, baseType: !1511, size: 64, align: 64, offset: 2816)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1479, file: !780, line: 477, baseType: !933, size: 32, align: 32, offset: 2880)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1479, file: !780, line: 479, baseType: !1514, size: 64, align: 64, offset: 2944)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1518)
!1518 = !{!1519, !1520, !1521, !1522, !1527}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1517, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1517, file: !780, line: 203, baseType: !1051, size: 64, align: 64, offset: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1517, file: !780, line: 204, baseType: !933, size: 32, align: 32, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1517, file: !780, line: 205, baseType: !1523, size: 64, align: 64, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1525, line: 86, baseType: !1526)
!1525 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1526 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1525, line: 86, flags: DIFlagFwdDecl)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1517, file: !780, line: 206, baseType: !1447, size: 64, align: 64, offset: 256)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1479, file: !780, line: 480, baseType: !933, size: 32, align: 32, offset: 3008)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1479, file: !780, line: 505, baseType: !933, size: 32, align: 32, offset: 3040)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1479, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1479, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1479, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1479, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1479, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1479, file: !780, line: 532, baseType: !1239, size: 64, align: 64, offset: 3264)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1479, file: !780, line: 539, baseType: !1239, size: 64, align: 64, offset: 3328)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1479, file: !780, line: 547, baseType: !1239, size: 64, align: 64, offset: 3392)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1479, file: !780, line: 554, baseType: !1523, size: 64, align: 64, offset: 3456)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1479, file: !780, line: 563, baseType: !933, size: 32, align: 32, offset: 3520)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1479, file: !780, line: 572, baseType: !933, size: 32, align: 32, offset: 3552)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1479, file: !780, line: 581, baseType: !933, size: 32, align: 32, offset: 3584)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1479, file: !780, line: 588, baseType: !1054, size: 64, align: 64, offset: 3648)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1479, file: !780, line: 593, baseType: !933, size: 32, align: 32, offset: 3712)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1479, file: !780, line: 596, baseType: !933, size: 32, align: 32, offset: 3744)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1479, file: !780, line: 599, baseType: !1447, size: 64, align: 64, offset: 3776)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1479, file: !780, line: 605, baseType: !1447, size: 64, align: 64, offset: 3840)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1479, file: !780, line: 616, baseType: !1447, size: 64, align: 64, offset: 3904)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1479, file: !780, line: 626, baseType: !1549, size: 64, align: 64, offset: 3968)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1550, line: 216, baseType: !1352)
!1550 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1479, file: !780, line: 627, baseType: !1549, size: 64, align: 64, offset: 4032)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1479, file: !780, line: 628, baseType: !1549, size: 64, align: 64, offset: 4096)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1479, file: !780, line: 629, baseType: !1549, size: 64, align: 64, offset: 4160)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1479, file: !780, line: 645, baseType: !1447, size: 64, align: 64, offset: 4224)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1329, file: !57, line: 3566, baseType: !1557, size: 64, align: 64, offset: 1408)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!933, !1371, !932, !1555, !1442}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1329, file: !57, line: 3567, baseType: !1368, size: 64, align: 64, offset: 1472)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1329, file: !57, line: 3576, baseType: !1562, size: 64, align: 64, offset: 1536)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!933, !1371, !1476}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1329, file: !57, line: 3577, baseType: !1566, size: 64, align: 64, offset: 1600)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!933, !1371, !1442}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1329, file: !57, line: 3584, baseType: !1570, size: 64, align: 64, offset: 1664)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!933, !1371, !1573}
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1329, file: !57, line: 3589, baseType: !1575, size: 64, align: 64, offset: 1728)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{null, !1371}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1329, file: !57, line: 3594, baseType: !933, size: 32, align: 32, offset: 1792)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1329, file: !57, line: 3600, baseType: !1219, size: 64, align: 64, offset: 1856)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1329, file: !57, line: 3609, baseType: !1581, size: 64, align: 64, offset: 1920)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1584)
!1584 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1319, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1319, file: !57, line: 1581, baseType: !934, size: 32, align: 32, offset: 224)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1319, file: !57, line: 1583, baseType: !932, size: 64, align: 64, offset: 256)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1319, file: !57, line: 1591, baseType: !1589, size: 64, align: 64, offset: 320)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1384, line: 129, size: 1664, align: 64, elements: !1591)
!1591 = !{!1592, !1593, !1594, !1595, !1596, !1614, !1615, !1621, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1590, file: !1384, line: 136, baseType: !933, size: 32, align: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1590, file: !1384, line: 151, baseType: !933, size: 32, align: 32, offset: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1590, file: !1384, line: 157, baseType: !933, size: 32, align: 32, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1590, file: !1384, line: 159, baseType: !1573, size: 64, align: 64, offset: 128)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1590, file: !1384, line: 161, baseType: !1597, size: 64, align: 64, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1384, line: 117, baseType: !1599)
!1599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1384, line: 100, size: 832, align: 64, elements: !1600)
!1600 = !{!1601, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613}
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1599, file: !1384, line: 105, baseType: !1602, size: 256, align: 64)
!1602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1603, size: 256, align: 64, elements: !1428)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1449, line: 238, baseType: !1605)
!1605 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1449, line: 238, flags: DIFlagFwdDecl)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1599, file: !1384, line: 110, baseType: !933, size: 32, align: 32, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1599, file: !1384, line: 111, baseType: !933, size: 32, align: 32, offset: 288)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1599, file: !1384, line: 111, baseType: !933, size: 32, align: 32, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1599, file: !1384, line: 112, baseType: !1425, size: 256, align: 32, offset: 352)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1599, file: !1384, line: 113, baseType: !1431, size: 128, align: 32, offset: 608)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1599, file: !1384, line: 114, baseType: !933, size: 32, align: 32, offset: 736)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1599, file: !1384, line: 115, baseType: !933, size: 32, align: 32, offset: 768)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1599, file: !1384, line: 116, baseType: !933, size: 32, align: 32, offset: 800)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1590, file: !1384, line: 163, baseType: !932, size: 64, align: 64, offset: 256)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1590, file: !1384, line: 165, baseType: !1616, size: 128, align: 64, offset: 320)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1384, line: 122, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1384, line: 119, size: 128, align: 64, elements: !1618)
!1618 = !{!1619, !1620}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1617, file: !1384, line: 120, baseType: !1442, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1617, file: !1384, line: 121, baseType: !1573, size: 64, align: 64, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1590, file: !1384, line: 166, baseType: !1622, size: 128, align: 64, offset: 448)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1384, line: 127, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1384, line: 124, size: 128, align: 64, elements: !1624)
!1624 = !{!1625, !1698}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1623, file: !1384, line: 125, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1630)
!1630 = !{!1631, !1632, !1656, !1660, !1661, !1695, !1696, !1697}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1629, file: !57, line: 5751, baseType: !1322, size: 64, align: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1629, file: !57, line: 5756, baseType: !1633, size: 64, align: 64, offset: 64)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1635)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1636)
!1636 = !{!1637, !1638, !1641, !1642, !1643, !1647, !1651, !1655}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1635, file: !57, line: 5797, baseType: !1219, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1635, file: !57, line: 5804, baseType: !1639, size: 64, align: 64, offset: 64)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1635, file: !57, line: 5815, baseType: !1322, size: 64, align: 64, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1635, file: !57, line: 5825, baseType: !933, size: 32, align: 32, offset: 192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1635, file: !57, line: 5826, baseType: !1644, size: 64, align: 64, offset: 256)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!933, !1627}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1635, file: !57, line: 5827, baseType: !1648, size: 64, align: 64, offset: 320)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!933, !1627, !1442}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1635, file: !57, line: 5828, baseType: !1652, size: 64, align: 64, offset: 384)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1627}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1635, file: !57, line: 5829, baseType: !1652, size: 64, align: 64, offset: 448)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1629, file: !57, line: 5762, baseType: !1657, size: 64, align: 64, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1659)
!1659 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1629, file: !57, line: 5768, baseType: !932, size: 64, align: 64, offset: 192)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1629, file: !57, line: 5775, baseType: !1662, size: 64, align: 64, offset: 256)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1664)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1665)
!1665 = !{!1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1664, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1664, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1664, file: !57, line: 3948, baseType: !941, size: 32, align: 32, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1664, file: !57, line: 3958, baseType: !1051, size: 64, align: 64, offset: 128)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1664, file: !57, line: 3962, baseType: !933, size: 32, align: 32, offset: 192)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1664, file: !57, line: 3968, baseType: !933, size: 32, align: 32, offset: 224)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1664, file: !57, line: 3973, baseType: !1239, size: 64, align: 64, offset: 256)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1664, file: !57, line: 3986, baseType: !933, size: 32, align: 32, offset: 320)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1664, file: !57, line: 3999, baseType: !933, size: 32, align: 32, offset: 352)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1664, file: !57, line: 4004, baseType: !933, size: 32, align: 32, offset: 384)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1664, file: !57, line: 4005, baseType: !933, size: 32, align: 32, offset: 416)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1664, file: !57, line: 4010, baseType: !933, size: 32, align: 32, offset: 448)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1664, file: !57, line: 4011, baseType: !933, size: 32, align: 32, offset: 480)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1664, file: !57, line: 4020, baseType: !1245, size: 64, align: 32, offset: 512)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1664, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1664, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1664, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1664, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1664, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1664, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1664, file: !57, line: 4039, baseType: !933, size: 32, align: 32, offset: 768)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1664, file: !57, line: 4046, baseType: !1351, size: 64, align: 64, offset: 832)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1664, file: !57, line: 4050, baseType: !933, size: 32, align: 32, offset: 896)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1664, file: !57, line: 4054, baseType: !933, size: 32, align: 32, offset: 928)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1664, file: !57, line: 4061, baseType: !933, size: 32, align: 32, offset: 960)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1664, file: !57, line: 4065, baseType: !933, size: 32, align: 32, offset: 992)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1664, file: !57, line: 4073, baseType: !933, size: 32, align: 32, offset: 1024)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1664, file: !57, line: 4080, baseType: !933, size: 32, align: 32, offset: 1056)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1664, file: !57, line: 4084, baseType: !933, size: 32, align: 32, offset: 1088)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1629, file: !57, line: 5781, baseType: !1662, size: 64, align: 64, offset: 320)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1629, file: !57, line: 5787, baseType: !1245, size: 64, align: 32, offset: 384)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1629, file: !57, line: 5793, baseType: !1245, size: 64, align: 32, offset: 448)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1623, file: !1384, line: 126, baseType: !933, size: 32, align: 32, offset: 64)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1590, file: !1384, line: 172, baseType: !1442, size: 64, align: 64, offset: 576)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1590, file: !1384, line: 177, baseType: !1051, size: 64, align: 64, offset: 640)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1590, file: !1384, line: 178, baseType: !934, size: 32, align: 32, offset: 704)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1590, file: !1384, line: 180, baseType: !932, size: 64, align: 64, offset: 768)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1590, file: !1384, line: 185, baseType: !933, size: 32, align: 32, offset: 832)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1590, file: !1384, line: 190, baseType: !932, size: 64, align: 64, offset: 896)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1590, file: !1384, line: 195, baseType: !933, size: 32, align: 32, offset: 960)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1590, file: !1384, line: 200, baseType: !1442, size: 64, align: 64, offset: 1024)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1590, file: !1384, line: 201, baseType: !933, size: 32, align: 32, offset: 1088)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1590, file: !1384, line: 202, baseType: !1573, size: 64, align: 64, offset: 1152)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1590, file: !1384, line: 203, baseType: !933, size: 32, align: 32, offset: 1216)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1590, file: !1384, line: 205, baseType: !933, size: 32, align: 32, offset: 1248)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1590, file: !1384, line: 206, baseType: !933, size: 32, align: 32, offset: 1280)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1590, file: !1384, line: 209, baseType: !1549, size: 64, align: 64, offset: 1344)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1590, file: !1384, line: 212, baseType: !1549, size: 64, align: 64, offset: 1408)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1590, file: !1384, line: 213, baseType: !1573, size: 64, align: 64, offset: 1472)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1590, file: !1384, line: 215, baseType: !933, size: 32, align: 32, offset: 1536)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1590, file: !1384, line: 217, baseType: !933, size: 32, align: 32, offset: 1568)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1590, file: !1384, line: 220, baseType: !933, size: 32, align: 32, offset: 1600)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1319, file: !57, line: 1598, baseType: !932, size: 64, align: 64, offset: 384)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1319, file: !57, line: 1606, baseType: !1239, size: 64, align: 64, offset: 448)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1319, file: !57, line: 1614, baseType: !933, size: 32, align: 32, offset: 512)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1319, file: !57, line: 1622, baseType: !933, size: 32, align: 32, offset: 544)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1319, file: !57, line: 1628, baseType: !933, size: 32, align: 32, offset: 576)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1319, file: !57, line: 1636, baseType: !933, size: 32, align: 32, offset: 608)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1319, file: !57, line: 1643, baseType: !933, size: 32, align: 32, offset: 640)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1319, file: !57, line: 1657, baseType: !1051, size: 64, align: 64, offset: 704)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1319, file: !57, line: 1658, baseType: !933, size: 32, align: 32, offset: 768)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1319, file: !57, line: 1679, baseType: !1245, size: 64, align: 32, offset: 800)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1319, file: !57, line: 1688, baseType: !933, size: 32, align: 32, offset: 864)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1319, file: !57, line: 1712, baseType: !933, size: 32, align: 32, offset: 896)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1319, file: !57, line: 1729, baseType: !933, size: 32, align: 32, offset: 928)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1319, file: !57, line: 1729, baseType: !933, size: 32, align: 32, offset: 960)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1319, file: !57, line: 1744, baseType: !933, size: 32, align: 32, offset: 992)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1319, file: !57, line: 1744, baseType: !933, size: 32, align: 32, offset: 1024)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1319, file: !57, line: 1751, baseType: !933, size: 32, align: 32, offset: 1056)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1319, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1319, file: !57, line: 1791, baseType: !1737, size: 64, align: 64, offset: 1152)
!1737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1738, size: 64, align: 64)
!1738 = !DISubroutineType(types: !1739)
!1739 = !{null, !1318, !1476, !1555, !933, !933, !933}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1319, file: !57, line: 1808, baseType: !1741, size: 64, align: 64, offset: 1216)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64, align: 64)
!1742 = !DISubroutineType(types: !1743)
!1743 = !{!516, !1318, !1340}
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1319, file: !57, line: 1816, baseType: !933, size: 32, align: 32, offset: 1280)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1319, file: !57, line: 1825, baseType: !1746, size: 32, align: 32, offset: 1312)
!1746 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1319, file: !57, line: 1830, baseType: !933, size: 32, align: 32, offset: 1344)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1319, file: !57, line: 1838, baseType: !1746, size: 32, align: 32, offset: 1376)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1319, file: !57, line: 1846, baseType: !933, size: 32, align: 32, offset: 1408)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1319, file: !57, line: 1851, baseType: !933, size: 32, align: 32, offset: 1440)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1319, file: !57, line: 1861, baseType: !1746, size: 32, align: 32, offset: 1472)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1319, file: !57, line: 1868, baseType: !1746, size: 32, align: 32, offset: 1504)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1319, file: !57, line: 1875, baseType: !1746, size: 32, align: 32, offset: 1536)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1319, file: !57, line: 1882, baseType: !1746, size: 32, align: 32, offset: 1568)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1319, file: !57, line: 1889, baseType: !1746, size: 32, align: 32, offset: 1600)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1319, file: !57, line: 1896, baseType: !1746, size: 32, align: 32, offset: 1632)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1319, file: !57, line: 1903, baseType: !1746, size: 32, align: 32, offset: 1664)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1319, file: !57, line: 1910, baseType: !933, size: 32, align: 32, offset: 1696)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1319, file: !57, line: 1915, baseType: !933, size: 32, align: 32, offset: 1728)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1319, file: !57, line: 1926, baseType: !1555, size: 64, align: 64, offset: 1792)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1319, file: !57, line: 1935, baseType: !1245, size: 64, align: 32, offset: 1856)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1319, file: !57, line: 1942, baseType: !933, size: 32, align: 32, offset: 1920)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1319, file: !57, line: 1948, baseType: !933, size: 32, align: 32, offset: 1952)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1319, file: !57, line: 1954, baseType: !933, size: 32, align: 32, offset: 1984)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1319, file: !57, line: 1960, baseType: !933, size: 32, align: 32, offset: 2016)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1319, file: !57, line: 1984, baseType: !933, size: 32, align: 32, offset: 2048)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1319, file: !57, line: 1991, baseType: !933, size: 32, align: 32, offset: 2080)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1319, file: !57, line: 1996, baseType: !933, size: 32, align: 32, offset: 2112)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1319, file: !57, line: 2004, baseType: !933, size: 32, align: 32, offset: 2144)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1319, file: !57, line: 2011, baseType: !933, size: 32, align: 32, offset: 2176)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1319, file: !57, line: 2018, baseType: !933, size: 32, align: 32, offset: 2208)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1319, file: !57, line: 2027, baseType: !933, size: 32, align: 32, offset: 2240)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1319, file: !57, line: 2034, baseType: !933, size: 32, align: 32, offset: 2272)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1319, file: !57, line: 2044, baseType: !933, size: 32, align: 32, offset: 2304)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1319, file: !57, line: 2054, baseType: !1776, size: 64, align: 64, offset: 2368)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1319, file: !57, line: 2061, baseType: !1776, size: 64, align: 64, offset: 2432)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1319, file: !57, line: 2066, baseType: !933, size: 32, align: 32, offset: 2496)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1319, file: !57, line: 2070, baseType: !933, size: 32, align: 32, offset: 2528)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1319, file: !57, line: 2078, baseType: !933, size: 32, align: 32, offset: 2560)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1319, file: !57, line: 2085, baseType: !933, size: 32, align: 32, offset: 2592)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1319, file: !57, line: 2092, baseType: !933, size: 32, align: 32, offset: 2624)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1319, file: !57, line: 2099, baseType: !933, size: 32, align: 32, offset: 2656)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1319, file: !57, line: 2106, baseType: !933, size: 32, align: 32, offset: 2688)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1319, file: !57, line: 2113, baseType: !933, size: 32, align: 32, offset: 2720)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1319, file: !57, line: 2120, baseType: !933, size: 32, align: 32, offset: 2752)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1319, file: !57, line: 2125, baseType: !933, size: 32, align: 32, offset: 2784)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1319, file: !57, line: 2133, baseType: !933, size: 32, align: 32, offset: 2816)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1319, file: !57, line: 2140, baseType: !933, size: 32, align: 32, offset: 2848)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1319, file: !57, line: 2145, baseType: !933, size: 32, align: 32, offset: 2880)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1319, file: !57, line: 2153, baseType: !933, size: 32, align: 32, offset: 2912)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1319, file: !57, line: 2158, baseType: !933, size: 32, align: 32, offset: 2944)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1319, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1319, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1319, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1319, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1319, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1319, file: !57, line: 2203, baseType: !933, size: 32, align: 32, offset: 3136)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1319, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
