; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--avdevice.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavdevice--avdevice.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type opaque
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAppToDevMessageType", file: !939, line: 119, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavdevice/avdevice.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!941 = !DIEnumerator(name: "AV_APP_TO_DEV_NONE", value: 1313820229)
!942 = !DIEnumerator(name: "AV_APP_TO_DEV_WINDOW_SIZE", value: 1195724621)
!943 = !DIEnumerator(name: "AV_APP_TO_DEV_WINDOW_REPAINT", value: 1380274241)
!944 = !DIEnumerator(name: "AV_APP_TO_DEV_PAUSE", value: 1346458912)
!945 = !DIEnumerator(name: "AV_APP_TO_DEV_PLAY", value: 1347174745)
!946 = !DIEnumerator(name: "AV_APP_TO_DEV_TOGGLE_PAUSE", value: 1346458964)
!947 = !DIEnumerator(name: "AV_APP_TO_DEV_SET_VOLUME", value: 1398165324)
!948 = !DIEnumerator(name: "AV_APP_TO_DEV_MUTE", value: 541939028)
!949 = !DIEnumerator(name: "AV_APP_TO_DEV_UNMUTE", value: 1431131476)
!950 = !DIEnumerator(name: "AV_APP_TO_DEV_TOGGLE_MUTE", value: 1414354260)
!951 = !DIEnumerator(name: "AV_APP_TO_DEV_GET_VOLUME", value: 1196838732)
!952 = !DIEnumerator(name: "AV_APP_TO_DEV_GET_MUTE", value: 1196250452)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDevToAppMessageType", file: !939, line: 198, size: 32, align: 32, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965}
!955 = !DIEnumerator(name: "AV_DEV_TO_APP_NONE", value: 1313820229)
!956 = !DIEnumerator(name: "AV_DEV_TO_APP_CREATE_WINDOW_BUFFER", value: 1111708229)
!957 = !DIEnumerator(name: "AV_DEV_TO_APP_PREPARE_WINDOW_BUFFER", value: 1112560197)
!958 = !DIEnumerator(name: "AV_DEV_TO_APP_DISPLAY_WINDOW_BUFFER", value: 1111771475)
!959 = !DIEnumerator(name: "AV_DEV_TO_APP_DESTROY_WINDOW_BUFFER", value: 1111770451)
!960 = !DIEnumerator(name: "AV_DEV_TO_APP_BUFFER_OVERFLOW", value: 1112491596)
!961 = !DIEnumerator(name: "AV_DEV_TO_APP_BUFFER_UNDERFLOW", value: 1112884812)
!962 = !DIEnumerator(name: "AV_DEV_TO_APP_BUFFER_READABLE", value: 1112687648)
!963 = !DIEnumerator(name: "AV_DEV_TO_APP_BUFFER_WRITABLE", value: 1113018912)
!964 = !DIEnumerator(name: "AV_DEV_TO_APP_MUTE_STATE_CHANGED", value: 1129141588)
!965 = !DIEnumerator(name: "AV_DEV_TO_APP_VOLUME_LEVEL_CHANGED", value: 1129729868)
!966 = !{!967, !968, !2158}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !971)
!971 = !{!972, !976, !977, !978, !979, !980, !981, !982, !984, !990, !1072, !1074, !1075, !2123, !2124, !2125, !2129, !2133, !2137, !2138, !2143, !2144, !2145, !2146, !2147, !2148, !2152}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !970, file: !919, line: 498, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !970, file: !919, line: 504, baseType: !973, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !970, file: !919, line: 505, baseType: !973, size: 64, align: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !970, file: !919, line: 506, baseType: !973, size: 64, align: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !970, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !970, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !970, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !919, line: 517, baseType: !983, size: 32, align: 32, offset: 352)
!983 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !970, file: !919, line: 523, baseType: !985, size: 64, align: 64, offset: 384)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !919, line: 443, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !970, file: !919, line: 526, baseType: !991, size: 64, align: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !995)
!995 = !{!996, !997, !1001, !1031, !1032, !1033, !1034, !1038, !1044, !1046, !1050}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !994, file: !26, line: 72, baseType: !973, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !994, file: !26, line: 78, baseType: !998, size: 64, align: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!973, !967}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !994, file: !26, line: 85, baseType: !1002, size: 64, align: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1027, !1028, !1029, !1030}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !4, line: 247, baseType: !973, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1004, file: !4, line: 253, baseType: !973, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1004, file: !4, line: 259, baseType: !983, size: 32, align: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1004, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1004, file: !4, line: 271, baseType: !1011, size: 64, align: 64, offset: 192)
!1011 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1004, file: !4, line: 265, size: 64, align: 64, elements: !1012)
!1012 = !{!1013, !1017, !1019, !1020}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1011, file: !4, line: 266, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1015, line: 197, baseType: !1016)
!1015 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1016 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1011, file: !4, line: 267, baseType: !1018, size: 64, align: 64)
!1018 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1011, file: !4, line: 268, baseType: !973, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1011, file: !4, line: 270, baseType: !1021, size: 64, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1022, line: 61, baseType: !1023)
!1022 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1022, line: 58, size: 64, align: 32, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1023, file: !1022, line: 59, baseType: !983, size: 32, align: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1023, file: !1022, line: 60, baseType: !983, size: 32, align: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1004, file: !4, line: 272, baseType: !1018, size: 64, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1004, file: !4, line: 273, baseType: !1018, size: 64, align: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1004, file: !4, line: 275, baseType: !983, size: 32, align: 32, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1004, file: !4, line: 300, baseType: !973, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !994, file: !26, line: 93, baseType: !983, size: 32, align: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !994, file: !26, line: 99, baseType: !983, size: 32, align: 32, offset: 224)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !994, file: !26, line: 108, baseType: !983, size: 32, align: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !994, file: !26, line: 113, baseType: !1035, size: 64, align: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!967, !967, !967}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !994, file: !26, line: 123, baseType: !1039, size: 64, align: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1042, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !994, file: !26, line: 130, baseType: !1045, size: 32, align: 32, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !994, file: !26, line: 136, baseType: !1047, size: 64, align: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1045, !967}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !994, file: !26, line: 142, baseType: !1051, size: 64, align: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!983, !1054, !967, !973, !983}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1057)
!1057 = !{!1058, !1070, !1071}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1056, file: !4, line: 360, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1062, file: !4, line: 307, baseType: !973, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1062, file: !4, line: 313, baseType: !1018, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1062, file: !4, line: 313, baseType: !1018, size: 64, align: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1062, file: !4, line: 318, baseType: !1018, size: 64, align: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1062, file: !4, line: 318, baseType: !1018, size: 64, align: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1062, file: !4, line: 323, baseType: !983, size: 32, align: 32, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1056, file: !4, line: 364, baseType: !983, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1056, file: !4, line: 368, baseType: !983, size: 32, align: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !970, file: !919, line: 535, baseType: !1073, size: 64, align: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !970, file: !919, line: 539, baseType: !983, size: 32, align: 32, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !970, file: !919, line: 541, baseType: !1076, size: 64, align: 64, offset: 640)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!983, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1210, !1211, !1212, !1279, !1280, !1281, !1997, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2051, !2052, !2053, !2054, !2055, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2086, !2087, !2090, !2091, !2092, !2093, !2094, !2095, !2100, !2101, !2102, !2103, !2111, !2112, !2116, !2120, !2121, !2122}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1080, file: !919, line: 1342, baseType: !991, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1080, file: !919, line: 1349, baseType: !1084, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1111, !1112, !1153, !1154, !1158, !1163, !1164, !1165, !1169, !1187, !1209}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1085, file: !919, line: 638, baseType: !973, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1085, file: !919, line: 645, baseType: !973, size: 64, align: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !919, line: 652, baseType: !983, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1085, file: !919, line: 659, baseType: !973, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1085, file: !919, line: 661, baseType: !985, size: 64, align: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1085, file: !919, line: 663, baseType: !991, size: 64, align: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1085, file: !919, line: 670, baseType: !973, size: 64, align: 64, offset: 384)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1085, file: !919, line: 679, baseType: !1084, size: 64, align: 64, offset: 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1085, file: !919, line: 684, baseType: !983, size: 32, align: 32, offset: 512)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1085, file: !919, line: 689, baseType: !983, size: 32, align: 32, offset: 544)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1085, file: !919, line: 696, baseType: !1098, size: 64, align: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!983, !1101}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1104)
!1104 = !{!1105, !1106, !1109, !1110}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1103, file: !919, line: 449, baseType: !973, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1103, file: !919, line: 450, baseType: !1107, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1103, file: !919, line: 451, baseType: !983, size: 32, align: 32, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1103, file: !919, line: 452, baseType: !973, size: 64, align: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1085, file: !919, line: 703, baseType: !1076, size: 64, align: 64, offset: 640)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1085, file: !919, line: 714, baseType: !1113, size: 64, align: 64, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!983, !1079, !1116}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1119)
!1119 = !{!1120, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1149, !1150, !1151, !1152}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1118, file: !47, line: 1451, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1123, line: 94, baseType: !1124)
!1123 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1123, line: 81, size: 192, align: 64, elements: !1125)
!1125 = !{!1126, !1130, !1134}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1124, file: !1123, line: 82, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1123, line: 73, baseType: !1129)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1123, line: 73, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !1123, line: 89, baseType: !1131, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1133, line: 48, baseType: !1108)
!1133 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1124, file: !1123, line: 93, baseType: !983, size: 32, align: 32, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1118, file: !47, line: 1461, baseType: !1014, size: 64, align: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1118, file: !47, line: 1467, baseType: !1014, size: 64, align: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !47, line: 1468, baseType: !1131, size: 64, align: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1118, file: !47, line: 1469, baseType: !983, size: 32, align: 32, offset: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1118, file: !47, line: 1470, baseType: !983, size: 32, align: 32, offset: 288)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1118, file: !47, line: 1474, baseType: !983, size: 32, align: 32, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1118, file: !47, line: 1479, baseType: !1142, size: 64, align: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1145)
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !47, line: 1412, baseType: !1131, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !47, line: 1413, baseType: !983, size: 32, align: 32, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1144, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1118, file: !47, line: 1480, baseType: !983, size: 32, align: 32, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1118, file: !47, line: 1486, baseType: !1014, size: 64, align: 64, offset: 512)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1118, file: !47, line: 1488, baseType: !1014, size: 64, align: 64, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1118, file: !47, line: 1497, baseType: !1014, size: 64, align: 64, offset: 640)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1085, file: !919, line: 720, baseType: !1076, size: 64, align: 64, offset: 768)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1085, file: !919, line: 730, baseType: !1155, size: 64, align: 64, offset: 832)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!983, !1079, !983, !1014, !983}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1085, file: !919, line: 737, baseType: !1159, size: 64, align: 64, offset: 896)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!1014, !1079, !983, !1162, !1014}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1085, file: !919, line: 744, baseType: !1076, size: 64, align: 64, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1085, file: !919, line: 750, baseType: !1076, size: 64, align: 64, offset: 1024)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1085, file: !919, line: 758, baseType: !1166, size: 64, align: 64, offset: 1088)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!983, !1079, !983, !1014, !1014, !1014, !983}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1085, file: !919, line: 764, baseType: !1170, size: 64, align: 64, offset: 1152)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!983, !1079, !1173}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !939, line: 460, size: 128, align: 64, elements: !1175)
!1175 = !{!1176, !1185, !1186}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "devices", scope: !1174, file: !939, line: 461, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDeviceInfo", file: !939, line: 455, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfo", file: !939, line: 452, size: 128, align: 64, elements: !1181)
!1181 = !{!1182, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "device_name", scope: !1180, file: !939, line: 453, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "device_description", scope: !1180, file: !939, line: 454, baseType: !1183, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "nb_devices", scope: !1174, file: !939, line: 462, baseType: !983, size: 32, align: 32, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "default_device", scope: !1174, file: !939, line: 463, baseType: !983, size: 32, align: 32, offset: 96)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1085, file: !919, line: 770, baseType: !1188, size: 64, align: 64, offset: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!983, !1079, !1191}
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !939, line: 400, size: 576, align: 64, elements: !1193)
!1193 = !{!1194, !1195, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1192, file: !939, line: 401, baseType: !991, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "device_context", scope: !1192, file: !939, line: 402, baseType: !1196, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !1080)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1192, file: !939, line: 403, baseType: !46, size: 32, align: 32, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "sample_format", scope: !1192, file: !939, line: 404, baseType: !649, size: 32, align: 32, offset: 160)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_format", scope: !1192, file: !939, line: 405, baseType: !666, size: 32, align: 32, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1192, file: !939, line: 406, baseType: !983, size: 32, align: 32, offset: 224)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1192, file: !939, line: 407, baseType: !983, size: 32, align: 32, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1192, file: !939, line: 408, baseType: !1014, size: 64, align: 64, offset: 320)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "window_width", scope: !1192, file: !939, line: 409, baseType: !983, size: 32, align: 32, offset: 384)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "window_height", scope: !1192, file: !939, line: 410, baseType: !983, size: 32, align: 32, offset: 416)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "frame_width", scope: !1192, file: !939, line: 411, baseType: !983, size: 32, align: 32, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "frame_height", scope: !1192, file: !939, line: 412, baseType: !983, size: 32, align: 32, offset: 480)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "fps", scope: !1192, file: !939, line: 413, baseType: !1021, size: 64, align: 32, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1085, file: !919, line: 776, baseType: !1188, size: 64, align: 64, offset: 1280)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1080, file: !919, line: 1356, baseType: !1073, size: 64, align: 64, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1080, file: !919, line: 1365, baseType: !967, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1080, file: !919, line: 1379, baseType: !1213, size: 64, align: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !866, line: 352, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !866, line: 161, size: 2112, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1221, !1222, !1223, !1227, !1228, !1232, !1233, !1234, !1235, !1236, !1238, !1239, !1246, !1247, !1251, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1269, !1270, !1271, !1272, !1276, !1277, !1278}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1215, file: !866, line: 174, baseType: !991, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1215, file: !866, line: 226, baseType: !1107, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1215, file: !866, line: 227, baseType: !983, size: 32, align: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1215, file: !866, line: 228, baseType: !1107, size: 64, align: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1215, file: !866, line: 229, baseType: !1107, size: 64, align: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1215, file: !866, line: 233, baseType: !967, size: 64, align: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1215, file: !866, line: 235, baseType: !1224, size: 64, align: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!983, !967, !1131, !983}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1215, file: !866, line: 236, baseType: !1224, size: 64, align: 64, offset: 448)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1215, file: !866, line: 237, baseType: !1229, size: 64, align: 64, offset: 512)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!1014, !967, !1014, !983}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1215, file: !866, line: 238, baseType: !1014, size: 64, align: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1215, file: !866, line: 239, baseType: !983, size: 32, align: 32, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1215, file: !866, line: 240, baseType: !983, size: 32, align: 32, offset: 672)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1215, file: !866, line: 241, baseType: !983, size: 32, align: 32, offset: 704)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1215, file: !866, line: 242, baseType: !1237, size: 64, align: 64, offset: 768)
!1237 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1215, file: !866, line: 243, baseType: !1107, size: 64, align: 64, offset: 832)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1215, file: !866, line: 244, baseType: !1240, size: 64, align: 64, offset: 896)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1237, !1237, !1243, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1245 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1215, file: !866, line: 245, baseType: !983, size: 32, align: 32, offset: 960)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1215, file: !866, line: 249, baseType: !1248, size: 64, align: 64, offset: 1024)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!983, !967, !983}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1215, file: !866, line: 255, baseType: !1252, size: 64, align: 64, offset: 1088)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!1014, !967, !983, !1014, !983}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1215, file: !866, line: 260, baseType: !983, size: 32, align: 32, offset: 1152)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1215, file: !866, line: 266, baseType: !1014, size: 64, align: 64, offset: 1216)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1215, file: !866, line: 273, baseType: !983, size: 32, align: 32, offset: 1280)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1215, file: !866, line: 279, baseType: !1014, size: 64, align: 64, offset: 1344)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1215, file: !866, line: 285, baseType: !983, size: 32, align: 32, offset: 1408)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1215, file: !866, line: 291, baseType: !983, size: 32, align: 32, offset: 1440)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1215, file: !866, line: 298, baseType: !983, size: 32, align: 32, offset: 1472)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1215, file: !866, line: 304, baseType: !983, size: 32, align: 32, offset: 1504)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1215, file: !866, line: 309, baseType: !973, size: 64, align: 64, offset: 1536)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1215, file: !866, line: 314, baseType: !973, size: 64, align: 64, offset: 1600)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1215, file: !866, line: 319, baseType: !1266, size: 64, align: 64, offset: 1664)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!983, !967, !1131, !983, !865, !1014}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1215, file: !866, line: 326, baseType: !983, size: 32, align: 32, offset: 1728)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1215, file: !866, line: 331, baseType: !865, size: 32, align: 32, offset: 1760)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1215, file: !866, line: 332, baseType: !1014, size: 64, align: 64, offset: 1792)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1215, file: !866, line: 338, baseType: !1273, size: 64, align: 64, offset: 1856)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!983, !967}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1215, file: !866, line: 340, baseType: !1014, size: 64, align: 64, offset: 1920)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1215, file: !866, line: 346, baseType: !1107, size: 64, align: 64, offset: 1984)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1215, file: !866, line: 351, baseType: !983, size: 32, align: 32, offset: 2048)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1080, file: !919, line: 1386, baseType: !983, size: 32, align: 32, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1080, file: !919, line: 1393, baseType: !1245, size: 32, align: 32, offset: 352)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1080, file: !919, line: 1405, baseType: !1282, size: 64, align: 64, offset: 384)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1845, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1945, !1951, !1952, !1956, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1988, !1989, !1990, !1991, !1992, !1993}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1285, file: !919, line: 866, baseType: !983, size: 32, align: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1285, file: !919, line: 872, baseType: !983, size: 32, align: 32, offset: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1285, file: !919, line: 878, baseType: !1290, size: 64, align: 64, offset: 64)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1520, !1521, !1522, !1523, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1549, !1553, !1554, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1733, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1292, file: !47, line: 1561, baseType: !991, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1292, file: !47, line: 1562, baseType: !983, size: 32, align: 32, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1292, file: !47, line: 1564, baseType: !874, size: 32, align: 32, offset: 96)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1292, file: !47, line: 1565, baseType: !1298, size: 64, align: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1310, !1313, !1316, !1319, !1323, !1324, !1325, !1333, !1334, !1335, !1337, !1341, !1347, !1352, !1356, !1357, !1404, !1491, !1495, !1496, !1500, !1504, !1509, !1513, !1514, !1515}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1300, file: !47, line: 3475, baseType: !973, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1300, file: !47, line: 3480, baseType: !973, size: 64, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1300, file: !47, line: 3481, baseType: !874, size: 32, align: 32, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1300, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1300, file: !47, line: 3487, baseType: !983, size: 32, align: 32, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1300, file: !47, line: 3488, baseType: !1308, size: 64, align: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1300, file: !47, line: 3489, baseType: !1311, size: 64, align: 64, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1300, file: !47, line: 3490, baseType: !1314, size: 64, align: 64, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1300, file: !47, line: 3491, baseType: !1317, size: 64, align: 64, offset: 448)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1300, file: !47, line: 3492, baseType: !1320, size: 64, align: 64, offset: 512)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1322)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1133, line: 55, baseType: !1237)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1300, file: !47, line: 3493, baseType: !1132, size: 8, align: 8, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1300, file: !47, line: 3494, baseType: !991, size: 64, align: 64, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1300, file: !47, line: 3495, baseType: !1326, size: 64, align: 64, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1330)
!1330 = !{!1331, !1332}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1329, file: !47, line: 3402, baseType: !983, size: 32, align: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1329, file: !47, line: 3403, baseType: !973, size: 64, align: 64, offset: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1300, file: !47, line: 3507, baseType: !973, size: 64, align: 64, offset: 768)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1300, file: !47, line: 3516, baseType: !983, size: 32, align: 32, offset: 832)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1300, file: !47, line: 3517, baseType: !1336, size: 64, align: 64, offset: 896)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1300, file: !47, line: 3527, baseType: !1338, size: 64, align: 64, offset: 960)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!983, !1290}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1300, file: !47, line: 3535, baseType: !1342, size: 64, align: 64, offset: 1024)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!983, !1290, !1345}
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1291)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1300, file: !47, line: 3541, baseType: !1348, size: 64, align: 64, offset: 1088)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1351)
!1351 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1300, file: !47, line: 3549, baseType: !1353, size: 64, align: 64, offset: 1152)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{null, !1336}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1300, file: !47, line: 3551, baseType: !1338, size: 64, align: 64, offset: 1216)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1300, file: !47, line: 3552, baseType: !1358, size: 64, align: 64, offset: 1280)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!983, !1290, !1131, !983, !1361}
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1364)
!1364 = !{!1365, !1368, !1370, !1371, !1372, !1403}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1363, file: !47, line: 3921, baseType: !1366, size: 16, align: 16)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1133, line: 49, baseType: !1367)
!1367 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1363, file: !47, line: 3922, baseType: !1369, size: 32, align: 32, offset: 32)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1133, line: 51, baseType: !1245)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1363, file: !47, line: 3923, baseType: !1369, size: 32, align: 32, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1363, file: !47, line: 3924, baseType: !1245, size: 32, align: 32, offset: 96)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1363, file: !47, line: 3925, baseType: !1373, size: 64, align: 64, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1381, !1382, !1383, !1393, !1397, !1399, !1400, !1401, !1402}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1376, file: !47, line: 3886, baseType: !983, size: 32, align: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1376, file: !47, line: 3887, baseType: !983, size: 32, align: 32, offset: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1376, file: !47, line: 3888, baseType: !983, size: 32, align: 32, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1376, file: !47, line: 3889, baseType: !983, size: 32, align: 32, offset: 96)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1376, file: !47, line: 3890, baseType: !983, size: 32, align: 32, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1376, file: !47, line: 3897, baseType: !1384, size: 768, align: 64, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1385)
!1385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1386)
!1386 = !{!1387, !1391}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1385, file: !47, line: 3855, baseType: !1388, size: 512, align: 64)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 512, align: 64, elements: !1389)
!1389 = !{!1390}
!1390 = !DISubrange(count: 8)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1385, file: !47, line: 3857, baseType: !1392, size: 256, align: 32, offset: 512)
!1392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 256, align: 32, elements: !1389)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1376, file: !47, line: 3903, baseType: !1394, size: 256, align: 64, offset: 960)
!1394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 256, align: 64, elements: !1395)
!1395 = !{!1396}
!1396 = !DISubrange(count: 4)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1376, file: !47, line: 3904, baseType: !1398, size: 128, align: 32, offset: 1216)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !983, size: 128, align: 32, elements: !1395)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1376, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1376, file: !47, line: 3908, baseType: !1183, size: 64, align: 64, offset: 1408)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1376, file: !47, line: 3915, baseType: !1183, size: 64, align: 64, offset: 1472)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1376, file: !47, line: 3917, baseType: !983, size: 32, align: 32, offset: 1536)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1363, file: !47, line: 3926, baseType: !1014, size: 64, align: 64, offset: 192)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1300, file: !47, line: 3564, baseType: !1405, size: 64, align: 64, offset: 1344)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!983, !1290, !1116, !1408, !1490}
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1410)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1412)
!1412 = !{!1413, !1414, !1415, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1442, !1444, !1445, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1478, !1479, !1480, !1481, !1482, !1483, !1486, !1487, !1488, !1489}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1411, file: !548, line: 282, baseType: !1388, size: 512, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1411, file: !548, line: 299, baseType: !1392, size: 256, align: 32, offset: 512)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1411, file: !548, line: 315, baseType: !1416, size: 64, align: 64, offset: 768)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1411, file: !548, line: 326, baseType: !983, size: 32, align: 32, offset: 832)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1411, file: !548, line: 326, baseType: !983, size: 32, align: 32, offset: 864)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1411, file: !548, line: 334, baseType: !983, size: 32, align: 32, offset: 896)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1411, file: !548, line: 341, baseType: !983, size: 32, align: 32, offset: 928)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1411, file: !548, line: 346, baseType: !983, size: 32, align: 32, offset: 960)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1411, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1411, file: !548, line: 356, baseType: !1021, size: 64, align: 32, offset: 1024)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1411, file: !548, line: 361, baseType: !1014, size: 64, align: 64, offset: 1088)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1411, file: !548, line: 369, baseType: !1014, size: 64, align: 64, offset: 1152)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1411, file: !548, line: 377, baseType: !1014, size: 64, align: 64, offset: 1216)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1411, file: !548, line: 382, baseType: !983, size: 32, align: 32, offset: 1280)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1411, file: !548, line: 386, baseType: !983, size: 32, align: 32, offset: 1312)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1411, file: !548, line: 391, baseType: !983, size: 32, align: 32, offset: 1344)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1411, file: !548, line: 396, baseType: !967, size: 64, align: 64, offset: 1408)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1411, file: !548, line: 403, baseType: !1432, size: 512, align: 64, offset: 1472)
!1432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1322, size: 512, align: 64, elements: !1389)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1411, file: !548, line: 410, baseType: !983, size: 32, align: 32, offset: 1984)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1411, file: !548, line: 415, baseType: !983, size: 32, align: 32, offset: 2016)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1411, file: !548, line: 420, baseType: !983, size: 32, align: 32, offset: 2048)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1411, file: !548, line: 425, baseType: !983, size: 32, align: 32, offset: 2080)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1411, file: !548, line: 435, baseType: !1014, size: 64, align: 64, offset: 2112)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1411, file: !548, line: 440, baseType: !983, size: 32, align: 32, offset: 2176)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1411, file: !548, line: 445, baseType: !1322, size: 64, align: 64, offset: 2240)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1411, file: !548, line: 459, baseType: !1441, size: 512, align: 64, offset: 2304)
!1441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 512, align: 64, elements: !1389)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1411, file: !548, line: 473, baseType: !1443, size: 64, align: 64, offset: 2816)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1411, file: !548, line: 477, baseType: !983, size: 32, align: 32, offset: 2880)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1411, file: !548, line: 479, baseType: !1446, size: 64, align: 64, offset: 2944)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454, !1459}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1449, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1449, file: !548, line: 203, baseType: !1131, size: 64, align: 64, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1449, file: !548, line: 204, baseType: !983, size: 32, align: 32, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1449, file: !548, line: 205, baseType: !1455, size: 64, align: 64, offset: 192)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1457, line: 86, baseType: !1458)
!1457 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1458 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1457, line: 86, flags: DIFlagFwdDecl)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1449, file: !548, line: 206, baseType: !1121, size: 64, align: 64, offset: 256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1411, file: !548, line: 480, baseType: !983, size: 32, align: 32, offset: 3008)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1411, file: !548, line: 505, baseType: !983, size: 32, align: 32, offset: 3040)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1411, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1411, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1411, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1411, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1411, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1411, file: !548, line: 532, baseType: !1014, size: 64, align: 64, offset: 3264)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1411, file: !548, line: 539, baseType: !1014, size: 64, align: 64, offset: 3328)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1411, file: !548, line: 547, baseType: !1014, size: 64, align: 64, offset: 3392)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1411, file: !548, line: 554, baseType: !1455, size: 64, align: 64, offset: 3456)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1411, file: !548, line: 563, baseType: !983, size: 32, align: 32, offset: 3520)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1411, file: !548, line: 572, baseType: !983, size: 32, align: 32, offset: 3552)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1411, file: !548, line: 581, baseType: !983, size: 32, align: 32, offset: 3584)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1411, file: !548, line: 588, baseType: !1475, size: 64, align: 64, offset: 3648)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1015, line: 194, baseType: !1477)
!1477 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1411, file: !548, line: 593, baseType: !983, size: 32, align: 32, offset: 3712)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1411, file: !548, line: 596, baseType: !983, size: 32, align: 32, offset: 3744)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1411, file: !548, line: 599, baseType: !1121, size: 64, align: 64, offset: 3776)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1411, file: !548, line: 605, baseType: !1121, size: 64, align: 64, offset: 3840)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1411, file: !548, line: 616, baseType: !1121, size: 64, align: 64, offset: 3904)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1411, file: !548, line: 626, baseType: !1484, size: 64, align: 64, offset: 3968)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1485, line: 216, baseType: !1237)
!1485 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1411, file: !548, line: 627, baseType: !1484, size: 64, align: 64, offset: 4032)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1411, file: !548, line: 628, baseType: !1484, size: 64, align: 64, offset: 4096)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1411, file: !548, line: 629, baseType: !1484, size: 64, align: 64, offset: 4160)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1411, file: !548, line: 645, baseType: !1121, size: 64, align: 64, offset: 4224)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1300, file: !47, line: 3566, baseType: !1492, size: 64, align: 64, offset: 1408)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!983, !1290, !967, !1490, !1116}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1300, file: !47, line: 3567, baseType: !1338, size: 64, align: 64, offset: 1472)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1300, file: !47, line: 3576, baseType: !1497, size: 64, align: 64, offset: 1536)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!983, !1290, !1408}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1300, file: !47, line: 3577, baseType: !1501, size: 64, align: 64, offset: 1600)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!983, !1290, !1116}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1300, file: !47, line: 3584, baseType: !1505, size: 64, align: 64, offset: 1664)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!983, !1290, !1508}
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1300, file: !47, line: 3589, baseType: !1510, size: 64, align: 64, offset: 1728)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{null, !1290}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1300, file: !47, line: 3594, baseType: !983, size: 32, align: 32, offset: 1792)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1300, file: !47, line: 3600, baseType: !973, size: 64, align: 64, offset: 1856)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1300, file: !47, line: 3609, baseType: !1516, size: 64, align: 64, offset: 1920)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1519)
!1519 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1292, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1292, file: !47, line: 1581, baseType: !1245, size: 32, align: 32, offset: 224)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1292, file: !47, line: 1583, baseType: !967, size: 64, align: 64, offset: 256)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1292, file: !47, line: 1591, baseType: !1524, size: 64, align: 64, offset: 320)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1292, file: !47, line: 1598, baseType: !967, size: 64, align: 64, offset: 384)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1292, file: !47, line: 1606, baseType: !1014, size: 64, align: 64, offset: 448)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1292, file: !47, line: 1614, baseType: !983, size: 32, align: 32, offset: 512)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1292, file: !47, line: 1622, baseType: !983, size: 32, align: 32, offset: 544)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1292, file: !47, line: 1628, baseType: !983, size: 32, align: 32, offset: 576)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1292, file: !47, line: 1636, baseType: !983, size: 32, align: 32, offset: 608)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1292, file: !47, line: 1643, baseType: !983, size: 32, align: 32, offset: 640)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1292, file: !47, line: 1657, baseType: !1131, size: 64, align: 64, offset: 704)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1292, file: !47, line: 1658, baseType: !983, size: 32, align: 32, offset: 768)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1292, file: !47, line: 1679, baseType: !1021, size: 64, align: 32, offset: 800)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1292, file: !47, line: 1688, baseType: !983, size: 32, align: 32, offset: 864)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1292, file: !47, line: 1712, baseType: !983, size: 32, align: 32, offset: 896)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1292, file: !47, line: 1729, baseType: !983, size: 32, align: 32, offset: 928)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1292, file: !47, line: 1729, baseType: !983, size: 32, align: 32, offset: 960)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1292, file: !47, line: 1744, baseType: !983, size: 32, align: 32, offset: 992)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1292, file: !47, line: 1744, baseType: !983, size: 32, align: 32, offset: 1024)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1292, file: !47, line: 1751, baseType: !983, size: 32, align: 32, offset: 1056)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1292, file: !47, line: 1766, baseType: !666, size: 32, align: 32, offset: 1088)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1292, file: !47, line: 1791, baseType: !1545, size: 64, align: 64, offset: 1152)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{null, !1548, !1408, !1490, !983, !983, !983}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1292, file: !47, line: 1808, baseType: !1550, size: 64, align: 64, offset: 1216)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!666, !1548, !1311}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1292, file: !47, line: 1816, baseType: !983, size: 32, align: 32, offset: 1280)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1292, file: !47, line: 1825, baseType: !1555, size: 32, align: 32, offset: 1312)
!1555 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1292, file: !47, line: 1830, baseType: !983, size: 32, align: 32, offset: 1344)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1292, file: !47, line: 1838, baseType: !1555, size: 32, align: 32, offset: 1376)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1292, file: !47, line: 1846, baseType: !983, size: 32, align: 32, offset: 1408)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1292, file: !47, line: 1851, baseType: !983, size: 32, align: 32, offset: 1440)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1292, file: !47, line: 1861, baseType: !1555, size: 32, align: 32, offset: 1472)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1292, file: !47, line: 1868, baseType: !1555, size: 32, align: 32, offset: 1504)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1292, file: !47, line: 1875, baseType: !1555, size: 32, align: 32, offset: 1536)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1292, file: !47, line: 1882, baseType: !1555, size: 32, align: 32, offset: 1568)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1292, file: !47, line: 1889, baseType: !1555, size: 32, align: 32, offset: 1600)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1292, file: !47, line: 1896, baseType: !1555, size: 32, align: 32, offset: 1632)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1292, file: !47, line: 1903, baseType: !1555, size: 32, align: 32, offset: 1664)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1292, file: !47, line: 1910, baseType: !983, size: 32, align: 32, offset: 1696)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1292, file: !47, line: 1915, baseType: !983, size: 32, align: 32, offset: 1728)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1292, file: !47, line: 1926, baseType: !1490, size: 64, align: 64, offset: 1792)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1292, file: !47, line: 1935, baseType: !1021, size: 64, align: 32, offset: 1856)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1292, file: !47, line: 1942, baseType: !983, size: 32, align: 32, offset: 1920)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1292, file: !47, line: 1948, baseType: !983, size: 32, align: 32, offset: 1952)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1292, file: !47, line: 1954, baseType: !983, size: 32, align: 32, offset: 1984)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1292, file: !47, line: 1960, baseType: !983, size: 32, align: 32, offset: 2016)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1292, file: !47, line: 1984, baseType: !983, size: 32, align: 32, offset: 2048)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1292, file: !47, line: 1991, baseType: !983, size: 32, align: 32, offset: 2080)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1292, file: !47, line: 1996, baseType: !983, size: 32, align: 32, offset: 2112)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1292, file: !47, line: 2004, baseType: !983, size: 32, align: 32, offset: 2144)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1292, file: !47, line: 2011, baseType: !983, size: 32, align: 32, offset: 2176)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1292, file: !47, line: 2018, baseType: !983, size: 32, align: 32, offset: 2208)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1292, file: !47, line: 2027, baseType: !983, size: 32, align: 32, offset: 2240)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1292, file: !47, line: 2034, baseType: !983, size: 32, align: 32, offset: 2272)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1292, file: !47, line: 2044, baseType: !983, size: 32, align: 32, offset: 2304)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1292, file: !47, line: 2054, baseType: !1585, size: 64, align: 64, offset: 2368)
!1585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1292, file: !47, line: 2061, baseType: !1585, size: 64, align: 64, offset: 2432)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1292, file: !47, line: 2066, baseType: !983, size: 32, align: 32, offset: 2496)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1292, file: !47, line: 2070, baseType: !983, size: 32, align: 32, offset: 2528)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1292, file: !47, line: 2078, baseType: !983, size: 32, align: 32, offset: 2560)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1292, file: !47, line: 2085, baseType: !983, size: 32, align: 32, offset: 2592)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1292, file: !47, line: 2092, baseType: !983, size: 32, align: 32, offset: 2624)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1292, file: !47, line: 2099, baseType: !983, size: 32, align: 32, offset: 2656)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1292, file: !47, line: 2106, baseType: !983, size: 32, align: 32, offset: 2688)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1292, file: !47, line: 2113, baseType: !983, size: 32, align: 32, offset: 2720)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1292, file: !47, line: 2120, baseType: !983, size: 32, align: 32, offset: 2752)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1292, file: !47, line: 2125, baseType: !983, size: 32, align: 32, offset: 2784)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1292, file: !47, line: 2133, baseType: !983, size: 32, align: 32, offset: 2816)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1292, file: !47, line: 2140, baseType: !983, size: 32, align: 32, offset: 2848)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1292, file: !47, line: 2145, baseType: !983, size: 32, align: 32, offset: 2880)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1292, file: !47, line: 2153, baseType: !983, size: 32, align: 32, offset: 2912)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1292, file: !47, line: 2158, baseType: !983, size: 32, align: 32, offset: 2944)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1292, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1292, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1292, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1292, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1292, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1292, file: !47, line: 2203, baseType: !983, size: 32, align: 32, offset: 3136)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1292, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1292, file: !47, line: 2212, baseType: !983, size: 32, align: 32, offset: 3200)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1292, file: !47, line: 2213, baseType: !983, size: 32, align: 32, offset: 3232)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1292, file: !47, line: 2220, baseType: !649, size: 32, align: 32, offset: 3264)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1292, file: !47, line: 2232, baseType: !983, size: 32, align: 32, offset: 3296)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1292, file: !47, line: 2243, baseType: !983, size: 32, align: 32, offset: 3328)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1292, file: !47, line: 2249, baseType: !983, size: 32, align: 32, offset: 3360)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1292, file: !47, line: 2256, baseType: !983, size: 32, align: 32, offset: 3392)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1292, file: !47, line: 2263, baseType: !1322, size: 64, align: 64, offset: 3456)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1292, file: !47, line: 2270, baseType: !1322, size: 64, align: 64, offset: 3520)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1292, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1292, file: !47, line: 2285, baseType: !649, size: 32, align: 32, offset: 3616)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1292, file: !47, line: 2367, baseType: !1621, size: 64, align: 64, offset: 3648)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DISubroutineType(types: !1623)
!1623 = !{!983, !1548, !1508, !983}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1292, file: !47, line: 2383, baseType: !983, size: 32, align: 32, offset: 3712)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1292, file: !47, line: 2386, baseType: !1555, size: 32, align: 32, offset: 3744)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1292, file: !47, line: 2387, baseType: !1555, size: 32, align: 32, offset: 3776)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1292, file: !47, line: 2394, baseType: !983, size: 32, align: 32, offset: 3808)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1292, file: !47, line: 2401, baseType: !983, size: 32, align: 32, offset: 3840)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1292, file: !47, line: 2408, baseType: !983, size: 32, align: 32, offset: 3872)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1292, file: !47, line: 2415, baseType: !983, size: 32, align: 32, offset: 3904)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1292, file: !47, line: 2422, baseType: !983, size: 32, align: 32, offset: 3936)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1292, file: !47, line: 2423, baseType: !1633, size: 64, align: 64, offset: 3968)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1635)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1636)
!1636 = !{!1637, !1638, !1639, !1640}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1635, file: !47, line: 827, baseType: !983, size: 32, align: 32)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1635, file: !47, line: 828, baseType: !983, size: 32, align: 32, offset: 32)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1635, file: !47, line: 829, baseType: !983, size: 32, align: 32, offset: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1635, file: !47, line: 830, baseType: !1555, size: 32, align: 32, offset: 96)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1292, file: !47, line: 2430, baseType: !1014, size: 64, align: 64, offset: 4032)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1292, file: !47, line: 2437, baseType: !1014, size: 64, align: 64, offset: 4096)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1292, file: !47, line: 2444, baseType: !1555, size: 32, align: 32, offset: 4160)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1292, file: !47, line: 2451, baseType: !1555, size: 32, align: 32, offset: 4192)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1292, file: !47, line: 2458, baseType: !983, size: 32, align: 32, offset: 4224)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1292, file: !47, line: 2469, baseType: !983, size: 32, align: 32, offset: 4256)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1292, file: !47, line: 2475, baseType: !983, size: 32, align: 32, offset: 4288)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1292, file: !47, line: 2481, baseType: !983, size: 32, align: 32, offset: 4320)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1292, file: !47, line: 2485, baseType: !983, size: 32, align: 32, offset: 4352)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1292, file: !47, line: 2489, baseType: !983, size: 32, align: 32, offset: 4384)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1292, file: !47, line: 2493, baseType: !983, size: 32, align: 32, offset: 4416)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1292, file: !47, line: 2501, baseType: !983, size: 32, align: 32, offset: 4448)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1292, file: !47, line: 2506, baseType: !983, size: 32, align: 32, offset: 4480)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1292, file: !47, line: 2510, baseType: !983, size: 32, align: 32, offset: 4512)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1292, file: !47, line: 2514, baseType: !1014, size: 64, align: 64, offset: 4544)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1292, file: !47, line: 2528, baseType: !1657, size: 64, align: 64, offset: 4608)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{null, !1548, !967, !983, !983}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1292, file: !47, line: 2534, baseType: !983, size: 32, align: 32, offset: 4672)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1292, file: !47, line: 2545, baseType: !983, size: 32, align: 32, offset: 4704)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1292, file: !47, line: 2547, baseType: !983, size: 32, align: 32, offset: 4736)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1292, file: !47, line: 2549, baseType: !983, size: 32, align: 32, offset: 4768)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1292, file: !47, line: 2551, baseType: !983, size: 32, align: 32, offset: 4800)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1292, file: !47, line: 2553, baseType: !983, size: 32, align: 32, offset: 4832)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1292, file: !47, line: 2555, baseType: !983, size: 32, align: 32, offset: 4864)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1292, file: !47, line: 2557, baseType: !983, size: 32, align: 32, offset: 4896)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1292, file: !47, line: 2559, baseType: !983, size: 32, align: 32, offset: 4928)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1292, file: !47, line: 2563, baseType: !983, size: 32, align: 32, offset: 4960)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1292, file: !47, line: 2571, baseType: !1183, size: 64, align: 64, offset: 4992)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1292, file: !47, line: 2579, baseType: !1183, size: 64, align: 64, offset: 5056)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1292, file: !47, line: 2586, baseType: !983, size: 32, align: 32, offset: 5120)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1292, file: !47, line: 2615, baseType: !983, size: 32, align: 32, offset: 5152)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1292, file: !47, line: 2627, baseType: !983, size: 32, align: 32, offset: 5184)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1292, file: !47, line: 2637, baseType: !983, size: 32, align: 32, offset: 5216)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1292, file: !47, line: 2681, baseType: !983, size: 32, align: 32, offset: 5248)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1292, file: !47, line: 2709, baseType: !1014, size: 64, align: 64, offset: 5312)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1292, file: !47, line: 2716, baseType: !1679, size: 64, align: 64, offset: 5376)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1681)
!1681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1682)
!1682 = !{!1683, !1684, !1685, !1686, !1687, !1688, !1689, !1693, !1697, !1698, !1699, !1700, !1706, !1707, !1708, !1709, !1710}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1681, file: !47, line: 3642, baseType: !973, size: 64, align: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1681, file: !47, line: 3649, baseType: !874, size: 32, align: 32, offset: 64)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1681, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1681, file: !47, line: 3663, baseType: !666, size: 32, align: 32, offset: 128)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1681, file: !47, line: 3669, baseType: !983, size: 32, align: 32, offset: 160)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1681, file: !47, line: 3682, baseType: !1505, size: 64, align: 64, offset: 192)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1681, file: !47, line: 3698, baseType: !1690, size: 64, align: 64, offset: 256)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!983, !1290, !1243, !1369}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1681, file: !47, line: 3712, baseType: !1694, size: 64, align: 64, offset: 320)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{!983, !1290, !983, !1243, !1369}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1681, file: !47, line: 3726, baseType: !1690, size: 64, align: 64, offset: 384)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1681, file: !47, line: 3737, baseType: !1338, size: 64, align: 64, offset: 448)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1681, file: !47, line: 3746, baseType: !983, size: 32, align: 32, offset: 512)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1681, file: !47, line: 3757, baseType: !1701, size: 64, align: 64, offset: 576)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{null, !1704}
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1681, file: !47, line: 3766, baseType: !1338, size: 64, align: 64, offset: 640)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1681, file: !47, line: 3774, baseType: !1338, size: 64, align: 64, offset: 704)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1681, file: !47, line: 3780, baseType: !983, size: 32, align: 32, offset: 768)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1681, file: !47, line: 3785, baseType: !983, size: 32, align: 32, offset: 800)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1681, file: !47, line: 3795, baseType: !1711, size: 64, align: 64, offset: 832)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!983, !1290, !1121}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1292, file: !47, line: 2728, baseType: !967, size: 64, align: 64, offset: 5440)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1292, file: !47, line: 2735, baseType: !1432, size: 512, align: 64, offset: 5504)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1292, file: !47, line: 2742, baseType: !983, size: 32, align: 32, offset: 6016)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1292, file: !47, line: 2755, baseType: !983, size: 32, align: 32, offset: 6048)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1292, file: !47, line: 2776, baseType: !983, size: 32, align: 32, offset: 6080)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1292, file: !47, line: 2783, baseType: !983, size: 32, align: 32, offset: 6112)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1292, file: !47, line: 2791, baseType: !983, size: 32, align: 32, offset: 6144)
