; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mdct_fixed.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mdct_fixed.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, i16*, i16*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, i16*, i16*)*, void (%struct.FFTContext*, i16*, i16*)*, void (%struct.FFTContext*, i16*, i16*)*, void (%struct.FFTContext*, i32*, i16*)*, i32, i32, i32* }
%struct.FFTComplex = type { i16, i16 }
%struct.FFTDComplex = type { i32, i32 }

; Function Attrs: cold nounwind optsize uwtable
define i32 @ff_mdct_init_fixed(%struct.FFTContext* %s, i32 %nbits, i32 %inverse, double %scale) #0 !dbg !37 {
entry:
  %retval.i45 = alloca i32, align 4
  %a.addr.i46 = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %a.addr.i46, metadata !83, metadata !88), !dbg !89
  %amin.addr.i47 = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %amin.addr.i47, metadata !95, metadata !88), !dbg !96
  %amax.addr.i48 = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %amax.addr.i48, metadata !97, metadata !88), !dbg !98
  %retval.i = alloca i32, align 4
  %a.addr.i = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mdct_fixed.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !{!14, !15, !25, !26, !27}
!14 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !4, line: 64, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !4, line: 62, size: 32, align: 16, elements: !18)
!18 = !{!19, !24}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !17, file: !4, line: 63, baseType: !20, size: 16, align: 16)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !4, line: 58, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !22, line: 195, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!23 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !17, file: !4, line: 63, baseType: !20, size: 16, align: 16, offset: 16)
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDComplex", file: !4, line: 73, baseType: !29)
!29 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTDComplex", file: !4, line: 71, size: 64, align: 32, elements: !30)
!30 = !{!31, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !29, file: !4, line: 72, baseType: !32, size: 32, align: 32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 66, baseType: !25)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !29, file: !4, line: 72, baseType: !32, size: 32, align: 32, offset: 32)
!34 = !{i32 2, !"Dwarf Version", i32 4}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!37 = distinct !DISubprogram(name: "ff_mdct_init_fixed", scope: !38, file: !38, line: 48, type: !39, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !82)
!38 = !DIFile(filename: "libavcodec/mdct_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!39 = !DISubroutineType(types: !40)
!40 = !{!25, !41, !25, !25, !14}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !4, line: 67, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !44)
!44 = !{!45, !46, !47, !52, !53, !54, !55, !57, !58, !63, !64, !70, !71, !72, !77, !78, !79}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !43, file: !4, line: 89, baseType: !25, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !43, file: !4, line: 90, baseType: !25, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !43, file: !4, line: 91, baseType: !48, size: 64, align: 64, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !50, line: 49, baseType: !51)
!50 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!51 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !43, file: !4, line: 92, baseType: !15, size: 64, align: 64, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !43, file: !4, line: 93, baseType: !25, size: 32, align: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !43, file: !4, line: 94, baseType: !25, size: 32, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !43, file: !4, line: 96, baseType: !56, size: 64, align: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !43, file: !4, line: 97, baseType: !56, size: 64, align: 64, offset: 320)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !43, file: !4, line: 101, baseType: !59, size: 64, align: 64, offset: 384)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !62, !15}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !43, file: !4, line: 106, baseType: !59, size: 64, align: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !43, file: !4, line: 107, baseType: !65, size: 64, align: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !62, !56, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !43, file: !4, line: 108, baseType: !65, size: 64, align: 64, offset: 576)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !43, file: !4, line: 109, baseType: !65, size: 64, align: 64, offset: 640)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !43, file: !4, line: 110, baseType: !73, size: 64, align: 64, offset: 704)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{null, !62, !76, !68}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !43, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !43, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !43, file: !4, line: 113, baseType: !80, size: 64, align: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !50, line: 51, baseType: !26)
!82 = !{}
!83 = !DILocalVariable(name: "a", arg: 1, scope: !84, file: !85, line: 127, type: !25)
!84 = distinct !DISubprogram(name: "av_clip_c", scope: !85, file: !85, line: 127, type: !86, isLocal: true, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !82)
!85 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!86 = !DISubroutineType(types: !87)
!87 = !{!25, !25, !25, !25}
!88 = !DIExpression()
!89 = !DILocation(line: 127, column: 87, scope: !84, inlinedAt: !90)
!90 = distinct !DILocation(line: 90, column: 28, scope: !91)
!91 = !DILexicalBlockFile(scope: !92, file: !38, discriminator: 2)
!92 = distinct !DILexicalBlock(scope: !93, file: !38, line: 83, column: 23)
!93 = distinct !DILexicalBlock(scope: !94, file: !38, line: 83, column: 5)
!94 = distinct !DILexicalBlock(scope: !37, file: !38, line: 83, column: 5)
!95 = !DILocalVariable(name: "amin", arg: 2, scope: !84, file: !85, line: 127, type: !25)
!96 = !DILocation(line: 127, column: 94, scope: !84, inlinedAt: !90)
!97 = !DILocalVariable(name: "amax", arg: 3, scope: !84, file: !85, line: 127, type: !25)
!98 = !DILocation(line: 127, column: 104, scope: !84, inlinedAt: !90)
!99 = !DILocation(line: 127, column: 87, scope: !84, inlinedAt: !100)
!100 = distinct !DILocation(line: 89, column: 28, scope: !91)
!101 = !DILocation(line: 127, column: 94, scope: !84, inlinedAt: !100)
!102 = !DILocation(line: 127, column: 104, scope: !84, inlinedAt: !100)
!103 = !DILocalVariable(name: "s", arg: 1, scope: !37, file: !38, line: 48, type: !41)
!104 = !DILocation(line: 48, column: 58, scope: !37)
!105 = !DILocalVariable(name: "nbits", arg: 2, scope: !37, file: !38, line: 48, type: !25)
!106 = !DILocation(line: 48, column: 65, scope: !37)
!107 = !DILocalVariable(name: "inverse", arg: 3, scope: !37, file: !38, line: 48, type: !25)
!108 = !DILocation(line: 48, column: 76, scope: !37)
!109 = !DILocalVariable(name: "scale", arg: 4, scope: !37, file: !38, line: 48, type: !14)
!110 = !DILocation(line: 48, column: 92, scope: !37)
!111 = !DILocalVariable(name: "n", scope: !37, file: !38, line: 50, type: !25)
!112 = !DILocation(line: 50, column: 9, scope: !37)
!113 = !DILocalVariable(name: "n4", scope: !37, file: !38, line: 50, type: !25)
!114 = !DILocation(line: 50, column: 12, scope: !37)
!115 = !DILocalVariable(name: "i", scope: !37, file: !38, line: 50, type: !25)
!116 = !DILocation(line: 50, column: 16, scope: !37)
!117 = !DILocalVariable(name: "alpha", scope: !37, file: !38, line: 51, type: !14)
!118 = !DILocation(line: 51, column: 12, scope: !37)
!119 = !DILocalVariable(name: "theta", scope: !37, file: !38, line: 51, type: !14)
!120 = !DILocation(line: 51, column: 19, scope: !37)
!121 = !DILocalVariable(name: "tstep", scope: !37, file: !38, line: 52, type: !25)
!122 = !DILocation(line: 52, column: 9, scope: !37)
!123 = !DILocation(line: 54, column: 12, scope: !37)
!124 = !DILocation(line: 54, column: 5, scope: !37)
!125 = !DILocation(line: 55, column: 14, scope: !37)
!126 = !DILocation(line: 55, column: 11, scope: !37)
!127 = !DILocation(line: 55, column: 7, scope: !37)
!128 = !DILocation(line: 56, column: 20, scope: !37)
!129 = !DILocation(line: 56, column: 5, scope: !37)
!130 = !DILocation(line: 56, column: 8, scope: !37)
!131 = !DILocation(line: 56, column: 18, scope: !37)
!132 = !DILocation(line: 57, column: 20, scope: !37)
!133 = !DILocation(line: 57, column: 5, scope: !37)
!134 = !DILocation(line: 57, column: 8, scope: !37)
!135 = !DILocation(line: 57, column: 18, scope: !37)
!136 = !DILocation(line: 58, column: 10, scope: !37)
!137 = !DILocation(line: 58, column: 12, scope: !37)
