; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--fft_fixed_32.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--fft_fixed_32.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, i32*, i32*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, i32*, i32*)*, void (%struct.FFTContext*, i32*, i32*)*, void (%struct.FFTContext*, i32*, i32*)*, void (%struct.FFTContext*, i32*, i32*)*, i32, i32, i32* }
%struct.FFTComplex = type { i32, i32 }

@ff_fft_init_fixed_32.control = internal global i32 0, align 4
@ff_fft_offsets_lut = external global [0 x i16], align 2
@avx_tab = internal constant [16 x i32] [i32 0, i32 4, i32 1, i32 5, i32 8, i32 12, i32 9, i32 13, i32 2, i32 6, i32 3, i32 7, i32 10, i32 14, i32 11, i32 15], align 16
@ff_w_tab_sr = external constant [0 x i32], align 4

; Function Attrs: cold nounwind optsize uwtable
define void @ff_init_ff_cos_tabs_fixed_32(i32 %index) #0 !dbg !86 {
entry:
  %index.addr = alloca i32, align 4
  store i32 %index, i32* %index.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %index.addr, metadata !89, metadata !90), !dbg !91
  ret void, !dbg !92
}

; Function Attrs: nounwind readnone
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !13, globals: !20)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--fft_fixed_32.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !9}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !{!14, !15, !18, !19}
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !16, line: 197, baseType: !17)
!16 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!17 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !16, line: 196, baseType: !18)
!20 = !{!21, !78}
!21 = distinct !DIGlobalVariable(name: "control", scope: !22, file: !23, line: 240, type: !76, isLocal: true, isDefinition: true, variable: i32* @ff_fft_init_fixed_32.control)
!22 = distinct !DISubprogram(name: "ff_fft_init_fixed_32", scope: !23, file: !23, line: 203, type: !24, isLocal: false, isDefinition: true, scopeLine: 204, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!23 = !DIFile(filename: "libavcodec/fft_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!24 = !DISubroutineType(types: !25)
!25 = !{!18, !26, !18, !18}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !4, line: 67, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !29)
!29 = !{!30, !31, !32, !37, !45, !46, !47, !49, !50, !55, !56, !62, !63, !64, !70, !71, !72}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !28, file: !4, line: 89, baseType: !18, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !28, file: !4, line: 90, baseType: !18, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !28, file: !4, line: 91, baseType: !33, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !35, line: 49, baseType: !36)
!35 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!36 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !28, file: !4, line: 92, baseType: !38, size: 64, align: 64, offset: 128)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !4, line: 64, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !4, line: 62, size: 64, align: 32, elements: !41)
!41 = !{!42, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !40, file: !4, line: 63, baseType: !43, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !4, line: 52, baseType: !19)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !40, file: !4, line: 63, baseType: !43, size: 32, align: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !28, file: !4, line: 93, baseType: !18, size: 32, align: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !28, file: !4, line: 94, baseType: !18, size: 32, align: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !28, file: !4, line: 96, baseType: !48, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !28, file: !4, line: 97, baseType: !48, size: 64, align: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !28, file: !4, line: 101, baseType: !51, size: 64, align: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !54, !38}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !28, file: !4, line: 106, baseType: !51, size: 64, align: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !28, file: !4, line: 107, baseType: !57, size: 64, align: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !54, !48, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !28, file: !4, line: 108, baseType: !57, size: 64, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !28, file: !4, line: 109, baseType: !57, size: 64, align: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !28, file: !4, line: 110, baseType: !65, size: 64, align: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DISubroutineType(types: !67)
!67 = !{null, !54, !68, !60}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 66, baseType: !18)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !28, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !28, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !28, file: !4, line: 113, baseType: !73, size: 64, align: 64, offset: 832)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !35, line: 51, baseType: !14)
!75 = !{}
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !77, line: 168, baseType: !18)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!78 = distinct !DIGlobalVariable(name: "avx_tab", scope: !0, file: !23, line: 165, type: !79, isLocal: true, isDefinition: true, variable: [16 x i32]* @avx_tab)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !80, size: 512, align: 32, elements: !81)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!81 = !{!82}
!82 = !DISubrange(count: 16)
!83 = !{i32 2, !"Dwarf Version", i32 4}
!84 = !{i32 2, !"Debug Info Version", i32 3}
!85 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!86 = distinct !DISubprogram(name: "ff_init_ff_cos_tabs_fixed_32", scope: !23, file: !23, line: 158, type: !87, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !75)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !18}
!89 = !DILocalVariable(name: "index", arg: 1, scope: !86, file: !23, line: 158, type: !18)
!90 = !DIExpression()
!91 = !DILocation(line: 158, column: 61, scope: !86)
!92 = !DILocation(line: 163, column: 1, scope: !86)
!93 = !DILocalVariable(name: "s", arg: 1, scope: !22, file: !23, line: 203, type: !26)
!94 = !DILocation(line: 203, column: 60, scope: !22)
!95 = !DILocalVariable(name: "nbits", arg: 2, scope: !22, file: !23, line: 203, type: !18)
!96 = !DILocation(line: 203, column: 67, scope: !22)
!97 = !DILocalVariable(name: "inverse", arg: 3, scope: !22, file: !23, line: 203, type: !18)
!98 = !DILocation(line: 203, column: 78, scope: !22)
!99 = !DILocalVariable(name: "i", scope: !22, file: !23, line: 205, type: !18)
!100 = !DILocation(line: 205, column: 9, scope: !22)
!101 = !DILocalVariable(name: "j", scope: !22, file: !23, line: 205, type: !18)
!102 = !DILocation(line: 205, column: 12, scope: !22)
!103 = !DILocalVariable(name: "n", scope: !22, file: !23, line: 205, type: !18)
!104 = !DILocation(line: 205, column: 15, scope: !22)
!105 = !DILocation(line: 207, column: 5, scope: !22)
!106 = !DILocation(line: 207, column: 8, scope: !22)
!107 = !DILocation(line: 207, column: 15, scope: !22)
!108 = !DILocation(line: 208, column: 5, scope: !22)
!109 = !DILocation(line: 208, column: 8, scope: !22)
!110 = !DILocation(line: 208, column: 17, scope: !22)
!111 = !DILocation(line: 210, column: 9, scope: !112)
!112 = distinct !DILexicalBlock(scope: !22, file: !23, line: 210, column: 9)
!113 = !DILocation(line: 210, column: 15, scope: !112)
!114 = !DILocation(line: 210, column: 19, scope: !112)
!115 = !DILocation(line: 210, column: 22, scope: !116)
!116 = !DILexicalBlockFile(scope: !112, file: !23, discriminator: 1)
!117 = !DILocation(line: 210, column: 28, scope: !116)
!118 = !DILocation(line: 210, column: 9, scope: !116)
!119 = !DILocation(line: 211, column: 9, scope: !112)
!120 = !DILocation(line: 212, column: 16, scope: !22)
!121 = !DILocation(line: 212, column: 5, scope: !22)
!122 = !DILocation(line: 212, column: 8, scope: !22)
!123 = !DILocation(line: 212, column: 14, scope: !22)
!124 = !DILocation(line: 213, column: 14, scope: !22)
!125 = !DILocation(line: 213, column: 11, scope: !22)
!126 = !DILocation(line: 213, column: 7, scope: !22)
!127 = !DILocation(line: 215, column: 9, scope: !128)
!128 = distinct !DILexicalBlock(scope: !22, file: !23, line: 215, column: 9)
!129 = !DILocation(line: 215, column: 15, scope: !128)
!130 = !DILocation(line: 215, column: 9, scope: !22)
!131 = !DILocation(line: 216, column: 31, scope: !132)
!132 = distinct !DILexicalBlock(scope: !128, file: !23, line: 215, column: 22)
