; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--latmenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--latmenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AudioObjectType", file: !939, line: 72, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavcodec/mpeg4audio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983}
!941 = !DIEnumerator(name: "AOT_NULL", value: 0)
!942 = !DIEnumerator(name: "AOT_AAC_MAIN", value: 1)
!943 = !DIEnumerator(name: "AOT_AAC_LC", value: 2)
!944 = !DIEnumerator(name: "AOT_AAC_SSR", value: 3)
!945 = !DIEnumerator(name: "AOT_AAC_LTP", value: 4)
!946 = !DIEnumerator(name: "AOT_SBR", value: 5)
!947 = !DIEnumerator(name: "AOT_AAC_SCALABLE", value: 6)
!948 = !DIEnumerator(name: "AOT_TWINVQ", value: 7)
!949 = !DIEnumerator(name: "AOT_CELP", value: 8)
!950 = !DIEnumerator(name: "AOT_HVXC", value: 9)
!951 = !DIEnumerator(name: "AOT_TTSI", value: 12)
!952 = !DIEnumerator(name: "AOT_MAINSYNTH", value: 13)
!953 = !DIEnumerator(name: "AOT_WAVESYNTH", value: 14)
!954 = !DIEnumerator(name: "AOT_MIDI", value: 15)
!955 = !DIEnumerator(name: "AOT_SAFX", value: 16)
!956 = !DIEnumerator(name: "AOT_ER_AAC_LC", value: 17)
!957 = !DIEnumerator(name: "AOT_ER_AAC_LTP", value: 19)
!958 = !DIEnumerator(name: "AOT_ER_AAC_SCALABLE", value: 20)
!959 = !DIEnumerator(name: "AOT_ER_TWINVQ", value: 21)
!960 = !DIEnumerator(name: "AOT_ER_BSAC", value: 22)
!961 = !DIEnumerator(name: "AOT_ER_AAC_LD", value: 23)
!962 = !DIEnumerator(name: "AOT_ER_CELP", value: 24)
!963 = !DIEnumerator(name: "AOT_ER_HVXC", value: 25)
!964 = !DIEnumerator(name: "AOT_ER_HILN", value: 26)
!965 = !DIEnumerator(name: "AOT_ER_PARAM", value: 27)
!966 = !DIEnumerator(name: "AOT_SSC", value: 28)
!967 = !DIEnumerator(name: "AOT_PS", value: 29)
!968 = !DIEnumerator(name: "AOT_SURROUND", value: 30)
!969 = !DIEnumerator(name: "AOT_ESCAPE", value: 31)
!970 = !DIEnumerator(name: "AOT_L1", value: 32)
!971 = !DIEnumerator(name: "AOT_L2", value: 33)
!972 = !DIEnumerator(name: "AOT_L3", value: 34)
!973 = !DIEnumerator(name: "AOT_DST", value: 35)
!974 = !DIEnumerator(name: "AOT_ALS", value: 36)
!975 = !DIEnumerator(name: "AOT_SLS", value: 37)
!976 = !DIEnumerator(name: "AOT_SLS_NON_CORE", value: 38)
!977 = !DIEnumerator(name: "AOT_ER_AAC_ELD", value: 39)
!978 = !DIEnumerator(name: "AOT_SMR_SIMPLE", value: 40)
!979 = !DIEnumerator(name: "AOT_SMR_MAIN", value: 41)
!980 = !DIEnumerator(name: "AOT_USAC_NOSBR", value: 42)
!981 = !DIEnumerator(name: "AOT_SAOC", value: 43)
!982 = !DIEnumerator(name: "AOT_LD_SURROUND", value: 44)
!983 = !DIEnumerator(name: "AOT_USAC", value: 45)
!984 = !{!985, !986, !987, !996, !997, !1003, !1005}
!985 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!986 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !990, line: 222, size: 16, align: 8, elements: !991)
!990 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!991 = !{!992}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !989, file: !990, line: 222, baseType: !993, size: 16, align: 16)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !994, line: 49, baseType: !995)
!994 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!995 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !990, line: 221, size: 32, align: 8, elements: !1000)
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !999, file: !990, line: 221, baseType: !1002, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !994, line: 51, baseType: !986)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !994, line: 48, baseType: !1004)
!1004 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!1006 = !{!1007, !2307, !2308}
!1007 = distinct !DIGlobalVariable(name: "ff_latm_muxer", scope: !0, file: !1008, line: 243, type: !1009, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_latm_muxer)
!1008 = !DIFile(filename: "libavformat/latmenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1011)
!1011 = !{!1012, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1033, !1114, !1116, !1117, !2272, !2273, !2274, !2278, !2282, !2286, !2287, !2292, !2293, !2294, !2295, !2296, !2297, !2301}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1010, file: !919, line: 498, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1010, file: !919, line: 504, baseType: !1013, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1010, file: !919, line: 505, baseType: !1013, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1010, file: !919, line: 506, baseType: !1013, size: 64, align: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1010, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1010, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1010, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !919, line: 517, baseType: !985, size: 32, align: 32, offset: 352)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1010, file: !919, line: 523, baseType: !1024, size: 64, align: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1029, line: 44, size: 64, align: 32, elements: !1030)
!1029 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1028, file: !1029, line: 45, baseType: !3, size: 32, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1028, file: !1029, line: 46, baseType: !986, size: 32, align: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1010, file: !919, line: 526, baseType: !1034, size: 64, align: 64, offset: 448)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1044, !1073, !1074, !1075, !1076, !1080, !1086, !1088, !1092}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1037, file: !486, line: 72, baseType: !1013, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1037, file: !486, line: 78, baseType: !1041, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!1013, !996}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1037, file: !486, line: 85, baseType: !1045, size: 64, align: 64, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1069, !1070, !1071, !1072}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !464, line: 247, baseType: !1013, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1047, file: !464, line: 253, baseType: !1013, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1047, file: !464, line: 259, baseType: !985, size: 32, align: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1047, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1047, file: !464, line: 271, baseType: !1054, size: 64, align: 64, offset: 192)
!1054 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1047, file: !464, line: 265, size: 64, align: 64, elements: !1055)
!1055 = !{!1056, !1059, !1061, !1062}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1054, file: !464, line: 266, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !994, line: 40, baseType: !1058)
!1058 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1054, file: !464, line: 267, baseType: !1060, size: 64, align: 64)
!1060 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1054, file: !464, line: 268, baseType: !1013, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1054, file: !464, line: 270, baseType: !1063, size: 64, align: 32)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1064, line: 61, baseType: !1065)
!1064 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1064, line: 58, size: 64, align: 32, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1065, file: !1064, line: 59, baseType: !985, size: 32, align: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1065, file: !1064, line: 60, baseType: !985, size: 32, align: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1047, file: !464, line: 272, baseType: !1060, size: 64, align: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1047, file: !464, line: 273, baseType: !1060, size: 64, align: 64, offset: 320)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1047, file: !464, line: 275, baseType: !985, size: 32, align: 32, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1047, file: !464, line: 300, baseType: !1013, size: 64, align: 64, offset: 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1037, file: !486, line: 93, baseType: !985, size: 32, align: 32, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1037, file: !486, line: 99, baseType: !985, size: 32, align: 32, offset: 224)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1037, file: !486, line: 108, baseType: !985, size: 32, align: 32, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1037, file: !486, line: 113, baseType: !1077, size: 64, align: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!996, !996, !996}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1037, file: !486, line: 123, baseType: !1081, size: 64, align: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!1084, !1084}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1037, file: !486, line: 130, baseType: !1087, size: 32, align: 32, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1037, file: !486, line: 136, baseType: !1089, size: 64, align: 64, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!1087, !996}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1037, file: !486, line: 142, baseType: !1093, size: 64, align: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!985, !1096, !996, !1013, !985}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1099)
!1099 = !{!1100, !1112, !1113}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1098, file: !464, line: 360, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1104, file: !464, line: 307, baseType: !1013, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1104, file: !464, line: 313, baseType: !1060, size: 64, align: 64, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1104, file: !464, line: 313, baseType: !1060, size: 64, align: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1104, file: !464, line: 318, baseType: !1060, size: 64, align: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1104, file: !464, line: 318, baseType: !1060, size: 64, align: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1104, file: !464, line: 323, baseType: !985, size: 32, align: 32, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1098, file: !464, line: 364, baseType: !985, size: 32, align: 32, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1098, file: !464, line: 368, baseType: !985, size: 32, align: 32, offset: 96)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1010, file: !919, line: 535, baseType: !1115, size: 64, align: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1010, file: !919, line: 539, baseType: !985, size: 32, align: 32, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1010, file: !919, line: 541, baseType: !1118, size: 64, align: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!985, !1121}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1123)
!1123 = !{!1124, !1125, !1221, !1222, !1223, !1289, !1290, !1291, !2126, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2163, !2164, !2165, !2166, !2167, !2168, !2169, !2180, !2181, !2182, !2183, !2184, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2235, !2236, !2239, !2240, !2241, !2242, !2243, !2244, !2249, !2250, !2251, !2252, !2260, !2261, !2265, !2269, !2270, !2271}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1122, file: !919, line: 1342, baseType: !1034, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1122, file: !919, line: 1349, baseType: !1126, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1128)
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1152, !1153, !1192, !1193, !1197, !1202, !1203, !1204, !1208, !1214, !1220}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1127, file: !919, line: 638, baseType: !1013, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1127, file: !919, line: 645, baseType: !1013, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1127, file: !919, line: 652, baseType: !985, size: 32, align: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1127, file: !919, line: 659, baseType: !1013, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1127, file: !919, line: 661, baseType: !1024, size: 64, align: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1127, file: !919, line: 663, baseType: !1034, size: 64, align: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1127, file: !919, line: 670, baseType: !1013, size: 64, align: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1127, file: !919, line: 679, baseType: !1126, size: 64, align: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1127, file: !919, line: 684, baseType: !985, size: 32, align: 32, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1127, file: !919, line: 689, baseType: !985, size: 32, align: 32, offset: 544)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1127, file: !919, line: 696, baseType: !1140, size: 64, align: 64, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!985, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1146)
!1146 = !{!1147, !1148, !1150, !1151}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1145, file: !919, line: 449, baseType: !1013, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1145, file: !919, line: 450, baseType: !1149, size: 64, align: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1145, file: !919, line: 451, baseType: !985, size: 32, align: 32, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1145, file: !919, line: 452, baseType: !1013, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1127, file: !919, line: 703, baseType: !1118, size: 64, align: 64, offset: 640)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1127, file: !919, line: 714, baseType: !1154, size: 64, align: 64, offset: 704)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!985, !1121, !1157}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1160)
!1160 = !{!1161, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1188, !1189, !1190, !1191}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1159, file: !4, line: 1451, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1164, line: 94, baseType: !1165)
!1164 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1164, line: 81, size: 192, align: 64, elements: !1166)
!1166 = !{!1167, !1171, !1173}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1165, file: !1164, line: 82, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1164, line: 73, baseType: !1170)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1164, line: 73, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1165, file: !1164, line: 89, baseType: !1172, size: 64, align: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1165, file: !1164, line: 93, baseType: !985, size: 32, align: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1159, file: !4, line: 1461, baseType: !1057, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1159, file: !4, line: 1467, baseType: !1057, size: 64, align: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !4, line: 1468, baseType: !1172, size: 64, align: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !4, line: 1469, baseType: !985, size: 32, align: 32, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1159, file: !4, line: 1470, baseType: !985, size: 32, align: 32, offset: 288)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1159, file: !4, line: 1474, baseType: !985, size: 32, align: 32, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1159, file: !4, line: 1479, baseType: !1181, size: 64, align: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1187}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !4, line: 1412, baseType: !1172, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1183, file: !4, line: 1413, baseType: !985, size: 32, align: 32, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1183, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1159, file: !4, line: 1480, baseType: !985, size: 32, align: 32, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1159, file: !4, line: 1486, baseType: !1057, size: 64, align: 64, offset: 512)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1159, file: !4, line: 1488, baseType: !1057, size: 64, align: 64, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1159, file: !4, line: 1497, baseType: !1057, size: 64, align: 64, offset: 640)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1127, file: !919, line: 720, baseType: !1118, size: 64, align: 64, offset: 768)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1127, file: !919, line: 730, baseType: !1194, size: 64, align: 64, offset: 832)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!985, !1121, !985, !1057, !985}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1127, file: !919, line: 737, baseType: !1198, size: 64, align: 64, offset: 896)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!1057, !1121, !985, !1201, !1057}
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1127, file: !919, line: 744, baseType: !1118, size: 64, align: 64, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1127, file: !919, line: 750, baseType: !1118, size: 64, align: 64, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1127, file: !919, line: 758, baseType: !1205, size: 64, align: 64, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!985, !1121, !985, !1057, !1057, !1057, !985}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1127, file: !919, line: 764, baseType: !1209, size: 64, align: 64, offset: 1152)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!985, !1121, !1212}
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1127, file: !919, line: 770, baseType: !1215, size: 64, align: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!985, !1121, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1127, file: !919, line: 776, baseType: !1215, size: 64, align: 64, offset: 1280)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1122, file: !919, line: 1356, baseType: !1115, size: 64, align: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1122, file: !919, line: 1365, baseType: !996, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1122, file: !919, line: 1379, baseType: !1224, size: 64, align: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1234, !1238, !1239, !1243, !1244, !1245, !1246, !1247, !1249, !1250, !1256, !1257, !1261, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1279, !1280, !1281, !1282, !1286, !1287, !1288}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1226, file: !537, line: 174, baseType: !1034, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1226, file: !537, line: 226, baseType: !1149, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1226, file: !537, line: 227, baseType: !985, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1226, file: !537, line: 228, baseType: !1149, size: 64, align: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1226, file: !537, line: 229, baseType: !1149, size: 64, align: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1226, file: !537, line: 233, baseType: !996, size: 64, align: 64, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1226, file: !537, line: 235, baseType: !1235, size: 64, align: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!985, !996, !1172, !985}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1226, file: !537, line: 236, baseType: !1235, size: 64, align: 64, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1226, file: !537, line: 237, baseType: !1240, size: 64, align: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1057, !996, !1057, !985}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1226, file: !537, line: 238, baseType: !1057, size: 64, align: 64, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1226, file: !537, line: 239, baseType: !985, size: 32, align: 32, offset: 640)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1226, file: !537, line: 240, baseType: !985, size: 32, align: 32, offset: 672)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1226, file: !537, line: 241, baseType: !985, size: 32, align: 32, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1226, file: !537, line: 242, baseType: !1248, size: 64, align: 64, offset: 768)
!1248 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1226, file: !537, line: 243, baseType: !1149, size: 64, align: 64, offset: 832)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1226, file: !537, line: 244, baseType: !1251, size: 64, align: 64, offset: 896)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!1248, !1248, !1254, !986}
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1226, file: !537, line: 245, baseType: !985, size: 32, align: 32, offset: 960)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1226, file: !537, line: 249, baseType: !1258, size: 64, align: 64, offset: 1024)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!985, !996, !985}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1226, file: !537, line: 255, baseType: !1262, size: 64, align: 64, offset: 1088)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!1057, !996, !985, !1057, !985}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1226, file: !537, line: 260, baseType: !985, size: 32, align: 32, offset: 1152)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1226, file: !537, line: 266, baseType: !1057, size: 64, align: 64, offset: 1216)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1226, file: !537, line: 273, baseType: !985, size: 32, align: 32, offset: 1280)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1226, file: !537, line: 279, baseType: !1057, size: 64, align: 64, offset: 1344)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1226, file: !537, line: 285, baseType: !985, size: 32, align: 32, offset: 1408)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1226, file: !537, line: 291, baseType: !985, size: 32, align: 32, offset: 1440)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1226, file: !537, line: 298, baseType: !985, size: 32, align: 32, offset: 1472)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1226, file: !537, line: 304, baseType: !985, size: 32, align: 32, offset: 1504)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1226, file: !537, line: 309, baseType: !1013, size: 64, align: 64, offset: 1536)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1226, file: !537, line: 314, baseType: !1013, size: 64, align: 64, offset: 1600)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1226, file: !537, line: 319, baseType: !1276, size: 64, align: 64, offset: 1664)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!985, !996, !1172, !985, !536, !1057}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1226, file: !537, line: 326, baseType: !985, size: 32, align: 32, offset: 1728)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1226, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1226, file: !537, line: 332, baseType: !1057, size: 64, align: 64, offset: 1792)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1226, file: !537, line: 338, baseType: !1283, size: 64, align: 64, offset: 1856)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!985, !996}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1226, file: !537, line: 340, baseType: !1057, size: 64, align: 64, offset: 1920)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1226, file: !537, line: 346, baseType: !1149, size: 64, align: 64, offset: 1984)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1226, file: !537, line: 351, baseType: !985, size: 32, align: 32, offset: 2048)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1122, file: !919, line: 1386, baseType: !985, size: 32, align: 32, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1122, file: !919, line: 1393, baseType: !986, size: 32, align: 32, offset: 352)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1122, file: !919, line: 1405, baseType: !1292, size: 64, align: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1296)
!1296 = !{!1297, !1298, !1299, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !2051, !2057, !2058, !2062, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2094, !2095, !2096, !2097, !2098, !2099}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1295, file: !919, line: 866, baseType: !985, size: 32, align: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1295, file: !919, line: 872, baseType: !985, size: 32, align: 32, offset: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1295, file: !919, line: 878, baseType: !1300, size: 64, align: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1532, !1533, !1534, !1535, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1688, !1692, !1693, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1872, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1302, file: !4, line: 1561, baseType: !1034, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1302, file: !4, line: 1562, baseType: !985, size: 32, align: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1302, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1302, file: !4, line: 1565, baseType: !1308, size: 64, align: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1317, !1320, !1323, !1326, !1329, !1333, !1334, !1335, !1343, !1344, !1345, !1347, !1351, !1357, !1366, !1370, !1371, !1416, !1503, !1507, !1508, !1512, !1516, !1521, !1525, !1526, !1527}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1310, file: !4, line: 3475, baseType: !1013, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1310, file: !4, line: 3480, baseType: !1013, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1310, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1310, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1310, file: !4, line: 3487, baseType: !985, size: 32, align: 32, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1310, file: !4, line: 3488, baseType: !1318, size: 64, align: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1310, file: !4, line: 3489, baseType: !1321, size: 64, align: 64, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1310, file: !4, line: 3490, baseType: !1324, size: 64, align: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1310, file: !4, line: 3491, baseType: !1327, size: 64, align: 64, offset: 448)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1310, file: !4, line: 3492, baseType: !1330, size: 64, align: 64, offset: 512)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !994, line: 55, baseType: !1248)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1310, file: !4, line: 3493, baseType: !1003, size: 8, align: 8, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1310, file: !4, line: 3494, baseType: !1034, size: 64, align: 64, offset: 640)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1310, file: !4, line: 3495, baseType: !1336, size: 64, align: 64, offset: 704)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1338)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1340)
!1340 = !{!1341, !1342}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1339, file: !4, line: 3402, baseType: !985, size: 32, align: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1339, file: !4, line: 3403, baseType: !1013, size: 64, align: 64, offset: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1310, file: !4, line: 3507, baseType: !1013, size: 64, align: 64, offset: 768)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1310, file: !4, line: 3516, baseType: !985, size: 32, align: 32, offset: 832)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1310, file: !4, line: 3517, baseType: !1346, size: 64, align: 64, offset: 896)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1310, file: !4, line: 3527, baseType: !1348, size: 64, align: 64, offset: 960)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!985, !1300}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1310, file: !4, line: 3535, baseType: !1352, size: 64, align: 64, offset: 1024)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DISubroutineType(types: !1354)
!1354 = !{!985, !1300, !1355}
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1301)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1310, file: !4, line: 3541, baseType: !1358, size: 64, align: 64, offset: 1088)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1362, line: 223, size: 128, align: 64, elements: !1363)
!1362 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1361, file: !1362, line: 224, baseType: !1254, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1361, file: !1362, line: 225, baseType: !1254, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1310, file: !4, line: 3549, baseType: !1367, size: 64, align: 64, offset: 1152)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{null, !1346}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1310, file: !4, line: 3551, baseType: !1348, size: 64, align: 64, offset: 1216)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1310, file: !4, line: 3552, baseType: !1372, size: 64, align: 64, offset: 1280)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!985, !1300, !1172, !985, !1375}
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1415}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1377, file: !4, line: 3921, baseType: !993, size: 16, align: 16)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1377, file: !4, line: 3922, baseType: !1002, size: 32, align: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1377, file: !4, line: 3923, baseType: !1002, size: 32, align: 32, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1377, file: !4, line: 3924, baseType: !986, size: 32, align: 32, offset: 96)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1377, file: !4, line: 3925, baseType: !1384, size: 64, align: 64, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394, !1404, !1408, !1410, !1411, !1413, !1414}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1387, file: !4, line: 3886, baseType: !985, size: 32, align: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1387, file: !4, line: 3887, baseType: !985, size: 32, align: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1387, file: !4, line: 3888, baseType: !985, size: 32, align: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1387, file: !4, line: 3889, baseType: !985, size: 32, align: 32, offset: 96)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1387, file: !4, line: 3890, baseType: !985, size: 32, align: 32, offset: 128)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1387, file: !4, line: 3897, baseType: !1395, size: 768, align: 64, offset: 192)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1397)
!1397 = !{!1398, !1402}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1396, file: !4, line: 3855, baseType: !1399, size: 512, align: 64)
!1399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 512, align: 64, elements: !1400)
!1400 = !{!1401}
!1401 = !DISubrange(count: 8)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1396, file: !4, line: 3857, baseType: !1403, size: 256, align: 32, offset: 512)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 256, align: 32, elements: !1400)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1387, file: !4, line: 3903, baseType: !1405, size: 256, align: 64, offset: 960)
!1405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 256, align: 64, elements: !1406)
!1406 = !{!1407}
!1407 = !DISubrange(count: 4)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1387, file: !4, line: 3904, baseType: !1409, size: 128, align: 32, offset: 1216)
!1409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 128, align: 32, elements: !1406)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1387, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1387, file: !4, line: 3908, baseType: !1412, size: 64, align: 64, offset: 1408)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1387, file: !4, line: 3915, baseType: !1412, size: 64, align: 64, offset: 1472)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1387, file: !4, line: 3917, baseType: !985, size: 32, align: 32, offset: 1536)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1377, file: !4, line: 3926, baseType: !1057, size: 64, align: 64, offset: 192)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1310, file: !4, line: 3564, baseType: !1417, size: 64, align: 64, offset: 1344)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!985, !1300, !1157, !1420, !1502}
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1422)
!1422 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1423)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1424)
!1424 = !{!1425, !1426, !1427, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1454, !1456, !1457, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1490, !1491, !1492, !1493, !1494, !1495, !1498, !1499, !1500, !1501}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1423, file: !789, line: 282, baseType: !1399, size: 512, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1423, file: !789, line: 299, baseType: !1403, size: 256, align: 32, offset: 512)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1423, file: !789, line: 315, baseType: !1428, size: 64, align: 64, offset: 768)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1423, file: !789, line: 326, baseType: !985, size: 32, align: 32, offset: 832)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1423, file: !789, line: 326, baseType: !985, size: 32, align: 32, offset: 864)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1423, file: !789, line: 334, baseType: !985, size: 32, align: 32, offset: 896)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1423, file: !789, line: 341, baseType: !985, size: 32, align: 32, offset: 928)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1423, file: !789, line: 346, baseType: !985, size: 32, align: 32, offset: 960)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1423, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1423, file: !789, line: 356, baseType: !1063, size: 64, align: 32, offset: 1024)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1423, file: !789, line: 361, baseType: !1057, size: 64, align: 64, offset: 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1423, file: !789, line: 369, baseType: !1057, size: 64, align: 64, offset: 1152)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1423, file: !789, line: 377, baseType: !1057, size: 64, align: 64, offset: 1216)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1423, file: !789, line: 382, baseType: !985, size: 32, align: 32, offset: 1280)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1423, file: !789, line: 386, baseType: !985, size: 32, align: 32, offset: 1312)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1423, file: !789, line: 391, baseType: !985, size: 32, align: 32, offset: 1344)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1423, file: !789, line: 396, baseType: !996, size: 64, align: 64, offset: 1408)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1423, file: !789, line: 403, baseType: !1444, size: 512, align: 64, offset: 1472)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1332, size: 512, align: 64, elements: !1400)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1423, file: !789, line: 410, baseType: !985, size: 32, align: 32, offset: 1984)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1423, file: !789, line: 415, baseType: !985, size: 32, align: 32, offset: 2016)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1423, file: !789, line: 420, baseType: !985, size: 32, align: 32, offset: 2048)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1423, file: !789, line: 425, baseType: !985, size: 32, align: 32, offset: 2080)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1423, file: !789, line: 435, baseType: !1057, size: 64, align: 64, offset: 2112)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1423, file: !789, line: 440, baseType: !985, size: 32, align: 32, offset: 2176)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1423, file: !789, line: 445, baseType: !1332, size: 64, align: 64, offset: 2240)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1423, file: !789, line: 459, baseType: !1453, size: 512, align: 64, offset: 2304)
!1453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 512, align: 64, elements: !1400)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1423, file: !789, line: 473, baseType: !1455, size: 64, align: 64, offset: 2816)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1423, file: !789, line: 477, baseType: !985, size: 32, align: 32, offset: 2880)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1423, file: !789, line: 479, baseType: !1458, size: 64, align: 64, offset: 2944)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1461)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1471}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1461, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1461, file: !789, line: 203, baseType: !1172, size: 64, align: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1461, file: !789, line: 204, baseType: !985, size: 32, align: 32, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1461, file: !789, line: 205, baseType: !1467, size: 64, align: 64, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1469, line: 86, baseType: !1470)
!1469 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1470 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1469, line: 86, flags: DIFlagFwdDecl)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1461, file: !789, line: 206, baseType: !1162, size: 64, align: 64, offset: 256)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1423, file: !789, line: 480, baseType: !985, size: 32, align: 32, offset: 3008)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1423, file: !789, line: 505, baseType: !985, size: 32, align: 32, offset: 3040)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1423, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1423, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1423, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1423, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1423, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1423, file: !789, line: 532, baseType: !1057, size: 64, align: 64, offset: 3264)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1423, file: !789, line: 539, baseType: !1057, size: 64, align: 64, offset: 3328)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1423, file: !789, line: 547, baseType: !1057, size: 64, align: 64, offset: 3392)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1423, file: !789, line: 554, baseType: !1467, size: 64, align: 64, offset: 3456)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1423, file: !789, line: 563, baseType: !985, size: 32, align: 32, offset: 3520)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1423, file: !789, line: 572, baseType: !985, size: 32, align: 32, offset: 3552)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1423, file: !789, line: 581, baseType: !985, size: 32, align: 32, offset: 3584)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1423, file: !789, line: 588, baseType: !1487, size: 64, align: 64, offset: 3648)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !994, line: 36, baseType: !1489)
!1489 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1423, file: !789, line: 593, baseType: !985, size: 32, align: 32, offset: 3712)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1423, file: !789, line: 596, baseType: !985, size: 32, align: 32, offset: 3744)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1423, file: !789, line: 599, baseType: !1162, size: 64, align: 64, offset: 3776)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1423, file: !789, line: 605, baseType: !1162, size: 64, align: 64, offset: 3840)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1423, file: !789, line: 616, baseType: !1162, size: 64, align: 64, offset: 3904)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1423, file: !789, line: 626, baseType: !1496, size: 64, align: 64, offset: 3968)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1497, line: 216, baseType: !1248)
!1497 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1423, file: !789, line: 627, baseType: !1496, size: 64, align: 64, offset: 4032)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1423, file: !789, line: 628, baseType: !1496, size: 64, align: 64, offset: 4096)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1423, file: !789, line: 629, baseType: !1496, size: 64, align: 64, offset: 4160)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1423, file: !789, line: 645, baseType: !1162, size: 64, align: 64, offset: 4224)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1310, file: !4, line: 3566, baseType: !1504, size: 64, align: 64, offset: 1408)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!985, !1300, !996, !1502, !1157}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1310, file: !4, line: 3567, baseType: !1348, size: 64, align: 64, offset: 1472)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1310, file: !4, line: 3576, baseType: !1509, size: 64, align: 64, offset: 1536)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!985, !1300, !1420}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1310, file: !4, line: 3577, baseType: !1513, size: 64, align: 64, offset: 1600)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!985, !1300, !1157}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1310, file: !4, line: 3584, baseType: !1517, size: 64, align: 64, offset: 1664)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!985, !1300, !1520}
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1310, file: !4, line: 3589, baseType: !1522, size: 64, align: 64, offset: 1728)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DISubroutineType(types: !1524)
!1524 = !{null, !1300}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1310, file: !4, line: 3594, baseType: !985, size: 32, align: 32, offset: 1792)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1310, file: !4, line: 3600, baseType: !1013, size: 64, align: 64, offset: 1856)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1310, file: !4, line: 3609, baseType: !1528, size: 64, align: 64, offset: 1920)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1531)
!1531 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1302, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1302, file: !4, line: 1581, baseType: !986, size: 32, align: 32, offset: 224)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1302, file: !4, line: 1583, baseType: !996, size: 64, align: 64, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1302, file: !4, line: 1591, baseType: !1536, size: 64, align: 64, offset: 320)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1362, line: 129, size: 1664, align: 64, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1542, !1543, !1561, !1562, !1568, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1537, file: !1362, line: 136, baseType: !985, size: 32, align: 32)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1537, file: !1362, line: 151, baseType: !985, size: 32, align: 32, offset: 32)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1537, file: !1362, line: 157, baseType: !985, size: 32, align: 32, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1537, file: !1362, line: 159, baseType: !1520, size: 64, align: 64, offset: 128)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1537, file: !1362, line: 161, baseType: !1544, size: 64, align: 64, offset: 192)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1362, line: 117, baseType: !1546)
!1546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1362, line: 100, size: 832, align: 64, elements: !1547)
!1547 = !{!1548, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1546, file: !1362, line: 105, baseType: !1549, size: 256, align: 64)
!1549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1550, size: 256, align: 64, elements: !1406)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1164, line: 238, baseType: !1552)
!1552 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1164, line: 238, flags: DIFlagFwdDecl)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1546, file: !1362, line: 110, baseType: !985, size: 32, align: 32, offset: 256)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1546, file: !1362, line: 111, baseType: !985, size: 32, align: 32, offset: 288)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1546, file: !1362, line: 111, baseType: !985, size: 32, align: 32, offset: 320)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1546, file: !1362, line: 112, baseType: !1403, size: 256, align: 32, offset: 352)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1546, file: !1362, line: 113, baseType: !1409, size: 128, align: 32, offset: 608)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1546, file: !1362, line: 114, baseType: !985, size: 32, align: 32, offset: 736)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1546, file: !1362, line: 115, baseType: !985, size: 32, align: 32, offset: 768)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1546, file: !1362, line: 116, baseType: !985, size: 32, align: 32, offset: 800)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1537, file: !1362, line: 163, baseType: !996, size: 64, align: 64, offset: 256)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1537, file: !1362, line: 165, baseType: !1563, size: 128, align: 64, offset: 320)
!1563 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1362, line: 122, baseType: !1564)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1362, line: 119, size: 128, align: 64, elements: !1565)
!1565 = !{!1566, !1567}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1564, file: !1362, line: 120, baseType: !1157, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1564, file: !1362, line: 121, baseType: !1520, size: 64, align: 64, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1537, file: !1362, line: 166, baseType: !1569, size: 128, align: 64, offset: 448)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1362, line: 127, baseType: !1570)
!1570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1362, line: 124, size: 128, align: 64, elements: !1571)
!1571 = !{!1572, !1645}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1570, file: !1362, line: 125, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1576)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1577)
!1577 = !{!1578, !1579, !1603, !1607, !1608, !1642, !1643, !1644}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1576, file: !4, line: 5751, baseType: !1034, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1576, file: !4, line: 5756, baseType: !1580, size: 64, align: 64, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1583)
!1583 = !{!1584, !1585, !1588, !1589, !1590, !1594, !1598, !1602}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1582, file: !4, line: 5797, baseType: !1013, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1582, file: !4, line: 5804, baseType: !1586, size: 64, align: 64, offset: 64)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1582, file: !4, line: 5815, baseType: !1034, size: 64, align: 64, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1582, file: !4, line: 5825, baseType: !985, size: 32, align: 32, offset: 192)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1582, file: !4, line: 5826, baseType: !1591, size: 64, align: 64, offset: 256)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{!985, !1574}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1582, file: !4, line: 5827, baseType: !1595, size: 64, align: 64, offset: 320)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{!985, !1574, !1157}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1582, file: !4, line: 5828, baseType: !1599, size: 64, align: 64, offset: 384)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{null, !1574}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1582, file: !4, line: 5829, baseType: !1599, size: 64, align: 64, offset: 448)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1576, file: !4, line: 5762, baseType: !1604, size: 64, align: 64, offset: 128)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1606)
!1606 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1576, file: !4, line: 5768, baseType: !996, size: 64, align: 64, offset: 192)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1576, file: !4, line: 5775, baseType: !1609, size: 64, align: 64, offset: 256)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1611, file: !4, line: 3940, baseType: !545, size: 32, align: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1611, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1611, file: !4, line: 3948, baseType: !1002, size: 32, align: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1611, file: !4, line: 3958, baseType: !1172, size: 64, align: 64, offset: 128)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1611, file: !4, line: 3962, baseType: !985, size: 32, align: 32, offset: 192)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1611, file: !4, line: 3968, baseType: !985, size: 32, align: 32, offset: 224)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1611, file: !4, line: 3973, baseType: !1057, size: 64, align: 64, offset: 256)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1611, file: !4, line: 3986, baseType: !985, size: 32, align: 32, offset: 320)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1611, file: !4, line: 3999, baseType: !985, size: 32, align: 32, offset: 352)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1611, file: !4, line: 4004, baseType: !985, size: 32, align: 32, offset: 384)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1611, file: !4, line: 4005, baseType: !985, size: 32, align: 32, offset: 416)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1611, file: !4, line: 4010, baseType: !985, size: 32, align: 32, offset: 448)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1611, file: !4, line: 4011, baseType: !985, size: 32, align: 32, offset: 480)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1611, file: !4, line: 4020, baseType: !1063, size: 64, align: 32, offset: 512)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1611, file: !4, line: 4025, baseType: !889, size: 32, align: 32, offset: 576)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1611, file: !4, line: 4030, baseType: !812, size: 32, align: 32, offset: 608)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1611, file: !4, line: 4031, baseType: !818, size: 32, align: 32, offset: 640)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1611, file: !4, line: 4032, baseType: !836, size: 32, align: 32, offset: 672)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1611, file: !4, line: 4033, baseType: !860, size: 32, align: 32, offset: 704)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1611, file: !4, line: 4034, baseType: !879, size: 32, align: 32, offset: 736)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1611, file: !4, line: 4039, baseType: !985, size: 32, align: 32, offset: 768)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1611, file: !4, line: 4046, baseType: !1332, size: 64, align: 64, offset: 832)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1611, file: !4, line: 4050, baseType: !985, size: 32, align: 32, offset: 896)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1611, file: !4, line: 4054, baseType: !985, size: 32, align: 32, offset: 928)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1611, file: !4, line: 4061, baseType: !985, size: 32, align: 32, offset: 960)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1611, file: !4, line: 4065, baseType: !985, size: 32, align: 32, offset: 992)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1611, file: !4, line: 4073, baseType: !985, size: 32, align: 32, offset: 1024)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1611, file: !4, line: 4080, baseType: !985, size: 32, align: 32, offset: 1056)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1611, file: !4, line: 4084, baseType: !985, size: 32, align: 32, offset: 1088)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1576, file: !4, line: 5781, baseType: !1609, size: 64, align: 64, offset: 320)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1576, file: !4, line: 5787, baseType: !1063, size: 64, align: 32, offset: 384)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1576, file: !4, line: 5793, baseType: !1063, size: 64, align: 32, offset: 448)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1570, file: !1362, line: 126, baseType: !985, size: 32, align: 32, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1537, file: !1362, line: 172, baseType: !1157, size: 64, align: 64, offset: 576)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1537, file: !1362, line: 177, baseType: !1172, size: 64, align: 64, offset: 640)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1537, file: !1362, line: 178, baseType: !986, size: 32, align: 32, offset: 704)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1537, file: !1362, line: 180, baseType: !996, size: 64, align: 64, offset: 768)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1537, file: !1362, line: 185, baseType: !985, size: 32, align: 32, offset: 832)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1537, file: !1362, line: 190, baseType: !996, size: 64, align: 64, offset: 896)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1537, file: !1362, line: 195, baseType: !985, size: 32, align: 32, offset: 960)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1537, file: !1362, line: 200, baseType: !1157, size: 64, align: 64, offset: 1024)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1537, file: !1362, line: 201, baseType: !985, size: 32, align: 32, offset: 1088)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1537, file: !1362, line: 202, baseType: !1520, size: 64, align: 64, offset: 1152)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1537, file: !1362, line: 203, baseType: !985, size: 32, align: 32, offset: 1216)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1537, file: !1362, line: 205, baseType: !985, size: 32, align: 32, offset: 1248)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1537, file: !1362, line: 206, baseType: !985, size: 32, align: 32, offset: 1280)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1537, file: !1362, line: 209, baseType: !1496, size: 64, align: 64, offset: 1344)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1537, file: !1362, line: 212, baseType: !1496, size: 64, align: 64, offset: 1408)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1537, file: !1362, line: 213, baseType: !1520, size: 64, align: 64, offset: 1472)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1537, file: !1362, line: 215, baseType: !985, size: 32, align: 32, offset: 1536)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1537, file: !1362, line: 217, baseType: !985, size: 32, align: 32, offset: 1568)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1537, file: !1362, line: 220, baseType: !985, size: 32, align: 32, offset: 1600)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1302, file: !4, line: 1598, baseType: !996, size: 64, align: 64, offset: 384)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1302, file: !4, line: 1606, baseType: !1057, size: 64, align: 64, offset: 448)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1302, file: !4, line: 1614, baseType: !985, size: 32, align: 32, offset: 512)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1302, file: !4, line: 1622, baseType: !985, size: 32, align: 32, offset: 544)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1302, file: !4, line: 1628, baseType: !985, size: 32, align: 32, offset: 576)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1302, file: !4, line: 1636, baseType: !985, size: 32, align: 32, offset: 608)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1302, file: !4, line: 1643, baseType: !985, size: 32, align: 32, offset: 640)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1302, file: !4, line: 1657, baseType: !1172, size: 64, align: 64, offset: 704)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1302, file: !4, line: 1658, baseType: !985, size: 32, align: 32, offset: 768)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1302, file: !4, line: 1679, baseType: !1063, size: 64, align: 32, offset: 800)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1302, file: !4, line: 1688, baseType: !985, size: 32, align: 32, offset: 864)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1302, file: !4, line: 1712, baseType: !985, size: 32, align: 32, offset: 896)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1302, file: !4, line: 1729, baseType: !985, size: 32, align: 32, offset: 928)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1302, file: !4, line: 1729, baseType: !985, size: 32, align: 32, offset: 960)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1302, file: !4, line: 1744, baseType: !985, size: 32, align: 32, offset: 992)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1302, file: !4, line: 1744, baseType: !985, size: 32, align: 32, offset: 1024)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1302, file: !4, line: 1751, baseType: !985, size: 32, align: 32, offset: 1056)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1302, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1302, file: !4, line: 1791, baseType: !1684, size: 64, align: 64, offset: 1152)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{null, !1687, !1420, !1502, !985, !985, !985}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1302, file: !4, line: 1808, baseType: !1689, size: 64, align: 64, offset: 1216)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!555, !1687, !1321}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1302, file: !4, line: 1816, baseType: !985, size: 32, align: 32, offset: 1280)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1302, file: !4, line: 1825, baseType: !1694, size: 32, align: 32, offset: 1312)
!1694 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1302, file: !4, line: 1830, baseType: !985, size: 32, align: 32, offset: 1344)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1302, file: !4, line: 1838, baseType: !1694, size: 32, align: 32, offset: 1376)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1302, file: !4, line: 1846, baseType: !985, size: 32, align: 32, offset: 1408)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1302, file: !4, line: 1851, baseType: !985, size: 32, align: 32, offset: 1440)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1302, file: !4, line: 1861, baseType: !1694, size: 32, align: 32, offset: 1472)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1302, file: !4, line: 1868, baseType: !1694, size: 32, align: 32, offset: 1504)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1302, file: !4, line: 1875, baseType: !1694, size: 32, align: 32, offset: 1536)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1302, file: !4, line: 1882, baseType: !1694, size: 32, align: 32, offset: 1568)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1302, file: !4, line: 1889, baseType: !1694, size: 32, align: 32, offset: 1600)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1302, file: !4, line: 1896, baseType: !1694, size: 32, align: 32, offset: 1632)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1302, file: !4, line: 1903, baseType: !1694, size: 32, align: 32, offset: 1664)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1302, file: !4, line: 1910, baseType: !985, size: 32, align: 32, offset: 1696)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1302, file: !4, line: 1915, baseType: !985, size: 32, align: 32, offset: 1728)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1302, file: !4, line: 1926, baseType: !1502, size: 64, align: 64, offset: 1792)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1302, file: !4, line: 1935, baseType: !1063, size: 64, align: 32, offset: 1856)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1302, file: !4, line: 1942, baseType: !985, size: 32, align: 32, offset: 1920)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1302, file: !4, line: 1948, baseType: !985, size: 32, align: 32, offset: 1952)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1302, file: !4, line: 1954, baseType: !985, size: 32, align: 32, offset: 1984)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1302, file: !4, line: 1960, baseType: !985, size: 32, align: 32, offset: 2016)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1302, file: !4, line: 1984, baseType: !985, size: 32, align: 32, offset: 2048)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1302, file: !4, line: 1991, baseType: !985, size: 32, align: 32, offset: 2080)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1302, file: !4, line: 1996, baseType: !985, size: 32, align: 32, offset: 2112)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1302, file: !4, line: 2004, baseType: !985, size: 32, align: 32, offset: 2144)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1302, file: !4, line: 2011, baseType: !985, size: 32, align: 32, offset: 2176)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1302, file: !4, line: 2018, baseType: !985, size: 32, align: 32, offset: 2208)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1302, file: !4, line: 2027, baseType: !985, size: 32, align: 32, offset: 2240)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1302, file: !4, line: 2034, baseType: !985, size: 32, align: 32, offset: 2272)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1302, file: !4, line: 2044, baseType: !985, size: 32, align: 32, offset: 2304)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1302, file: !4, line: 2054, baseType: !1724, size: 64, align: 64, offset: 2368)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1302, file: !4, line: 2061, baseType: !1724, size: 64, align: 64, offset: 2432)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1302, file: !4, line: 2066, baseType: !985, size: 32, align: 32, offset: 2496)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1302, file: !4, line: 2070, baseType: !985, size: 32, align: 32, offset: 2528)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1302, file: !4, line: 2078, baseType: !985, size: 32, align: 32, offset: 2560)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1302, file: !4, line: 2085, baseType: !985, size: 32, align: 32, offset: 2592)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1302, file: !4, line: 2092, baseType: !985, size: 32, align: 32, offset: 2624)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1302, file: !4, line: 2099, baseType: !985, size: 32, align: 32, offset: 2656)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1302, file: !4, line: 2106, baseType: !985, size: 32, align: 32, offset: 2688)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1302, file: !4, line: 2113, baseType: !985, size: 32, align: 32, offset: 2720)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1302, file: !4, line: 2120, baseType: !985, size: 32, align: 32, offset: 2752)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1302, file: !4, line: 2125, baseType: !985, size: 32, align: 32, offset: 2784)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1302, file: !4, line: 2133, baseType: !985, size: 32, align: 32, offset: 2816)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1302, file: !4, line: 2140, baseType: !985, size: 32, align: 32, offset: 2848)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1302, file: !4, line: 2145, baseType: !985, size: 32, align: 32, offset: 2880)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1302, file: !4, line: 2153, baseType: !985, size: 32, align: 32, offset: 2912)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1302, file: !4, line: 2158, baseType: !985, size: 32, align: 32, offset: 2944)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1302, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1302, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1302, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1302, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1302, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1302, file: !4, line: 2203, baseType: !985, size: 32, align: 32, offset: 3136)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1302, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1302, file: !4, line: 2212, baseType: !985, size: 32, align: 32, offset: 3200)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1302, file: !4, line: 2213, baseType: !985, size: 32, align: 32, offset: 3232)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1302, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1302, file: !4, line: 2232, baseType: !985, size: 32, align: 32, offset: 3296)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1302, file: !4, line: 2243, baseType: !985, size: 32, align: 32, offset: 3328)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1302, file: !4, line: 2249, baseType: !985, size: 32, align: 32, offset: 3360)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1302, file: !4, line: 2256, baseType: !985, size: 32, align: 32, offset: 3392)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1302, file: !4, line: 2263, baseType: !1332, size: 64, align: 64, offset: 3456)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1302, file: !4, line: 2270, baseType: !1332, size: 64, align: 64, offset: 3520)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1302, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1302, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1302, file: !4, line: 2367, baseType: !1760, size: 64, align: 64, offset: 3648)
!1760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1761, size: 64, align: 64)
!1761 = !DISubroutineType(types: !1762)
!1762 = !{!985, !1687, !1520, !985}
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1302, file: !4, line: 2383, baseType: !985, size: 32, align: 32, offset: 3712)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1302, file: !4, line: 2386, baseType: !1694, size: 32, align: 32, offset: 3744)
