; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--isom.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--isom.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.MovChannelLayout = type { i64, i32 }
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!851 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!852 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!853 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!854 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!855 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!856 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!857 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!858 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!859 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!860 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!864 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!865 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!866 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !920, !921}
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !918, line: 55, baseType: !919)
!918 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!920 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!921 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!922 = !{!923, !935, !939, !943, !947, !951, !957, !961}
!923 = distinct !DIGlobalVariable(name: "ff_mp4_obj_type", scope: !0, file: !924, line: 34, type: !925, isLocal: false, isDefinition: true, variable: [38 x %struct.AVCodecTag]* @ff_mp4_obj_type)
!924 = !DIFile(filename: "libavformat/isom.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 2432, align: 32, elements: !933)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecTag", file: !928, line: 47, baseType: !929)
!928 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !928, line: 44, size: 64, align: 32, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !929, file: !928, line: 45, baseType: !3, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !929, file: !928, line: 46, baseType: !921, size: 32, align: 32, offset: 32)
!933 = !{!934}
!934 = !DISubrange(count: 38)
!935 = distinct !DIGlobalVariable(name: "ff_codec_movvideo_tags", scope: !0, file: !924, line: 75, type: !936, isLocal: false, isDefinition: true, variable: [210 x %struct.AVCodecTag]* @ff_codec_movvideo_tags)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 13440, align: 32, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 210)
!939 = distinct !DIGlobalVariable(name: "ff_codec_movaudio_tags", scope: !0, file: !924, line: 317, type: !940, isLocal: false, isDefinition: true, variable: [54 x %struct.AVCodecTag]* @ff_codec_movaudio_tags)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 3456, align: 32, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 54)
!943 = distinct !DIGlobalVariable(name: "ff_codec_movsubtitle_tags", scope: !0, file: !924, line: 374, type: !944, isLocal: false, isDefinition: true, variable: [4 x %struct.AVCodecTag]* @ff_codec_movsubtitle_tags)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 4)
!947 = distinct !DIGlobalVariable(name: "ff_codec_movdata_tags", scope: !0, file: !924, line: 381, type: !948, isLocal: false, isDefinition: true, variable: [2 x %struct.AVCodecTag]* @ff_codec_movdata_tags)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 2)
!951 = distinct !DIGlobalVariable(name: "mov_mdhd_language_map", scope: !0, file: !924, line: 390, type: !952, isLocal: true, isDefinition: true, variable: [139 x [4 x i8]]* @mov_mdhd_language_map)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 4448, align: 8, elements: !955)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!955 = !{!956, !946}
!956 = !DISubrange(count: 139)
!957 = distinct !DIGlobalVariable(name: "mp4_audio_types", scope: !0, file: !924, line: 499, type: !958, isLocal: true, isDefinition: true, variable: [6 x %struct.AVCodecTag]* @mp4_audio_types)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 384, align: 32, elements: !959)
!959 = !{!960}
!960 = !DISubrange(count: 6)
!961 = distinct !DIGlobalVariable(name: "mov_channel_layout", scope: !0, file: !924, line: 571, type: !962, isLocal: true, isDefinition: true, variable: [23 x %struct.MovChannelLayout]* @mov_channel_layout)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 2944, align: 64, elements: !972)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovChannelLayout", file: !924, line: 569, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MovChannelLayout", file: !924, line: 566, size: 128, align: 64, elements: !966)
!966 = !{!967, !970}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !965, file: !924, line: 567, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !918, line: 40, baseType: !969)
!969 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "layout_tag", scope: !965, file: !924, line: 568, baseType: !971, size: 32, align: 32, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !918, line: 51, baseType: !921)
!972 = !{!973}
!973 = !DISubrange(count: 23)
!974 = !{i32 2, !"Dwarf Version", i32 4}
!975 = !{i32 2, !"Debug Info Version", i32 3}
!976 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!977 = distinct !DISubprogram(name: "ff_mov_iso639_to_lang", scope: !924, file: !924, line: 412, type: !978, isLocal: false, isDefinition: true, scopeLine: 413, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !981)
!978 = !DISubroutineType(types: !979)
!979 = !{!920, !980, !920}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!981 = !{}
!982 = !DILocalVariable(name: "lang", arg: 1, scope: !977, file: !924, line: 412, type: !980)
!983 = !DIExpression()
!984 = !DILocation(line: 412, column: 38, scope: !977)
!985 = !DILocalVariable(name: "mp4", arg: 2, scope: !977, file: !924, line: 412, type: !920)
!986 = !DILocation(line: 412, column: 51, scope: !977)
!987 = !DILocalVariable(name: "i", scope: !977, file: !924, line: 414, type: !920)
!988 = !DILocation(line: 414, column: 9, scope: !977)
!989 = !DILocalVariable(name: "code", scope: !977, file: !924, line: 414, type: !920)
!990 = !DILocation(line: 414, column: 12, scope: !977)
!991 = !DILocation(line: 417, column: 12, scope: !992)
!992 = distinct !DILexicalBlock(scope: !977, file: !924, line: 417, column: 5)
!993 = !DILocation(line: 417, column: 10, scope: !992)
!994 = !DILocation(line: 417, column: 17, scope: !995)
!995 = !DILexicalBlockFile(scope: !996, file: !924, discriminator: 1)
!996 = distinct !DILexicalBlock(scope: !992, file: !924, line: 417, column: 5)
!997 = !DILocation(line: 417, column: 25, scope: !995)
!998 = !DILocation(line: 417, column: 29, scope: !999)
!999 = !DILexicalBlockFile(scope: !996, file: !924, discriminator: 2)
!1000 = !DILocation(line: 417, column: 33, scope: !999)
!1001 = !DILocation(line: 417, column: 36, scope: !1002)
!1002 = !DILexicalBlockFile(scope: !996, file: !924, discriminator: 3)
!1003 = !DILocation(line: 417, column: 38, scope: !1002)
!1004 = !DILocation(line: 417, column: 5, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !992, file: !924, discriminator: 4)
!1006 = !DILocation(line: 418, column: 21, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1008, file: !924, line: 418, column: 13)
!1008 = distinct !DILexicalBlock(scope: !996, file: !924, line: 417, column: 115)
!1009 = !DILocation(line: 418, column: 49, scope: !1007)
!1010 = !DILocation(line: 418, column: 27, scope: !1007)
!1011 = !DILocation(line: 418, column: 14, scope: !1007)
!1012 = !DILocation(line: 418, column: 13, scope: !1008)
!1013 = !DILocation(line: 419, column: 20, scope: !1007)
!1014 = !DILocation(line: 419, column: 13, scope: !1007)
!1015 = !DILocation(line: 420, column: 5, scope: !1008)
!1016 = !DILocation(line: 417, column: 111, scope: !1017)
!1017 = !DILexicalBlockFile(scope: !996, file: !924, discriminator: 5)
!1018 = !DILocation(line: 417, column: 5, scope: !1017)
!1019 = distinct !{!1019, !1020}
!1020 = !DILocation(line: 417, column: 5, scope: !977)
!1021 = !DILocation(line: 422, column: 10, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !977, file: !924, line: 422, column: 9)
!1023 = !DILocation(line: 422, column: 9, scope: !977)
!1024 = !DILocation(line: 423, column: 9, scope: !1022)
!1025 = !DILocation(line: 425, column: 9, scope: !1026)
!1026 = distinct !DILexicalBlock(scope: !977, file: !924, line: 425, column: 9)
!1027 = !DILocation(line: 425, column: 17, scope: !1026)
!1028 = !DILocation(line: 425, column: 9, scope: !977)
!1029 = !DILocation(line: 426, column: 14, scope: !1026)
!1030 = !DILocation(line: 426, column: 9, scope: !1026)
!1031 = !DILocation(line: 428, column: 12, scope: !1032)
!1032 = distinct !DILexicalBlock(scope: !977, file: !924, line: 428, column: 5)
!1033 = !DILocation(line: 428, column: 10, scope: !1032)
!1034 = !DILocation(line: 428, column: 17, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !1036, file: !924, discriminator: 1)
!1036 = distinct !DILexicalBlock(scope: !1032, file: !924, line: 428, column: 5)
!1037 = !DILocation(line: 428, column: 19, scope: !1035)
!1038 = !DILocation(line: 428, column: 5, scope: !1035)
!1039 = !DILocalVariable(name: "c", scope: !1040, file: !924, line: 429, type: !1041)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !924, line: 428, column: 29)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !918, line: 48, baseType: !1042)
!1042 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1043 = !DILocation(line: 429, column: 17, scope: !1040)
!1044 = !DILocation(line: 429, column: 26, scope: !1040)
!1045 = !DILocation(line: 429, column: 21, scope: !1040)
!1046 = !DILocation(line: 430, column: 11, scope: !1040)
!1047 = !DILocation(line: 431, column: 13, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1040, file: !924, line: 431, column: 13)
!1049 = !DILocation(line: 431, column: 15, scope: !1048)
!1050 = !DILocation(line: 431, column: 13, scope: !1040)
!1051 = !DILocation(line: 432, column: 13, scope: !1048)
!1052 = !DILocation(line: 433, column: 14, scope: !1040)
!1053 = !DILocation(line: 434, column: 17, scope: !1040)
!1054 = !DILocation(line: 434, column: 14, scope: !1040)
!1055 = !DILocation(line: 435, column: 5, scope: !1040)
!1056 = !DILocation(line: 428, column: 25, scope: !1057)
!1057 = !DILexicalBlockFile(scope: !1036, file: !924, discriminator: 2)
!1058 = !DILocation(line: 428, column: 5, scope: !1057)
!1059 = distinct !{!1059, !1060}
!1060 = !DILocation(line: 428, column: 5, scope: !977)
!1061 = !DILocation(line: 436, column: 12, scope: !977)
!1062 = !DILocation(line: 436, column: 5, scope: !977)
!1063 = !DILocation(line: 437, column: 1, scope: !977)
!1064 = distinct !DISubprogram(name: "ff_mov_lang_to_iso639", scope: !924, file: !924, line: 439, type: !1065, isLocal: false, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !981)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!920, !921, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1068 = !DILocalVariable(name: "code", arg: 1, scope: !1064, file: !924, line: 439, type: !921)
!1069 = !DILocation(line: 439, column: 36, scope: !1064)
!1070 = !DILocalVariable(name: "to", arg: 2, scope: !1064, file: !924, line: 439, type: !1067)
!1071 = !DILocation(line: 439, column: 47, scope: !1064)
!1072 = !DILocalVariable(name: "i", scope: !1064, file: !924, line: 441, type: !920)
!1073 = !DILocation(line: 441, column: 9, scope: !1064)
!1074 = !DILocation(line: 442, column: 12, scope: !1064)
!1075 = !DILocation(line: 442, column: 5, scope: !1064)
!1076 = !DILocation(line: 445, column: 9, scope: !1077)
!1077 = distinct !DILexicalBlock(scope: !1064, file: !924, line: 445, column: 9)
!1078 = !DILocation(line: 445, column: 14, scope: !1077)
!1079 = !DILocation(line: 445, column: 23, scope: !1077)
!1080 = !DILocation(line: 445, column: 26, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1077, file: !924, discriminator: 1)
!1082 = !DILocation(line: 445, column: 31, scope: !1081)
!1083 = !DILocation(line: 445, column: 9, scope: !1081)
!1084 = !DILocation(line: 446, column: 16, scope: !1085)
!1085 = distinct !DILexicalBlock(scope: !1086, file: !924, line: 446, column: 9)
!1086 = distinct !DILexicalBlock(scope: !1077, file: !924, line: 445, column: 42)
!1087 = !DILocation(line: 446, column: 14, scope: !1085)
!1088 = !DILocation(line: 446, column: 21, scope: !1089)
!1089 = !DILexicalBlockFile(scope: !1090, file: !924, discriminator: 1)
!1090 = distinct !DILexicalBlock(scope: !1085, file: !924, line: 446, column: 9)
!1091 = !DILocation(line: 446, column: 23, scope: !1089)
!1092 = !DILocation(line: 446, column: 9, scope: !1089)
!1093 = !DILocation(line: 447, column: 29, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1090, file: !924, line: 446, column: 34)
!1095 = !DILocation(line: 447, column: 34, scope: !1094)
!1096 = !DILocation(line: 447, column: 26, scope: !1094)
!1097 = !DILocation(line: 447, column: 21, scope: !1094)
!1098 = !DILocation(line: 447, column: 16, scope: !1094)
!1099 = !DILocation(line: 447, column: 13, scope: !1094)
!1100 = !DILocation(line: 447, column: 19, scope: !1094)
!1101 = !DILocation(line: 448, column: 18, scope: !1094)
!1102 = !DILocation(line: 449, column: 9, scope: !1094)
!1103 = !DILocation(line: 446, column: 30, scope: !1104)
!1104 = !DILexicalBlockFile(scope: !1090, file: !924, discriminator: 2)
!1105 = !DILocation(line: 446, column: 9, scope: !1104)
!1106 = distinct !{!1106, !1107}
!1107 = !DILocation(line: 446, column: 9, scope: !1086)
!1108 = !DILocation(line: 450, column: 9, scope: !1086)
!1109 = !DILocation(line: 453, column: 9, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1064, file: !924, line: 453, column: 9)
!1111 = !DILocation(line: 453, column: 14, scope: !1110)
!1112 = !DILocation(line: 453, column: 9, scope: !1064)
!1113 = !DILocation(line: 454, column: 9, scope: !1110)
!1114 = !DILocation(line: 455, column: 32, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1064, file: !924, line: 455, column: 9)
!1116 = !DILocation(line: 455, column: 10, scope: !1115)
!1117 = !DILocation(line: 455, column: 9, scope: !1064)
!1118 = !DILocation(line: 456, column: 9, scope: !1115)
!1119 = !DILocation(line: 457, column: 12, scope: !1064)
!1120 = !DILocation(line: 457, column: 38, scope: !1064)
!1121 = !DILocation(line: 457, column: 16, scope: !1064)
!1122 = !DILocation(line: 457, column: 5, scope: !1064)
!1123 = !DILocation(line: 458, column: 5, scope: !1064)
!1124 = !DILocation(line: 459, column: 1, scope: !1064)
!1125 = distinct !DISubprogram(name: "ff_mp4_read_descr_len", scope: !924, file: !924, line: 461, type: !1126, isLocal: false, isDefinition: true, scopeLine: 462, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !981)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!920, !1128}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !485, line: 352, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !485, line: 161, size: 2112, align: 64, elements: !1131)
!1131 = !{!1132, !1174, !1176, !1177, !1178, !1179, !1180, !1185, !1186, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1202, !1203, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1226, !1227, !1228, !1232, !1233, !1234}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1130, file: !485, line: 174, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1137)
!1137 = !{!1138, !1139, !1144, !1148, !1149, !1150, !1151, !1155, !1161, !1163, !1167}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1136, file: !464, line: 72, baseType: !980, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1136, file: !464, line: 78, baseType: !1140, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!980, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1136, file: !464, line: 85, baseType: !1145, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1147)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1136, file: !464, line: 93, baseType: !920, size: 32, align: 32, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1136, file: !464, line: 99, baseType: !920, size: 32, align: 32, offset: 224)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1136, file: !464, line: 108, baseType: !920, size: 32, align: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1136, file: !464, line: 113, baseType: !1152, size: 64, align: 64, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!1143, !1143, !1143}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1136, file: !464, line: 123, baseType: !1156, size: 64, align: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!1159, !1159}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1136)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1136, file: !464, line: 130, baseType: !1162, size: 32, align: 32, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1136, file: !464, line: 136, baseType: !1164, size: 64, align: 64, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!1162, !1143}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1136, file: !464, line: 142, baseType: !1168, size: 64, align: 64, offset: 576)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!920, !1171, !1143, !980, !920}
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1130, file: !485, line: 226, baseType: !1175, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1130, file: !485, line: 227, baseType: !920, size: 32, align: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1130, file: !485, line: 228, baseType: !1175, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1130, file: !485, line: 229, baseType: !1175, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1130, file: !485, line: 233, baseType: !1143, size: 64, align: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1130, file: !485, line: 235, baseType: !1181, size: 64, align: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!920, !1143, !1184, !920}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1130, file: !485, line: 236, baseType: !1181, size: 64, align: 64, offset: 448)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1130, file: !485, line: 237, baseType: !1187, size: 64, align: 64, offset: 512)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{!968, !1143, !968, !920}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1130, file: !485, line: 238, baseType: !968, size: 64, align: 64, offset: 576)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1130, file: !485, line: 239, baseType: !920, size: 32, align: 32, offset: 640)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1130, file: !485, line: 240, baseType: !920, size: 32, align: 32, offset: 672)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1130, file: !485, line: 241, baseType: !920, size: 32, align: 32, offset: 704)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1130, file: !485, line: 242, baseType: !919, size: 64, align: 64, offset: 768)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1130, file: !485, line: 243, baseType: !1175, size: 64, align: 64, offset: 832)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1130, file: !485, line: 244, baseType: !1197, size: 64, align: 64, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!919, !919, !1200, !921}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1130, file: !485, line: 245, baseType: !920, size: 32, align: 32, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1130, file: !485, line: 249, baseType: !1204, size: 64, align: 64, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!920, !1143, !920}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1130, file: !485, line: 255, baseType: !1208, size: 64, align: 64, offset: 1088)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!968, !1143, !920, !968, !920}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1130, file: !485, line: 260, baseType: !920, size: 32, align: 32, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1130, file: !485, line: 266, baseType: !968, size: 64, align: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1130, file: !485, line: 273, baseType: !920, size: 32, align: 32, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1130, file: !485, line: 279, baseType: !968, size: 64, align: 64, offset: 1344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1130, file: !485, line: 285, baseType: !920, size: 32, align: 32, offset: 1408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1130, file: !485, line: 291, baseType: !920, size: 32, align: 32, offset: 1440)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1130, file: !485, line: 298, baseType: !920, size: 32, align: 32, offset: 1472)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1130, file: !485, line: 304, baseType: !920, size: 32, align: 32, offset: 1504)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1130, file: !485, line: 309, baseType: !980, size: 64, align: 64, offset: 1536)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1130, file: !485, line: 314, baseType: !980, size: 64, align: 64, offset: 1600)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1130, file: !485, line: 319, baseType: !1222, size: 64, align: 64, offset: 1664)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!920, !1143, !1184, !920, !484, !968}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1130, file: !485, line: 326, baseType: !920, size: 32, align: 32, offset: 1728)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1130, file: !485, line: 331, baseType: !484, size: 32, align: 32, offset: 1760)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1130, file: !485, line: 332, baseType: !968, size: 64, align: 64, offset: 1792)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1130, file: !485, line: 338, baseType: !1229, size: 64, align: 64, offset: 1856)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!920, !1143}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1130, file: !485, line: 340, baseType: !968, size: 64, align: 64, offset: 1920)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1130, file: !485, line: 346, baseType: !1175, size: 64, align: 64, offset: 1984)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1130, file: !485, line: 351, baseType: !920, size: 32, align: 32, offset: 2048)
!1235 = !DILocalVariable(name: "pb", arg: 1, scope: !1125, file: !924, line: 461, type: !1128)
!1236 = !DILocation(line: 461, column: 40, scope: !1125)
!1237 = !DILocalVariable(name: "len", scope: !1125, file: !924, line: 463, type: !920)
!1238 = !DILocation(line: 463, column: 9, scope: !1125)
!1239 = !DILocalVariable(name: "count", scope: !1125, file: !924, line: 464, type: !920)
!1240 = !DILocation(line: 464, column: 9, scope: !1125)
!1241 = !DILocation(line: 465, column: 5, scope: !1125)
!1242 = !DILocation(line: 465, column: 17, scope: !1243)
!1243 = !DILexicalBlockFile(scope: !1125, file: !924, discriminator: 1)
!1244 = !DILocation(line: 465, column: 5, scope: !1243)
!1245 = !DILocalVariable(name: "c", scope: !1246, file: !924, line: 466, type: !920)
!1246 = distinct !DILexicalBlock(scope: !1125, file: !924, line: 465, column: 21)
!1247 = !DILocation(line: 466, column: 13, scope: !1246)
!1248 = !DILocation(line: 466, column: 25, scope: !1246)
!1249 = !DILocation(line: 466, column: 17, scope: !1246)
!1250 = !DILocation(line: 467, column: 16, scope: !1246)
!1251 = !DILocation(line: 467, column: 20, scope: !1246)
!1252 = !DILocation(line: 467, column: 29, scope: !1246)
!1253 = !DILocation(line: 467, column: 31, scope: !1246)
!1254 = !DILocation(line: 467, column: 26, scope: !1246)
!1255 = !DILocation(line: 467, column: 13, scope: !1246)
!1256 = !DILocation(line: 468, column: 15, scope: !1257)
!1257 = distinct !DILexicalBlock(scope: !1246, file: !924, line: 468, column: 13)
!1258 = !DILocation(line: 468, column: 17, scope: !1257)
!1259 = !DILocation(line: 468, column: 13, scope: !1246)
!1260 = !DILocation(line: 469, column: 13, scope: !1257)
!1261 = !DILocation(line: 465, column: 5, scope: !1262)
!1262 = !DILexicalBlockFile(scope: !1125, file: !924, discriminator: 2)
!1263 = distinct !{!1263, !1241}
!1264 = !DILocation(line: 471, column: 12, scope: !1125)
!1265 = !DILocation(line: 471, column: 5, scope: !1125)
!1266 = distinct !DISubprogram(name: "ff_mp4_read_descr", scope: !924, file: !924, line: 474, type: !1267, isLocal: false, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !981)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!920, !1269, !1128, !1651}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1272)
!1272 = !{!1273, !1274, !1376, !1522, !1523, !1524, !1525, !1526, !2274, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2328, !2329, !2330, !2331, !2332, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2383, !2384, !2387, !2388, !2389, !2390, !2391, !2392, !2394, !2395, !2396, !2397, !2405, !2406, !2410, !2414, !2415, !2416}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1271, file: !897, line: 1342, baseType: !1133, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1271, file: !897, line: 1349, baseType: !1275, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1277)
!1277 = !{!1278, !1279, !1280, !1281, !1282, !1287, !1288, !1289, !1290, !1291, !1292, !1304, !1309, !1347, !1348, !1352, !1357, !1358, !1359, !1363, !1369, !1375}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !897, line: 638, baseType: !980, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1276, file: !897, line: 645, baseType: !980, size: 64, align: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1276, file: !897, line: 652, baseType: !920, size: 32, align: 32, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1276, file: !897, line: 659, baseType: !980, size: 64, align: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1276, file: !897, line: 661, baseType: !1283, size: 64, align: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1285)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1276, file: !897, line: 663, baseType: !1133, size: 64, align: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1276, file: !897, line: 670, baseType: !980, size: 64, align: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1276, file: !897, line: 679, baseType: !1275, size: 64, align: 64, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1276, file: !897, line: 684, baseType: !920, size: 32, align: 32, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1276, file: !897, line: 689, baseType: !920, size: 32, align: 32, offset: 544)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1276, file: !897, line: 696, baseType: !1293, size: 64, align: 64, offset: 576)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!920, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1299)
!1299 = !{!1300, !1301, !1302, !1303}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1298, file: !897, line: 449, baseType: !980, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1298, file: !897, line: 450, baseType: !1175, size: 64, align: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1298, file: !897, line: 451, baseType: !920, size: 32, align: 32, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1298, file: !897, line: 452, baseType: !980, size: 64, align: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1276, file: !897, line: 703, baseType: !1305, size: 64, align: 64, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DISubroutineType(types: !1307)
!1307 = !{!920, !1308}
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1276, file: !897, line: 714, baseType: !1310, size: 64, align: 64, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DISubroutineType(types: !1312)
!1312 = !{!920, !1308, !1313}
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1316)
!1316 = !{!1317, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1343, !1344, !1345, !1346}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1315, file: !4, line: 1451, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1320, line: 94, baseType: !1321)
!1320 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1320, line: 81, size: 192, align: 64, elements: !1322)
!1322 = !{!1323, !1327, !1328}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1321, file: !1320, line: 82, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1320, line: 73, baseType: !1326)
!1326 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1320, line: 73, flags: DIFlagFwdDecl)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1321, file: !1320, line: 89, baseType: !1184, size: 64, align: 64, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1321, file: !1320, line: 93, baseType: !920, size: 32, align: 32, offset: 128)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1315, file: !4, line: 1461, baseType: !968, size: 64, align: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1315, file: !4, line: 1467, baseType: !968, size: 64, align: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1315, file: !4, line: 1468, baseType: !1184, size: 64, align: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1315, file: !4, line: 1469, baseType: !920, size: 32, align: 32, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1315, file: !4, line: 1470, baseType: !920, size: 32, align: 32, offset: 288)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1315, file: !4, line: 1474, baseType: !920, size: 32, align: 32, offset: 320)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1315, file: !4, line: 1479, baseType: !1336, size: 64, align: 64, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1339)
!1339 = !{!1340, !1341, !1342}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1338, file: !4, line: 1412, baseType: !1184, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1338, file: !4, line: 1413, baseType: !920, size: 32, align: 32, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1338, file: !4, line: 1414, baseType: !493, size: 32, align: 32, offset: 96)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1315, file: !4, line: 1480, baseType: !920, size: 32, align: 32, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1315, file: !4, line: 1486, baseType: !968, size: 64, align: 64, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1315, file: !4, line: 1488, baseType: !968, size: 64, align: 64, offset: 576)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1315, file: !4, line: 1497, baseType: !968, size: 64, align: 64, offset: 640)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1276, file: !897, line: 720, baseType: !1305, size: 64, align: 64, offset: 768)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1276, file: !897, line: 730, baseType: !1349, size: 64, align: 64, offset: 832)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!920, !1308, !920, !968, !920}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1276, file: !897, line: 737, baseType: !1353, size: 64, align: 64, offset: 896)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!968, !1308, !920, !1356, !968}
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1276, file: !897, line: 744, baseType: !1305, size: 64, align: 64, offset: 960)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1276, file: !897, line: 750, baseType: !1305, size: 64, align: 64, offset: 1024)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1276, file: !897, line: 758, baseType: !1360, size: 64, align: 64, offset: 1088)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!920, !1308, !920, !968, !968, !968, !920}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1276, file: !897, line: 764, baseType: !1364, size: 64, align: 64, offset: 1152)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!920, !1308, !1367}
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1276, file: !897, line: 770, baseType: !1370, size: 64, align: 64, offset: 1216)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{!920, !1308, !1373}
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1276, file: !897, line: 776, baseType: !1370, size: 64, align: 64, offset: 1280)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1271, file: !897, line: 1356, baseType: !1377, size: 64, align: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1399, !1403, !1407, !1413, !1507, !1508, !1509, !1510, !1511, !1512, !1516}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1378, file: !897, line: 498, baseType: !980, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1378, file: !897, line: 504, baseType: !980, size: 64, align: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1378, file: !897, line: 505, baseType: !980, size: 64, align: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1378, file: !897, line: 506, baseType: !980, size: 64, align: 64, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1378, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1378, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1378, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1378, file: !897, line: 517, baseType: !920, size: 32, align: 32, offset: 352)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1378, file: !897, line: 523, baseType: !1283, size: 64, align: 64, offset: 384)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1378, file: !897, line: 526, baseType: !1133, size: 64, align: 64, offset: 448)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1378, file: !897, line: 535, baseType: !1377, size: 64, align: 64, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1378, file: !897, line: 539, baseType: !920, size: 32, align: 32, offset: 576)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1378, file: !897, line: 541, baseType: !1305, size: 64, align: 64, offset: 640)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1378, file: !897, line: 549, baseType: !1310, size: 64, align: 64, offset: 704)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1378, file: !897, line: 550, baseType: !1305, size: 64, align: 64, offset: 768)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1378, file: !897, line: 554, baseType: !1396, size: 64, align: 64, offset: 832)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!920, !1308, !1313, !1313, !920}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1378, file: !897, line: 563, baseType: !1400, size: 64, align: 64, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!920, !3, !920}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1378, file: !897, line: 565, baseType: !1404, size: 64, align: 64, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{null, !1308, !920, !1356, !1356}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1378, file: !897, line: 570, baseType: !1408, size: 64, align: 64, offset: 1024)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!920, !1308, !920, !1143, !1411}
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1412, line: 216, baseType: !919)
!1412 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1378, file: !897, line: 581, baseType: !1414, size: 64, align: 64, offset: 1088)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!920, !1308, !920, !1417, !921}
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !535, line: 646, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !535, line: 268, size: 4288, align: 64, elements: !1421)
!1421 = !{!1422, !1426, !1428, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1461, !1463, !1464, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1420, file: !535, line: 282, baseType: !1423, size: 512, align: 64)
!1423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 512, align: 64, elements: !1424)
!1424 = !{!1425}
!1425 = !DISubrange(count: 8)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1420, file: !535, line: 299, baseType: !1427, size: 256, align: 32, offset: 512)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 256, align: 32, elements: !1424)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1420, file: !535, line: 315, baseType: !1429, size: 64, align: 64, offset: 768)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1420, file: !535, line: 326, baseType: !920, size: 32, align: 32, offset: 832)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1420, file: !535, line: 326, baseType: !920, size: 32, align: 32, offset: 864)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1420, file: !535, line: 334, baseType: !920, size: 32, align: 32, offset: 896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1420, file: !535, line: 341, baseType: !920, size: 32, align: 32, offset: 928)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1420, file: !535, line: 346, baseType: !920, size: 32, align: 32, offset: 960)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1420, file: !535, line: 351, baseType: !523, size: 32, align: 32, offset: 992)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1420, file: !535, line: 356, baseType: !1437, size: 64, align: 32, offset: 1024)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1438, line: 61, baseType: !1439)
!1438 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1438, line: 58, size: 64, align: 32, elements: !1440)
!1440 = !{!1441, !1442}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1439, file: !1438, line: 59, baseType: !920, size: 32, align: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1439, file: !1438, line: 60, baseType: !920, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1420, file: !535, line: 361, baseType: !968, size: 64, align: 64, offset: 1088)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1420, file: !535, line: 369, baseType: !968, size: 64, align: 64, offset: 1152)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1420, file: !535, line: 377, baseType: !968, size: 64, align: 64, offset: 1216)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1420, file: !535, line: 382, baseType: !920, size: 32, align: 32, offset: 1280)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1420, file: !535, line: 386, baseType: !920, size: 32, align: 32, offset: 1312)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1420, file: !535, line: 391, baseType: !920, size: 32, align: 32, offset: 1344)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1420, file: !535, line: 396, baseType: !1143, size: 64, align: 64, offset: 1408)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1420, file: !535, line: 403, baseType: !1451, size: 512, align: 64, offset: 1472)
!1451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 512, align: 64, elements: !1424)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1420, file: !535, line: 410, baseType: !920, size: 32, align: 32, offset: 1984)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1420, file: !535, line: 415, baseType: !920, size: 32, align: 32, offset: 2016)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1420, file: !535, line: 420, baseType: !920, size: 32, align: 32, offset: 2048)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1420, file: !535, line: 425, baseType: !920, size: 32, align: 32, offset: 2080)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1420, file: !535, line: 435, baseType: !968, size: 64, align: 64, offset: 2112)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1420, file: !535, line: 440, baseType: !920, size: 32, align: 32, offset: 2176)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1420, file: !535, line: 445, baseType: !917, size: 64, align: 64, offset: 2240)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1420, file: !535, line: 459, baseType: !1460, size: 512, align: 64, offset: 2304)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1318, size: 512, align: 64, elements: !1424)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1420, file: !535, line: 473, baseType: !1462, size: 64, align: 64, offset: 2816)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1420, file: !535, line: 477, baseType: !920, size: 32, align: 32, offset: 2880)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1420, file: !535, line: 479, baseType: !1465, size: 64, align: 64, offset: 2944)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !535, line: 207, baseType: !1468)
!1468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !535, line: 201, size: 320, align: 64, elements: !1469)
!1469 = !{!1470, !1471, !1472, !1473, !1478}
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1468, file: !535, line: 202, baseType: !534, size: 32, align: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1468, file: !535, line: 203, baseType: !1184, size: 64, align: 64, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1468, file: !535, line: 204, baseType: !920, size: 32, align: 32, offset: 128)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1468, file: !535, line: 205, baseType: !1474, size: 64, align: 64, offset: 192)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1476, line: 86, baseType: !1477)
!1476 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1477 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1476, line: 86, flags: DIFlagFwdDecl)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1468, file: !535, line: 206, baseType: !1318, size: 64, align: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1420, file: !535, line: 480, baseType: !920, size: 32, align: 32, offset: 3008)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1420, file: !535, line: 505, baseType: !920, size: 32, align: 32, offset: 3040)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1420, file: !535, line: 512, baseType: !558, size: 32, align: 32, offset: 3072)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1420, file: !535, line: 514, baseType: !565, size: 32, align: 32, offset: 3104)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1420, file: !535, line: 516, baseType: !583, size: 32, align: 32, offset: 3136)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1420, file: !535, line: 523, baseType: !607, size: 32, align: 32, offset: 3168)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1420, file: !535, line: 525, baseType: !626, size: 32, align: 32, offset: 3200)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1420, file: !535, line: 532, baseType: !968, size: 64, align: 64, offset: 3264)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1420, file: !535, line: 539, baseType: !968, size: 64, align: 64, offset: 3328)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1420, file: !535, line: 547, baseType: !968, size: 64, align: 64, offset: 3392)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1420, file: !535, line: 554, baseType: !1474, size: 64, align: 64, offset: 3456)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1420, file: !535, line: 563, baseType: !920, size: 32, align: 32, offset: 3520)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1420, file: !535, line: 572, baseType: !920, size: 32, align: 32, offset: 3552)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1420, file: !535, line: 581, baseType: !920, size: 32, align: 32, offset: 3584)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1420, file: !535, line: 588, baseType: !1494, size: 64, align: 64, offset: 3648)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !918, line: 36, baseType: !1496)
!1496 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1420, file: !535, line: 593, baseType: !920, size: 32, align: 32, offset: 3712)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1420, file: !535, line: 596, baseType: !920, size: 32, align: 32, offset: 3744)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1420, file: !535, line: 599, baseType: !1318, size: 64, align: 64, offset: 3776)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1420, file: !535, line: 605, baseType: !1318, size: 64, align: 64, offset: 3840)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1420, file: !535, line: 616, baseType: !1318, size: 64, align: 64, offset: 3904)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1420, file: !535, line: 626, baseType: !1411, size: 64, align: 64, offset: 3968)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1420, file: !535, line: 627, baseType: !1411, size: 64, align: 64, offset: 4032)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1420, file: !535, line: 628, baseType: !1411, size: 64, align: 64, offset: 4096)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1420, file: !535, line: 629, baseType: !1411, size: 64, align: 64, offset: 4160)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1420, file: !535, line: 645, baseType: !1318, size: 64, align: 64, offset: 4224)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1378, file: !897, line: 587, baseType: !1364, size: 64, align: 64, offset: 1152)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1378, file: !897, line: 592, baseType: !1370, size: 64, align: 64, offset: 1216)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1378, file: !897, line: 597, baseType: !1370, size: 64, align: 64, offset: 1280)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1378, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1378, file: !897, line: 608, baseType: !1305, size: 64, align: 64, offset: 1408)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1378, file: !897, line: 617, baseType: !1513, size: 64, align: 64, offset: 1472)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1308}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1378, file: !897, line: 623, baseType: !1517, size: 64, align: 64, offset: 1536)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!920, !1308, !1520}
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1314)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1271, file: !897, line: 1365, baseType: !1143, size: 64, align: 64, offset: 192)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1271, file: !897, line: 1379, baseType: !1128, size: 64, align: 64, offset: 256)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1271, file: !897, line: 1386, baseType: !920, size: 32, align: 32, offset: 320)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1271, file: !897, line: 1393, baseType: !921, size: 32, align: 32, offset: 352)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1271, file: !897, line: 1405, baseType: !1527, size: 64, align: 64, offset: 384)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1530)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1531)
!1531 = !{!1532, !1533, !1534, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2199, !2205, !2206, !2210, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2242, !2243, !2244, !2245, !2246, !2247}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1530, file: !897, line: 866, baseType: !920, size: 32, align: 32)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1530, file: !897, line: 872, baseType: !920, size: 32, align: 32, offset: 32)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1530, file: !897, line: 878, baseType: !1535, size: 64, align: 64, offset: 64)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1537)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1542, !1680, !1681, !1682, !1683, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1836, !1840, !1841, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2020, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1537, file: !4, line: 1561, baseType: !1133, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1537, file: !4, line: 1562, baseType: !920, size: 32, align: 32, offset: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1537, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1537, file: !4, line: 1565, baseType: !1543, size: 64, align: 64, offset: 128)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1546)
!1546 = !{!1547, !1548, !1549, !1550, !1551, !1552, !1555, !1558, !1561, !1564, !1567, !1568, !1569, !1577, !1578, !1579, !1581, !1585, !1591, !1600, !1604, !1605, !1645, !1652, !1656, !1657, !1661, !1665, !1669, !1673, !1674, !1675}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1545, file: !4, line: 3475, baseType: !980, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1545, file: !4, line: 3480, baseType: !980, size: 64, align: 64, offset: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1545, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1545, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1545, file: !4, line: 3487, baseType: !920, size: 32, align: 32, offset: 192)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1545, file: !4, line: 3488, baseType: !1553, size: 64, align: 64, offset: 256)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1437)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1545, file: !4, line: 3489, baseType: !1556, size: 64, align: 64, offset: 320)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1545, file: !4, line: 3490, baseType: !1559, size: 64, align: 64, offset: 384)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1545, file: !4, line: 3491, baseType: !1562, size: 64, align: 64, offset: 448)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1545, file: !4, line: 3492, baseType: !1565, size: 64, align: 64, offset: 512)
!1565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1566, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1545, file: !4, line: 3493, baseType: !1041, size: 8, align: 8, offset: 576)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1545, file: !4, line: 3494, baseType: !1133, size: 64, align: 64, offset: 640)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1545, file: !4, line: 3495, baseType: !1570, size: 64, align: 64, offset: 704)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1572)
!1572 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1574)
!1574 = !{!1575, !1576}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1573, file: !4, line: 3402, baseType: !920, size: 32, align: 32)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1573, file: !4, line: 3403, baseType: !980, size: 64, align: 64, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1545, file: !4, line: 3507, baseType: !980, size: 64, align: 64, offset: 768)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1545, file: !4, line: 3516, baseType: !920, size: 32, align: 32, offset: 832)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1545, file: !4, line: 3517, baseType: !1580, size: 64, align: 64, offset: 896)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1545, file: !4, line: 3527, baseType: !1582, size: 64, align: 64, offset: 960)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!920, !1535}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1545, file: !4, line: 3535, baseType: !1586, size: 64, align: 64, offset: 1024)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{!920, !1535, !1589}
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1536)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1545, file: !4, line: 3541, baseType: !1592, size: 64, align: 64, offset: 1088)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1595)
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1596, line: 223, size: 128, align: 64, elements: !1597)
!1596 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1597 = !{!1598, !1599}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1595, file: !1596, line: 224, baseType: !1200, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1595, file: !1596, line: 225, baseType: !1200, size: 64, align: 64, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1545, file: !4, line: 3549, baseType: !1601, size: 64, align: 64, offset: 1152)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{null, !1580}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1545, file: !4, line: 3551, baseType: !1582, size: 64, align: 64, offset: 1216)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1545, file: !4, line: 3552, baseType: !1606, size: 64, align: 64, offset: 1280)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!920, !1535, !1184, !920, !1609}
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1612)
!1612 = !{!1613, !1616, !1617, !1618, !1619, !1644}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1611, file: !4, line: 3921, baseType: !1614, size: 16, align: 16)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !918, line: 49, baseType: !1615)
!1615 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1611, file: !4, line: 3922, baseType: !971, size: 32, align: 32, offset: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1611, file: !4, line: 3923, baseType: !971, size: 32, align: 32, offset: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1611, file: !4, line: 3924, baseType: !921, size: 32, align: 32, offset: 96)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1611, file: !4, line: 3925, baseType: !1620, size: 64, align: 64, offset: 128)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1623)
!1623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1624)
!1624 = !{!1625, !1626, !1627, !1628, !1629, !1630, !1636, !1638, !1640, !1641, !1642, !1643}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1623, file: !4, line: 3886, baseType: !920, size: 32, align: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1623, file: !4, line: 3887, baseType: !920, size: 32, align: 32, offset: 32)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1623, file: !4, line: 3888, baseType: !920, size: 32, align: 32, offset: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1623, file: !4, line: 3889, baseType: !920, size: 32, align: 32, offset: 96)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1623, file: !4, line: 3890, baseType: !920, size: 32, align: 32, offset: 128)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1623, file: !4, line: 3897, baseType: !1631, size: 768, align: 64, offset: 192)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1633)
!1633 = !{!1634, !1635}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1632, file: !4, line: 3855, baseType: !1423, size: 512, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1632, file: !4, line: 3857, baseType: !1427, size: 256, align: 32, offset: 512)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1623, file: !4, line: 3903, baseType: !1637, size: 256, align: 64, offset: 960)
!1637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1184, size: 256, align: 64, elements: !945)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1623, file: !4, line: 3904, baseType: !1639, size: 128, align: 32, offset: 1216)
!1639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 128, align: 32, elements: !945)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1623, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1623, file: !4, line: 3908, baseType: !1067, size: 64, align: 64, offset: 1408)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1623, file: !4, line: 3915, baseType: !1067, size: 64, align: 64, offset: 1472)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1623, file: !4, line: 3917, baseType: !920, size: 32, align: 32, offset: 1536)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1611, file: !4, line: 3926, baseType: !968, size: 64, align: 64, offset: 192)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1545, file: !4, line: 3564, baseType: !1646, size: 64, align: 64, offset: 1344)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!920, !1535, !1313, !1649, !1651}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1419)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1545, file: !4, line: 3566, baseType: !1653, size: 64, align: 64, offset: 1408)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{!920, !1535, !1143, !1651, !1313}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1545, file: !4, line: 3567, baseType: !1582, size: 64, align: 64, offset: 1472)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1545, file: !4, line: 3576, baseType: !1658, size: 64, align: 64, offset: 1536)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!920, !1535, !1649}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1545, file: !4, line: 3577, baseType: !1662, size: 64, align: 64, offset: 1600)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!920, !1535, !1313}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1545, file: !4, line: 3584, baseType: !1666, size: 64, align: 64, offset: 1664)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!920, !1535, !1418}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1545, file: !4, line: 3589, baseType: !1670, size: 64, align: 64, offset: 1728)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1535}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1545, file: !4, line: 3594, baseType: !920, size: 32, align: 32, offset: 1792)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1545, file: !4, line: 3600, baseType: !980, size: 64, align: 64, offset: 1856)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1545, file: !4, line: 3609, baseType: !1676, size: 64, align: 64, offset: 1920)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1679)
!1679 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1537, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1537, file: !4, line: 1581, baseType: !921, size: 32, align: 32, offset: 224)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1537, file: !4, line: 1583, baseType: !1143, size: 64, align: 64, offset: 256)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1537, file: !4, line: 1591, baseType: !1684, size: 64, align: 64, offset: 320)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1596, line: 129, size: 1664, align: 64, elements: !1686)
!1686 = !{!1687, !1688, !1689, !1690, !1691, !1709, !1710, !1716, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1685, file: !1596, line: 136, baseType: !920, size: 32, align: 32)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1685, file: !1596, line: 151, baseType: !920, size: 32, align: 32, offset: 32)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1685, file: !1596, line: 157, baseType: !920, size: 32, align: 32, offset: 64)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1685, file: !1596, line: 159, baseType: !1418, size: 64, align: 64, offset: 128)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1685, file: !1596, line: 161, baseType: !1692, size: 64, align: 64, offset: 192)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1596, line: 117, baseType: !1694)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1596, line: 100, size: 832, align: 64, elements: !1695)
!1695 = !{!1696, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1694, file: !1596, line: 105, baseType: !1697, size: 256, align: 64)
!1697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1698, size: 256, align: 64, elements: !945)
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1320, line: 238, baseType: !1700)
!1700 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1320, line: 238, flags: DIFlagFwdDecl)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1694, file: !1596, line: 110, baseType: !920, size: 32, align: 32, offset: 256)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1694, file: !1596, line: 111, baseType: !920, size: 32, align: 32, offset: 288)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1694, file: !1596, line: 111, baseType: !920, size: 32, align: 32, offset: 320)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1694, file: !1596, line: 112, baseType: !1427, size: 256, align: 32, offset: 352)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1694, file: !1596, line: 113, baseType: !1639, size: 128, align: 32, offset: 608)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1694, file: !1596, line: 114, baseType: !920, size: 32, align: 32, offset: 736)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1694, file: !1596, line: 115, baseType: !920, size: 32, align: 32, offset: 768)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1694, file: !1596, line: 116, baseType: !920, size: 32, align: 32, offset: 800)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1685, file: !1596, line: 163, baseType: !1143, size: 64, align: 64, offset: 256)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1685, file: !1596, line: 165, baseType: !1711, size: 128, align: 64, offset: 320)
!1711 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1596, line: 122, baseType: !1712)
!1712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1596, line: 119, size: 128, align: 64, elements: !1713)
!1713 = !{!1714, !1715}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1712, file: !1596, line: 120, baseType: !1313, size: 64, align: 64)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1712, file: !1596, line: 121, baseType: !1418, size: 64, align: 64, offset: 64)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1685, file: !1596, line: 166, baseType: !1717, size: 128, align: 64, offset: 448)
!1717 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1596, line: 127, baseType: !1718)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1596, line: 124, size: 128, align: 64, elements: !1719)
!1719 = !{!1720, !1793}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1718, file: !1596, line: 125, baseType: !1721, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64, align: 64)
!1723 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1724)
!1724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1725)
!1725 = !{!1726, !1727, !1751, !1755, !1756, !1790, !1791, !1792}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1724, file: !4, line: 5751, baseType: !1133, size: 64, align: 64)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1724, file: !4, line: 5756, baseType: !1728, size: 64, align: 64, offset: 64)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1730)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1731)
!1731 = !{!1732, !1733, !1736, !1737, !1738, !1742, !1746, !1750}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1730, file: !4, line: 5797, baseType: !980, size: 64, align: 64)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1730, file: !4, line: 5804, baseType: !1734, size: 64, align: 64, offset: 64)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1730, file: !4, line: 5815, baseType: !1133, size: 64, align: 64, offset: 128)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1730, file: !4, line: 5825, baseType: !920, size: 32, align: 32, offset: 192)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1730, file: !4, line: 5826, baseType: !1739, size: 64, align: 64, offset: 256)
!1739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1740, size: 64, align: 64)
!1740 = !DISubroutineType(types: !1741)
!1741 = !{!920, !1722}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1730, file: !4, line: 5827, baseType: !1743, size: 64, align: 64, offset: 320)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64, align: 64)
!1744 = !DISubroutineType(types: !1745)
!1745 = !{!920, !1722, !1313}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1730, file: !4, line: 5828, baseType: !1747, size: 64, align: 64, offset: 384)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DISubroutineType(types: !1749)
!1749 = !{null, !1722}
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1730, file: !4, line: 5829, baseType: !1747, size: 64, align: 64, offset: 448)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1724, file: !4, line: 5762, baseType: !1752, size: 64, align: 64, offset: 128)
!1752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1753, size: 64, align: 64)
!1753 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1754)
!1754 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1724, file: !4, line: 5768, baseType: !1143, size: 64, align: 64, offset: 192)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1724, file: !4, line: 5775, baseType: !1757, size: 64, align: 64, offset: 256)
!1757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1758, size: 64, align: 64)
!1758 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1759)
!1759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1760)
!1760 = !{!1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789}
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1759, file: !4, line: 3940, baseType: !636, size: 32, align: 32)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1759, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1759, file: !4, line: 3948, baseType: !971, size: 32, align: 32, offset: 64)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1759, file: !4, line: 3958, baseType: !1184, size: 64, align: 64, offset: 128)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1759, file: !4, line: 3962, baseType: !920, size: 32, align: 32, offset: 192)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1759, file: !4, line: 3968, baseType: !920, size: 32, align: 32, offset: 224)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1759, file: !4, line: 3973, baseType: !968, size: 64, align: 64, offset: 256)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1759, file: !4, line: 3986, baseType: !920, size: 32, align: 32, offset: 320)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1759, file: !4, line: 3999, baseType: !920, size: 32, align: 32, offset: 352)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1759, file: !4, line: 4004, baseType: !920, size: 32, align: 32, offset: 384)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1759, file: !4, line: 4005, baseType: !920, size: 32, align: 32, offset: 416)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1759, file: !4, line: 4010, baseType: !920, size: 32, align: 32, offset: 448)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1759, file: !4, line: 4011, baseType: !920, size: 32, align: 32, offset: 480)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1759, file: !4, line: 4020, baseType: !1437, size: 64, align: 32, offset: 512)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1759, file: !4, line: 4025, baseType: !867, size: 32, align: 32, offset: 576)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1759, file: !4, line: 4030, baseType: !558, size: 32, align: 32, offset: 608)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1759, file: !4, line: 4031, baseType: !565, size: 32, align: 32, offset: 640)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1759, file: !4, line: 4032, baseType: !583, size: 32, align: 32, offset: 672)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1759, file: !4, line: 4033, baseType: !607, size: 32, align: 32, offset: 704)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1759, file: !4, line: 4034, baseType: !626, size: 32, align: 32, offset: 736)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1759, file: !4, line: 4039, baseType: !920, size: 32, align: 32, offset: 768)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1759, file: !4, line: 4046, baseType: !917, size: 64, align: 64, offset: 832)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1759, file: !4, line: 4050, baseType: !920, size: 32, align: 32, offset: 896)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1759, file: !4, line: 4054, baseType: !920, size: 32, align: 32, offset: 928)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1759, file: !4, line: 4061, baseType: !920, size: 32, align: 32, offset: 960)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1759, file: !4, line: 4065, baseType: !920, size: 32, align: 32, offset: 992)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1759, file: !4, line: 4073, baseType: !920, size: 32, align: 32, offset: 1024)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1759, file: !4, line: 4080, baseType: !920, size: 32, align: 32, offset: 1056)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1759, file: !4, line: 4084, baseType: !920, size: 32, align: 32, offset: 1088)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1724, file: !4, line: 5781, baseType: !1757, size: 64, align: 64, offset: 320)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1724, file: !4, line: 5787, baseType: !1437, size: 64, align: 32, offset: 384)
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1724, file: !4, line: 5793, baseType: !1437, size: 64, align: 32, offset: 448)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1718, file: !1596, line: 126, baseType: !920, size: 32, align: 32, offset: 64)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1685, file: !1596, line: 172, baseType: !1313, size: 64, align: 64, offset: 576)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1685, file: !1596, line: 177, baseType: !1184, size: 64, align: 64, offset: 640)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1685, file: !1596, line: 178, baseType: !921, size: 32, align: 32, offset: 704)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1685, file: !1596, line: 180, baseType: !1143, size: 64, align: 64, offset: 768)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1685, file: !1596, line: 185, baseType: !920, size: 32, align: 32, offset: 832)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1685, file: !1596, line: 190, baseType: !1143, size: 64, align: 64, offset: 896)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1685, file: !1596, line: 195, baseType: !920, size: 32, align: 32, offset: 960)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1685, file: !1596, line: 200, baseType: !1313, size: 64, align: 64, offset: 1024)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1685, file: !1596, line: 201, baseType: !920, size: 32, align: 32, offset: 1088)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1685, file: !1596, line: 202, baseType: !1418, size: 64, align: 64, offset: 1152)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1685, file: !1596, line: 203, baseType: !920, size: 32, align: 32, offset: 1216)
