; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_alphamerge.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_alphamerge.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!91 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!92 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!93 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!94 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!95 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!96 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !48, line: 493, size: 32, align: 32, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!98 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!99 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!100 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!101 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!102 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!103 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!104 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!105 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!106 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!107 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!108 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!109 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!110 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!111 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!112 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!113 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!114 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !126, line: 29, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!128 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!129 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!130 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!131 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!132 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!133 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!134 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!135 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!136 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!137 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!138 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!139 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!140 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!141 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!142 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!143 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!144 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!145 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !148, file: !147, line: 503, size: 32, align: 32, elements: !522)
!147 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !147, line: 439, size: 493504, align: 64, elements: !149)
!149 = !{!150, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !483, !484, !485, !486, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !148, file: !147, line: 440, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !147, line: 67, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !147, line: 338, size: 1344, align: 64, elements: !154)
!154 = !{!155, !201, !382, !383, !385, !387, !389, !390, !391, !392, !393, !433, !434, !440, !450, !451, !452, !454, !455, !456, !457, !458}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !153, file: !147, line: 339, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !126, line: 143, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !126, line: 67, size: 640, align: 64, elements: !160)
!160 = !{!161, !165, !170, !174, !176, !177, !178, !182, !188, !190, !194}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !159, file: !126, line: 72, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !159, file: !126, line: 78, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!162, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !159, file: !126, line: 85, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 85, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !159, file: !126, line: 93, baseType: !175, size: 32, align: 32, offset: 192)
!175 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !159, file: !126, line: 99, baseType: !175, size: 32, align: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !159, file: !126, line: 108, baseType: !175, size: 32, align: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !159, file: !126, line: 113, baseType: !179, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!169, !169, !169}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !159, file: !126, line: 123, baseType: !183, size: 64, align: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !159, file: !126, line: 130, baseType: !189, size: 32, align: 32, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !126, line: 48, baseType: !125)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !159, file: !126, line: 136, baseType: !191, size: 64, align: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!189, !169}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !159, file: !126, line: 142, baseType: !195, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!175, !198, !169, !162, !175}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 60, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !153, file: !147, line: 341, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !147, line: 328, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !147, line: 144, size: 1024, align: 64, elements: !206)
!206 = !{!207, !208, !209, !350, !351, !352, !353, !357, !358, !363, !367, !368, !369, !370, !372, !377, !381}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !147, line: 148, baseType: !162, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !205, file: !147, line: 155, baseType: !162, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !205, file: !147, line: 164, baseType: !210, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !147, line: 69, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !214, line: 54, size: 576, align: 64, elements: !215)
!214 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!215 = !{!216, !217, !218, !334, !338, !342, !346, !347, !348, !349}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !214, line: 60, baseType: !162, size: 64, align: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !213, file: !214, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !213, file: !214, line: 73, baseType: !219, size: 64, align: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!222, !332, !175, !175}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !225)
!225 = !{!226, !234, !236, !238, !239, !240, !241, !242, !243, !244, !251, !254, !255, !256, !257, !258, !259, !260, !264, !265, !266, !267, !268, !269, !270, !271, !284, !286, !287, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !320, !321, !322, !323, !324, !325, !328, !329, !330, !331}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !224, file: !24, line: 282, baseType: !227, size: 512, align: 64)
!227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 512, align: 64, elements: !232)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !230, line: 48, baseType: !231)
!230 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!231 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!232 = !{!233}
!233 = !DISubrange(count: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !224, file: !24, line: 299, baseType: !235, size: 256, align: 32, offset: 512)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 256, align: 32, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !224, file: !24, line: 315, baseType: !237, size: 64, align: 64, offset: 768)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !224, file: !24, line: 326, baseType: !175, size: 32, align: 32, offset: 832)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !224, file: !24, line: 326, baseType: !175, size: 32, align: 32, offset: 864)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !224, file: !24, line: 334, baseType: !175, size: 32, align: 32, offset: 896)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !224, file: !24, line: 341, baseType: !175, size: 32, align: 32, offset: 928)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !224, file: !24, line: 346, baseType: !175, size: 32, align: 32, offset: 960)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !224, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !224, file: !24, line: 356, baseType: !245, size: 64, align: 32, offset: 1024)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !246, line: 61, baseType: !247)
!246 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !246, line: 58, size: 64, align: 32, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !247, file: !246, line: 59, baseType: !175, size: 32, align: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !247, file: !246, line: 60, baseType: !175, size: 32, align: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !224, file: !24, line: 361, baseType: !252, size: 64, align: 64, offset: 1088)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !230, line: 40, baseType: !253)
!253 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !224, file: !24, line: 369, baseType: !252, size: 64, align: 64, offset: 1152)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !224, file: !24, line: 377, baseType: !252, size: 64, align: 64, offset: 1216)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !224, file: !24, line: 382, baseType: !175, size: 32, align: 32, offset: 1280)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !224, file: !24, line: 386, baseType: !175, size: 32, align: 32, offset: 1312)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !224, file: !24, line: 391, baseType: !175, size: 32, align: 32, offset: 1344)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !224, file: !24, line: 396, baseType: !169, size: 64, align: 64, offset: 1408)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !224, file: !24, line: 403, baseType: !261, size: 512, align: 64, offset: 1472)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 512, align: 64, elements: !232)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !230, line: 55, baseType: !263)
!263 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !224, file: !24, line: 410, baseType: !175, size: 32, align: 32, offset: 1984)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !224, file: !24, line: 415, baseType: !175, size: 32, align: 32, offset: 2016)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !224, file: !24, line: 420, baseType: !175, size: 32, align: 32, offset: 2048)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !224, file: !24, line: 425, baseType: !175, size: 32, align: 32, offset: 2080)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !224, file: !24, line: 435, baseType: !252, size: 64, align: 64, offset: 2112)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !224, file: !24, line: 440, baseType: !175, size: 32, align: 32, offset: 2176)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !224, file: !24, line: 445, baseType: !262, size: 64, align: 64, offset: 2240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !224, file: !24, line: 459, baseType: !272, size: 512, align: 64, offset: 2304)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !273, size: 512, align: 64, elements: !232)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !275, line: 94, baseType: !276)
!275 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !275, line: 81, size: 192, align: 64, elements: !277)
!277 = !{!278, !282, !283}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !276, file: !275, line: 82, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !275, line: 73, baseType: !281)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !275, line: 73, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !275, line: 89, baseType: !228, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !276, file: !275, line: 93, baseType: !175, size: 32, align: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !224, file: !24, line: 473, baseType: !285, size: 64, align: 64, offset: 2816)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !224, file: !24, line: 477, baseType: !175, size: 32, align: 32, offset: 2880)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !224, file: !24, line: 479, baseType: !288, size: 64, align: 64, offset: 2944)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !292)
!292 = !{!293, !294, !295, !296, !301}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !291, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !291, file: !24, line: 203, baseType: !228, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !291, file: !24, line: 204, baseType: !175, size: 32, align: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !291, file: !24, line: 205, baseType: !297, size: 64, align: 64, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64, align: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !299, line: 86, baseType: !300)
!299 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !299, line: 86, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !291, file: !24, line: 206, baseType: !273, size: 64, align: 64, offset: 256)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !224, file: !24, line: 480, baseType: !175, size: 32, align: 32, offset: 3008)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !224, file: !24, line: 505, baseType: !175, size: 32, align: 32, offset: 3040)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !224, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !224, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !224, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !224, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !224, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !224, file: !24, line: 532, baseType: !252, size: 64, align: 64, offset: 3264)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !224, file: !24, line: 539, baseType: !252, size: 64, align: 64, offset: 3328)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !224, file: !24, line: 547, baseType: !252, size: 64, align: 64, offset: 3392)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !224, file: !24, line: 554, baseType: !297, size: 64, align: 64, offset: 3456)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !224, file: !24, line: 563, baseType: !175, size: 32, align: 32, offset: 3520)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !224, file: !24, line: 572, baseType: !175, size: 32, align: 32, offset: 3552)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !224, file: !24, line: 581, baseType: !175, size: 32, align: 32, offset: 3584)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !224, file: !24, line: 588, baseType: !317, size: 64, align: 64, offset: 3648)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !230, line: 36, baseType: !319)
!319 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !224, file: !24, line: 593, baseType: !175, size: 32, align: 32, offset: 3712)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !224, file: !24, line: 596, baseType: !175, size: 32, align: 32, offset: 3744)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !224, file: !24, line: 599, baseType: !273, size: 64, align: 64, offset: 3776)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !224, file: !24, line: 605, baseType: !273, size: 64, align: 64, offset: 3840)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !224, file: !24, line: 616, baseType: !273, size: 64, align: 64, offset: 3904)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !224, file: !24, line: 626, baseType: !326, size: 64, align: 64, offset: 3968)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !327, line: 216, baseType: !263)
!327 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!328 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !224, file: !24, line: 627, baseType: !326, size: 64, align: 64, offset: 4032)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !224, file: !24, line: 628, baseType: !326, size: 64, align: 64, offset: 4096)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !224, file: !24, line: 629, baseType: !326, size: 64, align: 64, offset: 4160)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !224, file: !24, line: 645, baseType: !273, size: 64, align: 64, offset: 4224)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !147, line: 68, baseType: !148)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !213, file: !214, line: 81, baseType: !335, size: 64, align: 64, offset: 192)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!222, !332, !175}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !213, file: !214, line: 93, baseType: !339, size: 64, align: 64, offset: 256)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!175, !332, !222}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !213, file: !214, line: 104, baseType: !343, size: 64, align: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!175, !332}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !213, file: !214, line: 113, baseType: !343, size: 64, align: 64, offset: 384)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !213, file: !214, line: 129, baseType: !343, size: 64, align: 64, offset: 448)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !213, file: !214, line: 137, baseType: !175, size: 32, align: 32, offset: 512)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !213, file: !214, line: 145, baseType: !175, size: 32, align: 32, offset: 544)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !205, file: !147, line: 172, baseType: !210, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !205, file: !147, line: 182, baseType: !156, size: 64, align: 64, offset: 256)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !147, line: 187, baseType: !175, size: 32, align: 32, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !205, file: !147, line: 210, baseType: !354, size: 64, align: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!175, !151}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !205, file: !147, line: 233, baseType: !354, size: 64, align: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !205, file: !147, line: 246, baseType: !359, size: 64, align: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64, align: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!175, !151, !362}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !205, file: !147, line: 258, baseType: !364, size: 64, align: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !151}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !205, file: !147, line: 282, baseType: !354, size: 64, align: 64, offset: 640)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !205, file: !147, line: 284, baseType: !175, size: 32, align: 32, offset: 704)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !205, file: !147, line: 286, baseType: !175, size: 32, align: 32, offset: 736)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !147, line: 292, baseType: !371, size: 64, align: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !205, file: !147, line: 306, baseType: !373, size: 64, align: 64, offset: 832)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64, align: 64)
!374 = !DISubroutineType(types: !375)
!375 = !{!175, !151, !162, !162, !376, !175, !175}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !205, file: !147, line: 313, baseType: !378, size: 64, align: 64, offset: 896)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64, align: 64)
!379 = !DISubroutineType(types: !380)
!380 = !{!175, !151, !169}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !205, file: !147, line: 327, baseType: !354, size: 64, align: 64, offset: 960)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !147, line: 343, baseType: !376, size: 64, align: 64, offset: 128)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !153, file: !147, line: 345, baseType: !384, size: 64, align: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !153, file: !147, line: 346, baseType: !386, size: 64, align: 64, offset: 256)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !153, file: !147, line: 347, baseType: !388, size: 32, align: 32, offset: 320)
!388 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !153, file: !147, line: 349, baseType: !384, size: 64, align: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !153, file: !147, line: 350, baseType: !386, size: 64, align: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !153, file: !147, line: 351, baseType: !388, size: 32, align: 32, offset: 512)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !153, file: !147, line: 353, baseType: !169, size: 64, align: 64, offset: 576)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !153, file: !147, line: 355, baseType: !394, size: 64, align: 64, offset: 640)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !147, line: 840, size: 768, align: 64, elements: !396)
!396 = !{!397, !398, !400, !401, !402, !403, !404, !405, !427, !428, !429, !430, !431, !432}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !395, file: !147, line: 841, baseType: !156, size: 64, align: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !395, file: !147, line: 842, baseType: !399, size: 64, align: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !395, file: !147, line: 843, baseType: !388, size: 32, align: 32, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !395, file: !147, line: 845, baseType: !376, size: 64, align: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !395, file: !147, line: 847, baseType: !376, size: 64, align: 64, offset: 256)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !395, file: !147, line: 862, baseType: !175, size: 32, align: 32, offset: 320)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !395, file: !147, line: 869, baseType: !175, size: 32, align: 32, offset: 352)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !395, file: !147, line: 874, baseType: !406, size: 64, align: 64, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64, align: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !147, line: 809, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !214, line: 148, size: 192, align: 64, elements: !409)
!409 = !{!410, !411, !421}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !408, file: !214, line: 149, baseType: !169, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !408, file: !214, line: 150, baseType: !412, size: 64, align: 64, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !147, line: 837, baseType: !414)
!414 = !DISubroutineType(types: !415)
!415 = !{!175, !151, !416, !169, !420, !175}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !147, line: 823, baseType: !418)
!418 = !DISubroutineType(types: !419)
!419 = !{!175, !151, !169, !175, !175}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !408, file: !214, line: 151, baseType: !422, size: 8, align: 8, offset: 128)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !423, line: 48, baseType: !424)
!423 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !423, line: 46, size: 8, align: 8, elements: !425)
!425 = !{!426}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !424, file: !423, line: 47, baseType: !164, size: 8, align: 8)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !395, file: !147, line: 881, baseType: !169, size: 64, align: 64, offset: 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !395, file: !147, line: 895, baseType: !412, size: 64, align: 64, offset: 512)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !395, file: !147, line: 897, baseType: !376, size: 64, align: 64, offset: 576)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !395, file: !147, line: 906, baseType: !386, size: 64, align: 64, offset: 640)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !395, file: !147, line: 907, baseType: !175, size: 32, align: 32, offset: 704)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !395, file: !147, line: 909, baseType: !388, size: 32, align: 32, offset: 736)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !153, file: !147, line: 373, baseType: !175, size: 32, align: 32, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !153, file: !147, line: 378, baseType: !435, size: 64, align: 64, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !147, line: 335, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !214, line: 154, size: 64, align: 64, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !437, file: !214, line: 155, baseType: !412, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !153, file: !147, line: 380, baseType: !441, size: 64, align: 64, offset: 832)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !214, line: 38, size: 320, align: 64, elements: !443)
!443 = !{!444, !446, !447, !448, !449}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !442, file: !214, line: 39, baseType: !445, size: 64, align: 64)
!445 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !442, file: !214, line: 40, baseType: !376, size: 64, align: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !442, file: !214, line: 41, baseType: !376, size: 64, align: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !442, file: !214, line: 42, baseType: !175, size: 32, align: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !442, file: !214, line: 43, baseType: !441, size: 64, align: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !153, file: !147, line: 382, baseType: !376, size: 64, align: 64, offset: 896)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !153, file: !147, line: 383, baseType: !169, size: 64, align: 64, offset: 960)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !153, file: !147, line: 384, baseType: !453, size: 64, align: 64, offset: 1024)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !153, file: !147, line: 385, baseType: !175, size: 32, align: 32, offset: 1088)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !153, file: !147, line: 394, baseType: !273, size: 64, align: 64, offset: 1152)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !153, file: !147, line: 401, baseType: !175, size: 32, align: 32, offset: 1216)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !153, file: !147, line: 408, baseType: !388, size: 32, align: 32, offset: 1248)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !153, file: !147, line: 424, baseType: !175, size: 32, align: 32, offset: 1280)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !148, file: !147, line: 441, baseType: !384, size: 64, align: 64, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !148, file: !147, line: 443, baseType: !151, size: 64, align: 64, offset: 128)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !148, file: !147, line: 444, baseType: !384, size: 64, align: 64, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !147, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !148, file: !147, line: 449, baseType: !175, size: 32, align: 32, offset: 288)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !148, file: !147, line: 450, baseType: !175, size: 32, align: 32, offset: 320)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !148, file: !147, line: 451, baseType: !245, size: 64, align: 32, offset: 352)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !148, file: !147, line: 453, baseType: !262, size: 64, align: 64, offset: 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !148, file: !147, line: 454, baseType: !175, size: 32, align: 32, offset: 512)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !148, file: !147, line: 456, baseType: !175, size: 32, align: 32, offset: 544)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !148, file: !147, line: 465, baseType: !245, size: 64, align: 32, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !148, file: !147, line: 481, baseType: !471, size: 64, align: 64, offset: 640)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !147, line: 70, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !474, line: 64, size: 256, align: 64, elements: !475)
!474 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!475 = !{!476, !477, !478, !479}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !473, file: !474, line: 65, baseType: !388, size: 32, align: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !473, file: !474, line: 66, baseType: !420, size: 64, align: 64, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !473, file: !474, line: 68, baseType: !388, size: 32, align: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !473, file: !474, line: 69, baseType: !480, size: 64, align: 64, offset: 192)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64, align: 64)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !148, file: !147, line: 482, baseType: !471, size: 64, align: 64, offset: 704)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !148, file: !147, line: 488, baseType: !471, size: 64, align: 64, offset: 768)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !148, file: !147, line: 489, baseType: !471, size: 64, align: 64, offset: 832)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !148, file: !147, line: 490, baseType: !487, size: 64, align: 64, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !474, line: 85, size: 256, align: 64, elements: !489)
!489 = !{!490, !492, !493, !494, !495, !496}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !488, file: !474, line: 86, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !488, file: !474, line: 87, baseType: !175, size: 32, align: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !488, file: !474, line: 88, baseType: !164, size: 8, align: 8, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !488, file: !474, line: 89, baseType: !164, size: 8, align: 8, offset: 104)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !488, file: !474, line: 91, baseType: !388, size: 32, align: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !488, file: !474, line: 92, baseType: !497, size: 64, align: 64, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !148, file: !147, line: 491, baseType: !487, size: 64, align: 64, offset: 960)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !148, file: !147, line: 500, baseType: !175, size: 32, align: 32, offset: 1024)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !148, file: !147, line: 507, baseType: !146, size: 32, align: 32, offset: 1056)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !148, file: !147, line: 512, baseType: !394, size: 64, align: 64, offset: 1088)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !148, file: !147, line: 518, baseType: !252, size: 64, align: 64, offset: 1152)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !148, file: !147, line: 524, baseType: !252, size: 64, align: 64, offset: 1216)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !148, file: !147, line: 529, baseType: !175, size: 32, align: 32, offset: 1280)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !148, file: !147, line: 542, baseType: !245, size: 64, align: 32, offset: 1312)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !148, file: !147, line: 547, baseType: !222, size: 64, align: 64, offset: 1408)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !148, file: !147, line: 553, baseType: !175, size: 32, align: 32, offset: 1472)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !148, file: !147, line: 562, baseType: !175, size: 32, align: 32, offset: 1504)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !148, file: !147, line: 568, baseType: !175, size: 32, align: 32, offset: 1536)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !148, file: !147, line: 573, baseType: !175, size: 32, align: 32, offset: 1568)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !147, line: 578, baseType: !388, size: 32, align: 32, offset: 1600)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !148, file: !147, line: 583, baseType: !252, size: 64, align: 64, offset: 1664)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !148, file: !147, line: 583, baseType: !252, size: 64, align: 64, offset: 1728)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !148, file: !147, line: 588, baseType: !169, size: 64, align: 64, offset: 1792)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !148, file: !147, line: 595, baseType: !175, size: 32, align: 32, offset: 1856)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !148, file: !147, line: 601, baseType: !273, size: 64, align: 64, offset: 1920)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !148, file: !147, line: 610, baseType: !519, size: 491520, align: 8, offset: 1984)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 491520, align: 8, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 61440)
!522 = !{!523, !524, !525}
!523 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!524 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!525 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !48, line: 64, size: 32, align: 32, elements: !527)
!527 = !{!528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!528 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!529 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!530 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!531 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!532 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!533 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!534 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!535 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!536 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!537 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!538 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!539 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!540 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!541 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!542 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!543 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!544 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!545 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!546 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!547 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!548 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!549 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!550 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!551 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!552 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!553 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!554 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!555 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!556 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!557 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!558 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!559 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!560 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!561 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!562 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!563 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!564 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!565 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!566 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!567 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!568 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!569 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!570 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!571 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!572 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!573 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!574 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!575 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!576 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!577 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!578 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!579 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!580 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!581 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!582 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!583 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!584 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!585 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!586 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!587 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!588 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!589 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!590 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!591 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!592 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!593 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!594 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!595 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!596 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!597 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!598 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!599 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!600 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!601 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!602 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!603 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!604 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!605 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!606 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!607 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!608 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!609 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!610 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!611 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!612 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!613 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!614 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!615 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!616 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!617 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!618 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!619 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!620 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!621 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!622 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!623 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!624 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!625 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!626 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!627 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!628 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!629 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!630 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!631 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!632 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!633 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!634 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!635 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!636 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!637 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!638 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!639 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!640 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!641 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!642 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!643 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!644 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!645 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!646 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!647 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!648 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!649 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!650 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!651 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!652 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!653 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!654 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!655 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!656 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!657 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!658 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!659 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!660 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!661 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!662 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!663 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!664 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!665 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!666 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!667 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!668 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!669 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!670 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!671 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!672 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!673 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!674 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!675 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!676 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!677 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!678 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!679 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!680 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!681 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!682 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!683 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!684 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!685 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!686 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!687 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!688 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!689 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!690 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!691 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!692 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!693 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!694 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!695 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!696 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!697 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!698 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!699 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!700 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!701 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!702 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!703 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!704 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!705 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!706 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!707 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!708 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!709 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!710 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!711 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!712 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!713 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!714 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!715 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!716 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!717 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!718 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!719 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!720 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!721 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!722 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!723 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!724 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !726, line: 37, size: 32, align: 32, elements: !727)
!726 = !DIFile(filename: "libavfilter/vf_alphamerge.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!727 = !{!728, !729, !730, !731}
!728 = !DIEnumerator(name: "Y", value: 0)
!729 = !DIEnumerator(name: "U", value: 1)
!730 = !DIEnumerator(name: "V", value: 2)
!731 = !DIEnumerator(name: "A", value: 3)
!732 = !{!175, !388}
!733 = !{!734, !735, !739, !743, !750}
!734 = distinct !DIGlobalVariable(name: "ff_vf_alphamerge", scope: !0, file: !726, line: 206, type: !204, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_alphamerge)
!735 = distinct !DIGlobalVariable(name: "alphamerge_inputs", scope: !0, file: !726, line: 184, type: !736, isLocal: true, isDefinition: true, variable: [3 x %struct.AVFilterPad]* @alphamerge_inputs)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 1728, align: 64, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 3)
!739 = distinct !DIGlobalVariable(name: "alphamerge_outputs", scope: !0, file: !726, line: 197, type: !740, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @alphamerge_outputs)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 1152, align: 64, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 2)
!743 = distinct !DIGlobalVariable(name: "main_fmts", scope: !744, file: !726, line: 48, type: !746, isLocal: true, isDefinition: true, variable: [9 x i32]* @query_formats.main_fmts)
!744 = distinct !DISubprogram(name: "query_formats", scope: !726, file: !726, line: 46, type: !355, isLocal: true, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !745)
!745 = !{}
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 288, align: 32, elements: !748)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !526)
!748 = !{!749}
!749 = !DISubrange(count: 9)
!750 = distinct !DIGlobalVariable(name: "alpha_fmts", scope: !744, file: !726, line: 54, type: !751, isLocal: true, isDefinition: true, variable: [2 x i32]* @query_formats.alpha_fmts)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 64, align: 32, elements: !741)
!752 = !{i32 2, !"Dwarf Version", i32 4}
!753 = !{i32 2, !"Debug Info Version", i32 3}
!754 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!755 = !DILocalVariable(name: "ctx", arg: 1, scope: !744, file: !726, line: 46, type: !151)
!756 = !DIExpression()
!757 = !DILocation(line: 46, column: 43, scope: !744)
!758 = !DILocalVariable(name: "main_formats", scope: !744, file: !726, line: 55, type: !471)
!759 = !DILocation(line: 55, column: 22, scope: !744)
!760 = !DILocalVariable(name: "alpha_formats", scope: !744, file: !726, line: 55, type: !471)
!761 = !DILocation(line: 55, column: 43, scope: !744)
!762 = !DILocalVariable(name: "ret", scope: !744, file: !726, line: 56, type: !175)
!763 = !DILocation(line: 56, column: 9, scope: !744)
!764 = !DILocation(line: 58, column: 26, scope: !765)
!765 = distinct !DILexicalBlock(scope: !744, file: !726, line: 58, column: 9)
!766 = !DILocation(line: 58, column: 24, scope: !765)
!767 = !DILocation(line: 58, column: 58, scope: !765)
!768 = !DILocation(line: 59, column: 27, scope: !765)
!769 = !DILocation(line: 59, column: 25, scope: !765)
!770 = !DILocation(line: 58, column: 9, scope: !771)
!771 = !DILexicalBlockFile(scope: !744, file: !726, discriminator: 1)
!772 = !DILocation(line: 60, column: 17, scope: !773)
!773 = distinct !DILexicalBlock(scope: !765, file: !726, line: 59, column: 61)
!774 = !DILocation(line: 61, column: 13, scope: !773)
!775 = !DILocation(line: 63, column: 31, scope: !776)
!776 = distinct !DILexicalBlock(scope: !744, file: !726, line: 63, column: 9)
!777 = !DILocation(line: 63, column: 47, scope: !776)
!778 = !DILocation(line: 63, column: 52, scope: !776)
!779 = !DILocation(line: 63, column: 63, scope: !776)
!780 = !DILocation(line: 63, column: 16, scope: !776)
!781 = !DILocation(line: 63, column: 14, scope: !776)
!782 = !DILocation(line: 63, column: 77, scope: !776)
!783 = !DILocation(line: 63, column: 81, scope: !776)
!784 = !DILocation(line: 64, column: 31, scope: !776)
!785 = !DILocation(line: 64, column: 47, scope: !776)
!786 = !DILocation(line: 64, column: 52, scope: !776)
!787 = !DILocation(line: 64, column: 63, scope: !776)
!788 = !DILocation(line: 64, column: 16, scope: !776)
!789 = !DILocation(line: 64, column: 14, scope: !776)
!790 = !DILocation(line: 64, column: 77, scope: !776)
!791 = !DILocation(line: 64, column: 81, scope: !776)
!792 = !DILocation(line: 65, column: 31, scope: !776)
!793 = !DILocation(line: 65, column: 47, scope: !776)
!794 = !DILocation(line: 65, column: 52, scope: !776)
!795 = !DILocation(line: 65, column: 64, scope: !776)
!796 = !DILocation(line: 65, column: 16, scope: !776)
!797 = !DILocation(line: 65, column: 14, scope: !776)
!798 = !DILocation(line: 65, column: 77, scope: !776)
!799 = !DILocation(line: 63, column: 9, scope: !771)
!800 = !DILocation(line: 66, column: 13, scope: !776)
!801 = !DILocation(line: 67, column: 5, scope: !744)
!802 = !DILocation(line: 69, column: 9, scope: !803)
!803 = distinct !DILexicalBlock(scope: !744, file: !726, line: 69, column: 9)
!804 = !DILocation(line: 69, column: 9, scope: !744)
!805 = !DILocation(line: 70, column: 19, scope: !803)
!806 = !DILocation(line: 70, column: 33, scope: !803)
!807 = !DILocation(line: 70, column: 18, scope: !803)
!808 = !DILocation(line: 70, column: 9, scope: !803)
!809 = !DILocation(line: 71, column: 14, scope: !744)
!810 = !DILocation(line: 71, column: 5, scope: !744)
!811 = !DILocation(line: 72, column: 9, scope: !812)
!812 = distinct !DILexicalBlock(scope: !744, file: !726, line: 72, column: 9)
!813 = !DILocation(line: 72, column: 9, scope: !744)
!814 = !DILocation(line: 73, column: 19, scope: !812)
!815 = !DILocation(line: 73, column: 34, scope: !812)
!816 = !DILocation(line: 73, column: 18, scope: !812)
!817 = !DILocation(line: 73, column: 9, scope: !812)
!818 = !DILocation(line: 74, column: 14, scope: !744)
!819 = !DILocation(line: 74, column: 5, scope: !744)
!820 = !DILocation(line: 75, column: 12, scope: !744)
!821 = !DILocation(line: 75, column: 5, scope: !744)
!822 = !DILocation(line: 76, column: 1, scope: !744)
!823 = distinct !DISubprogram(name: "activate", scope: !726, file: !726, line: 136, type: !355, isLocal: true, isDefinition: true, scopeLine: 137, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !745)
!824 = !DILocalVariable(name: "ctx", arg: 1, scope: !823, file: !726, line: 136, type: !151)
!825 = !DILocation(line: 136, column: 38, scope: !823)
!826 = !DILocalVariable(name: "outlink", scope: !823, file: !726, line: 138, type: !332)
!827 = !DILocation(line: 138, column: 19, scope: !823)
!828 = !DILocation(line: 138, column: 29, scope: !823)
!829 = !DILocation(line: 138, column: 34, scope: !823)
!830 = !DILocalVariable(name: "s", scope: !823, file: !726, line: 139, type: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "AlphaMergeContext", file: !726, line: 44, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AlphaMergeContext", file: !726, line: 39, size: 192, align: 64, elements: !834)
!834 = !{!835, !836, !840, !841}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "is_packed_rgb", scope: !833, file: !726, line: 40, baseType: !175, size: 32, align: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rgba_map", scope: !833, file: !726, line: 41, baseType: !837, size: 32, align: 8, offset: 32)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 32, align: 8, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 4)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "main_frame", scope: !833, file: !726, line: 42, baseType: !222, size: 64, align: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "alpha_frame", scope: !833, file: !726, line: 43, baseType: !222, size: 64, align: 64, offset: 128)
!842 = !DILocation(line: 139, column: 24, scope: !823)
!843 = !DILocation(line: 139, column: 28, scope: !823)
!844 = !DILocation(line: 139, column: 33, scope: !823)
!845 = !DILocalVariable(name: "ret", scope: !823, file: !726, line: 140, type: !175)
!846 = !DILocation(line: 140, column: 9, scope: !823)
!847 = !DILocation(line: 142, column: 5, scope: !823)
!848 = distinct !{!848, !847}
!849 = !DILocalVariable(name: "ret", scope: !850, file: !726, line: 142, type: !175)
!850 = distinct !DILexicalBlock(scope: !823, file: !726, line: 142, column: 8)
!851 = !DILocation(line: 142, column: 14, scope: !850)
!852 = !DILocation(line: 142, column: 42, scope: !853)
!853 = !DILexicalBlockFile(scope: !850, file: !726, discriminator: 1)
!854 = !DILocation(line: 142, column: 20, scope: !853)
!855 = !DILocation(line: 142, column: 14, scope: !853)
!856 = !DILocation(line: 142, column: 56, scope: !853)
!857 = !DILocalVariable(name: "i", scope: !858, file: !726, line: 142, type: !388)
!858 = distinct !DILexicalBlock(scope: !859, file: !726, line: 142, column: 61)
!859 = distinct !DILexicalBlock(scope: !850, file: !726, line: 142, column: 56)
!860 = !DILocation(line: 142, column: 72, scope: !858)
!861 = !DILocation(line: 142, column: 82, scope: !862)
!862 = !DILexicalBlockFile(scope: !863, file: !726, discriminator: 2)
!863 = distinct !DILexicalBlock(scope: !858, file: !726, line: 142, column: 75)
!864 = !DILocation(line: 142, column: 80, scope: !862)
!865 = !DILocation(line: 142, column: 87, scope: !866)
!866 = !DILexicalBlockFile(scope: !867, file: !726, discriminator: 3)
!867 = distinct !DILexicalBlock(scope: !863, file: !726, line: 142, column: 75)
!868 = !DILocation(line: 142, column: 91, scope: !866)
!869 = !DILocation(line: 142, column: 96, scope: !866)
!870 = !DILocation(line: 142, column: 89, scope: !866)
!871 = !DILocation(line: 142, column: 75, scope: !866)
!872 = !DILocation(line: 142, column: 145, scope: !873)
!873 = !DILexicalBlockFile(scope: !867, file: !726, discriminator: 4)
!874 = !DILocation(line: 142, column: 133, scope: !873)
!875 = !DILocation(line: 142, column: 138, scope: !873)
!876 = !DILocation(line: 142, column: 149, scope: !873)
!877 = !DILocation(line: 142, column: 112, scope: !873)
!878 = !DILocation(line: 142, column: 108, scope: !879)
!879 = !DILexicalBlockFile(scope: !867, file: !726, discriminator: 5)
!880 = !DILocation(line: 142, column: 75, scope: !879)
!881 = distinct !{!881, !882}
!882 = !DILocation(line: 142, column: 75, scope: !858)
!883 = !DILocation(line: 142, column: 155, scope: !884)
!884 = !DILexicalBlockFile(scope: !858, file: !726, discriminator: 6)
!885 = !DILocation(line: 142, column: 167, scope: !886)
!886 = !DILexicalBlockFile(scope: !850, file: !726, discriminator: 7)
!887 = !DILocation(line: 144, column: 10, scope: !888)
!888 = distinct !DILexicalBlock(scope: !823, file: !726, line: 144, column: 9)
!889 = !DILocation(line: 144, column: 13, scope: !888)
!890 = !DILocation(line: 144, column: 9, scope: !823)
!891 = !DILocation(line: 145, column: 39, scope: !892)
!892 = distinct !DILexicalBlock(scope: !888, file: !726, line: 144, column: 25)
!893 = !DILocation(line: 145, column: 44, scope: !892)
!894 = !DILocation(line: 145, column: 56, scope: !892)
!895 = !DILocation(line: 145, column: 59, scope: !892)
!896 = !DILocation(line: 145, column: 15, scope: !892)
!897 = !DILocation(line: 145, column: 13, scope: !892)
!898 = !DILocation(line: 146, column: 13, scope: !899)
!899 = distinct !DILexicalBlock(scope: !892, file: !726, line: 146, column: 13)
!900 = !DILocation(line: 146, column: 17, scope: !899)
!901 = !DILocation(line: 146, column: 13, scope: !892)
!902 = !DILocation(line: 147, column: 20, scope: !899)
!903 = !DILocation(line: 147, column: 13, scope: !899)
!904 = !DILocation(line: 148, column: 5, scope: !892)
!905 = !DILocation(line: 150, column: 10, scope: !906)
