; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hap.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hap.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HapContext = type { %struct.AVClass*, %struct.TextureDSPContext, %struct.GetByteContext, i32, i32, i32, i32, %struct.HapChunk*, i32*, i32, i32, i8*, i8*, i64, i64, i32, i32, i32, i32, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.TextureDSPContext = type { i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)*, i32 (i8*, i64, i8*)* }
%struct.GetByteContext = type { i8*, i8*, i8* }
%struct.HapChunk = type { i32, i32, i64, i32, i64 }
%union.unaligned_32 = type { i32 }


!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HapTextureFormat", file: !47, line: 33, size: 32, align: 32, elements: !48)
!47 = !DIFile(filename: "libavcodec/hap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!48 = !{!49, !50, !51, !52}
!49 = !DIEnumerator(name: "HAP_FMT_RGBDXT1", value: 11)
!50 = !DIEnumerator(name: "HAP_FMT_RGBADXT5", value: 14)
!51 = !DIEnumerator(name: "HAP_FMT_YCOCGDXT5", value: 15)
!52 = !DIEnumerator(name: "HAP_FMT_RGTC1", value: 1)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HapCompressor", file: !47, line: 40, size: 32, align: 32, elements: !54)
!54 = !{!55, !56, !57}
!55 = !DIEnumerator(name: "HAP_COMP_NONE", value: 160)
!56 = !DIEnumerator(name: "HAP_COMP_SNAPPY", value: 176)
!57 = !DIEnumerator(name: "HAP_COMP_COMPLEX", value: 192)
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HapSectionType", file: !47, line: 46, size: 32, align: 32, elements: !59)
!59 = !{!60, !61, !62, !63}
!60 = !DIEnumerator(name: "HAP_ST_DECODE_INSTRUCTIONS", value: 1)
!61 = !DIEnumerator(name: "HAP_ST_COMPRESSOR_TABLE", value: 2)
!62 = !DIEnumerator(name: "HAP_ST_SIZE_TABLE", value: 3)
!63 = !DIEnumerator(name: "HAP_ST_OFFSET_TABLE", value: 4)
!64 = !{!65, !66, !67, !72}
!65 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!66 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !70, line: 48, baseType: !71)
!70 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!71 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !75, line: 221, size: 32, align: 8, elements: !76)
!75 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !74, file: !75, line: 221, baseType: !78, size: 32, align: 32)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !70, line: 51, baseType: !66)
!79 = !{i32 2, !"Dwarf Version", i32 4}
!80 = !{i32 2, !"Debug Info Version", i32 3}
!81 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!82 = distinct !DISubprogram(name: "ff_hap_set_chunk_count", scope: !83, file: !83, line: 28, type: !84, isLocal: false, isDefinition: true, scopeLine: 29, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !238)
!83 = !DIFile(filename: "libavcodec/hap.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!84 = !DISubroutineType(types: !85)
!85 = !{!65, !86, !65, !65}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "HapContext", file: !47, line: 92, baseType: !88)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HapContext", file: !47, line: 61, size: 2048, align: 64, elements: !89)
!89 = !{!90, !174, !200, !208, !209, !210, !211, !212, !224, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !88, file: !47, line: 62, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !94)
!94 = !{!95, !99, !104, !133, !134, !135, !136, !140, !146, !148, !152}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !93, file: !26, line: 72, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !98)
!98 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !93, file: !26, line: 78, baseType: !100, size: 64, align: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!96, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !93, file: !26, line: 85, baseType: !105, size: 64, align: 64, offset: 128)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !108)
!108 = !{!109, !110, !111, !112, !113, !129, !130, !131, !132}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !107, file: !4, line: 247, baseType: !96, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !107, file: !4, line: 253, baseType: !96, size: 64, align: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !107, file: !4, line: 259, baseType: !65, size: 32, align: 32, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !107, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !107, file: !4, line: 271, baseType: !114, size: 64, align: 64, offset: 192)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !107, file: !4, line: 265, size: 64, align: 64, elements: !115)
!115 = !{!116, !119, !121, !122}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !114, file: !4, line: 266, baseType: !117, size: 64, align: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !70, line: 40, baseType: !118)
!118 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !114, file: !4, line: 267, baseType: !120, size: 64, align: 64)
!120 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !114, file: !4, line: 268, baseType: !96, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !114, file: !4, line: 270, baseType: !123, size: 64, align: 32)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !124, line: 61, baseType: !125)
!124 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !124, line: 58, size: 64, align: 32, elements: !126)
!126 = !{!127, !128}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !125, file: !124, line: 59, baseType: !65, size: 32, align: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !125, file: !124, line: 60, baseType: !65, size: 32, align: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !107, file: !4, line: 272, baseType: !120, size: 64, align: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !107, file: !4, line: 273, baseType: !120, size: 64, align: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !107, file: !4, line: 275, baseType: !65, size: 32, align: 32, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !107, file: !4, line: 300, baseType: !96, size: 64, align: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !93, file: !26, line: 93, baseType: !65, size: 32, align: 32, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !93, file: !26, line: 99, baseType: !65, size: 32, align: 32, offset: 224)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !93, file: !26, line: 108, baseType: !65, size: 32, align: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !93, file: !26, line: 113, baseType: !137, size: 64, align: 64, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DISubroutineType(types: !139)
!139 = !{!103, !103, !103}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !93, file: !26, line: 123, baseType: !141, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!144, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !93, file: !26, line: 130, baseType: !147, size: 32, align: 32, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !93, file: !26, line: 136, baseType: !149, size: 64, align: 64, offset: 512)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DISubroutineType(types: !151)
!151 = !{!147, !103}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !93, file: !26, line: 142, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!65, !156, !103, !96, !65}
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !159)
!159 = !{!160, !172, !173}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !158, file: !4, line: 360, baseType: !161, size: 64, align: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !165)
!165 = !{!166, !167, !168, !169, !170, !171}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !164, file: !4, line: 307, baseType: !96, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !164, file: !4, line: 313, baseType: !120, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !164, file: !4, line: 313, baseType: !120, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !164, file: !4, line: 318, baseType: !120, size: 64, align: 64, offset: 192)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !164, file: !4, line: 318, baseType: !120, size: 64, align: 64, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !164, file: !4, line: 323, baseType: !65, size: 32, align: 32, offset: 320)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !158, file: !4, line: 364, baseType: !65, size: 32, align: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !158, file: !4, line: 368, baseType: !65, size: 32, align: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "dxtc", scope: !88, file: !47, line: 64, baseType: !175, size: 960, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextureDSPContext", file: !176, line: 61, baseType: !177)
!176 = !DIFile(filename: "libavcodec/texturedsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TextureDSPContext", file: !176, line: 45, size: 960, align: 64, elements: !178)
!178 = !{!179, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "dxt1_block", scope: !177, file: !176, line: 46, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!65, !183, !184, !67}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !185, line: 149, baseType: !118)
!185 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!186 = !DIDerivedType(tag: DW_TAG_member, name: "dxt1a_block", scope: !177, file: !176, line: 47, baseType: !180, size: 64, align: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dxt2_block", scope: !177, file: !176, line: 48, baseType: !180, size: 64, align: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "dxt3_block", scope: !177, file: !176, line: 49, baseType: !180, size: 64, align: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "dxt4_block", scope: !177, file: !176, line: 50, baseType: !180, size: 64, align: 64, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "dxt5_block", scope: !177, file: !176, line: 51, baseType: !180, size: 64, align: 64, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "dxt5y_block", scope: !177, file: !176, line: 52, baseType: !180, size: 64, align: 64, offset: 384)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "dxt5ys_block", scope: !177, file: !176, line: 53, baseType: !180, size: 64, align: 64, offset: 448)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1s_block", scope: !177, file: !176, line: 54, baseType: !180, size: 64, align: 64, offset: 512)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1u_block", scope: !177, file: !176, line: 55, baseType: !180, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1u_gray_block", scope: !177, file: !176, line: 56, baseType: !180, size: 64, align: 64, offset: 640)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc1u_alpha_block", scope: !177, file: !176, line: 57, baseType: !180, size: 64, align: 64, offset: 704)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc2s_block", scope: !177, file: !176, line: 58, baseType: !180, size: 64, align: 64, offset: 768)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "rgtc2u_block", scope: !177, file: !176, line: 59, baseType: !180, size: 64, align: 64, offset: 832)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "dxn3dc_block", scope: !177, file: !176, line: 60, baseType: !180, size: 64, align: 64, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "gbc", scope: !88, file: !47, line: 65, baseType: !201, size: 192, align: 64, offset: 1024)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !202, line: 35, baseType: !203)
!202 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !202, line: 33, size: 192, align: 64, elements: !204)
!204 = !{!205, !206, !207}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !203, file: !202, line: 34, baseType: !67, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !203, file: !202, line: 34, baseType: !67, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !203, file: !202, line: 34, baseType: !67, size: 64, align: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "opt_tex_fmt", scope: !88, file: !47, line: 67, baseType: !46, size: 32, align: 32, offset: 1216)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "opt_chunk_count", scope: !88, file: !47, line: 68, baseType: !65, size: 32, align: 32, offset: 1248)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "opt_compressor", scope: !88, file: !47, line: 69, baseType: !65, size: 32, align: 32, offset: 1280)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_count", scope: !88, file: !47, line: 71, baseType: !65, size: 32, align: 32, offset: 1312)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !88, file: !47, line: 72, baseType: !213, size: 64, align: 64, offset: 1344)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "HapChunk", file: !47, line: 59, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HapChunk", file: !47, line: 53, size: 256, align: 64, elements: !216)
!216 = !{!217, !218, !219, !222, !223}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "compressor", scope: !215, file: !47, line: 54, baseType: !53, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_offset", scope: !215, file: !47, line: 55, baseType: !65, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !215, file: !47, line: 56, baseType: !220, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !185, line: 216, baseType: !221)
!221 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_offset", scope: !215, file: !47, line: 57, baseType: !65, size: 32, align: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "uncompressed_size", scope: !215, file: !47, line: 58, baseType: !220, size: 64, align: 64, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_results", scope: !88, file: !47, line: 73, baseType: !225, size: 64, align: 64, offset: 1408)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tex_rat", scope: !88, file: !47, line: 75, baseType: !65, size: 32, align: 32, offset: 1472)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tex_rat2", scope: !88, file: !47, line: 76, baseType: !65, size: 32, align: 32, offset: 1504)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tex_data", scope: !88, file: !47, line: 77, baseType: !67, size: 64, align: 64, offset: 1536)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "tex_buf", scope: !88, file: !47, line: 78, baseType: !183, size: 64, align: 64, offset: 1600)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tex_size", scope: !88, file: !47, line: 79, baseType: !220, size: 64, align: 64, offset: 1664)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "max_snappy", scope: !88, file: !47, line: 81, baseType: !220, size: 64, align: 64, offset: 1728)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !88, file: !47, line: 83, baseType: !65, size: 32, align: 32, offset: 1792)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "texture_count", scope: !88, file: !47, line: 85, baseType: !65, size: 32, align: 32, offset: 1824)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "texture_section_size", scope: !88, file: !47, line: 86, baseType: !65, size: 32, align: 32, offset: 1856)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "uncompress_pix_size", scope: !88, file: !47, line: 87, baseType: !65, size: 32, align: 32, offset: 1888)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tex_fun", scope: !88, file: !47, line: 90, baseType: !180, size: 64, align: 64, offset: 1920)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tex_fun2", scope: !88, file: !47, line: 91, baseType: !180, size: 64, align: 64, offset: 1984)
!238 = !{}
!239 = !DILocalVariable(name: "ctx", arg: 1, scope: !82, file: !83, line: 28, type: !86)
!240 = !DIExpression()
!241 = !DILocation(line: 28, column: 40, scope: !82)
!242 = !DILocalVariable(name: "count", arg: 2, scope: !82, file: !83, line: 28, type: !65)
!243 = !DILocation(line: 28, column: 49, scope: !82)
!244 = !DILocalVariable(name: "first_in_frame", arg: 3, scope: !82, file: !83, line: 28, type: !65)
!245 = !DILocation(line: 28, column: 60, scope: !82)
!246 = !DILocalVariable(name: "ret", scope: !82, file: !83, line: 30, type: !65)
!247 = !DILocation(line: 30, column: 9, scope: !82)
!248 = !DILocation(line: 31, column: 9, scope: !249)
!249 = distinct !DILexicalBlock(scope: !82, file: !83, line: 31, column: 9)
!250 = !DILocation(line: 31, column: 24, scope: !249)
!251 = !DILocation(line: 31, column: 29, scope: !249)
!252 = !DILocation(line: 31, column: 32, scope: !253)
!253 = !DILexicalBlockFile(scope: !249, file: !83, discriminator: 1)
!254 = !DILocation(line: 31, column: 37, scope: !253)
!255 = !DILocation(line: 31, column: 52, scope: !253)
!256 = !DILocation(line: 31, column: 49, scope: !253)
!257 = !DILocation(line: 31, column: 9, scope: !253)
!258 = !DILocalVariable(name: "ret", scope: !259, file: !83, line: 32, type: !65)
!259 = distinct !DILexicalBlock(scope: !249, file: !83, line: 31, column: 59)
!260 = !DILocation(line: 32, column: 13, scope: !259)
!261 = !DILocation(line: 32, column: 38, scope: !259)
!262 = !DILocation(line: 32, column: 43, scope: !259)
!263 = !DILocation(line: 32, column: 37, scope: !259)
!264 = !DILocation(line: 32, column: 51, scope: !259)
!265 = !DILocation(line: 32, column: 19, scope: !259)
!266 = !DILocation(line: 33, column: 13, scope: !267)
!267 = distinct !DILexicalBlock(scope: !259, file: !83, line: 33, column: 13)
!268 = !DILocation(line: 33, column: 17, scope: !267)
!269 = !DILocation(line: 33, column: 13, scope: !259)
!270 = !DILocation(line: 34, column: 38, scope: !267)
!271 = !DILocation(line: 34, column: 43, scope: !267)
!272 = !DILocation(line: 34, column: 37, scope: !267)
!273 = !DILocation(line: 34, column: 58, scope: !267)
!274 = !DILocation(line: 34, column: 19, scope: !267)
!275 = !DILocation(line: 34, column: 17, scope: !267)
!276 = !DILocation(line: 34, column: 13, scope: !267)
!277 = !DILocation(line: 35, column: 13, scope: !278)
!278 = distinct !DILexicalBlock(scope: !259, file: !83, line: 35, column: 13)
!279 = !DILocation(line: 35, column: 17, scope: !278)
!280 = !DILocation(line: 35, column: 13, scope: !259)
!281 = !DILocation(line: 36, column: 13, scope: !282)
!282 = distinct !DILexicalBlock(scope: !278, file: !83, line: 35, column: 22)
!283 = !DILocation(line: 36, column: 18, scope: !282)
!284 = !DILocation(line: 36, column: 30, scope: !282)
!285 = !DILocation(line: 37, column: 9, scope: !282)
!286 = !DILocation(line: 38, column: 32, scope: !287)
!287 = distinct !DILexicalBlock(scope: !278, file: !83, line: 37, column: 16)
!288 = !DILocation(line: 38, column: 13, scope: !287)
!289 = !DILocation(line: 38, column: 18, scope: !287)
!290 = !DILocation(line: 38, column: 30, scope: !287)
!291 = !DILocation(line: 40, column: 5, scope: !259)
!292 = !DILocation(line: 40, column: 16, scope: !293)
!293 = !DILexicalBlockFile(scope: !294, file: !83, discriminator: 1)
!294 = distinct !DILexicalBlock(scope: !249, file: !83, line: 40, column: 16)
!295 = !DILocation(line: 40, column: 21, scope: !293)
!296 = !DILocation(line: 40, column: 36, scope: !293)
!297 = !DILocation(line: 40, column: 33, scope: !293)
!298 = !DILocation(line: 45, column: 13, scope: !299)
!299 = distinct !DILexicalBlock(scope: !294, file: !83, line: 40, column: 43)
!300 = !DILocation(line: 46, column: 5, scope: !299)
!301 = !DILocation(line: 47, column: 12, scope: !82)
!302 = !DILocation(line: 47, column: 5, scope: !82)
