; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--metasound_data.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--metasound_data.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TwinVQModeTab = type { [3 x %struct.TwinVQFrameMode], i16, i8, float*, i8, i8, i8, i8, i16*, i8, i8, i8, i8, i16 }
%struct.TwinVQFrameMode = type { i8, i16*, i8, i16*, i8, i8, i16*, i16*, i8 }

@bark_tab_s8_64 = internal constant [10 x i16] [i16 2, i16 1, i16 2, i16 2, i16 3, i16 4, i16 5, i16 7, i16 13, i16 25], align 16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--metasound_data.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !72, !76, !80, !81, !85, !86, !90, !91, !95, !99, !103, !104, !108, !112, !113, !114, !115, !116, !117, !118, !119, !120, !124, !125, !129, !130, !134, !135, !136, !137, !138, !139, !140, !141, !145, !149, !153, !154, !158, !159, !160, !161, !165, !169, !173, !174, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !202, !206, !207, !208, !209, !210, !211, !213, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !240, !241, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !270, !271, !272, !273, !274, !275, !279, !280, !281, !282, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298}
!4 = distinct !DIGlobalVariable(name: "ff_metasound_mode0806", scope: !0, file: !5, line: 15018, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode0806)
!5 = !DIFile(filename: "libavcodec/metasound_data.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "TwinVQModeTab", file: !8, line: 135, baseType: !9)
!8 = !DIFile(filename: "libavcodec/twinvq.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TwinVQModeTab", file: !8, line: 111, size: 1856, align: 64, elements: !10)
!10 = !{!11, !37, !38, !39, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "fmode", scope: !9, file: !8, line: 112, baseType: !12, size: 1536, align: 64)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 1536, align: 64, elements: !35)
!13 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TwinVQFrameMode", file: !8, line: 66, size: 512, align: 64, elements: !14)
!14 = !{!15, !19, !24, !25, !30, !31, !32, !33, !34}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !13, file: !8, line: 67, baseType: !16, size: 8, align: 8)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !17, line: 48, baseType: !18)
!17 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!18 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "bark_tab", scope: !13, file: !8, line: 68, baseType: !20, size: 64, align: 64, offset: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !17, line: 49, baseType: !23)
!23 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "bark_env_size", scope: !13, file: !8, line: 71, baseType: !16, size: 8, align: 8, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "bark_cb", scope: !13, file: !8, line: 73, baseType: !26, size: 64, align: 64, offset: 192)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !17, line: 37, baseType: !29)
!29 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "bark_n_coef", scope: !13, file: !8, line: 74, baseType: !16, size: 8, align: 8, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "bark_n_bit", scope: !13, file: !8, line: 75, baseType: !16, size: 8, align: 8, offset: 264)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "cb0", scope: !13, file: !8, line: 79, baseType: !26, size: 64, align: 64, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "cb1", scope: !13, file: !8, line: 80, baseType: !26, size: 64, align: 64, offset: 384)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "cb_len_read", scope: !13, file: !8, line: 83, baseType: !16, size: 8, align: 8, offset: 448)
!35 = !{!36}
!36 = !DISubrange(count: 3)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !9, file: !8, line: 114, baseType: !22, size: 16, align: 16, offset: 1536)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "n_lsp", scope: !9, file: !8, line: 115, baseType: !16, size: 8, align: 8, offset: 1552)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "lspcodebook", scope: !9, file: !8, line: 116, baseType: !40, size: 64, align: 64, offset: 1600)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "lsp_bit0", scope: !9, file: !8, line: 119, baseType: !16, size: 8, align: 8, offset: 1664)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "lsp_bit1", scope: !9, file: !8, line: 120, baseType: !16, size: 8, align: 8, offset: 1672)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "lsp_bit2", scope: !9, file: !8, line: 121, baseType: !16, size: 8, align: 8, offset: 1680)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "lsp_split", scope: !9, file: !8, line: 123, baseType: !16, size: 8, align: 8, offset: 1688)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ppc_shape_cb", scope: !9, file: !8, line: 124, baseType: !26, size: 64, align: 64, offset: 1728)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "ppc_period_bit", scope: !9, file: !8, line: 127, baseType: !16, size: 8, align: 8, offset: 1792)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "ppc_shape_bit", scope: !9, file: !8, line: 129, baseType: !16, size: 8, align: 8, offset: 1800)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ppc_shape_len", scope: !9, file: !8, line: 130, baseType: !16, size: 8, align: 8, offset: 1808)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "pgain_bit", scope: !9, file: !8, line: 131, baseType: !16, size: 8, align: 8, offset: 1816)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "peak_per2wid", scope: !9, file: !8, line: 134, baseType: !22, size: 16, align: 16, offset: 1824)
!53 = distinct !DIGlobalVariable(name: "ff_metasound_mode0806s", scope: !0, file: !5, line: 15027, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode0806s)
!54 = distinct !DIGlobalVariable(name: "ff_metasound_mode0808", scope: !0, file: !5, line: 15036, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode0808)
!55 = distinct !DIGlobalVariable(name: "ff_metasound_mode0808s", scope: !0, file: !5, line: 15045, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode0808s)
!56 = distinct !DIGlobalVariable(name: "ff_metasound_mode1110", scope: !0, file: !5, line: 15054, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode1110)
!57 = distinct !DIGlobalVariable(name: "ff_metasound_mode1110s", scope: !0, file: !5, line: 15063, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode1110s)
!58 = distinct !DIGlobalVariable(name: "ff_metasound_mode1616", scope: !0, file: !5, line: 15072, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode1616)
!59 = distinct !DIGlobalVariable(name: "ff_metasound_mode1616s", scope: !0, file: !5, line: 15081, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode1616s)
!60 = distinct !DIGlobalVariable(name: "ff_metasound_mode2224", scope: !0, file: !5, line: 15090, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode2224)
!61 = distinct !DIGlobalVariable(name: "ff_metasound_mode2224s", scope: !0, file: !5, line: 15099, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode2224s)
!62 = distinct !DIGlobalVariable(name: "ff_metasound_mode4432", scope: !0, file: !5, line: 15108, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode4432)
!63 = distinct !DIGlobalVariable(name: "ff_metasound_mode4432s", scope: !0, file: !5, line: 15117, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode4432s)
!64 = distinct !DIGlobalVariable(name: "ff_metasound_mode4440", scope: !0, file: !5, line: 15126, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode4440)
!65 = distinct !DIGlobalVariable(name: "ff_metasound_mode4440s", scope: !0, file: !5, line: 15135, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode4440s)
!66 = distinct !DIGlobalVariable(name: "ff_metasound_mode4448", scope: !0, file: !5, line: 15144, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode4448)
!67 = distinct !DIGlobalVariable(name: "ff_metasound_mode4448s", scope: !0, file: !5, line: 15153, type: !6, isLocal: false, isDefinition: true, variable: %struct.TwinVQModeTab* @ff_metasound_mode4448s)
!68 = distinct !DIGlobalVariable(name: "bark_tab_s8_64", scope: !0, file: !5, line: 14880, type: !69, isLocal: true, isDefinition: true, variable: [10 x i16]* @bark_tab_s8_64)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 160, align: 16, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 10)
!72 = distinct !DIGlobalVariable(name: "fcb8s", scope: !0, file: !5, line: 10483, type: !73, isLocal: true, isDefinition: true, variable: [320 x i16]* @fcb8s)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 5120, align: 16, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 320)
!76 = distinct !DIGlobalVariable(name: "cb0806ss0", scope: !0, file: !5, line: 414, type: !77, isLocal: true, isDefinition: true, variable: [1728 x i16]* @cb0806ss0)
