; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--cabac.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--cabac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CABACContext = type { i32, i32, i32, i8*, i8*, i8*, %struct.PutBitContext }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, globals: !9)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--cabac.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4, !7, !8}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !5, line: 122, baseType: !6)
!5 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!6 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!7 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !{!10}
!10 = distinct !DIGlobalVariable(name: "ff_h264_cabac_tables", scope: !0, file: !11, line: 35, type: !12, isLocal: false, isDefinition: true, variable: [1343 x i8]* @ff_h264_cabac_tables)
!11 = !DIFile(filename: "libavcodec/cabac.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 10744, align: 8, elements: !16)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !5, line: 48, baseType: !15)
!15 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!16 = !{!17}
!17 = !DISubrange(count: 1343)
!18 = !{i32 2, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!21 = distinct !DISubprogram(name: "ff_init_cabac_encoder", scope: !11, file: !11, line: 164, type: !22, isLocal: false, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!22 = !DISubroutineType(types: !23)
!23 = !{null, !24, !45, !7}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "CABACContext", file: !26, line: 51, baseType: !27)
!26 = !DIFile(filename: "libavcodec/cabac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CABACContext", file: !26, line: 43, size: 640, align: 64, elements: !28)
!28 = !{!29, !30, !31, !32, !34, !35, !36}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !27, file: !26, line: 44, baseType: !7, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !27, file: !26, line: 45, baseType: !7, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "outstanding_count", scope: !27, file: !26, line: 46, baseType: !7, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream_start", scope: !27, file: !26, line: 47, baseType: !33, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream", scope: !27, file: !26, line: 48, baseType: !33, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream_end", scope: !27, file: !26, line: 49, baseType: !33, size: 64, align: 64, offset: 256)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !27, file: !26, line: 50, baseType: !37, size: 320, align: 64, offset: 320)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !38, line: 40, baseType: !39)
!38 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !38, line: 35, size: 320, align: 64, elements: !40)
!40 = !{!41, !43, !44, !46, !47, !48}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !39, file: !38, line: 36, baseType: !42, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !5, line: 51, baseType: !8)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !39, file: !38, line: 37, baseType: !7, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !39, file: !38, line: 38, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !39, file: !38, line: 38, baseType: !45, size: 64, align: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !39, file: !38, line: 38, baseType: !45, size: 64, align: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !39, file: !38, line: 39, baseType: !7, size: 32, align: 32, offset: 256)
!49 = !DILocalVariable(name: "c", arg: 1, scope: !21, file: !11, line: 164, type: !24)
!50 = !DIExpression()
!51 = !DILocation(line: 164, column: 42, scope: !21)
!52 = !DILocalVariable(name: "buf", arg: 2, scope: !21, file: !11, line: 164, type: !45)
!53 = !DILocation(line: 164, column: 54, scope: !21)
!54 = !DILocalVariable(name: "buf_size", arg: 3, scope: !21, file: !11, line: 164, type: !7)
!55 = !DILocation(line: 164, column: 63, scope: !21)
!56 = !DILocation(line: 165, column: 20, scope: !21)
!57 = !DILocation(line: 165, column: 23, scope: !21)
!58 = !DILocation(line: 165, column: 27, scope: !21)
!59 = !DILocation(line: 165, column: 32, scope: !21)
!60 = !DILocation(line: 165, column: 5, scope: !21)
!61 = !DILocation(line: 167, column: 5, scope: !21)
!62 = !DILocation(line: 167, column: 8, scope: !21)
!63 = !DILocation(line: 167, column: 11, scope: !21)
!64 = !DILocation(line: 168, column: 5, scope: !21)
!65 = !DILocation(line: 168, column: 8, scope: !21)
!66 = !DILocation(line: 168, column: 13, scope: !21)
!67 = !DILocation(line: 169, column: 5, scope: !21)
!68 = !DILocation(line: 169, column: 8, scope: !21)
!69 = !DILocation(line: 169, column: 25, scope: !21)
!70 = !DILocation(line: 170, column: 5, scope: !21)
!71 = !DILocation(line: 170, column: 8, scope: !21)
!72 = !DILocation(line: 170, column: 11, scope: !21)
!73 = !DILocation(line: 170, column: 19, scope: !21)
!74 = !DILocation(line: 171, column: 1, scope: !21)
!75 = distinct !DISubprogram(name: "init_put_bits", scope: !38, file: !38, line: 48, type: !76, isLocal: true, isDefinition: true, scopeLine: 50, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !78, !45, !7}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!79 = !DILocalVariable(name: "s", arg: 1, scope: !75, file: !38, line: 48, type: !78)
!80 = !DILocation(line: 48, column: 49, scope: !75)
!81 = !DILocalVariable(name: "buffer", arg: 2, scope: !75, file: !38, line: 48, type: !45)
!82 = !DILocation(line: 48, column: 61, scope: !75)
!83 = !DILocalVariable(name: "buffer_size", arg: 3, scope: !75, file: !38, line: 49, type: !7)
!84 = !DILocation(line: 49, column: 38, scope: !75)
!85 = !DILocation(line: 51, column: 9, scope: !86)
!86 = distinct !DILexicalBlock(scope: !75, file: !38, line: 51, column: 9)
!87 = !DILocation(line: 51, column: 21, scope: !86)
!88 = !DILocation(line: 51, column: 9, scope: !75)
!89 = !DILocation(line: 52, column: 21, scope: !90)
!90 = distinct !DILexicalBlock(scope: !86, file: !38, line: 51, column: 26)
!91 = !DILocation(line: 53, column: 16, scope: !90)
!92 = !DILocation(line: 54, column: 5, scope: !90)
!93 = !DILocation(line: 56, column: 27, scope: !75)
!94 = !DILocation(line: 56, column: 25, scope: !75)
!95 = !DILocation(line: 56, column: 5, scope: !75)
!96 = !DILocation(line: 56, column: 8, scope: !75)
!97 = !DILocation(line: 56, column: 21, scope: !75)
!98 = !DILocation(line: 57, column: 14, scope: !75)
!99 = !DILocation(line: 57, column: 5, scope: !75)
!100 = !DILocation(line: 57, column: 8, scope: !75)
!101 = !DILocation(line: 57, column: 12, scope: !75)
!102 = !DILocation(line: 58, column: 18, scope: !75)
!103 = !DILocation(line: 58, column: 21, scope: !75)
!104 = !DILocation(line: 58, column: 27, scope: !75)
!105 = !DILocation(line: 58, column: 25, scope: !75)
!106 = !DILocation(line: 58, column: 5, scope: !75)
!107 = !DILocation(line: 58, column: 8, scope: !75)
!108 = !DILocation(line: 58, column: 16, scope: !75)
!109 = !DILocation(line: 59, column: 18, scope: !75)
!110 = !DILocation(line: 59, column: 21, scope: !75)
!111 = !DILocation(line: 59, column: 5, scope: !75)
!112 = !DILocation(line: 59, column: 8, scope: !75)
!113 = !DILocation(line: 59, column: 16, scope: !75)
!114 = !DILocation(line: 60, column: 5, scope: !75)
