; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--snowdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--snowdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SnowDWTContext = type { void (i16*, i16*, i16*, i16*, i16*, i16*, i32)*, void (i16*, i16*, i32)*, void (i8*, i32, i8**, i32, i32, i32, i32, i32, %struct.slice_buffer_s*, i32, i8*)* }
%struct.slice_buffer_s = type { i16**, i16**, i32, i32, i32, i32, i16* }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_dwt_init_x86(%struct.SnowDWTContext* %c) #0 !dbg !12 {
entry:
  %c.addr = alloca %struct.SnowDWTContext*, align 8
  %mm_flags = alloca i32, align 4
  store %struct.SnowDWTContext* %c, %struct.SnowDWTContext** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.SnowDWTContext** %c.addr, metadata !56, metadata !57), !dbg !58
  call void @llvm.dbg.declare(metadata i32* %mm_flags, metadata !59, metadata !57), !dbg !60
  %call = call i32 @av_get_cpu_flags(), !dbg !61
  store i32 %call, i32* %mm_flags, align 4, !dbg !60
  %0 = load i32, i32* %mm_flags, align 4, !dbg !62
  %and = and i32 %0, 1, !dbg !64
  %tobool = icmp ne i32 %and, 0, !dbg !64
  br i1 %tobool, label %if.then, label %if.end12, !dbg !65

if.then:                                          ; preds = %entry
  %1 = load i32, i32* %mm_flags, align 4, !dbg !66

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--snowdsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "x86_reg", file: !5, line: 39, baseType: !6)
!5 = !DIFile(filename: "./libavutil/x86/asm.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !7, line: 40, baseType: !8)
!7 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!8 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!9 = !{i32 2, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!12 = distinct !DISubprogram(name: "ff_dwt_init_x86", scope: !13, file: !13, line: 880, type: !14, isLocal: false, isDefinition: true, scopeLine: 881, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!13 = !DIFile(filename: "libavcodec/x86/snowdsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!14 = !DISubroutineType(types: !15)
!15 = !{null, !16}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "SnowDWTContext", file: !18, line: 65, baseType: !19)
!18 = !DIFile(filename: "./libavcodec/snow_dwt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!19 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SnowDWTContext", file: !18, line: 56, size: 192, align: 64, elements: !20)
!20 = !{!21, !29, !33}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_compose97i", scope: !19, file: !18, line: 57, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25, !25, !25, !25, !25, !25, !28}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDWTELEM", file: !18, line: 30, baseType: !27)
!27 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!28 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "horizontal_compose97i", scope: !19, file: !18, line: 60, baseType: !30, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{null, !25, !25, !28}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "inner_add_yblock", scope: !19, file: !18, line: 61, baseType: !34, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null, !37, !41, !42, !28, !28, !28, !28, !28, !44, !28, !43}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 48, baseType: !40)
!40 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64, align: 64)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "slice_buffer", file: !18, line: 52, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "slice_buffer_s", file: !18, line: 44, size: 320, align: 64, elements: !47)
!47 = !{!48, !50, !51, !52, !53, !54, !55}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !46, file: !18, line: 45, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data_stack", scope: !46, file: !18, line: 46, baseType: !49, size: 64, align: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data_stack_top", scope: !46, file: !18, line: 47, baseType: !28, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "line_count", scope: !46, file: !18, line: 48, baseType: !28, size: 32, align: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "line_width", scope: !46, file: !18, line: 49, baseType: !28, size: 32, align: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "data_count", scope: !46, file: !18, line: 50, baseType: !28, size: 32, align: 32, offset: 224)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "base_buffer", scope: !46, file: !18, line: 51, baseType: !25, size: 64, align: 64, offset: 256)
!56 = !DILocalVariable(name: "c", arg: 1, scope: !12, file: !13, line: 880, type: !16)
!57 = !DIExpression()
!58 = !DILocation(line: 880, column: 60, scope: !12)
!59 = !DILocalVariable(name: "mm_flags", scope: !12, file: !13, line: 883, type: !28)
!60 = !DILocation(line: 883, column: 9, scope: !12)
!61 = !DILocation(line: 883, column: 20, scope: !12)
!62 = !DILocation(line: 885, column: 9, scope: !63)
!63 = distinct !DILexicalBlock(scope: !12, file: !13, line: 885, column: 9)
!64 = !DILocation(line: 885, column: 18, scope: !63)
!65 = !DILocation(line: 885, column: 9, scope: !12)
!66 = !DILocation(line: 886, column: 12, scope: !67)
!67 = distinct !DILexicalBlock(scope: !68, file: !13, line: 886, column: 12)
!68 = distinct !DILexicalBlock(scope: !63, file: !13, line: 885, column: 28)
!69 = !DILocation(line: 886, column: 21, scope: !67)
!70 = !DILocation(line: 886, column: 30, scope: !67)
!71 = !DILocation(line: 886, column: 12, scope: !68)
!72 = !DILocation(line: 887, column: 13, scope: !73)
!73 = distinct !DILexicalBlock(scope: !67, file: !13, line: 886, column: 34)
!74 = !DILocation(line: 887, column: 16, scope: !73)
!75 = !DILocation(line: 887, column: 38, scope: !73)
!76 = !DILocation(line: 889, column: 13, scope: !73)
!77 = !DILocation(line: 889, column: 16, scope: !73)
!78 = !DILocation(line: 889, column: 36, scope: !73)
!79 = !DILocation(line: 892, column: 13, scope: !73)
!80 = !DILocation(line: 892, column: 16, scope: !73)
!81 = !DILocation(line: 892, column: 33, scope: !73)
!82 = !DILocation(line: 894, column: 9, scope: !73)
!83 = !DILocation(line: 896, column: 17, scope: !84)
!84 = distinct !DILexicalBlock(scope: !85, file: !13, line: 896, column: 17)
!85 = distinct !DILexicalBlock(scope: !67, file: !13, line: 895, column: 13)
!86 = !DILocation(line: 896, column: 26, scope: !84)
!87 = !DILocation(line: 896, column: 17, scope: !85)
!88 = !DILocation(line: 897, column: 13, scope: !89)
!89 = distinct !DILexicalBlock(scope: !84, file: !13, line: 896, column: 36)
!90 = !DILocation(line: 897, column: 16, scope: !89)
!91 = !DILocation(line: 897, column: 38, scope: !89)
!92 = !DILocation(line: 899, column: 13, scope: !89)
!93 = !DILocation(line: 899, column: 16, scope: !89)
!94 = !DILocation(line: 899, column: 36, scope: !89)
!95 = !DILocation(line: 901, column: 13, scope: !89)
!96 = !DILocation(line: 903, column: 13, scope: !85)
!97 = !DILocation(line: 903, column: 16, scope: !85)
!98 = !DILocation(line: 903, column: 33, scope: !85)
!99 = !DILocation(line: 906, column: 5, scope: !68)
!100 = !DILocation(line: 908, column: 1, scope: !12)
!101 = distinct !DISubprogram(name: "ff_snow_horizontal_compose97i_sse2", scope: !13, file: !13, line: 30, type: !31, isLocal: true, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!102 = !DILocalVariable(name: "i", arg: 1, scope: !103, file: !104, line: 228, type: !28)
!103 = distinct !DISubprogram(name: "snow_horizontal_compose_liftS_lead_out", scope: !104, file: !104, line: 228, type: !105, isLocal: true, isDefinition: true, scopeLine: 228, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!104 = !DIFile(filename: "./libavcodec/snow.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!105 = !DISubroutineType(types: !106)
!106 = !{null, !28, !25, !25, !25, !28, !28}
!107 = !DILocation(line: 228, column: 94, scope: !103, inlinedAt: !108)
!108 = distinct !DILocation(line: 144, column: 9, scope: !109)
!109 = distinct !DILexicalBlock(scope: !101, file: !13, line: 103, column: 5)
!110 = !DILocalVariable(name: "dst", arg: 2, scope: !103, file: !104, line: 228, type: !25)
!111 = !DILocation(line: 228, column: 108, scope: !103, inlinedAt: !108)
!112 = !DILocalVariable(name: "src", arg: 3, scope: !103, file: !104, line: 228, type: !25)
