; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--webpenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--webpenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!884 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!885 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!886 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!887 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!888 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !948}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !942, line: 221, size: 32, align: 8, elements: !943)
!942 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !941, file: !942, line: 221, baseType: !945, size: 32, align: 32)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !946, line: 51, baseType: !947)
!946 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!947 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !946, line: 40, baseType: !949)
!949 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!950 = !{!951, !2196, !2197}
!951 = distinct !DIGlobalVariable(name: "ff_webp_muxer", scope: !0, file: !952, line: 207, type: !953, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_webp_muxer)
!952 = !DIFile(filename: "libavformat/webpenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !955)
!955 = !{!956, !960, !961, !962, !963, !964, !965, !966, !968, !978, !1058, !1060, !1061, !2161, !2162, !2163, !2167, !2171, !2175, !2176, !2181, !2182, !2183, !2184, !2185, !2186, !2190}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !919, line: 498, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !954, file: !919, line: 504, baseType: !957, size: 64, align: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !954, file: !919, line: 505, baseType: !957, size: 64, align: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !954, file: !919, line: 506, baseType: !957, size: 64, align: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !954, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !954, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !954, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !954, file: !919, line: 517, baseType: !967, size: 32, align: 32, offset: 352)
!967 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !954, file: !919, line: 523, baseType: !969, size: 64, align: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !974, line: 44, size: 64, align: 32, elements: !975)
!974 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !973, file: !974, line: 45, baseType: !3, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !973, file: !974, line: 46, baseType: !947, size: 32, align: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !954, file: !919, line: 526, baseType: !979, size: 64, align: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !983)
!983 = !{!984, !985, !990, !1017, !1018, !1019, !1020, !1024, !1030, !1032, !1036}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !982, file: !486, line: 72, baseType: !957, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !982, file: !486, line: 78, baseType: !986, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!957, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !982, file: !486, line: 85, baseType: !991, size: 64, align: 64, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !994)
!994 = !{!995, !996, !997, !998, !999, !1013, !1014, !1015, !1016}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !464, line: 247, baseType: !957, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !993, file: !464, line: 253, baseType: !957, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !993, file: !464, line: 259, baseType: !967, size: 32, align: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !993, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !993, file: !464, line: 271, baseType: !1000, size: 64, align: 64, offset: 192)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !993, file: !464, line: 265, size: 64, align: 64, elements: !1001)
!1001 = !{!1002, !1003, !1005, !1006}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1000, file: !464, line: 266, baseType: !948, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1000, file: !464, line: 267, baseType: !1004, size: 64, align: 64)
!1004 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1000, file: !464, line: 268, baseType: !957, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1000, file: !464, line: 270, baseType: !1007, size: 64, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1008, line: 61, baseType: !1009)
!1008 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1008, line: 58, size: 64, align: 32, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1009, file: !1008, line: 59, baseType: !967, size: 32, align: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1009, file: !1008, line: 60, baseType: !967, size: 32, align: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !993, file: !464, line: 272, baseType: !1004, size: 64, align: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !993, file: !464, line: 273, baseType: !1004, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !464, line: 275, baseType: !967, size: 32, align: 32, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !993, file: !464, line: 300, baseType: !957, size: 64, align: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !982, file: !486, line: 93, baseType: !967, size: 32, align: 32, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !982, file: !486, line: 99, baseType: !967, size: 32, align: 32, offset: 224)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !982, file: !486, line: 108, baseType: !967, size: 32, align: 32, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !982, file: !486, line: 113, baseType: !1021, size: 64, align: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!989, !989, !989}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !982, file: !486, line: 123, baseType: !1025, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!1028, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !982, file: !486, line: 130, baseType: !1031, size: 32, align: 32, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !982, file: !486, line: 136, baseType: !1033, size: 64, align: 64, offset: 512)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!1031, !989}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !982, file: !486, line: 142, baseType: !1037, size: 64, align: 64, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!967, !1040, !989, !957, !967}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1043)
!1043 = !{!1044, !1056, !1057}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1042, file: !464, line: 360, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054, !1055}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1048, file: !464, line: 307, baseType: !957, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1048, file: !464, line: 313, baseType: !1004, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1048, file: !464, line: 313, baseType: !1004, size: 64, align: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1048, file: !464, line: 318, baseType: !1004, size: 64, align: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1048, file: !464, line: 318, baseType: !1004, size: 64, align: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1048, file: !464, line: 323, baseType: !967, size: 32, align: 32, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1042, file: !464, line: 364, baseType: !967, size: 32, align: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1042, file: !464, line: 368, baseType: !967, size: 32, align: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !954, file: !919, line: 535, baseType: !1059, size: 64, align: 64, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !954, file: !919, line: 539, baseType: !967, size: 32, align: 32, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !954, file: !919, line: 541, baseType: !1062, size: 64, align: 64, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!967, !1065}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1067)
!1067 = !{!1068, !1069, !1167, !1168, !1169, !1235, !1236, !1237, !2015, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2069, !2070, !2071, !2072, !2073, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2124, !2125, !2128, !2129, !2130, !2131, !2132, !2133, !2138, !2139, !2140, !2141, !2149, !2150, !2154, !2158, !2159, !2160}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1066, file: !919, line: 1342, baseType: !979, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1066, file: !919, line: 1349, baseType: !1070, size: 64, align: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1097, !1098, !1138, !1139, !1143, !1148, !1149, !1150, !1154, !1160, !1166}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1071, file: !919, line: 638, baseType: !957, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1071, file: !919, line: 645, baseType: !957, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1071, file: !919, line: 652, baseType: !967, size: 32, align: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1071, file: !919, line: 659, baseType: !957, size: 64, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1071, file: !919, line: 661, baseType: !969, size: 64, align: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1071, file: !919, line: 663, baseType: !979, size: 64, align: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1071, file: !919, line: 670, baseType: !957, size: 64, align: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1071, file: !919, line: 679, baseType: !1070, size: 64, align: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1071, file: !919, line: 684, baseType: !967, size: 32, align: 32, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1071, file: !919, line: 689, baseType: !967, size: 32, align: 32, offset: 544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1071, file: !919, line: 696, baseType: !1084, size: 64, align: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!967, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1090)
!1090 = !{!1091, !1092, !1095, !1096}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1089, file: !919, line: 449, baseType: !957, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1089, file: !919, line: 450, baseType: !1093, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1089, file: !919, line: 451, baseType: !967, size: 32, align: 32, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1089, file: !919, line: 452, baseType: !957, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1071, file: !919, line: 703, baseType: !1062, size: 64, align: 64, offset: 640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1071, file: !919, line: 714, baseType: !1099, size: 64, align: 64, offset: 704)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!967, !1065, !1102}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1105)
!1105 = !{!1106, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1134, !1135, !1136, !1137}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1104, file: !4, line: 1451, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1109, line: 94, baseType: !1110)
!1109 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1109, line: 81, size: 192, align: 64, elements: !1111)
!1111 = !{!1112, !1116, !1119}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1110, file: !1109, line: 82, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1109, line: 73, baseType: !1115)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1109, line: 73, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1110, file: !1109, line: 89, baseType: !1117, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !946, line: 48, baseType: !1094)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1110, file: !1109, line: 93, baseType: !967, size: 32, align: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1104, file: !4, line: 1461, baseType: !948, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1104, file: !4, line: 1467, baseType: !948, size: 64, align: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !4, line: 1468, baseType: !1117, size: 64, align: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !4, line: 1469, baseType: !967, size: 32, align: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1104, file: !4, line: 1470, baseType: !967, size: 32, align: 32, offset: 288)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !4, line: 1474, baseType: !967, size: 32, align: 32, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1104, file: !4, line: 1479, baseType: !1127, size: 64, align: 64, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !4, line: 1412, baseType: !1117, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !4, line: 1413, baseType: !967, size: 32, align: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1129, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1104, file: !4, line: 1480, baseType: !967, size: 32, align: 32, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1104, file: !4, line: 1486, baseType: !948, size: 64, align: 64, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1104, file: !4, line: 1488, baseType: !948, size: 64, align: 64, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1104, file: !4, line: 1497, baseType: !948, size: 64, align: 64, offset: 640)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1071, file: !919, line: 720, baseType: !1062, size: 64, align: 64, offset: 768)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1071, file: !919, line: 730, baseType: !1140, size: 64, align: 64, offset: 832)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!967, !1065, !967, !948, !967}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1071, file: !919, line: 737, baseType: !1144, size: 64, align: 64, offset: 896)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!948, !1065, !967, !1147, !948}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1071, file: !919, line: 744, baseType: !1062, size: 64, align: 64, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1071, file: !919, line: 750, baseType: !1062, size: 64, align: 64, offset: 1024)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1071, file: !919, line: 758, baseType: !1151, size: 64, align: 64, offset: 1088)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!967, !1065, !967, !948, !948, !948, !967}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1071, file: !919, line: 764, baseType: !1155, size: 64, align: 64, offset: 1152)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!967, !1065, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1071, file: !919, line: 770, baseType: !1161, size: 64, align: 64, offset: 1216)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!967, !1065, !1164}
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1071, file: !919, line: 776, baseType: !1161, size: 64, align: 64, offset: 1280)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1066, file: !919, line: 1356, baseType: !1059, size: 64, align: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1066, file: !919, line: 1365, baseType: !989, size: 64, align: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1066, file: !919, line: 1379, baseType: !1170, size: 64, align: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180, !1184, !1185, !1189, !1190, !1191, !1192, !1193, !1195, !1196, !1202, !1203, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1225, !1226, !1227, !1228, !1232, !1233, !1234}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1172, file: !537, line: 174, baseType: !979, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1172, file: !537, line: 226, baseType: !1093, size: 64, align: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1172, file: !537, line: 227, baseType: !967, size: 32, align: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1172, file: !537, line: 228, baseType: !1093, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1172, file: !537, line: 229, baseType: !1093, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1172, file: !537, line: 233, baseType: !989, size: 64, align: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1172, file: !537, line: 235, baseType: !1181, size: 64, align: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!967, !989, !1117, !967}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1172, file: !537, line: 236, baseType: !1181, size: 64, align: 64, offset: 448)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1172, file: !537, line: 237, baseType: !1186, size: 64, align: 64, offset: 512)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{!948, !989, !948, !967}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1172, file: !537, line: 238, baseType: !948, size: 64, align: 64, offset: 576)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1172, file: !537, line: 239, baseType: !967, size: 32, align: 32, offset: 640)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1172, file: !537, line: 240, baseType: !967, size: 32, align: 32, offset: 672)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1172, file: !537, line: 241, baseType: !967, size: 32, align: 32, offset: 704)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1172, file: !537, line: 242, baseType: !1194, size: 64, align: 64, offset: 768)
!1194 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1172, file: !537, line: 243, baseType: !1093, size: 64, align: 64, offset: 832)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1172, file: !537, line: 244, baseType: !1197, size: 64, align: 64, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!1194, !1194, !1200, !947}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1118)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1172, file: !537, line: 245, baseType: !967, size: 32, align: 32, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1172, file: !537, line: 249, baseType: !1204, size: 64, align: 64, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!967, !989, !967}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1172, file: !537, line: 255, baseType: !1208, size: 64, align: 64, offset: 1088)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!948, !989, !967, !948, !967}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1172, file: !537, line: 260, baseType: !967, size: 32, align: 32, offset: 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1172, file: !537, line: 266, baseType: !948, size: 64, align: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1172, file: !537, line: 273, baseType: !967, size: 32, align: 32, offset: 1280)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1172, file: !537, line: 279, baseType: !948, size: 64, align: 64, offset: 1344)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1172, file: !537, line: 285, baseType: !967, size: 32, align: 32, offset: 1408)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1172, file: !537, line: 291, baseType: !967, size: 32, align: 32, offset: 1440)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1172, file: !537, line: 298, baseType: !967, size: 32, align: 32, offset: 1472)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1172, file: !537, line: 304, baseType: !967, size: 32, align: 32, offset: 1504)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1172, file: !537, line: 309, baseType: !957, size: 64, align: 64, offset: 1536)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1172, file: !537, line: 314, baseType: !957, size: 64, align: 64, offset: 1600)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1172, file: !537, line: 319, baseType: !1222, size: 64, align: 64, offset: 1664)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!967, !989, !1117, !967, !536, !948}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1172, file: !537, line: 326, baseType: !967, size: 32, align: 32, offset: 1728)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1172, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1172, file: !537, line: 332, baseType: !948, size: 64, align: 64, offset: 1792)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1172, file: !537, line: 338, baseType: !1229, size: 64, align: 64, offset: 1856)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!967, !989}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1172, file: !537, line: 340, baseType: !948, size: 64, align: 64, offset: 1920)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1172, file: !537, line: 346, baseType: !1093, size: 64, align: 64, offset: 1984)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1172, file: !537, line: 351, baseType: !967, size: 32, align: 32, offset: 2048)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1066, file: !919, line: 1386, baseType: !967, size: 32, align: 32, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1066, file: !919, line: 1393, baseType: !947, size: 32, align: 32, offset: 352)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1066, file: !919, line: 1405, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1801, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1901, !1907, !1908, !1912, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1944, !1945, !1946, !1947, !1948, !1949}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1241, file: !919, line: 866, baseType: !967, size: 32, align: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1241, file: !919, line: 872, baseType: !967, size: 32, align: 32, offset: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1241, file: !919, line: 878, baseType: !1246, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1248)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1249)
!1249 = !{!1250, !1251, !1252, !1253, !1476, !1477, !1478, !1479, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1505, !1509, !1510, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1689, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1248, file: !4, line: 1561, baseType: !979, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1248, file: !4, line: 1562, baseType: !967, size: 32, align: 32, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1248, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1248, file: !4, line: 1565, baseType: !1254, size: 64, align: 64, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1266, !1269, !1272, !1275, !1279, !1280, !1281, !1289, !1290, !1291, !1293, !1297, !1303, !1308, !1312, !1313, !1360, !1447, !1451, !1452, !1456, !1460, !1465, !1469, !1470, !1471}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1256, file: !4, line: 3475, baseType: !957, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1256, file: !4, line: 3480, baseType: !957, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1256, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1256, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1256, file: !4, line: 3487, baseType: !967, size: 32, align: 32, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1256, file: !4, line: 3488, baseType: !1264, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1256, file: !4, line: 3489, baseType: !1267, size: 64, align: 64, offset: 320)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1256, file: !4, line: 3490, baseType: !1270, size: 64, align: 64, offset: 384)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1256, file: !4, line: 3491, baseType: !1273, size: 64, align: 64, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1256, file: !4, line: 3492, baseType: !1276, size: 64, align: 64, offset: 512)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !946, line: 55, baseType: !1194)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1256, file: !4, line: 3493, baseType: !1118, size: 8, align: 8, offset: 576)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1256, file: !4, line: 3494, baseType: !979, size: 64, align: 64, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1256, file: !4, line: 3495, baseType: !1282, size: 64, align: 64, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1284)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1286)
!1286 = !{!1287, !1288}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1285, file: !4, line: 3402, baseType: !967, size: 32, align: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1285, file: !4, line: 3403, baseType: !957, size: 64, align: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1256, file: !4, line: 3507, baseType: !957, size: 64, align: 64, offset: 768)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1256, file: !4, line: 3516, baseType: !967, size: 32, align: 32, offset: 832)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1256, file: !4, line: 3517, baseType: !1292, size: 64, align: 64, offset: 896)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1256, file: !4, line: 3527, baseType: !1294, size: 64, align: 64, offset: 960)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!967, !1246}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1256, file: !4, line: 3535, baseType: !1298, size: 64, align: 64, offset: 1024)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!967, !1246, !1301}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1247)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1256, file: !4, line: 3541, baseType: !1304, size: 64, align: 64, offset: 1088)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1307)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1256, file: !4, line: 3549, baseType: !1309, size: 64, align: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{null, !1292}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1256, file: !4, line: 3551, baseType: !1294, size: 64, align: 64, offset: 1216)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1256, file: !4, line: 3552, baseType: !1314, size: 64, align: 64, offset: 1280)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!967, !1246, !1117, !967, !1317}
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1320)
!1320 = !{!1321, !1324, !1325, !1326, !1327, !1359}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1319, file: !4, line: 3921, baseType: !1322, size: 16, align: 16)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !946, line: 49, baseType: !1323)
!1323 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1319, file: !4, line: 3922, baseType: !945, size: 32, align: 32, offset: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1319, file: !4, line: 3923, baseType: !945, size: 32, align: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1319, file: !4, line: 3924, baseType: !947, size: 32, align: 32, offset: 96)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1319, file: !4, line: 3925, baseType: !1328, size: 64, align: 64, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1332)
!1332 = !{!1333, !1334, !1335, !1336, !1337, !1338, !1348, !1352, !1354, !1355, !1357, !1358}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1331, file: !4, line: 3886, baseType: !967, size: 32, align: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1331, file: !4, line: 3887, baseType: !967, size: 32, align: 32, offset: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1331, file: !4, line: 3888, baseType: !967, size: 32, align: 32, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1331, file: !4, line: 3889, baseType: !967, size: 32, align: 32, offset: 96)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1331, file: !4, line: 3890, baseType: !967, size: 32, align: 32, offset: 128)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1331, file: !4, line: 3897, baseType: !1339, size: 768, align: 64, offset: 192)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1341)
!1341 = !{!1342, !1346}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1340, file: !4, line: 3855, baseType: !1343, size: 512, align: 64)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 512, align: 64, elements: !1344)
!1344 = !{!1345}
!1345 = !DISubrange(count: 8)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1340, file: !4, line: 3857, baseType: !1347, size: 256, align: 32, offset: 512)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 256, align: 32, elements: !1344)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1331, file: !4, line: 3903, baseType: !1349, size: 256, align: 64, offset: 960)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 256, align: 64, elements: !1350)
!1350 = !{!1351}
!1351 = !DISubrange(count: 4)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1331, file: !4, line: 3904, baseType: !1353, size: 128, align: 32, offset: 1216)
!1353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 128, align: 32, elements: !1350)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1331, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1331, file: !4, line: 3908, baseType: !1356, size: 64, align: 64, offset: 1408)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1331, file: !4, line: 3915, baseType: !1356, size: 64, align: 64, offset: 1472)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1331, file: !4, line: 3917, baseType: !967, size: 32, align: 32, offset: 1536)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1319, file: !4, line: 3926, baseType: !948, size: 64, align: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1256, file: !4, line: 3564, baseType: !1361, size: 64, align: 64, offset: 1344)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!967, !1246, !1102, !1364, !1446}
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1366)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1398, !1400, !1401, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1434, !1435, !1436, !1437, !1438, !1439, !1442, !1443, !1444, !1445}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1367, file: !789, line: 282, baseType: !1343, size: 512, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1367, file: !789, line: 299, baseType: !1347, size: 256, align: 32, offset: 512)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1367, file: !789, line: 315, baseType: !1372, size: 64, align: 64, offset: 768)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1367, file: !789, line: 326, baseType: !967, size: 32, align: 32, offset: 832)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1367, file: !789, line: 326, baseType: !967, size: 32, align: 32, offset: 864)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1367, file: !789, line: 334, baseType: !967, size: 32, align: 32, offset: 896)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1367, file: !789, line: 341, baseType: !967, size: 32, align: 32, offset: 928)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1367, file: !789, line: 346, baseType: !967, size: 32, align: 32, offset: 960)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1367, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1367, file: !789, line: 356, baseType: !1007, size: 64, align: 32, offset: 1024)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1367, file: !789, line: 361, baseType: !948, size: 64, align: 64, offset: 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1367, file: !789, line: 369, baseType: !948, size: 64, align: 64, offset: 1152)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1367, file: !789, line: 377, baseType: !948, size: 64, align: 64, offset: 1216)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1367, file: !789, line: 382, baseType: !967, size: 32, align: 32, offset: 1280)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1367, file: !789, line: 386, baseType: !967, size: 32, align: 32, offset: 1312)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1367, file: !789, line: 391, baseType: !967, size: 32, align: 32, offset: 1344)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1367, file: !789, line: 396, baseType: !989, size: 64, align: 64, offset: 1408)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1367, file: !789, line: 403, baseType: !1388, size: 512, align: 64, offset: 1472)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1278, size: 512, align: 64, elements: !1344)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1367, file: !789, line: 410, baseType: !967, size: 32, align: 32, offset: 1984)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1367, file: !789, line: 415, baseType: !967, size: 32, align: 32, offset: 2016)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1367, file: !789, line: 420, baseType: !967, size: 32, align: 32, offset: 2048)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1367, file: !789, line: 425, baseType: !967, size: 32, align: 32, offset: 2080)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1367, file: !789, line: 435, baseType: !948, size: 64, align: 64, offset: 2112)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1367, file: !789, line: 440, baseType: !967, size: 32, align: 32, offset: 2176)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1367, file: !789, line: 445, baseType: !1278, size: 64, align: 64, offset: 2240)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1367, file: !789, line: 459, baseType: !1397, size: 512, align: 64, offset: 2304)
!1397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 512, align: 64, elements: !1344)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1367, file: !789, line: 473, baseType: !1399, size: 64, align: 64, offset: 2816)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1367, file: !789, line: 477, baseType: !967, size: 32, align: 32, offset: 2880)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1367, file: !789, line: 479, baseType: !1402, size: 64, align: 64, offset: 2944)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1415}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1405, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1405, file: !789, line: 203, baseType: !1117, size: 64, align: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1405, file: !789, line: 204, baseType: !967, size: 32, align: 32, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1405, file: !789, line: 205, baseType: !1411, size: 64, align: 64, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1413, line: 86, baseType: !1414)
!1413 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1414 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1413, line: 86, flags: DIFlagFwdDecl)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1405, file: !789, line: 206, baseType: !1107, size: 64, align: 64, offset: 256)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1367, file: !789, line: 480, baseType: !967, size: 32, align: 32, offset: 3008)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1367, file: !789, line: 505, baseType: !967, size: 32, align: 32, offset: 3040)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1367, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1367, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1367, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1367, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1367, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1367, file: !789, line: 532, baseType: !948, size: 64, align: 64, offset: 3264)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1367, file: !789, line: 539, baseType: !948, size: 64, align: 64, offset: 3328)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1367, file: !789, line: 547, baseType: !948, size: 64, align: 64, offset: 3392)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1367, file: !789, line: 554, baseType: !1411, size: 64, align: 64, offset: 3456)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1367, file: !789, line: 563, baseType: !967, size: 32, align: 32, offset: 3520)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1367, file: !789, line: 572, baseType: !967, size: 32, align: 32, offset: 3552)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1367, file: !789, line: 581, baseType: !967, size: 32, align: 32, offset: 3584)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1367, file: !789, line: 588, baseType: !1431, size: 64, align: 64, offset: 3648)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !946, line: 36, baseType: !1433)
!1433 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1367, file: !789, line: 593, baseType: !967, size: 32, align: 32, offset: 3712)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1367, file: !789, line: 596, baseType: !967, size: 32, align: 32, offset: 3744)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1367, file: !789, line: 599, baseType: !1107, size: 64, align: 64, offset: 3776)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1367, file: !789, line: 605, baseType: !1107, size: 64, align: 64, offset: 3840)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1367, file: !789, line: 616, baseType: !1107, size: 64, align: 64, offset: 3904)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1367, file: !789, line: 626, baseType: !1440, size: 64, align: 64, offset: 3968)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1441, line: 216, baseType: !1194)
!1441 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1367, file: !789, line: 627, baseType: !1440, size: 64, align: 64, offset: 4032)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1367, file: !789, line: 628, baseType: !1440, size: 64, align: 64, offset: 4096)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1367, file: !789, line: 629, baseType: !1440, size: 64, align: 64, offset: 4160)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1367, file: !789, line: 645, baseType: !1107, size: 64, align: 64, offset: 4224)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1256, file: !4, line: 3566, baseType: !1448, size: 64, align: 64, offset: 1408)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!967, !1246, !989, !1446, !1102}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1256, file: !4, line: 3567, baseType: !1294, size: 64, align: 64, offset: 1472)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1256, file: !4, line: 3576, baseType: !1453, size: 64, align: 64, offset: 1536)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!967, !1246, !1364}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1256, file: !4, line: 3577, baseType: !1457, size: 64, align: 64, offset: 1600)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!967, !1246, !1102}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1256, file: !4, line: 3584, baseType: !1461, size: 64, align: 64, offset: 1664)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!967, !1246, !1464}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1256, file: !4, line: 3589, baseType: !1466, size: 64, align: 64, offset: 1728)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{null, !1246}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1256, file: !4, line: 3594, baseType: !967, size: 32, align: 32, offset: 1792)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1256, file: !4, line: 3600, baseType: !957, size: 64, align: 64, offset: 1856)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1256, file: !4, line: 3609, baseType: !1472, size: 64, align: 64, offset: 1920)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1475)
!1475 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1248, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1248, file: !4, line: 1581, baseType: !947, size: 32, align: 32, offset: 224)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1248, file: !4, line: 1583, baseType: !989, size: 64, align: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1248, file: !4, line: 1591, baseType: !1480, size: 64, align: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1248, file: !4, line: 1598, baseType: !989, size: 64, align: 64, offset: 384)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1248, file: !4, line: 1606, baseType: !948, size: 64, align: 64, offset: 448)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1248, file: !4, line: 1614, baseType: !967, size: 32, align: 32, offset: 512)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1248, file: !4, line: 1622, baseType: !967, size: 32, align: 32, offset: 544)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1248, file: !4, line: 1628, baseType: !967, size: 32, align: 32, offset: 576)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1248, file: !4, line: 1636, baseType: !967, size: 32, align: 32, offset: 608)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1248, file: !4, line: 1643, baseType: !967, size: 32, align: 32, offset: 640)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1248, file: !4, line: 1657, baseType: !1117, size: 64, align: 64, offset: 704)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1248, file: !4, line: 1658, baseType: !967, size: 32, align: 32, offset: 768)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1248, file: !4, line: 1679, baseType: !1007, size: 64, align: 32, offset: 800)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1248, file: !4, line: 1688, baseType: !967, size: 32, align: 32, offset: 864)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1248, file: !4, line: 1712, baseType: !967, size: 32, align: 32, offset: 896)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1248, file: !4, line: 1729, baseType: !967, size: 32, align: 32, offset: 928)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1248, file: !4, line: 1729, baseType: !967, size: 32, align: 32, offset: 960)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1248, file: !4, line: 1744, baseType: !967, size: 32, align: 32, offset: 992)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1248, file: !4, line: 1744, baseType: !967, size: 32, align: 32, offset: 1024)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1248, file: !4, line: 1751, baseType: !967, size: 32, align: 32, offset: 1056)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1248, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1248, file: !4, line: 1791, baseType: !1501, size: 64, align: 64, offset: 1152)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1504, !1364, !1446, !967, !967, !967}
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1248, file: !4, line: 1808, baseType: !1506, size: 64, align: 64, offset: 1216)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!555, !1504, !1267}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1248, file: !4, line: 1816, baseType: !967, size: 32, align: 32, offset: 1280)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1248, file: !4, line: 1825, baseType: !1511, size: 32, align: 32, offset: 1312)
!1511 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1248, file: !4, line: 1830, baseType: !967, size: 32, align: 32, offset: 1344)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1248, file: !4, line: 1838, baseType: !1511, size: 32, align: 32, offset: 1376)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1248, file: !4, line: 1846, baseType: !967, size: 32, align: 32, offset: 1408)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1248, file: !4, line: 1851, baseType: !967, size: 32, align: 32, offset: 1440)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1248, file: !4, line: 1861, baseType: !1511, size: 32, align: 32, offset: 1472)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1248, file: !4, line: 1868, baseType: !1511, size: 32, align: 32, offset: 1504)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1248, file: !4, line: 1875, baseType: !1511, size: 32, align: 32, offset: 1536)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1248, file: !4, line: 1882, baseType: !1511, size: 32, align: 32, offset: 1568)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1248, file: !4, line: 1889, baseType: !1511, size: 32, align: 32, offset: 1600)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1248, file: !4, line: 1896, baseType: !1511, size: 32, align: 32, offset: 1632)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1248, file: !4, line: 1903, baseType: !1511, size: 32, align: 32, offset: 1664)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1248, file: !4, line: 1910, baseType: !967, size: 32, align: 32, offset: 1696)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1248, file: !4, line: 1915, baseType: !967, size: 32, align: 32, offset: 1728)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1248, file: !4, line: 1926, baseType: !1446, size: 64, align: 64, offset: 1792)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1248, file: !4, line: 1935, baseType: !1007, size: 64, align: 32, offset: 1856)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1248, file: !4, line: 1942, baseType: !967, size: 32, align: 32, offset: 1920)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1248, file: !4, line: 1948, baseType: !967, size: 32, align: 32, offset: 1952)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1248, file: !4, line: 1954, baseType: !967, size: 32, align: 32, offset: 1984)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1248, file: !4, line: 1960, baseType: !967, size: 32, align: 32, offset: 2016)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1248, file: !4, line: 1984, baseType: !967, size: 32, align: 32, offset: 2048)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1248, file: !4, line: 1991, baseType: !967, size: 32, align: 32, offset: 2080)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1248, file: !4, line: 1996, baseType: !967, size: 32, align: 32, offset: 2112)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1248, file: !4, line: 2004, baseType: !967, size: 32, align: 32, offset: 2144)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1248, file: !4, line: 2011, baseType: !967, size: 32, align: 32, offset: 2176)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1248, file: !4, line: 2018, baseType: !967, size: 32, align: 32, offset: 2208)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1248, file: !4, line: 2027, baseType: !967, size: 32, align: 32, offset: 2240)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1248, file: !4, line: 2034, baseType: !967, size: 32, align: 32, offset: 2272)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1248, file: !4, line: 2044, baseType: !967, size: 32, align: 32, offset: 2304)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1248, file: !4, line: 2054, baseType: !1541, size: 64, align: 64, offset: 2368)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1248, file: !4, line: 2061, baseType: !1541, size: 64, align: 64, offset: 2432)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1248, file: !4, line: 2066, baseType: !967, size: 32, align: 32, offset: 2496)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1248, file: !4, line: 2070, baseType: !967, size: 32, align: 32, offset: 2528)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1248, file: !4, line: 2078, baseType: !967, size: 32, align: 32, offset: 2560)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1248, file: !4, line: 2085, baseType: !967, size: 32, align: 32, offset: 2592)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1248, file: !4, line: 2092, baseType: !967, size: 32, align: 32, offset: 2624)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1248, file: !4, line: 2099, baseType: !967, size: 32, align: 32, offset: 2656)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1248, file: !4, line: 2106, baseType: !967, size: 32, align: 32, offset: 2688)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1248, file: !4, line: 2113, baseType: !967, size: 32, align: 32, offset: 2720)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1248, file: !4, line: 2120, baseType: !967, size: 32, align: 32, offset: 2752)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1248, file: !4, line: 2125, baseType: !967, size: 32, align: 32, offset: 2784)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1248, file: !4, line: 2133, baseType: !967, size: 32, align: 32, offset: 2816)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1248, file: !4, line: 2140, baseType: !967, size: 32, align: 32, offset: 2848)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1248, file: !4, line: 2145, baseType: !967, size: 32, align: 32, offset: 2880)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1248, file: !4, line: 2153, baseType: !967, size: 32, align: 32, offset: 2912)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1248, file: !4, line: 2158, baseType: !967, size: 32, align: 32, offset: 2944)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1248, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1248, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1248, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1248, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1248, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1248, file: !4, line: 2203, baseType: !967, size: 32, align: 32, offset: 3136)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1248, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1248, file: !4, line: 2212, baseType: !967, size: 32, align: 32, offset: 3200)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1248, file: !4, line: 2213, baseType: !967, size: 32, align: 32, offset: 3232)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1248, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1248, file: !4, line: 2232, baseType: !967, size: 32, align: 32, offset: 3296)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1248, file: !4, line: 2243, baseType: !967, size: 32, align: 32, offset: 3328)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1248, file: !4, line: 2249, baseType: !967, size: 32, align: 32, offset: 3360)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1248, file: !4, line: 2256, baseType: !967, size: 32, align: 32, offset: 3392)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1248, file: !4, line: 2263, baseType: !1278, size: 64, align: 64, offset: 3456)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1248, file: !4, line: 2270, baseType: !1278, size: 64, align: 64, offset: 3520)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1248, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1248, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1248, file: !4, line: 2367, baseType: !1577, size: 64, align: 64, offset: 3648)
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!967, !1504, !1464, !967}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1248, file: !4, line: 2383, baseType: !967, size: 32, align: 32, offset: 3712)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1248, file: !4, line: 2386, baseType: !1511, size: 32, align: 32, offset: 3744)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1248, file: !4, line: 2387, baseType: !1511, size: 32, align: 32, offset: 3776)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1248, file: !4, line: 2394, baseType: !967, size: 32, align: 32, offset: 3808)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1248, file: !4, line: 2401, baseType: !967, size: 32, align: 32, offset: 3840)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1248, file: !4, line: 2408, baseType: !967, size: 32, align: 32, offset: 3872)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1248, file: !4, line: 2415, baseType: !967, size: 32, align: 32, offset: 3904)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1248, file: !4, line: 2422, baseType: !967, size: 32, align: 32, offset: 3936)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1248, file: !4, line: 2423, baseType: !1589, size: 64, align: 64, offset: 3968)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1591)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1591, file: !4, line: 827, baseType: !967, size: 32, align: 32)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1591, file: !4, line: 828, baseType: !967, size: 32, align: 32, offset: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1591, file: !4, line: 829, baseType: !967, size: 32, align: 32, offset: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1591, file: !4, line: 830, baseType: !1511, size: 32, align: 32, offset: 96)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1248, file: !4, line: 2430, baseType: !948, size: 64, align: 64, offset: 4032)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1248, file: !4, line: 2437, baseType: !948, size: 64, align: 64, offset: 4096)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1248, file: !4, line: 2444, baseType: !1511, size: 32, align: 32, offset: 4160)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1248, file: !4, line: 2451, baseType: !1511, size: 32, align: 32, offset: 4192)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1248, file: !4, line: 2458, baseType: !967, size: 32, align: 32, offset: 4224)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1248, file: !4, line: 2469, baseType: !967, size: 32, align: 32, offset: 4256)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1248, file: !4, line: 2475, baseType: !967, size: 32, align: 32, offset: 4288)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1248, file: !4, line: 2481, baseType: !967, size: 32, align: 32, offset: 4320)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1248, file: !4, line: 2485, baseType: !967, size: 32, align: 32, offset: 4352)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1248, file: !4, line: 2489, baseType: !967, size: 32, align: 32, offset: 4384)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1248, file: !4, line: 2493, baseType: !967, size: 32, align: 32, offset: 4416)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1248, file: !4, line: 2501, baseType: !967, size: 32, align: 32, offset: 4448)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1248, file: !4, line: 2506, baseType: !967, size: 32, align: 32, offset: 4480)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1248, file: !4, line: 2510, baseType: !967, size: 32, align: 32, offset: 4512)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1248, file: !4, line: 2514, baseType: !948, size: 64, align: 64, offset: 4544)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1248, file: !4, line: 2528, baseType: !1613, size: 64, align: 64, offset: 4608)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{null, !1504, !989, !967, !967}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1248, file: !4, line: 2534, baseType: !967, size: 32, align: 32, offset: 4672)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1248, file: !4, line: 2545, baseType: !967, size: 32, align: 32, offset: 4704)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1248, file: !4, line: 2547, baseType: !967, size: 32, align: 32, offset: 4736)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1248, file: !4, line: 2549, baseType: !967, size: 32, align: 32, offset: 4768)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1248, file: !4, line: 2551, baseType: !967, size: 32, align: 32, offset: 4800)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1248, file: !4, line: 2553, baseType: !967, size: 32, align: 32, offset: 4832)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1248, file: !4, line: 2555, baseType: !967, size: 32, align: 32, offset: 4864)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1248, file: !4, line: 2557, baseType: !967, size: 32, align: 32, offset: 4896)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1248, file: !4, line: 2559, baseType: !967, size: 32, align: 32, offset: 4928)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1248, file: !4, line: 2563, baseType: !967, size: 32, align: 32, offset: 4960)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1248, file: !4, line: 2571, baseType: !1356, size: 64, align: 64, offset: 4992)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1248, file: !4, line: 2579, baseType: !1356, size: 64, align: 64, offset: 5056)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1248, file: !4, line: 2586, baseType: !967, size: 32, align: 32, offset: 5120)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1248, file: !4, line: 2615, baseType: !967, size: 32, align: 32, offset: 5152)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1248, file: !4, line: 2627, baseType: !967, size: 32, align: 32, offset: 5184)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1248, file: !4, line: 2637, baseType: !967, size: 32, align: 32, offset: 5216)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1248, file: !4, line: 2681, baseType: !967, size: 32, align: 32, offset: 5248)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1248, file: !4, line: 2709, baseType: !948, size: 64, align: 64, offset: 5312)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1248, file: !4, line: 2716, baseType: !1635, size: 64, align: 64, offset: 5376)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642, !1643, !1644, !1645, !1649, !1653, !1654, !1655, !1656, !1662, !1663, !1664, !1665, !1666}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1637, file: !4, line: 3642, baseType: !957, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1637, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1637, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1637, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1637, file: !4, line: 3669, baseType: !967, size: 32, align: 32, offset: 160)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1637, file: !4, line: 3682, baseType: !1461, size: 64, align: 64, offset: 192)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1637, file: !4, line: 3698, baseType: !1646, size: 64, align: 64, offset: 256)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!967, !1246, !1200, !945}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1637, file: !4, line: 3712, baseType: !1650, size: 64, align: 64, offset: 320)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!967, !1246, !967, !1200, !945}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1637, file: !4, line: 3726, baseType: !1646, size: 64, align: 64, offset: 384)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1637, file: !4, line: 3737, baseType: !1294, size: 64, align: 64, offset: 448)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1637, file: !4, line: 3746, baseType: !967, size: 32, align: 32, offset: 512)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1637, file: !4, line: 3757, baseType: !1657, size: 64, align: 64, offset: 576)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{null, !1660}
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1637, file: !4, line: 3766, baseType: !1294, size: 64, align: 64, offset: 640)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1637, file: !4, line: 3774, baseType: !1294, size: 64, align: 64, offset: 704)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1637, file: !4, line: 3780, baseType: !967, size: 32, align: 32, offset: 768)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1637, file: !4, line: 3785, baseType: !967, size: 32, align: 32, offset: 800)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1637, file: !4, line: 3795, baseType: !1667, size: 64, align: 64, offset: 832)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{!967, !1246, !1107}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1248, file: !4, line: 2728, baseType: !989, size: 64, align: 64, offset: 5440)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1248, file: !4, line: 2735, baseType: !1388, size: 512, align: 64, offset: 5504)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1248, file: !4, line: 2742, baseType: !967, size: 32, align: 32, offset: 6016)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1248, file: !4, line: 2755, baseType: !967, size: 32, align: 32, offset: 6048)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1248, file: !4, line: 2776, baseType: !967, size: 32, align: 32, offset: 6080)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1248, file: !4, line: 2783, baseType: !967, size: 32, align: 32, offset: 6112)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1248, file: !4, line: 2791, baseType: !967, size: 32, align: 32, offset: 6144)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1248, file: !4, line: 2802, baseType: !1464, size: 64, align: 64, offset: 6208)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1248, file: !4, line: 2811, baseType: !967, size: 32, align: 32, offset: 6272)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1248, file: !4, line: 2821, baseType: !967, size: 32, align: 32, offset: 6304)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1248, file: !4, line: 2830, baseType: !967, size: 32, align: 32, offset: 6336)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1248, file: !4, line: 2840, baseType: !967, size: 32, align: 32, offset: 6368)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1248, file: !4, line: 2851, baseType: !1683, size: 64, align: 64, offset: 6400)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!967, !1504, !1686, !989, !1446, !967, !967}
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!967, !1504, !989}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1248, file: !4, line: 2871, baseType: !1690, size: 64, align: 64, offset: 6464)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!967, !1504, !1693, !989, !1446, !967}
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!967, !1504, !989, !967, !967}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1248, file: !4, line: 2878, baseType: !967, size: 32, align: 32, offset: 6528)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1248, file: !4, line: 2885, baseType: !967, size: 32, align: 32, offset: 6560)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1248, file: !4, line: 3005, baseType: !967, size: 32, align: 32, offset: 6592)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1248, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1248, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1248, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1248, file: !4, line: 3037, baseType: !1117, size: 64, align: 64, offset: 6720)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1248, file: !4, line: 3038, baseType: !967, size: 32, align: 32, offset: 6784)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1248, file: !4, line: 3050, baseType: !1278, size: 64, align: 64, offset: 6848)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1248, file: !4, line: 3065, baseType: !967, size: 32, align: 32, offset: 6912)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1248, file: !4, line: 3083, baseType: !967, size: 32, align: 32, offset: 6944)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1248, file: !4, line: 3092, baseType: !1007, size: 64, align: 32, offset: 6976)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1248, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1248, file: !4, line: 3106, baseType: !1007, size: 64, align: 32, offset: 7072)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1248, file: !4, line: 3113, baseType: !1711, size: 64, align: 64, offset: 7168)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1713)
!1713 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1714)
!1714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1715)
!1715 = !{!1716, !1717, !1718, !1719, !1720, !1721, !1724}
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1714, file: !4, line: 713, baseType: !3, size: 32, align: 32)
