; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--ebur128.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--ebur128.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFEBUR128State = type { i32, i32, i64, %struct.FFEBUR128StateInternal* }
%struct.FFEBUR128StateInternal = type { double*, i64, i64, i64, i32*, i64, [5 x double], [5 x double], [5 x [5 x double]], i64*, i64*, i64, double*, i64, i8** }

@histogram_init = internal global i32 0, align 4
@histogram_energy_boundaries = internal global [1001 x double] zeroinitializer, align 32
@histogram_energies = internal global [1000 x double] zeroinitializer, align 32
@ebur128_init_filter.pa = private unnamed_addr constant [3 x double] [double 1.000000e+00, double 0.000000e+00, double 0.000000e+00], align 16
@ebur128_init_filter.rb = private unnamed_addr constant [3 x double] [double 1.000000e+00, double -2.000000e+00, double 1.000000e+00], align 16
@ebur128_init_filter.ra = private unnamed_addr constant [3 x double] [double 1.000000e+00, double 0.000000e+00, double 0.000000e+00], align 16

; Function Attrs: nounwind uwtable
define %struct.FFEBUR128State* @ff_ebur128_init(i32 %channels, i64 %samplerate, i64 %window, i32 %mode) #0 !dbg !123 {
entry:
  %retval = alloca %struct.FFEBUR128State*, align 8
  %channels.addr = alloca i32, align 4
  %samplerate.addr = alloca i64, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !50, globals: !108)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--ebur128.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !11}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode", file: !4, line: 83, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavfilter/ebur128.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10}
!6 = !DIEnumerator(name: "FF_EBUR128_MODE_M", value: 1)
!7 = !DIEnumerator(name: "FF_EBUR128_MODE_S", value: 3)
!8 = !DIEnumerator(name: "FF_EBUR128_MODE_I", value: 5)
!9 = !DIEnumerator(name: "FF_EBUR128_MODE_LRA", value: 11)
!10 = !DIEnumerator(name: "FF_EBUR128_MODE_SAMPLE_PEAK", value: 17)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "channel", file: !4, line: 39, size: 32, align: 32, elements: !12)
!12 = !{!13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49}
!13 = !DIEnumerator(name: "FF_EBUR128_UNUSED", value: 0)
!14 = !DIEnumerator(name: "FF_EBUR128_LEFT", value: 1)
!15 = !DIEnumerator(name: "FF_EBUR128_Mp030", value: 1)
!16 = !DIEnumerator(name: "FF_EBUR128_RIGHT", value: 2)
!17 = !DIEnumerator(name: "FF_EBUR128_Mm030", value: 2)
!18 = !DIEnumerator(name: "FF_EBUR128_CENTER", value: 3)
!19 = !DIEnumerator(name: "FF_EBUR128_Mp000", value: 3)
!20 = !DIEnumerator(name: "FF_EBUR128_LEFT_SURROUND", value: 4)
!21 = !DIEnumerator(name: "FF_EBUR128_Mp110", value: 4)
!22 = !DIEnumerator(name: "FF_EBUR128_RIGHT_SURROUND", value: 5)
!23 = !DIEnumerator(name: "FF_EBUR128_Mm110", value: 5)
!24 = !DIEnumerator(name: "FF_EBUR128_DUAL_MONO", value: 6)
!25 = !DIEnumerator(name: "FF_EBUR128_MpSC", value: 7)
!26 = !DIEnumerator(name: "FF_EBUR128_MmSC", value: 8)
!27 = !DIEnumerator(name: "FF_EBUR128_Mp060", value: 9)
!28 = !DIEnumerator(name: "FF_EBUR128_Mm060", value: 10)
!29 = !DIEnumerator(name: "FF_EBUR128_Mp090", value: 11)
!30 = !DIEnumerator(name: "FF_EBUR128_Mm090", value: 12)
!31 = !DIEnumerator(name: "FF_EBUR128_Mp135", value: 13)
!32 = !DIEnumerator(name: "FF_EBUR128_Mm135", value: 14)
!33 = !DIEnumerator(name: "FF_EBUR128_Mp180", value: 15)
!34 = !DIEnumerator(name: "FF_EBUR128_Up000", value: 16)
!35 = !DIEnumerator(name: "FF_EBUR128_Up030", value: 17)
!36 = !DIEnumerator(name: "FF_EBUR128_Um030", value: 18)
!37 = !DIEnumerator(name: "FF_EBUR128_Up045", value: 19)
!38 = !DIEnumerator(name: "FF_EBUR128_Um045", value: 20)
!39 = !DIEnumerator(name: "FF_EBUR128_Up090", value: 21)
!40 = !DIEnumerator(name: "FF_EBUR128_Um090", value: 22)
!41 = !DIEnumerator(name: "FF_EBUR128_Up110", value: 23)
!42 = !DIEnumerator(name: "FF_EBUR128_Um110", value: 24)
!43 = !DIEnumerator(name: "FF_EBUR128_Up135", value: 25)
!44 = !DIEnumerator(name: "FF_EBUR128_Um135", value: 26)
!45 = !DIEnumerator(name: "FF_EBUR128_Up180", value: 27)
!46 = !DIEnumerator(name: "FF_EBUR128_Tp000", value: 28)
!47 = !DIEnumerator(name: "FF_EBUR128_Bp000", value: 29)
!48 = !DIEnumerator(name: "FF_EBUR128_Bp045", value: 30)
!49 = !DIEnumerator(name: "FF_EBUR128_Bm045", value: 31)
!50 = !{!51, !62, !67, !94, !98, !101, !105, !70, !75, !68}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFEBUR128State", file: !4, line: 108, baseType: !53)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFEBUR128State", file: !4, line: 103, size: 192, align: 64, elements: !54)
!54 = !{!55, !57, !59, !61}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !53, file: !4, line: 104, baseType: !56, size: 32, align: 32)
!56 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !53, file: !4, line: 105, baseType: !58, size: 32, align: 32, offset: 32)
!58 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "samplerate", scope: !53, file: !4, line: 106, baseType: !60, size: 64, align: 64, offset: 64)
!60 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !53, file: !4, line: 107, baseType: !62, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFEBUR128StateInternal", file: !64, line: 66, size: 3008, align: 64, elements: !65)
!64 = !DIFile(filename: "libavfilter/ebur128.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!65 = !{!66, !69, !72, !73, !74, !76, !77, !81, !82, !85, !87, !88, !89, !90, !91}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "audio_data", scope: !63, file: !64, line: 68, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "audio_data_frames", scope: !63, file: !64, line: 70, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 216, baseType: !60)
!71 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!72 = !DIDerivedType(tag: DW_TAG_member, name: "audio_data_index", scope: !63, file: !64, line: 72, baseType: !70, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "needed_frames", scope: !63, file: !64, line: 76, baseType: !60, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "channel_map", scope: !63, file: !64, line: 78, baseType: !75, size: 64, align: 64, offset: 256)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "samples_in_100ms", scope: !63, file: !64, line: 80, baseType: !60, size: 64, align: 64, offset: 320)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !63, file: !64, line: 82, baseType: !78, size: 320, align: 64, offset: 384)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 320, align: 64, elements: !79)
!79 = !{!80}
!80 = !DISubrange(count: 5)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !63, file: !64, line: 84, baseType: !78, size: 320, align: 64, offset: 704)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !63, file: !64, line: 86, baseType: !83, size: 1600, align: 64, offset: 1024)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 1600, align: 64, elements: !84)
!84 = !{!80, !80}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "block_energy_histogram", scope: !63, file: !64, line: 88, baseType: !86, size: 64, align: 64, offset: 2624)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "short_term_block_energy_histogram", scope: !63, file: !64, line: 89, baseType: !86, size: 64, align: 64, offset: 2688)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "short_term_frame_counter", scope: !63, file: !64, line: 91, baseType: !70, size: 64, align: 64, offset: 2752)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "sample_peak", scope: !63, file: !64, line: 93, baseType: !67, size: 64, align: 64, offset: 2816)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !63, file: !64, line: 95, baseType: !60, size: 64, align: 64, offset: 2880)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptrs", scope: !63, file: !64, line: 97, baseType: !92, size: 64, align: 64, offset: 2944)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!108 = !{!109, !113, !117}
!109 = distinct !DIGlobalVariable(name: "histogram_energies", scope: !0, file: !64, line: 101, type: !110, isLocal: true, isDefinition: true, variable: [1000 x double]* @histogram_energies)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64000, align: 64, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1000)
!113 = distinct !DIGlobalVariable(name: "histogram_energy_boundaries", scope: !0, file: !64, line: 102, type: !114, isLocal: true, isDefinition: true, variable: [1001 x double]* @histogram_energy_boundaries)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 64064, align: 64, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1001)
!117 = distinct !DIGlobalVariable(name: "histogram_init", scope: !0, file: !64, line: 100, type: !118, isLocal: true, isDefinition: true, variable: i32* @histogram_init)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !119, line: 168, baseType: !56)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!120 = !{i32 2, !"Dwarf Version", i32 4}
!121 = !{i32 2, !"Debug Info Version", i32 3}
!122 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!123 = distinct !DISubprogram(name: "ff_ebur128_init", scope: !64, file: !64, line: 217, type: !124, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!51, !58, !60, !60, !56}
!126 = !{}
!127 = !DILocalVariable(name: "channels", arg: 1, scope: !123, file: !64, line: 217, type: !58)
!128 = !DIExpression()
!129 = !DILocation(line: 217, column: 46, scope: !123)
!130 = !DILocalVariable(name: "samplerate", arg: 2, scope: !123, file: !64, line: 218, type: !60)
!131 = !DILocation(line: 218, column: 47, scope: !123)
!132 = !DILocalVariable(name: "window", arg: 3, scope: !123, file: !64, line: 219, type: !60)
!133 = !DILocation(line: 219, column: 47, scope: !123)
!134 = !DILocalVariable(name: "mode", arg: 4, scope: !123, file: !64, line: 219, type: !56)
!135 = !DILocation(line: 219, column: 59, scope: !123)
!136 = !DILocalVariable(name: "errcode", scope: !123, file: !64, line: 221, type: !56)
!137 = !DILocation(line: 221, column: 9, scope: !123)
!138 = !DILocalVariable(name: "st", scope: !123, file: !64, line: 222, type: !51)
!139 = !DILocation(line: 222, column: 21, scope: !123)
!140 = !DILocation(line: 224, column: 29, scope: !123)
!141 = !DILocation(line: 224, column: 10, scope: !123)
