; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--jpeglsenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--jpeglsenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991}
!928 = !DIEnumerator(name: "SOF0", value: 192)
!929 = !DIEnumerator(name: "SOF1", value: 193)
!930 = !DIEnumerator(name: "SOF2", value: 194)
!931 = !DIEnumerator(name: "SOF3", value: 195)
!932 = !DIEnumerator(name: "SOF5", value: 197)
!933 = !DIEnumerator(name: "SOF6", value: 198)
!934 = !DIEnumerator(name: "SOF7", value: 199)
!935 = !DIEnumerator(name: "JPG", value: 200)
!936 = !DIEnumerator(name: "SOF9", value: 201)
!937 = !DIEnumerator(name: "SOF10", value: 202)
!938 = !DIEnumerator(name: "SOF11", value: 203)
!939 = !DIEnumerator(name: "SOF13", value: 205)
!940 = !DIEnumerator(name: "SOF14", value: 206)
!941 = !DIEnumerator(name: "SOF15", value: 207)
!942 = !DIEnumerator(name: "DHT", value: 196)
!943 = !DIEnumerator(name: "DAC", value: 204)
!944 = !DIEnumerator(name: "RST0", value: 208)
!945 = !DIEnumerator(name: "RST1", value: 209)
!946 = !DIEnumerator(name: "RST2", value: 210)
!947 = !DIEnumerator(name: "RST3", value: 211)
!948 = !DIEnumerator(name: "RST4", value: 212)
!949 = !DIEnumerator(name: "RST5", value: 213)
!950 = !DIEnumerator(name: "RST6", value: 214)
!951 = !DIEnumerator(name: "RST7", value: 215)
!952 = !DIEnumerator(name: "SOI", value: 216)
!953 = !DIEnumerator(name: "EOI", value: 217)
!954 = !DIEnumerator(name: "SOS", value: 218)
!955 = !DIEnumerator(name: "DQT", value: 219)
!956 = !DIEnumerator(name: "DNL", value: 220)
!957 = !DIEnumerator(name: "DRI", value: 221)
!958 = !DIEnumerator(name: "DHP", value: 222)
!959 = !DIEnumerator(name: "EXP", value: 223)
!960 = !DIEnumerator(name: "APP0", value: 224)
!961 = !DIEnumerator(name: "APP1", value: 225)
!962 = !DIEnumerator(name: "APP2", value: 226)
!963 = !DIEnumerator(name: "APP3", value: 227)
!964 = !DIEnumerator(name: "APP4", value: 228)
!965 = !DIEnumerator(name: "APP5", value: 229)
!966 = !DIEnumerator(name: "APP6", value: 230)
!967 = !DIEnumerator(name: "APP7", value: 231)
!968 = !DIEnumerator(name: "APP8", value: 232)
!969 = !DIEnumerator(name: "APP9", value: 233)
!970 = !DIEnumerator(name: "APP10", value: 234)
!971 = !DIEnumerator(name: "APP11", value: 235)
!972 = !DIEnumerator(name: "APP12", value: 236)
!973 = !DIEnumerator(name: "APP13", value: 237)
!974 = !DIEnumerator(name: "APP14", value: 238)
!975 = !DIEnumerator(name: "APP15", value: 239)
!976 = !DIEnumerator(name: "JPG0", value: 240)
!977 = !DIEnumerator(name: "JPG1", value: 241)
!978 = !DIEnumerator(name: "JPG2", value: 242)
!979 = !DIEnumerator(name: "JPG3", value: 243)
!980 = !DIEnumerator(name: "JPG4", value: 244)
!981 = !DIEnumerator(name: "JPG5", value: 245)
!982 = !DIEnumerator(name: "JPG6", value: 246)
!983 = !DIEnumerator(name: "SOF48", value: 247)
!984 = !DIEnumerator(name: "LSE", value: 248)
!985 = !DIEnumerator(name: "JPG9", value: 249)
!986 = !DIEnumerator(name: "JPG10", value: 250)
!987 = !DIEnumerator(name: "JPG11", value: 251)
!988 = !DIEnumerator(name: "JPG12", value: 252)
!989 = !DIEnumerator(name: "JPG13", value: 253)
!990 = !DIEnumerator(name: "COM", value: 254)
!991 = !DIEnumerator(name: "TEM", value: 1)
!992 = !{!993, !997, !1004, !1005, !1008, !1003, !1009, !1006}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !995, line: 49, baseType: !996)
!995 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!996 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !999, line: 221, size: 32, align: 8, elements: !1000)
!999 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !998, file: !999, line: 221, baseType: !1002, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !995, line: 51, baseType: !1003)
!1003 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !995, line: 48, baseType: !1007)
!1007 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1008 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1011 = !{!1012, !2703, !2704}
!1012 = distinct !DIGlobalVariable(name: "ff_jpegls_encoder", scope: !0, file: !1013, line: 466, type: !1014, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_jpegls_encoder)
!1013 = !DIFile(filename: "libavcodec/jpeglsenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1016)
!1016 = !{!1017, !1021, !1022, !1023, !1024, !1025, !1034, !1037, !1040, !1043, !1048, !1049, !1124, !1132, !1133, !1134, !1136, !2618, !2624, !2632, !2636, !2637, !2674, !2678, !2682, !2683, !2687, !2691, !2692, !2696, !2697, !2698}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !14, line: 3475, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1015, file: !14, line: 3480, baseType: !1018, size: 64, align: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1015, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1015, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1015, file: !14, line: 3487, baseType: !1008, size: 32, align: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1015, file: !14, line: 3488, baseType: !1026, size: 64, align: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1029, line: 61, baseType: !1030)
!1029 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1029, line: 58, size: 64, align: 32, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1030, file: !1029, line: 59, baseType: !1008, size: 32, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1030, file: !1029, line: 60, baseType: !1008, size: 32, align: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1015, file: !14, line: 3489, baseType: !1035, size: 64, align: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1015, file: !14, line: 3490, baseType: !1038, size: 64, align: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1015, file: !14, line: 3491, baseType: !1041, size: 64, align: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1015, file: !14, line: 3492, baseType: !1044, size: 64, align: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !995, line: 55, baseType: !1047)
!1047 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1015, file: !14, line: 3493, baseType: !1006, size: 8, align: 8, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1015, file: !14, line: 3494, baseType: !1050, size: 64, align: 64, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1054)
!1054 = !{!1055, !1056, !1060, !1083, !1084, !1085, !1086, !1090, !1096, !1098, !1102}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1053, file: !713, line: 72, baseType: !1018, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1053, file: !713, line: 78, baseType: !1057, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1018, !1004}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1053, file: !713, line: 85, baseType: !1061, size: 64, align: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1079, !1080, !1081, !1082}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1063, file: !691, line: 247, baseType: !1018, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1063, file: !691, line: 253, baseType: !1018, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1063, file: !691, line: 259, baseType: !1008, size: 32, align: 32, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1063, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1063, file: !691, line: 271, baseType: !1070, size: 64, align: 64, offset: 192)
!1070 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1063, file: !691, line: 265, size: 64, align: 64, elements: !1071)
!1071 = !{!1072, !1075, !1077, !1078}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1070, file: !691, line: 266, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !995, line: 40, baseType: !1074)
!1074 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1070, file: !691, line: 267, baseType: !1076, size: 64, align: 64)
!1076 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1070, file: !691, line: 268, baseType: !1018, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1070, file: !691, line: 270, baseType: !1028, size: 64, align: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1063, file: !691, line: 272, baseType: !1076, size: 64, align: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1063, file: !691, line: 273, baseType: !1076, size: 64, align: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1063, file: !691, line: 275, baseType: !1008, size: 32, align: 32, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1063, file: !691, line: 300, baseType: !1018, size: 64, align: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1053, file: !713, line: 93, baseType: !1008, size: 32, align: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1053, file: !713, line: 99, baseType: !1008, size: 32, align: 32, offset: 224)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1053, file: !713, line: 108, baseType: !1008, size: 32, align: 32, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1053, file: !713, line: 113, baseType: !1087, size: 64, align: 64, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!1004, !1004, !1004}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1053, file: !713, line: 123, baseType: !1091, size: 64, align: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!1094, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1053, file: !713, line: 130, baseType: !1097, size: 32, align: 32, offset: 448)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1053, file: !713, line: 136, baseType: !1099, size: 64, align: 64, offset: 512)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!1097, !1004}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1053, file: !713, line: 142, baseType: !1103, size: 64, align: 64, offset: 576)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!1008, !1106, !1004, !1018, !1008}
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1109)
!1109 = !{!1110, !1122, !1123}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1108, file: !691, line: 360, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1114, file: !691, line: 307, baseType: !1018, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1114, file: !691, line: 313, baseType: !1076, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1114, file: !691, line: 313, baseType: !1076, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1114, file: !691, line: 318, baseType: !1076, size: 64, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1114, file: !691, line: 318, baseType: !1076, size: 64, align: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1114, file: !691, line: 323, baseType: !1008, size: 32, align: 32, offset: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1108, file: !691, line: 364, baseType: !1008, size: 32, align: 32, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1108, file: !691, line: 368, baseType: !1008, size: 32, align: 32, offset: 96)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1015, file: !14, line: 3495, baseType: !1125, size: 64, align: 64, offset: 704)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1129)
!1129 = !{!1130, !1131}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1128, file: !14, line: 3402, baseType: !1008, size: 32, align: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1128, file: !14, line: 3403, baseType: !1018, size: 64, align: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1015, file: !14, line: 3507, baseType: !1018, size: 64, align: 64, offset: 768)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1015, file: !14, line: 3516, baseType: !1008, size: 32, align: 32, offset: 832)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1015, file: !14, line: 3517, baseType: !1135, size: 64, align: 64, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1015, file: !14, line: 3527, baseType: !1137, size: 64, align: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!1008, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1142)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1150, !1151, !1152, !1153, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1432, !1436, !1437, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2556, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2609, !2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1142, file: !14, line: 1561, baseType: !1050, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1142, file: !14, line: 1562, baseType: !1008, size: 32, align: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1142, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1142, file: !14, line: 1565, baseType: !1148, size: 64, align: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1142, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1142, file: !14, line: 1581, baseType: !1003, size: 32, align: 32, offset: 224)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1142, file: !14, line: 1583, baseType: !1004, size: 64, align: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1142, file: !14, line: 1591, baseType: !1154, size: 64, align: 64, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1156, line: 129, size: 1664, align: 64, elements: !1157)
!1156 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1157 = !{!1158, !1159, !1160, !1161, !1258, !1279, !1280, !1309, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1155, file: !1156, line: 136, baseType: !1008, size: 32, align: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1155, file: !1156, line: 151, baseType: !1008, size: 32, align: 32, offset: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1155, file: !1156, line: 157, baseType: !1008, size: 32, align: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1155, file: !1156, line: 159, baseType: !1162, size: 64, align: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1165)
!1165 = !{!1166, !1170, !1172, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1210, !1212, !1213, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246, !1247, !1248, !1249, !1250, !1251, !1254, !1255, !1256, !1257}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !744, line: 282, baseType: !1167, size: 512, align: 64)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 512, align: 64, elements: !1168)
!1168 = !{!1169}
!1169 = !DISubrange(count: 8)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1164, file: !744, line: 299, baseType: !1171, size: 256, align: 32, offset: 512)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 256, align: 32, elements: !1168)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1164, file: !744, line: 315, baseType: !1173, size: 64, align: 64, offset: 768)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1164, file: !744, line: 326, baseType: !1008, size: 32, align: 32, offset: 832)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1164, file: !744, line: 326, baseType: !1008, size: 32, align: 32, offset: 864)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1164, file: !744, line: 334, baseType: !1008, size: 32, align: 32, offset: 896)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1164, file: !744, line: 341, baseType: !1008, size: 32, align: 32, offset: 928)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1164, file: !744, line: 346, baseType: !1008, size: 32, align: 32, offset: 960)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1164, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1164, file: !744, line: 356, baseType: !1028, size: 64, align: 32, offset: 1024)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1164, file: !744, line: 361, baseType: !1073, size: 64, align: 64, offset: 1088)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1164, file: !744, line: 369, baseType: !1073, size: 64, align: 64, offset: 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1164, file: !744, line: 377, baseType: !1073, size: 64, align: 64, offset: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1164, file: !744, line: 382, baseType: !1008, size: 32, align: 32, offset: 1280)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1164, file: !744, line: 386, baseType: !1008, size: 32, align: 32, offset: 1312)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1164, file: !744, line: 391, baseType: !1008, size: 32, align: 32, offset: 1344)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1164, file: !744, line: 396, baseType: !1004, size: 64, align: 64, offset: 1408)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1164, file: !744, line: 403, baseType: !1189, size: 512, align: 64, offset: 1472)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 512, align: 64, elements: !1168)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1164, file: !744, line: 410, baseType: !1008, size: 32, align: 32, offset: 1984)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1164, file: !744, line: 415, baseType: !1008, size: 32, align: 32, offset: 2016)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1164, file: !744, line: 420, baseType: !1008, size: 32, align: 32, offset: 2048)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1164, file: !744, line: 425, baseType: !1008, size: 32, align: 32, offset: 2080)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1164, file: !744, line: 435, baseType: !1073, size: 64, align: 64, offset: 2112)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1164, file: !744, line: 440, baseType: !1008, size: 32, align: 32, offset: 2176)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1164, file: !744, line: 445, baseType: !1046, size: 64, align: 64, offset: 2240)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1164, file: !744, line: 459, baseType: !1198, size: 512, align: 64, offset: 2304)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 512, align: 64, elements: !1168)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1201, line: 94, baseType: !1202)
!1201 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1201, line: 81, size: 192, align: 64, elements: !1203)
!1203 = !{!1204, !1208, !1209}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1202, file: !1201, line: 82, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1201, line: 73, baseType: !1207)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1201, line: 73, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !1201, line: 89, baseType: !1005, size: 64, align: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !1201, line: 93, baseType: !1008, size: 32, align: 32, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1164, file: !744, line: 473, baseType: !1211, size: 64, align: 64, offset: 2816)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1164, file: !744, line: 477, baseType: !1008, size: 32, align: 32, offset: 2880)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1164, file: !744, line: 479, baseType: !1214, size: 64, align: 64, offset: 2944)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1227}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1217, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !744, line: 203, baseType: !1005, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !744, line: 204, baseType: !1008, size: 32, align: 32, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1217, file: !744, line: 205, baseType: !1223, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1225, line: 86, baseType: !1226)
!1225 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1225, line: 86, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !744, line: 206, baseType: !1199, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1164, file: !744, line: 480, baseType: !1008, size: 32, align: 32, offset: 3008)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1164, file: !744, line: 505, baseType: !1008, size: 32, align: 32, offset: 3040)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1164, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1164, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1164, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1164, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1164, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1164, file: !744, line: 532, baseType: !1073, size: 64, align: 64, offset: 3264)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1164, file: !744, line: 539, baseType: !1073, size: 64, align: 64, offset: 3328)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1164, file: !744, line: 547, baseType: !1073, size: 64, align: 64, offset: 3392)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1164, file: !744, line: 554, baseType: !1223, size: 64, align: 64, offset: 3456)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1164, file: !744, line: 563, baseType: !1008, size: 32, align: 32, offset: 3520)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1164, file: !744, line: 572, baseType: !1008, size: 32, align: 32, offset: 3552)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1164, file: !744, line: 581, baseType: !1008, size: 32, align: 32, offset: 3584)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1164, file: !744, line: 588, baseType: !1243, size: 64, align: 64, offset: 3648)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !995, line: 36, baseType: !1245)
!1245 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1164, file: !744, line: 593, baseType: !1008, size: 32, align: 32, offset: 3712)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1164, file: !744, line: 596, baseType: !1008, size: 32, align: 32, offset: 3744)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1164, file: !744, line: 599, baseType: !1199, size: 64, align: 64, offset: 3776)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1164, file: !744, line: 605, baseType: !1199, size: 64, align: 64, offset: 3840)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1164, file: !744, line: 616, baseType: !1199, size: 64, align: 64, offset: 3904)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1164, file: !744, line: 626, baseType: !1252, size: 64, align: 64, offset: 3968)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1253, line: 216, baseType: !1047)
!1253 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1164, file: !744, line: 627, baseType: !1252, size: 64, align: 64, offset: 4032)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1164, file: !744, line: 628, baseType: !1252, size: 64, align: 64, offset: 4096)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1164, file: !744, line: 629, baseType: !1252, size: 64, align: 64, offset: 4160)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1164, file: !744, line: 645, baseType: !1199, size: 64, align: 64, offset: 4224)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1155, file: !1156, line: 161, baseType: !1259, size: 64, align: 64, offset: 192)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1156, line: 117, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1156, line: 100, size: 832, align: 64, elements: !1262)
!1262 = !{!1263, !1270, !1271, !1272, !1273, !1274, !1276, !1277, !1278}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1261, file: !1156, line: 105, baseType: !1264, size: 256, align: 64)
!1264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1265, size: 256, align: 64, elements: !1268)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1201, line: 238, baseType: !1267)
!1267 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1201, line: 238, flags: DIFlagFwdDecl)
!1268 = !{!1269}
!1269 = !DISubrange(count: 4)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1261, file: !1156, line: 110, baseType: !1008, size: 32, align: 32, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1261, file: !1156, line: 111, baseType: !1008, size: 32, align: 32, offset: 288)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1261, file: !1156, line: 111, baseType: !1008, size: 32, align: 32, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1261, file: !1156, line: 112, baseType: !1171, size: 256, align: 32, offset: 352)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1261, file: !1156, line: 113, baseType: !1275, size: 128, align: 32, offset: 608)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 128, align: 32, elements: !1268)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1261, file: !1156, line: 114, baseType: !1008, size: 32, align: 32, offset: 736)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1261, file: !1156, line: 115, baseType: !1008, size: 32, align: 32, offset: 768)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1261, file: !1156, line: 116, baseType: !1008, size: 32, align: 32, offset: 800)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1155, file: !1156, line: 163, baseType: !1004, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1155, file: !1156, line: 165, baseType: !1281, size: 128, align: 64, offset: 320)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1156, line: 122, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1156, line: 119, size: 128, align: 64, elements: !1283)
!1283 = !{!1284, !1308}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1282, file: !1156, line: 120, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1288)
!1288 = !{!1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1304, !1305, !1306, !1307}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1287, file: !14, line: 1451, baseType: !1199, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1287, file: !14, line: 1461, baseType: !1073, size: 64, align: 64, offset: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1287, file: !14, line: 1467, baseType: !1073, size: 64, align: 64, offset: 128)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1287, file: !14, line: 1468, baseType: !1005, size: 64, align: 64, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1287, file: !14, line: 1469, baseType: !1008, size: 32, align: 32, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1287, file: !14, line: 1470, baseType: !1008, size: 32, align: 32, offset: 288)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1287, file: !14, line: 1474, baseType: !1008, size: 32, align: 32, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1287, file: !14, line: 1479, baseType: !1297, size: 64, align: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1300)
!1300 = !{!1301, !1302, !1303}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1299, file: !14, line: 1412, baseType: !1005, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1299, file: !14, line: 1413, baseType: !1008, size: 32, align: 32, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1299, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1287, file: !14, line: 1480, baseType: !1008, size: 32, align: 32, offset: 448)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1287, file: !14, line: 1486, baseType: !1073, size: 64, align: 64, offset: 512)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1287, file: !14, line: 1488, baseType: !1073, size: 64, align: 64, offset: 576)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1287, file: !14, line: 1497, baseType: !1073, size: 64, align: 64, offset: 640)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1282, file: !1156, line: 121, baseType: !1162, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1155, file: !1156, line: 166, baseType: !1310, size: 128, align: 64, offset: 448)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1156, line: 127, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1156, line: 124, size: 128, align: 64, elements: !1312)
!1312 = !{!1313, !1386}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1311, file: !1156, line: 125, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1344, !1348, !1349, !1383, !1384, !1385}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1317, file: !14, line: 5751, baseType: !1050, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1317, file: !14, line: 5756, baseType: !1321, size: 64, align: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1324)
!1324 = !{!1325, !1326, !1329, !1330, !1331, !1335, !1339, !1343}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1323, file: !14, line: 5797, baseType: !1018, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1323, file: !14, line: 5804, baseType: !1327, size: 64, align: 64, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1323, file: !14, line: 5815, baseType: !1050, size: 64, align: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1323, file: !14, line: 5825, baseType: !1008, size: 32, align: 32, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1323, file: !14, line: 5826, baseType: !1332, size: 64, align: 64, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{!1008, !1315}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1323, file: !14, line: 5827, baseType: !1336, size: 64, align: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!1008, !1315, !1285}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1323, file: !14, line: 5828, baseType: !1340, size: 64, align: 64, offset: 384)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{null, !1315}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1323, file: !14, line: 5829, baseType: !1340, size: 64, align: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1317, file: !14, line: 5762, baseType: !1345, size: 64, align: 64, offset: 128)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1347)
!1347 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1317, file: !14, line: 5768, baseType: !1004, size: 64, align: 64, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1317, file: !14, line: 5775, baseType: !1350, size: 64, align: 64, offset: 256)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1352, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1352, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1352, file: !14, line: 3948, baseType: !1002, size: 32, align: 32, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1352, file: !14, line: 3958, baseType: !1005, size: 64, align: 64, offset: 128)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1352, file: !14, line: 3962, baseType: !1008, size: 32, align: 32, offset: 192)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1352, file: !14, line: 3968, baseType: !1008, size: 32, align: 32, offset: 224)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1352, file: !14, line: 3973, baseType: !1073, size: 64, align: 64, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1352, file: !14, line: 3986, baseType: !1008, size: 32, align: 32, offset: 320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1352, file: !14, line: 3999, baseType: !1008, size: 32, align: 32, offset: 352)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1352, file: !14, line: 4004, baseType: !1008, size: 32, align: 32, offset: 384)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1352, file: !14, line: 4005, baseType: !1008, size: 32, align: 32, offset: 416)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1352, file: !14, line: 4010, baseType: !1008, size: 32, align: 32, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1352, file: !14, line: 4011, baseType: !1008, size: 32, align: 32, offset: 480)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1352, file: !14, line: 4020, baseType: !1028, size: 64, align: 32, offset: 512)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1352, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1352, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1352, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1352, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1352, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1352, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1352, file: !14, line: 4039, baseType: !1008, size: 32, align: 32, offset: 768)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1352, file: !14, line: 4046, baseType: !1046, size: 64, align: 64, offset: 832)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1352, file: !14, line: 4050, baseType: !1008, size: 32, align: 32, offset: 896)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1352, file: !14, line: 4054, baseType: !1008, size: 32, align: 32, offset: 928)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1352, file: !14, line: 4061, baseType: !1008, size: 32, align: 32, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1352, file: !14, line: 4065, baseType: !1008, size: 32, align: 32, offset: 992)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1352, file: !14, line: 4073, baseType: !1008, size: 32, align: 32, offset: 1024)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1352, file: !14, line: 4080, baseType: !1008, size: 32, align: 32, offset: 1056)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1352, file: !14, line: 4084, baseType: !1008, size: 32, align: 32, offset: 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1317, file: !14, line: 5781, baseType: !1350, size: 64, align: 64, offset: 320)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1317, file: !14, line: 5787, baseType: !1028, size: 64, align: 32, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1317, file: !14, line: 5793, baseType: !1028, size: 64, align: 32, offset: 448)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1311, file: !1156, line: 126, baseType: !1008, size: 32, align: 32, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1155, file: !1156, line: 172, baseType: !1285, size: 64, align: 64, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1155, file: !1156, line: 177, baseType: !1005, size: 64, align: 64, offset: 640)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1155, file: !1156, line: 178, baseType: !1003, size: 32, align: 32, offset: 704)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1155, file: !1156, line: 180, baseType: !1004, size: 64, align: 64, offset: 768)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1155, file: !1156, line: 185, baseType: !1008, size: 32, align: 32, offset: 832)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1155, file: !1156, line: 190, baseType: !1004, size: 64, align: 64, offset: 896)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1155, file: !1156, line: 195, baseType: !1008, size: 32, align: 32, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1155, file: !1156, line: 200, baseType: !1285, size: 64, align: 64, offset: 1024)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1155, file: !1156, line: 201, baseType: !1008, size: 32, align: 32, offset: 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1155, file: !1156, line: 202, baseType: !1162, size: 64, align: 64, offset: 1152)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1155, file: !1156, line: 203, baseType: !1008, size: 32, align: 32, offset: 1216)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1155, file: !1156, line: 205, baseType: !1008, size: 32, align: 32, offset: 1248)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1155, file: !1156, line: 206, baseType: !1008, size: 32, align: 32, offset: 1280)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1155, file: !1156, line: 209, baseType: !1252, size: 64, align: 64, offset: 1344)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1155, file: !1156, line: 212, baseType: !1252, size: 64, align: 64, offset: 1408)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1155, file: !1156, line: 213, baseType: !1162, size: 64, align: 64, offset: 1472)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1155, file: !1156, line: 215, baseType: !1008, size: 32, align: 32, offset: 1536)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1155, file: !1156, line: 217, baseType: !1008, size: 32, align: 32, offset: 1568)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1155, file: !1156, line: 220, baseType: !1008, size: 32, align: 32, offset: 1600)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1142, file: !14, line: 1598, baseType: !1004, size: 64, align: 64, offset: 384)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1142, file: !14, line: 1606, baseType: !1073, size: 64, align: 64, offset: 448)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1142, file: !14, line: 1614, baseType: !1008, size: 32, align: 32, offset: 512)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1142, file: !14, line: 1622, baseType: !1008, size: 32, align: 32, offset: 544)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1142, file: !14, line: 1628, baseType: !1008, size: 32, align: 32, offset: 576)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1142, file: !14, line: 1636, baseType: !1008, size: 32, align: 32, offset: 608)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1142, file: !14, line: 1643, baseType: !1008, size: 32, align: 32, offset: 640)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1142, file: !14, line: 1657, baseType: !1005, size: 64, align: 64, offset: 704)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1142, file: !14, line: 1658, baseType: !1008, size: 32, align: 32, offset: 768)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1142, file: !14, line: 1679, baseType: !1028, size: 64, align: 32, offset: 800)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1142, file: !14, line: 1688, baseType: !1008, size: 32, align: 32, offset: 864)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1142, file: !14, line: 1712, baseType: !1008, size: 32, align: 32, offset: 896)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1142, file: !14, line: 1729, baseType: !1008, size: 32, align: 32, offset: 928)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1142, file: !14, line: 1729, baseType: !1008, size: 32, align: 32, offset: 960)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1142, file: !14, line: 1744, baseType: !1008, size: 32, align: 32, offset: 992)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1142, file: !14, line: 1744, baseType: !1008, size: 32, align: 32, offset: 1024)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1142, file: !14, line: 1751, baseType: !1008, size: 32, align: 32, offset: 1056)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1142, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1142, file: !14, line: 1791, baseType: !1425, size: 64, align: 64, offset: 1152)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{null, !1428, !1429, !1431, !1008, !1008, !1008}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1142, file: !14, line: 1808, baseType: !1433, size: 64, align: 64, offset: 1216)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!473, !1428, !1035}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1142, file: !14, line: 1816, baseType: !1008, size: 32, align: 32, offset: 1280)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1142, file: !14, line: 1825, baseType: !1438, size: 32, align: 32, offset: 1312)
!1438 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1142, file: !14, line: 1830, baseType: !1008, size: 32, align: 32, offset: 1344)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1142, file: !14, line: 1838, baseType: !1438, size: 32, align: 32, offset: 1376)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1142, file: !14, line: 1846, baseType: !1008, size: 32, align: 32, offset: 1408)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1142, file: !14, line: 1851, baseType: !1008, size: 32, align: 32, offset: 1440)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1142, file: !14, line: 1861, baseType: !1438, size: 32, align: 32, offset: 1472)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1142, file: !14, line: 1868, baseType: !1438, size: 32, align: 32, offset: 1504)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1142, file: !14, line: 1875, baseType: !1438, size: 32, align: 32, offset: 1536)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1142, file: !14, line: 1882, baseType: !1438, size: 32, align: 32, offset: 1568)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1142, file: !14, line: 1889, baseType: !1438, size: 32, align: 32, offset: 1600)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1142, file: !14, line: 1896, baseType: !1438, size: 32, align: 32, offset: 1632)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1142, file: !14, line: 1903, baseType: !1438, size: 32, align: 32, offset: 1664)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1142, file: !14, line: 1910, baseType: !1008, size: 32, align: 32, offset: 1696)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1142, file: !14, line: 1915, baseType: !1008, size: 32, align: 32, offset: 1728)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1142, file: !14, line: 1926, baseType: !1431, size: 64, align: 64, offset: 1792)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1142, file: !14, line: 1935, baseType: !1028, size: 64, align: 32, offset: 1856)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1142, file: !14, line: 1942, baseType: !1008, size: 32, align: 32, offset: 1920)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1142, file: !14, line: 1948, baseType: !1008, size: 32, align: 32, offset: 1952)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1142, file: !14, line: 1954, baseType: !1008, size: 32, align: 32, offset: 1984)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1142, file: !14, line: 1960, baseType: !1008, size: 32, align: 32, offset: 2016)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1142, file: !14, line: 1984, baseType: !1008, size: 32, align: 32, offset: 2048)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1142, file: !14, line: 1991, baseType: !1008, size: 32, align: 32, offset: 2080)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1142, file: !14, line: 1996, baseType: !1008, size: 32, align: 32, offset: 2112)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1142, file: !14, line: 2004, baseType: !1008, size: 32, align: 32, offset: 2144)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1142, file: !14, line: 2011, baseType: !1008, size: 32, align: 32, offset: 2176)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1142, file: !14, line: 2018, baseType: !1008, size: 32, align: 32, offset: 2208)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1142, file: !14, line: 2027, baseType: !1008, size: 32, align: 32, offset: 2240)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1142, file: !14, line: 2034, baseType: !1008, size: 32, align: 32, offset: 2272)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1142, file: !14, line: 2044, baseType: !1008, size: 32, align: 32, offset: 2304)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1142, file: !14, line: 2054, baseType: !993, size: 64, align: 64, offset: 2368)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1142, file: !14, line: 2061, baseType: !993, size: 64, align: 64, offset: 2432)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1142, file: !14, line: 2066, baseType: !1008, size: 32, align: 32, offset: 2496)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1142, file: !14, line: 2070, baseType: !1008, size: 32, align: 32, offset: 2528)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1142, file: !14, line: 2078, baseType: !1008, size: 32, align: 32, offset: 2560)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1142, file: !14, line: 2085, baseType: !1008, size: 32, align: 32, offset: 2592)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1142, file: !14, line: 2092, baseType: !1008, size: 32, align: 32, offset: 2624)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1142, file: !14, line: 2099, baseType: !1008, size: 32, align: 32, offset: 2656)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1142, file: !14, line: 2106, baseType: !1008, size: 32, align: 32, offset: 2688)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1142, file: !14, line: 2113, baseType: !1008, size: 32, align: 32, offset: 2720)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1142, file: !14, line: 2120, baseType: !1008, size: 32, align: 32, offset: 2752)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1142, file: !14, line: 2125, baseType: !1008, size: 32, align: 32, offset: 2784)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1142, file: !14, line: 2133, baseType: !1008, size: 32, align: 32, offset: 2816)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1142, file: !14, line: 2140, baseType: !1008, size: 32, align: 32, offset: 2848)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1142, file: !14, line: 2145, baseType: !1008, size: 32, align: 32, offset: 2880)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1142, file: !14, line: 2153, baseType: !1008, size: 32, align: 32, offset: 2912)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1142, file: !14, line: 2158, baseType: !1008, size: 32, align: 32, offset: 2944)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1142, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1142, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1142, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1142, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1142, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1142, file: !14, line: 2203, baseType: !1008, size: 32, align: 32, offset: 3136)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1142, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1142, file: !14, line: 2212, baseType: !1008, size: 32, align: 32, offset: 3200)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1142, file: !14, line: 2213, baseType: !1008, size: 32, align: 32, offset: 3232)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1142, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1142, file: !14, line: 2232, baseType: !1008, size: 32, align: 32, offset: 3296)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1142, file: !14, line: 2243, baseType: !1008, size: 32, align: 32, offset: 3328)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1142, file: !14, line: 2249, baseType: !1008, size: 32, align: 32, offset: 3360)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1142, file: !14, line: 2256, baseType: !1008, size: 32, align: 32, offset: 3392)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1142, file: !14, line: 2263, baseType: !1046, size: 64, align: 64, offset: 3456)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1142, file: !14, line: 2270, baseType: !1046, size: 64, align: 64, offset: 3520)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1142, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1142, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1142, file: !14, line: 2367, baseType: !1503, size: 64, align: 64, offset: 3648)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!1008, !1428, !1162, !1008}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1142, file: !14, line: 2383, baseType: !1008, size: 32, align: 32, offset: 3712)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1142, file: !14, line: 2386, baseType: !1438, size: 32, align: 32, offset: 3744)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1142, file: !14, line: 2387, baseType: !1438, size: 32, align: 32, offset: 3776)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1142, file: !14, line: 2394, baseType: !1008, size: 32, align: 32, offset: 3808)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1142, file: !14, line: 2401, baseType: !1008, size: 32, align: 32, offset: 3840)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1142, file: !14, line: 2408, baseType: !1008, size: 32, align: 32, offset: 3872)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1142, file: !14, line: 2415, baseType: !1008, size: 32, align: 32, offset: 3904)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1142, file: !14, line: 2422, baseType: !1008, size: 32, align: 32, offset: 3936)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1142, file: !14, line: 2423, baseType: !1515, size: 64, align: 64, offset: 3968)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1518)
!1518 = !{!1519, !1520, !1521, !1522}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1517, file: !14, line: 827, baseType: !1008, size: 32, align: 32)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1517, file: !14, line: 828, baseType: !1008, size: 32, align: 32, offset: 32)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1517, file: !14, line: 829, baseType: !1008, size: 32, align: 32, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1517, file: !14, line: 830, baseType: !1438, size: 32, align: 32, offset: 96)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1142, file: !14, line: 2430, baseType: !1073, size: 64, align: 64, offset: 4032)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1142, file: !14, line: 2437, baseType: !1073, size: 64, align: 64, offset: 4096)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1142, file: !14, line: 2444, baseType: !1438, size: 32, align: 32, offset: 4160)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1142, file: !14, line: 2451, baseType: !1438, size: 32, align: 32, offset: 4192)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1142, file: !14, line: 2458, baseType: !1008, size: 32, align: 32, offset: 4224)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1142, file: !14, line: 2469, baseType: !1008, size: 32, align: 32, offset: 4256)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1142, file: !14, line: 2475, baseType: !1008, size: 32, align: 32, offset: 4288)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1142, file: !14, line: 2481, baseType: !1008, size: 32, align: 32, offset: 4320)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1142, file: !14, line: 2485, baseType: !1008, size: 32, align: 32, offset: 4352)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1142, file: !14, line: 2489, baseType: !1008, size: 32, align: 32, offset: 4384)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1142, file: !14, line: 2493, baseType: !1008, size: 32, align: 32, offset: 4416)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1142, file: !14, line: 2501, baseType: !1008, size: 32, align: 32, offset: 4448)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1142, file: !14, line: 2506, baseType: !1008, size: 32, align: 32, offset: 4480)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1142, file: !14, line: 2510, baseType: !1008, size: 32, align: 32, offset: 4512)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1142, file: !14, line: 2514, baseType: !1073, size: 64, align: 64, offset: 4544)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1142, file: !14, line: 2528, baseType: !1539, size: 64, align: 64, offset: 4608)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{null, !1428, !1004, !1008, !1008}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1142, file: !14, line: 2534, baseType: !1008, size: 32, align: 32, offset: 4672)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1142, file: !14, line: 2545, baseType: !1008, size: 32, align: 32, offset: 4704)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1142, file: !14, line: 2547, baseType: !1008, size: 32, align: 32, offset: 4736)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1142, file: !14, line: 2549, baseType: !1008, size: 32, align: 32, offset: 4768)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1142, file: !14, line: 2551, baseType: !1008, size: 32, align: 32, offset: 4800)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1142, file: !14, line: 2553, baseType: !1008, size: 32, align: 32, offset: 4832)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1142, file: !14, line: 2555, baseType: !1008, size: 32, align: 32, offset: 4864)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1142, file: !14, line: 2557, baseType: !1008, size: 32, align: 32, offset: 4896)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1142, file: !14, line: 2559, baseType: !1008, size: 32, align: 32, offset: 4928)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1142, file: !14, line: 2563, baseType: !1008, size: 32, align: 32, offset: 4960)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1142, file: !14, line: 2571, baseType: !1553, size: 64, align: 64, offset: 4992)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1142, file: !14, line: 2579, baseType: !1553, size: 64, align: 64, offset: 5056)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1142, file: !14, line: 2586, baseType: !1008, size: 32, align: 32, offset: 5120)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1142, file: !14, line: 2615, baseType: !1008, size: 32, align: 32, offset: 5152)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1142, file: !14, line: 2627, baseType: !1008, size: 32, align: 32, offset: 5184)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1142, file: !14, line: 2637, baseType: !1008, size: 32, align: 32, offset: 5216)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1142, file: !14, line: 2681, baseType: !1008, size: 32, align: 32, offset: 5248)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1142, file: !14, line: 2709, baseType: !1073, size: 64, align: 64, offset: 5312)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1142, file: !14, line: 2716, baseType: !1562, size: 64, align: 64, offset: 5376)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1564)
!1564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1565)
!1565 = !{!1566, !1567, !1568, !1569, !1570, !1571, !1575, !1581, !1585, !1586, !1587, !1588, !2529, !2530, !2531, !2532, !2533}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1564, file: !14, line: 3642, baseType: !1018, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1564, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1564, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1564, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1564, file: !14, line: 3669, baseType: !1008, size: 32, align: 32, offset: 160)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1564, file: !14, line: 3682, baseType: !1572, size: 64, align: 64, offset: 192)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!1008, !1140, !1162}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1564, file: !14, line: 3698, baseType: !1576, size: 64, align: 64, offset: 256)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DISubroutineType(types: !1578)
!1578 = !{!1008, !1140, !1579, !1002}
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1564, file: !14, line: 3712, baseType: !1582, size: 64, align: 64, offset: 320)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!1008, !1140, !1008, !1579, !1002}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1564, file: !14, line: 3726, baseType: !1576, size: 64, align: 64, offset: 384)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1564, file: !14, line: 3737, baseType: !1137, size: 64, align: 64, offset: 448)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1564, file: !14, line: 3746, baseType: !1008, size: 32, align: 32, offset: 512)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1564, file: !14, line: 3757, baseType: !1589, size: 64, align: 64, offset: 576)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{null, !1592}
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1594, line: 81, size: 86208, align: 64, elements: !1595)
!1594 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1595 = !{!1596, !1598, !1599, !1600, !1601, !1605, !1606, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1653, !1654, !1709, !1711, !1712, !1713, !1714, !1715, !1726, !1727, !1728, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1744, !1746, !1748, !1749, !1750, !1751, !1752, !1753, !1758, !1760, !1761, !1762, !1763, !1764, !1765, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1792, !1793, !1794, !1795, !1811, !1818, !1830, !1846, !1868, !1908, !1921, !1948, !1963, !1977, !1990, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2011, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2024, !2026, !2027, !2028, !2029, !2030, !2031, !2034, !2036, !2038, !2039, !2042, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2109, !2110, !2112, !2113, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2135, !2136, !2137, !2140, !2141, !2142, !2143, !2145, !2147, !2148, !2149, !2150, !2151, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2233, !2234, !2235, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2405, !2406, !2407, !2408, !2412, !2413, !2417, !2421, !2425, !2426, !2430, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2445, !2446, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2464, !2465, !2466, !2516, !2517, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1593, file: !1594, line: 82, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1593, file: !1594, line: 84, baseType: !1008, size: 32, align: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1593, file: !1594, line: 84, baseType: !1008, size: 32, align: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1593, file: !1594, line: 85, baseType: !1008, size: 32, align: 32, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1593, file: !1594, line: 86, baseType: !1602, size: 384, align: 32, offset: 160)
!1602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 384, align: 32, elements: !1603)
!1603 = !{!1604}
!1604 = !DISubrange(count: 12)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1593, file: !1594, line: 87, baseType: !1008, size: 32, align: 32, offset: 544)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1593, file: !1594, line: 90, baseType: !1607, size: 1088, align: 64, offset: 576)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1608)
!1608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1609)
!1609 = !{!1610, !1611, !1615}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1608, file: !902, line: 32, baseType: !1579, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1608, file: !902, line: 33, baseType: !1612, size: 512, align: 8, offset: 64)
!1612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 512, align: 8, elements: !1613)
!1613 = !{!1614}
!1614 = !DISubrange(count: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1608, file: !902, line: 34, baseType: !1612, size: 512, align: 8, offset: 576)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1593, file: !1594, line: 91, baseType: !1607, size: 1088, align: 64, offset: 1664)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1593, file: !1594, line: 92, baseType: !1607, size: 1088, align: 64, offset: 2752)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1593, file: !1594, line: 93, baseType: !1607, size: 1088, align: 64, offset: 3840)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1593, file: !1594, line: 98, baseType: !1428, size: 64, align: 64, offset: 4928)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1593, file: !1594, line: 100, baseType: !1008, size: 32, align: 32, offset: 4992)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1593, file: !1594, line: 100, baseType: !1008, size: 32, align: 32, offset: 5024)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1593, file: !1594, line: 101, baseType: !1008, size: 32, align: 32, offset: 5056)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1593, file: !1594, line: 102, baseType: !1008, size: 32, align: 32, offset: 5088)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1593, file: !1594, line: 103, baseType: !1073, size: 64, align: 64, offset: 5120)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1593, file: !1594, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1593, file: !1594, line: 105, baseType: !1008, size: 32, align: 32, offset: 5216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1593, file: !1594, line: 106, baseType: !1008, size: 32, align: 32, offset: 5248)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1593, file: !1594, line: 109, baseType: !1008, size: 32, align: 32, offset: 5280)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1593, file: !1594, line: 110, baseType: !1008, size: 32, align: 32, offset: 5312)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1593, file: !1594, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1593, file: !1594, line: 113, baseType: !1008, size: 32, align: 32, offset: 5376)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1593, file: !1594, line: 114, baseType: !1008, size: 32, align: 32, offset: 5408)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1593, file: !1594, line: 115, baseType: !1008, size: 32, align: 32, offset: 5440)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1593, file: !1594, line: 116, baseType: !1008, size: 32, align: 32, offset: 5472)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1593, file: !1594, line: 117, baseType: !1008, size: 32, align: 32, offset: 5504)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1593, file: !1594, line: 118, baseType: !1008, size: 32, align: 32, offset: 5536)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1593, file: !1594, line: 119, baseType: !1008, size: 32, align: 32, offset: 5568)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1593, file: !1594, line: 120, baseType: !1008, size: 32, align: 32, offset: 5600)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1593, file: !1594, line: 124, baseType: !1008, size: 32, align: 32, offset: 5632)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1593, file: !1594, line: 125, baseType: !1008, size: 32, align: 32, offset: 5664)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1593, file: !1594, line: 126, baseType: !1008, size: 32, align: 32, offset: 5696)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1593, file: !1594, line: 127, baseType: !1008, size: 32, align: 32, offset: 5728)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1593, file: !1594, line: 128, baseType: !1008, size: 32, align: 32, offset: 5760)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1593, file: !1594, line: 129, baseType: !1008, size: 32, align: 32, offset: 5792)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1593, file: !1594, line: 129, baseType: !1008, size: 32, align: 32, offset: 5824)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1593, file: !1594, line: 130, baseType: !1008, size: 32, align: 32, offset: 5856)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1593, file: !1594, line: 131, baseType: !1008, size: 32, align: 32, offset: 5888)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1593, file: !1594, line: 132, baseType: !1008, size: 32, align: 32, offset: 5920)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1593, file: !1594, line: 132, baseType: !1008, size: 32, align: 32, offset: 5952)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1593, file: !1594, line: 133, baseType: !1008, size: 32, align: 32, offset: 5984)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1593, file: !1594, line: 134, baseType: !1652, size: 64, align: 64, offset: 6016)
!1652 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1253, line: 149, baseType: !1074)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1593, file: !1594, line: 135, baseType: !1652, size: 64, align: 64, offset: 6080)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1593, file: !1594, line: 136, baseType: !1655, size: 64, align: 64, offset: 6144)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1657, line: 91, baseType: !1658)
!1657 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1657, line: 45, size: 2624, align: 64, elements: !1659)
!1659 = !{!1660, !1662, !1673, !1674, !1675, !1677, !1683, !1684, !1686, !1687, !1688, !1689, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1658, file: !1657, line: 46, baseType: !1661, size: 64, align: 64)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1658, file: !1657, line: 47, baseType: !1663, size: 256, align: 64, offset: 64)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1664, line: 40, baseType: !1665)
!1664 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1664, line: 34, size: 256, align: 64, elements: !1666)
!1666 = !{!1667, !1668, !1672}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1665, file: !1664, line: 35, baseType: !1162, size: 64, align: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1665, file: !1664, line: 36, baseType: !1669, size: 128, align: 64, offset: 64)
!1669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 128, align: 64, elements: !1670)
!1670 = !{!1671}
!1671 = !DISubrange(count: 2)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1665, file: !1664, line: 39, baseType: !1199, size: 64, align: 64, offset: 192)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1658, file: !1657, line: 49, baseType: !1199, size: 64, align: 64, offset: 320)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1658, file: !1657, line: 50, baseType: !1243, size: 64, align: 64, offset: 384)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1658, file: !1657, line: 52, baseType: !1676, size: 128, align: 64, offset: 448)
!1676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1199, size: 128, align: 64, elements: !1670)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1658, file: !1657, line: 53, baseType: !1678, size: 128, align: 64, offset: 576)
!1678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1679, size: 128, align: 64, elements: !1670)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1681, size: 32, align: 16, elements: !1670)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !995, line: 37, baseType: !1682)
!1682 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1658, file: !1657, line: 55, baseType: !1199, size: 64, align: 64, offset: 704)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1658, file: !1657, line: 56, baseType: !1685, size: 64, align: 64, offset: 768)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1658, file: !1657, line: 58, baseType: !1199, size: 64, align: 64, offset: 832)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1658, file: !1657, line: 59, baseType: !1005, size: 64, align: 64, offset: 896)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1658, file: !1657, line: 61, baseType: !1676, size: 128, align: 64, offset: 960)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1658, file: !1657, line: 62, baseType: !1690, size: 128, align: 64, offset: 1088)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1243, size: 128, align: 64, elements: !1670)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1658, file: !1657, line: 64, baseType: !1199, size: 64, align: 64, offset: 1216)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1658, file: !1657, line: 65, baseType: !993, size: 64, align: 64, offset: 1280)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1658, file: !1657, line: 67, baseType: !1199, size: 64, align: 64, offset: 1344)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1658, file: !1657, line: 68, baseType: !993, size: 64, align: 64, offset: 1408)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1658, file: !1657, line: 70, baseType: !1008, size: 32, align: 32, offset: 1472)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1658, file: !1657, line: 71, baseType: !1008, size: 32, align: 32, offset: 1504)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1658, file: !1657, line: 73, baseType: !1199, size: 64, align: 64, offset: 1536)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1658, file: !1657, line: 74, baseType: !1005, size: 64, align: 64, offset: 1600)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1658, file: !1657, line: 76, baseType: !1199, size: 64, align: 64, offset: 1664)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1658, file: !1657, line: 77, baseType: !1004, size: 64, align: 64, offset: 1728)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1658, file: !1657, line: 79, baseType: !1008, size: 32, align: 32, offset: 1792)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1658, file: !1657, line: 81, baseType: !1073, size: 64, align: 64, offset: 1856)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1658, file: !1657, line: 82, baseType: !1073, size: 64, align: 64, offset: 1920)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1658, file: !1657, line: 84, baseType: !1008, size: 32, align: 32, offset: 1984)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1658, file: !1657, line: 85, baseType: !1008, size: 32, align: 32, offset: 2016)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1658, file: !1657, line: 87, baseType: !1008, size: 32, align: 32, offset: 2048)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1658, file: !1657, line: 88, baseType: !1008, size: 32, align: 32, offset: 2080)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1658, file: !1657, line: 90, baseType: !1189, size: 512, align: 64, offset: 2112)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1593, file: !1594, line: 137, baseType: !1710, size: 64, align: 64, offset: 6208)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_input_picture", scope: !1593, file: !1594, line: 138, baseType: !1710, size: 64, align: 64, offset: 6272)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "user_specified_pts", scope: !1593, file: !1594, line: 140, baseType: !1073, size: 64, align: 64, offset: 6336)
