; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--tak_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--tak_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!829 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!830 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!831 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!832 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!833 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!834 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!835 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!836 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!837 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!838 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!839 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!840 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!841 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!842 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !509, line: 493, size: 32, align: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!845 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!846 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!847 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!848 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!849 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!851 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!853 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!854 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!855 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!856 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!857 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TAKCodecType", file: !894, line: 99, size: 32, align: 32, elements: !895)
!894 = !DIFile(filename: "libavcodec/tak.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!895 = !{!896, !897}
!896 = !DIEnumerator(name: "TAK_CODEC_MONO_STEREO", value: 2)
!897 = !DIEnumerator(name: "TAK_CODEC_MULTICHANNEL", value: 4)
!898 = !{!899, !900}
!899 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!900 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!901 = !{!902}
!902 = distinct !DIGlobalVariable(name: "ff_tak_parser", scope: !0, file: !903, line: 121, type: !904, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_tak_parser)
!903 = !DIFile(filename: "libavcodec/tak_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !906)
!906 = !{!907, !911, !912, !964, !1562, !1566, !1570}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !905, file: !4, line: 5260, baseType: !908, size: 160, align: 32)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 160, align: 32, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 5)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !905, file: !4, line: 5261, baseType: !899, size: 32, align: 32, offset: 160)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !905, file: !4, line: 5262, baseType: !913, size: 64, align: 64, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{!899, !916}
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !919)
!919 = !{!920, !922, !924, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !918, file: !4, line: 5093, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !918, file: !4, line: 5094, baseType: !923, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !918, file: !4, line: 5095, baseType: !925, size: 64, align: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !926, line: 40, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !918, file: !4, line: 5096, baseType: !925, size: 64, align: 64, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !918, file: !4, line: 5098, baseType: !925, size: 64, align: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !918, file: !4, line: 5100, baseType: !899, size: 32, align: 32, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !918, file: !4, line: 5110, baseType: !899, size: 32, align: 32, offset: 352)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !918, file: !4, line: 5111, baseType: !925, size: 64, align: 64, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !918, file: !4, line: 5112, baseType: !925, size: 64, align: 64, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !918, file: !4, line: 5115, baseType: !925, size: 64, align: 64, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !918, file: !4, line: 5116, baseType: !925, size: 64, align: 64, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !918, file: !4, line: 5117, baseType: !899, size: 32, align: 32, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !918, file: !4, line: 5120, baseType: !899, size: 32, align: 32, offset: 672)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !918, file: !4, line: 5121, baseType: !939, size: 256, align: 64, offset: 704)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 256, align: 64, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 4)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !918, file: !4, line: 5122, baseType: !939, size: 256, align: 64, offset: 960)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !918, file: !4, line: 5123, baseType: !939, size: 256, align: 64, offset: 1216)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !918, file: !4, line: 5125, baseType: !899, size: 32, align: 32, offset: 1472)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !918, file: !4, line: 5132, baseType: !925, size: 64, align: 64, offset: 1536)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !918, file: !4, line: 5133, baseType: !939, size: 256, align: 64, offset: 1600)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !918, file: !4, line: 5141, baseType: !899, size: 32, align: 32, offset: 1856)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !918, file: !4, line: 5148, baseType: !925, size: 64, align: 64, offset: 1920)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !918, file: !4, line: 5161, baseType: !899, size: 32, align: 32, offset: 1984)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !918, file: !4, line: 5176, baseType: !899, size: 32, align: 32, offset: 2016)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !918, file: !4, line: 5190, baseType: !899, size: 32, align: 32, offset: 2048)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !918, file: !4, line: 5197, baseType: !939, size: 256, align: 64, offset: 2112)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !918, file: !4, line: 5202, baseType: !925, size: 64, align: 64, offset: 2368)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !918, file: !4, line: 5207, baseType: !925, size: 64, align: 64, offset: 2432)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !918, file: !4, line: 5214, baseType: !899, size: 32, align: 32, offset: 2496)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !918, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !918, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !918, file: !4, line: 5234, baseType: !899, size: 32, align: 32, offset: 2592)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !918, file: !4, line: 5239, baseType: !899, size: 32, align: 32, offset: 2624)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !918, file: !4, line: 5240, baseType: !899, size: 32, align: 32, offset: 2656)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !918, file: !4, line: 5245, baseType: !899, size: 32, align: 32, offset: 2688)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !918, file: !4, line: 5246, baseType: !899, size: 32, align: 32, offset: 2720)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !918, file: !4, line: 5256, baseType: !899, size: 32, align: 32, offset: 2752)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !905, file: !4, line: 5265, baseType: !965, size: 64, align: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!899, !916, !968, !1561, !1254, !1457, !899}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !971)
!971 = !{!972, !1016, !1017, !1018, !1284, !1285, !1286, !1287, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1313, !1317, !1318, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1499, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !970, file: !4, line: 1561, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !982, !986, !990, !991, !992, !993, !997, !1003, !1005, !1009}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !19, line: 72, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !19, line: 78, baseType: !983, size: 64, align: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!979, !921}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !19, line: 85, baseType: !987, size: 64, align: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !19, line: 93, baseType: !899, size: 32, align: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !19, line: 99, baseType: !899, size: 32, align: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !19, line: 108, baseType: !899, size: 32, align: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !19, line: 113, baseType: !994, size: 64, align: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!921, !921, !921}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !19, line: 123, baseType: !998, size: 64, align: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!1001, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !19, line: 130, baseType: !1004, size: 32, align: 32, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !19, line: 136, baseType: !1006, size: 64, align: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1004, !921}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !19, line: 142, baseType: !1010, size: 64, align: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!899, !1013, !921, !979, !899}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !970, file: !4, line: 1562, baseType: !899, size: 32, align: 32, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !970, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !970, file: !4, line: 1565, baseType: !1019, size: 64, align: 64, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1037, !1040, !1043, !1046, !1051, !1054, !1055, !1063, !1064, !1065, !1067, !1071, !1077, !1082, !1086, !1087, !1134, !1255, !1259, !1260, !1264, !1268, !1273, !1277, !1278, !1279}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1021, file: !4, line: 3475, baseType: !979, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1021, file: !4, line: 3480, baseType: !979, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1021, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1021, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1021, file: !4, line: 3487, baseType: !899, size: 32, align: 32, offset: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1021, file: !4, line: 3488, baseType: !1029, size: 64, align: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1032, line: 61, baseType: !1033)
!1032 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1032, line: 58, size: 64, align: 32, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1033, file: !1032, line: 59, baseType: !899, size: 32, align: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1033, file: !1032, line: 60, baseType: !899, size: 32, align: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1021, file: !4, line: 3489, baseType: !1038, size: 64, align: 64, offset: 320)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1021, file: !4, line: 3490, baseType: !1041, size: 64, align: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1021, file: !4, line: 3491, baseType: !1044, size: 64, align: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1021, file: !4, line: 3492, baseType: !1047, size: 64, align: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !1050)
!1050 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1021, file: !4, line: 3493, baseType: !1052, size: 8, align: 8, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !1053)
!1053 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1021, file: !4, line: 3494, baseType: !973, size: 64, align: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1021, file: !4, line: 3495, baseType: !1056, size: 64, align: 64, offset: 704)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1059, file: !4, line: 3402, baseType: !899, size: 32, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1059, file: !4, line: 3403, baseType: !979, size: 64, align: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1021, file: !4, line: 3507, baseType: !979, size: 64, align: 64, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1021, file: !4, line: 3516, baseType: !899, size: 32, align: 32, offset: 832)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1021, file: !4, line: 3517, baseType: !1066, size: 64, align: 64, offset: 896)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1021, file: !4, line: 3527, baseType: !1068, size: 64, align: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!899, !968}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1021, file: !4, line: 3535, baseType: !1072, size: 64, align: 64, offset: 1024)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!899, !968, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1021, file: !4, line: 3541, baseType: !1078, size: 64, align: 64, offset: 1088)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1081)
!1081 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1021, file: !4, line: 3549, baseType: !1083, size: 64, align: 64, offset: 1152)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{null, !1066}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1021, file: !4, line: 3551, baseType: !1068, size: 64, align: 64, offset: 1216)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1021, file: !4, line: 3552, baseType: !1088, size: 64, align: 64, offset: 1280)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!899, !968, !1091, !899, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1095)
!1095 = !{!1096, !1099, !1101, !1102, !1103, !1133}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1094, file: !4, line: 3921, baseType: !1097, size: 16, align: 16)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !1098)
!1098 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1094, file: !4, line: 3922, baseType: !1100, size: 32, align: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !900)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1094, file: !4, line: 3923, baseType: !1100, size: 32, align: 32, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1094, file: !4, line: 3924, baseType: !900, size: 32, align: 32, offset: 96)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1094, file: !4, line: 3925, baseType: !1104, size: 64, align: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113, !1114, !1124, !1126, !1128, !1129, !1131, !1132}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1107, file: !4, line: 3886, baseType: !899, size: 32, align: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1107, file: !4, line: 3887, baseType: !899, size: 32, align: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1107, file: !4, line: 3888, baseType: !899, size: 32, align: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1107, file: !4, line: 3889, baseType: !899, size: 32, align: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1107, file: !4, line: 3890, baseType: !899, size: 32, align: 32, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1107, file: !4, line: 3897, baseType: !1115, size: 768, align: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1117)
!1117 = !{!1118, !1122}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !4, line: 3855, baseType: !1119, size: 512, align: 64)
!1119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 512, align: 64, elements: !1120)
!1120 = !{!1121}
!1121 = !DISubrange(count: 8)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1116, file: !4, line: 3857, baseType: !1123, size: 256, align: 32, offset: 512)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 256, align: 32, elements: !1120)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !4, line: 3903, baseType: !1125, size: 256, align: 64, offset: 960)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1091, size: 256, align: 64, elements: !940)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1107, file: !4, line: 3904, baseType: !1127, size: 128, align: 32, offset: 1216)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 128, align: 32, elements: !940)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1107, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1107, file: !4, line: 3908, baseType: !1130, size: 64, align: 64, offset: 1408)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1107, file: !4, line: 3915, baseType: !1130, size: 64, align: 64, offset: 1472)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1107, file: !4, line: 3917, baseType: !899, size: 32, align: 32, offset: 1536)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1094, file: !4, line: 3926, baseType: !925, size: 64, align: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1021, file: !4, line: 3564, baseType: !1135, size: 64, align: 64, offset: 1344)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!899, !968, !1138, !1172, !1254}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1141)
!1141 = !{!1142, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1168, !1169, !1170, !1171}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1140, file: !4, line: 1451, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1145, line: 94, baseType: !1146)
!1145 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1145, line: 81, size: 192, align: 64, elements: !1147)
!1147 = !{!1148, !1152, !1153}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1146, file: !1145, line: 82, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1145, line: 73, baseType: !1151)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1145, line: 73, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !1145, line: 89, baseType: !1091, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1146, file: !1145, line: 93, baseType: !899, size: 32, align: 32, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1140, file: !4, line: 1461, baseType: !925, size: 64, align: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1140, file: !4, line: 1467, baseType: !925, size: 64, align: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1140, file: !4, line: 1468, baseType: !1091, size: 64, align: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !4, line: 1469, baseType: !899, size: 32, align: 32, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1140, file: !4, line: 1470, baseType: !899, size: 32, align: 32, offset: 288)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1140, file: !4, line: 1474, baseType: !899, size: 32, align: 32, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1140, file: !4, line: 1479, baseType: !1161, size: 64, align: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1164)
!1164 = !{!1165, !1166, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1163, file: !4, line: 1412, baseType: !1091, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1163, file: !4, line: 1413, baseType: !899, size: 32, align: 32, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1163, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1140, file: !4, line: 1480, baseType: !899, size: 32, align: 32, offset: 448)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1140, file: !4, line: 1486, baseType: !925, size: 64, align: 64, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1140, file: !4, line: 1488, baseType: !925, size: 64, align: 64, offset: 576)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1140, file: !4, line: 1497, baseType: !925, size: 64, align: 64, offset: 640)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1206, !1208, !1209, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1242, !1243, !1244, !1245, !1246, !1247, !1250, !1251, !1252, !1253}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1175, file: !772, line: 282, baseType: !1119, size: 512, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1175, file: !772, line: 299, baseType: !1123, size: 256, align: 32, offset: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1175, file: !772, line: 315, baseType: !1180, size: 64, align: 64, offset: 768)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1175, file: !772, line: 326, baseType: !899, size: 32, align: 32, offset: 832)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1175, file: !772, line: 326, baseType: !899, size: 32, align: 32, offset: 864)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1175, file: !772, line: 334, baseType: !899, size: 32, align: 32, offset: 896)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1175, file: !772, line: 341, baseType: !899, size: 32, align: 32, offset: 928)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1175, file: !772, line: 346, baseType: !899, size: 32, align: 32, offset: 960)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1175, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1175, file: !772, line: 356, baseType: !1031, size: 64, align: 32, offset: 1024)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1175, file: !772, line: 361, baseType: !925, size: 64, align: 64, offset: 1088)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1175, file: !772, line: 369, baseType: !925, size: 64, align: 64, offset: 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1175, file: !772, line: 377, baseType: !925, size: 64, align: 64, offset: 1216)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1175, file: !772, line: 382, baseType: !899, size: 32, align: 32, offset: 1280)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1175, file: !772, line: 386, baseType: !899, size: 32, align: 32, offset: 1312)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1175, file: !772, line: 391, baseType: !899, size: 32, align: 32, offset: 1344)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1175, file: !772, line: 396, baseType: !921, size: 64, align: 64, offset: 1408)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1175, file: !772, line: 403, baseType: !1196, size: 512, align: 64, offset: 1472)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 512, align: 64, elements: !1120)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1175, file: !772, line: 410, baseType: !899, size: 32, align: 32, offset: 1984)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1175, file: !772, line: 415, baseType: !899, size: 32, align: 32, offset: 2016)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1175, file: !772, line: 420, baseType: !899, size: 32, align: 32, offset: 2048)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1175, file: !772, line: 425, baseType: !899, size: 32, align: 32, offset: 2080)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1175, file: !772, line: 435, baseType: !925, size: 64, align: 64, offset: 2112)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1175, file: !772, line: 440, baseType: !899, size: 32, align: 32, offset: 2176)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1175, file: !772, line: 445, baseType: !1049, size: 64, align: 64, offset: 2240)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1175, file: !772, line: 459, baseType: !1205, size: 512, align: 64, offset: 2304)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1143, size: 512, align: 64, elements: !1120)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1175, file: !772, line: 473, baseType: !1207, size: 64, align: 64, offset: 2816)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1175, file: !772, line: 477, baseType: !899, size: 32, align: 32, offset: 2880)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1175, file: !772, line: 479, baseType: !1210, size: 64, align: 64, offset: 2944)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1214)
!1214 = !{!1215, !1216, !1217, !1218, !1223}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1213, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1213, file: !772, line: 203, baseType: !1091, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1213, file: !772, line: 204, baseType: !899, size: 32, align: 32, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1213, file: !772, line: 205, baseType: !1219, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1221, line: 86, baseType: !1222)
!1221 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1221, line: 86, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1213, file: !772, line: 206, baseType: !1143, size: 64, align: 64, offset: 256)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1175, file: !772, line: 480, baseType: !899, size: 32, align: 32, offset: 3008)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1175, file: !772, line: 505, baseType: !899, size: 32, align: 32, offset: 3040)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1175, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1175, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1175, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1175, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1175, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1175, file: !772, line: 532, baseType: !925, size: 64, align: 64, offset: 3264)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1175, file: !772, line: 539, baseType: !925, size: 64, align: 64, offset: 3328)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1175, file: !772, line: 547, baseType: !925, size: 64, align: 64, offset: 3392)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1175, file: !772, line: 554, baseType: !1219, size: 64, align: 64, offset: 3456)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1175, file: !772, line: 563, baseType: !899, size: 32, align: 32, offset: 3520)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1175, file: !772, line: 572, baseType: !899, size: 32, align: 32, offset: 3552)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1175, file: !772, line: 581, baseType: !899, size: 32, align: 32, offset: 3584)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1175, file: !772, line: 588, baseType: !1239, size: 64, align: 64, offset: 3648)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !926, line: 36, baseType: !1241)
!1241 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1175, file: !772, line: 593, baseType: !899, size: 32, align: 32, offset: 3712)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1175, file: !772, line: 596, baseType: !899, size: 32, align: 32, offset: 3744)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1175, file: !772, line: 599, baseType: !1143, size: 64, align: 64, offset: 3776)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1175, file: !772, line: 605, baseType: !1143, size: 64, align: 64, offset: 3840)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1175, file: !772, line: 616, baseType: !1143, size: 64, align: 64, offset: 3904)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1175, file: !772, line: 626, baseType: !1248, size: 64, align: 64, offset: 3968)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1249, line: 216, baseType: !1050)
!1249 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1175, file: !772, line: 627, baseType: !1248, size: 64, align: 64, offset: 4032)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1175, file: !772, line: 628, baseType: !1248, size: 64, align: 64, offset: 4096)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1175, file: !772, line: 629, baseType: !1248, size: 64, align: 64, offset: 4160)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1175, file: !772, line: 645, baseType: !1143, size: 64, align: 64, offset: 4224)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1021, file: !4, line: 3566, baseType: !1256, size: 64, align: 64, offset: 1408)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!899, !968, !921, !1254, !1138}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1021, file: !4, line: 3567, baseType: !1068, size: 64, align: 64, offset: 1472)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1021, file: !4, line: 3576, baseType: !1261, size: 64, align: 64, offset: 1536)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!899, !968, !1172}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1021, file: !4, line: 3577, baseType: !1265, size: 64, align: 64, offset: 1600)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!899, !968, !1138}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1021, file: !4, line: 3584, baseType: !1269, size: 64, align: 64, offset: 1664)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!899, !968, !1272}
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1021, file: !4, line: 3589, baseType: !1274, size: 64, align: 64, offset: 1728)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{null, !968}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1021, file: !4, line: 3594, baseType: !899, size: 32, align: 32, offset: 1792)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1021, file: !4, line: 3600, baseType: !979, size: 64, align: 64, offset: 1856)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1021, file: !4, line: 3609, baseType: !1280, size: 64, align: 64, offset: 1920)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1283)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !970, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !970, file: !4, line: 1581, baseType: !900, size: 32, align: 32, offset: 224)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !970, file: !4, line: 1583, baseType: !921, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !970, file: !4, line: 1591, baseType: !1288, size: 64, align: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !970, file: !4, line: 1598, baseType: !921, size: 64, align: 64, offset: 384)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !970, file: !4, line: 1606, baseType: !925, size: 64, align: 64, offset: 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !970, file: !4, line: 1614, baseType: !899, size: 32, align: 32, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !970, file: !4, line: 1622, baseType: !899, size: 32, align: 32, offset: 544)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !970, file: !4, line: 1628, baseType: !899, size: 32, align: 32, offset: 576)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !4, line: 1636, baseType: !899, size: 32, align: 32, offset: 608)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !970, file: !4, line: 1643, baseType: !899, size: 32, align: 32, offset: 640)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !970, file: !4, line: 1657, baseType: !1091, size: 64, align: 64, offset: 704)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !970, file: !4, line: 1658, baseType: !899, size: 32, align: 32, offset: 768)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !970, file: !4, line: 1679, baseType: !1031, size: 64, align: 32, offset: 800)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !970, file: !4, line: 1688, baseType: !899, size: 32, align: 32, offset: 864)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !970, file: !4, line: 1712, baseType: !899, size: 32, align: 32, offset: 896)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !970, file: !4, line: 1729, baseType: !899, size: 32, align: 32, offset: 928)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !970, file: !4, line: 1729, baseType: !899, size: 32, align: 32, offset: 960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !970, file: !4, line: 1744, baseType: !899, size: 32, align: 32, offset: 992)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !970, file: !4, line: 1744, baseType: !899, size: 32, align: 32, offset: 1024)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !970, file: !4, line: 1751, baseType: !899, size: 32, align: 32, offset: 1056)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !970, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !970, file: !4, line: 1791, baseType: !1309, size: 64, align: 64, offset: 1152)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{null, !1312, !1172, !1254, !899, !899, !899}
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !970, file: !4, line: 1808, baseType: !1314, size: 64, align: 64, offset: 1216)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{!508, !1312, !1038}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !970, file: !4, line: 1816, baseType: !899, size: 32, align: 32, offset: 1280)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !970, file: !4, line: 1825, baseType: !1319, size: 32, align: 32, offset: 1312)
!1319 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !970, file: !4, line: 1830, baseType: !899, size: 32, align: 32, offset: 1344)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !970, file: !4, line: 1838, baseType: !1319, size: 32, align: 32, offset: 1376)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !970, file: !4, line: 1846, baseType: !899, size: 32, align: 32, offset: 1408)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !970, file: !4, line: 1851, baseType: !899, size: 32, align: 32, offset: 1440)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !970, file: !4, line: 1861, baseType: !1319, size: 32, align: 32, offset: 1472)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !970, file: !4, line: 1868, baseType: !1319, size: 32, align: 32, offset: 1504)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !970, file: !4, line: 1875, baseType: !1319, size: 32, align: 32, offset: 1536)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !970, file: !4, line: 1882, baseType: !1319, size: 32, align: 32, offset: 1568)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !970, file: !4, line: 1889, baseType: !1319, size: 32, align: 32, offset: 1600)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !970, file: !4, line: 1896, baseType: !1319, size: 32, align: 32, offset: 1632)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !970, file: !4, line: 1903, baseType: !1319, size: 32, align: 32, offset: 1664)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !970, file: !4, line: 1910, baseType: !899, size: 32, align: 32, offset: 1696)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !970, file: !4, line: 1915, baseType: !899, size: 32, align: 32, offset: 1728)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !970, file: !4, line: 1926, baseType: !1254, size: 64, align: 64, offset: 1792)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !970, file: !4, line: 1935, baseType: !1031, size: 64, align: 32, offset: 1856)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !970, file: !4, line: 1942, baseType: !899, size: 32, align: 32, offset: 1920)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !970, file: !4, line: 1948, baseType: !899, size: 32, align: 32, offset: 1952)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !970, file: !4, line: 1954, baseType: !899, size: 32, align: 32, offset: 1984)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !970, file: !4, line: 1960, baseType: !899, size: 32, align: 32, offset: 2016)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !970, file: !4, line: 1984, baseType: !899, size: 32, align: 32, offset: 2048)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !970, file: !4, line: 1991, baseType: !899, size: 32, align: 32, offset: 2080)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !970, file: !4, line: 1996, baseType: !899, size: 32, align: 32, offset: 2112)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !970, file: !4, line: 2004, baseType: !899, size: 32, align: 32, offset: 2144)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !970, file: !4, line: 2011, baseType: !899, size: 32, align: 32, offset: 2176)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !970, file: !4, line: 2018, baseType: !899, size: 32, align: 32, offset: 2208)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !970, file: !4, line: 2027, baseType: !899, size: 32, align: 32, offset: 2240)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !970, file: !4, line: 2034, baseType: !899, size: 32, align: 32, offset: 2272)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !970, file: !4, line: 2044, baseType: !899, size: 32, align: 32, offset: 2304)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !970, file: !4, line: 2054, baseType: !1349, size: 64, align: 64, offset: 2368)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !970, file: !4, line: 2061, baseType: !1349, size: 64, align: 64, offset: 2432)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !970, file: !4, line: 2066, baseType: !899, size: 32, align: 32, offset: 2496)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !970, file: !4, line: 2070, baseType: !899, size: 32, align: 32, offset: 2528)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !970, file: !4, line: 2078, baseType: !899, size: 32, align: 32, offset: 2560)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !970, file: !4, line: 2085, baseType: !899, size: 32, align: 32, offset: 2592)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !970, file: !4, line: 2092, baseType: !899, size: 32, align: 32, offset: 2624)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !970, file: !4, line: 2099, baseType: !899, size: 32, align: 32, offset: 2656)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !970, file: !4, line: 2106, baseType: !899, size: 32, align: 32, offset: 2688)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !970, file: !4, line: 2113, baseType: !899, size: 32, align: 32, offset: 2720)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !970, file: !4, line: 2120, baseType: !899, size: 32, align: 32, offset: 2752)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !970, file: !4, line: 2125, baseType: !899, size: 32, align: 32, offset: 2784)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !970, file: !4, line: 2133, baseType: !899, size: 32, align: 32, offset: 2816)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !970, file: !4, line: 2140, baseType: !899, size: 32, align: 32, offset: 2848)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !970, file: !4, line: 2145, baseType: !899, size: 32, align: 32, offset: 2880)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !970, file: !4, line: 2153, baseType: !899, size: 32, align: 32, offset: 2912)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !970, file: !4, line: 2158, baseType: !899, size: 32, align: 32, offset: 2944)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !970, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !970, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !970, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !970, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !970, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !970, file: !4, line: 2203, baseType: !899, size: 32, align: 32, offset: 3136)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !970, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !970, file: !4, line: 2212, baseType: !899, size: 32, align: 32, offset: 3200)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !970, file: !4, line: 2213, baseType: !899, size: 32, align: 32, offset: 3232)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !970, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !970, file: !4, line: 2232, baseType: !899, size: 32, align: 32, offset: 3296)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !970, file: !4, line: 2243, baseType: !899, size: 32, align: 32, offset: 3328)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !970, file: !4, line: 2249, baseType: !899, size: 32, align: 32, offset: 3360)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !970, file: !4, line: 2256, baseType: !899, size: 32, align: 32, offset: 3392)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !970, file: !4, line: 2263, baseType: !1049, size: 64, align: 64, offset: 3456)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !970, file: !4, line: 2270, baseType: !1049, size: 64, align: 64, offset: 3520)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !970, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !970, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !970, file: !4, line: 2367, baseType: !1385, size: 64, align: 64, offset: 3648)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{!899, !1312, !1272, !899}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !970, file: !4, line: 2383, baseType: !899, size: 32, align: 32, offset: 3712)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !970, file: !4, line: 2386, baseType: !1319, size: 32, align: 32, offset: 3744)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !970, file: !4, line: 2387, baseType: !1319, size: 32, align: 32, offset: 3776)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !970, file: !4, line: 2394, baseType: !899, size: 32, align: 32, offset: 3808)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !970, file: !4, line: 2401, baseType: !899, size: 32, align: 32, offset: 3840)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !970, file: !4, line: 2408, baseType: !899, size: 32, align: 32, offset: 3872)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !970, file: !4, line: 2415, baseType: !899, size: 32, align: 32, offset: 3904)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !970, file: !4, line: 2422, baseType: !899, size: 32, align: 32, offset: 3936)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !970, file: !4, line: 2423, baseType: !1397, size: 64, align: 64, offset: 3968)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1400)
!1400 = !{!1401, !1402, !1403, !1404}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1399, file: !4, line: 827, baseType: !899, size: 32, align: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1399, file: !4, line: 828, baseType: !899, size: 32, align: 32, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1399, file: !4, line: 829, baseType: !899, size: 32, align: 32, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1399, file: !4, line: 830, baseType: !1319, size: 32, align: 32, offset: 96)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !970, file: !4, line: 2430, baseType: !925, size: 64, align: 64, offset: 4032)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !970, file: !4, line: 2437, baseType: !925, size: 64, align: 64, offset: 4096)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !970, file: !4, line: 2444, baseType: !1319, size: 32, align: 32, offset: 4160)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !970, file: !4, line: 2451, baseType: !1319, size: 32, align: 32, offset: 4192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !970, file: !4, line: 2458, baseType: !899, size: 32, align: 32, offset: 4224)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !970, file: !4, line: 2469, baseType: !899, size: 32, align: 32, offset: 4256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !970, file: !4, line: 2475, baseType: !899, size: 32, align: 32, offset: 4288)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !970, file: !4, line: 2481, baseType: !899, size: 32, align: 32, offset: 4320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !970, file: !4, line: 2485, baseType: !899, size: 32, align: 32, offset: 4352)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !970, file: !4, line: 2489, baseType: !899, size: 32, align: 32, offset: 4384)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !970, file: !4, line: 2493, baseType: !899, size: 32, align: 32, offset: 4416)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !970, file: !4, line: 2501, baseType: !899, size: 32, align: 32, offset: 4448)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !970, file: !4, line: 2506, baseType: !899, size: 32, align: 32, offset: 4480)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !970, file: !4, line: 2510, baseType: !899, size: 32, align: 32, offset: 4512)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !970, file: !4, line: 2514, baseType: !925, size: 64, align: 64, offset: 4544)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !970, file: !4, line: 2528, baseType: !1421, size: 64, align: 64, offset: 4608)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{null, !1312, !921, !899, !899}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !970, file: !4, line: 2534, baseType: !899, size: 32, align: 32, offset: 4672)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !970, file: !4, line: 2545, baseType: !899, size: 32, align: 32, offset: 4704)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !970, file: !4, line: 2547, baseType: !899, size: 32, align: 32, offset: 4736)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !970, file: !4, line: 2549, baseType: !899, size: 32, align: 32, offset: 4768)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !970, file: !4, line: 2551, baseType: !899, size: 32, align: 32, offset: 4800)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !970, file: !4, line: 2553, baseType: !899, size: 32, align: 32, offset: 4832)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !970, file: !4, line: 2555, baseType: !899, size: 32, align: 32, offset: 4864)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !970, file: !4, line: 2557, baseType: !899, size: 32, align: 32, offset: 4896)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !970, file: !4, line: 2559, baseType: !899, size: 32, align: 32, offset: 4928)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !970, file: !4, line: 2563, baseType: !899, size: 32, align: 32, offset: 4960)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !970, file: !4, line: 2571, baseType: !1130, size: 64, align: 64, offset: 4992)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !970, file: !4, line: 2579, baseType: !1130, size: 64, align: 64, offset: 5056)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !970, file: !4, line: 2586, baseType: !899, size: 32, align: 32, offset: 5120)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !970, file: !4, line: 2615, baseType: !899, size: 32, align: 32, offset: 5152)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !970, file: !4, line: 2627, baseType: !899, size: 32, align: 32, offset: 5184)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !970, file: !4, line: 2637, baseType: !899, size: 32, align: 32, offset: 5216)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !970, file: !4, line: 2681, baseType: !899, size: 32, align: 32, offset: 5248)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !970, file: !4, line: 2709, baseType: !925, size: 64, align: 64, offset: 5312)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !970, file: !4, line: 2716, baseType: !1443, size: 64, align: 64, offset: 5376)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1445)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1446)
!1446 = !{!1447, !1448, !1449, !1450, !1451, !1452, !1453, !1459, !1463, !1464, !1465, !1466, !1472, !1473, !1474, !1475, !1476}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1445, file: !4, line: 3642, baseType: !979, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1445, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1445, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1445, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1445, file: !4, line: 3669, baseType: !899, size: 32, align: 32, offset: 160)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1445, file: !4, line: 3682, baseType: !1269, size: 64, align: 64, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1445, file: !4, line: 3698, baseType: !1454, size: 64, align: 64, offset: 256)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!899, !968, !1457, !1100}
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1445, file: !4, line: 3712, baseType: !1460, size: 64, align: 64, offset: 320)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!899, !968, !899, !1457, !1100}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1445, file: !4, line: 3726, baseType: !1454, size: 64, align: 64, offset: 384)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1445, file: !4, line: 3737, baseType: !1068, size: 64, align: 64, offset: 448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1445, file: !4, line: 3746, baseType: !899, size: 32, align: 32, offset: 512)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1445, file: !4, line: 3757, baseType: !1467, size: 64, align: 64, offset: 576)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DISubroutineType(types: !1469)
!1469 = !{null, !1470}
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1445, file: !4, line: 3766, baseType: !1068, size: 64, align: 64, offset: 640)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1445, file: !4, line: 3774, baseType: !1068, size: 64, align: 64, offset: 704)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1445, file: !4, line: 3780, baseType: !899, size: 32, align: 32, offset: 768)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1445, file: !4, line: 3785, baseType: !899, size: 32, align: 32, offset: 800)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1445, file: !4, line: 3795, baseType: !1477, size: 64, align: 64, offset: 832)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!899, !968, !1143}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !970, file: !4, line: 2728, baseType: !921, size: 64, align: 64, offset: 5440)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !970, file: !4, line: 2735, baseType: !1196, size: 512, align: 64, offset: 5504)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !970, file: !4, line: 2742, baseType: !899, size: 32, align: 32, offset: 6016)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !970, file: !4, line: 2755, baseType: !899, size: 32, align: 32, offset: 6048)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !970, file: !4, line: 2776, baseType: !899, size: 32, align: 32, offset: 6080)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !970, file: !4, line: 2783, baseType: !899, size: 32, align: 32, offset: 6112)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !970, file: !4, line: 2791, baseType: !899, size: 32, align: 32, offset: 6144)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !970, file: !4, line: 2802, baseType: !1272, size: 64, align: 64, offset: 6208)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !970, file: !4, line: 2811, baseType: !899, size: 32, align: 32, offset: 6272)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !970, file: !4, line: 2821, baseType: !899, size: 32, align: 32, offset: 6304)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !970, file: !4, line: 2830, baseType: !899, size: 32, align: 32, offset: 6336)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !970, file: !4, line: 2840, baseType: !899, size: 32, align: 32, offset: 6368)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !970, file: !4, line: 2851, baseType: !1493, size: 64, align: 64, offset: 6400)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!899, !1312, !1496, !921, !1254, !899, !899}
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!899, !1312, !921}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !970, file: !4, line: 2871, baseType: !1500, size: 64, align: 64, offset: 6464)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!899, !1312, !1503, !921, !1254, !899}
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!899, !1312, !921, !899, !899}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !970, file: !4, line: 2878, baseType: !899, size: 32, align: 32, offset: 6528)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !970, file: !4, line: 2885, baseType: !899, size: 32, align: 32, offset: 6560)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !970, file: !4, line: 3005, baseType: !899, size: 32, align: 32, offset: 6592)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !970, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !970, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !970, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !970, file: !4, line: 3037, baseType: !1091, size: 64, align: 64, offset: 6720)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !970, file: !4, line: 3038, baseType: !899, size: 32, align: 32, offset: 6784)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !970, file: !4, line: 3050, baseType: !1049, size: 64, align: 64, offset: 6848)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !970, file: !4, line: 3065, baseType: !899, size: 32, align: 32, offset: 6912)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !970, file: !4, line: 3083, baseType: !899, size: 32, align: 32, offset: 6944)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !970, file: !4, line: 3092, baseType: !1031, size: 64, align: 32, offset: 6976)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !970, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !970, file: !4, line: 3106, baseType: !1031, size: 64, align: 32, offset: 7072)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !970, file: !4, line: 3113, baseType: !1521, size: 64, align: 64, offset: 7168)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1523)
!1523 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1524)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1525)
!1525 = !{!1526, !1527, !1528, !1529, !1530, !1531, !1534}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1524, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1524, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1524, file: !4, line: 720, baseType: !979, size: 64, align: 64, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1524, file: !4, line: 724, baseType: !979, size: 64, align: 64, offset: 128)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1524, file: !4, line: 728, baseType: !899, size: 32, align: 32, offset: 192)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1524, file: !4, line: 734, baseType: !1532, size: 64, align: 64, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1524, file: !4, line: 739, baseType: !1535, size: 64, align: 64, offset: 320)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !970, file: !4, line: 3129, baseType: !925, size: 64, align: 64, offset: 7232)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !970, file: !4, line: 3130, baseType: !925, size: 64, align: 64, offset: 7296)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !970, file: !4, line: 3131, baseType: !925, size: 64, align: 64, offset: 7360)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !970, file: !4, line: 3132, baseType: !925, size: 64, align: 64, offset: 7424)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !970, file: !4, line: 3139, baseType: !1130, size: 64, align: 64, offset: 7488)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !970, file: !4, line: 3147, baseType: !899, size: 32, align: 32, offset: 7552)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !970, file: !4, line: 3165, baseType: !899, size: 32, align: 32, offset: 7584)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !970, file: !4, line: 3172, baseType: !899, size: 32, align: 32, offset: 7616)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !970, file: !4, line: 3180, baseType: !899, size: 32, align: 32, offset: 7648)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !970, file: !4, line: 3191, baseType: !1349, size: 64, align: 64, offset: 7680)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !970, file: !4, line: 3199, baseType: !1091, size: 64, align: 64, offset: 7744)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !970, file: !4, line: 3207, baseType: !1130, size: 64, align: 64, offset: 7808)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !970, file: !4, line: 3214, baseType: !900, size: 32, align: 32, offset: 7872)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !970, file: !4, line: 3224, baseType: !1161, size: 64, align: 64, offset: 7936)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !970, file: !4, line: 3225, baseType: !899, size: 32, align: 32, offset: 8000)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !970, file: !4, line: 3249, baseType: !1143, size: 64, align: 64, offset: 8064)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !970, file: !4, line: 3256, baseType: !899, size: 32, align: 32, offset: 8128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !970, file: !4, line: 3271, baseType: !899, size: 32, align: 32, offset: 8160)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !970, file: !4, line: 3279, baseType: !925, size: 64, align: 64, offset: 8192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !970, file: !4, line: 3301, baseType: !1143, size: 64, align: 64, offset: 8256)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !970, file: !4, line: 3310, baseType: !899, size: 32, align: 32, offset: 8320)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !970, file: !4, line: 3337, baseType: !899, size: 32, align: 32, offset: 8352)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !970, file: !4, line: 3351, baseType: !899, size: 32, align: 32, offset: 8384)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !970, file: !4, line: 3359, baseType: !899, size: 32, align: 32, offset: 8416)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !905, file: !4, line: 5269, baseType: !1563, size: 64, align: 64, offset: 320)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{null, !916}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !905, file: !4, line: 5270, baseType: !1567, size: 64, align: 64, offset: 384)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!899, !968, !1457, !899}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !905, file: !4, line: 5271, baseType: !923, size: 64, align: 64, offset: 448)
!1571 = !{i32 2, !"Dwarf Version", i32 4}
!1572 = !{i32 2, !"Debug Info Version", i32 3}
!1573 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1574 = distinct !DISubprogram(name: "tak_parse", scope: !903, file: !903, line: 37, type: !966, isLocal: true, isDefinition: true, scopeLine: 40, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1575)
!1575 = !{}
!1576 = !DILocalVariable(name: "s", arg: 1, scope: !1574, file: !903, line: 37, type: !916)
!1577 = !DIExpression()
!1578 = !DILocation(line: 37, column: 44, scope: !1574)
!1579 = !DILocalVariable(name: "avctx", arg: 2, scope: !1574, file: !903, line: 37, type: !968)
!1580 = !DILocation(line: 37, column: 63, scope: !1574)
!1581 = !DILocalVariable(name: "poutbuf", arg: 3, scope: !1574, file: !903, line: 38, type: !1561)
!1582 = !DILocation(line: 38, column: 38, scope: !1574)
!1583 = !DILocalVariable(name: "poutbuf_size", arg: 4, scope: !1574, file: !903, line: 38, type: !1254)
!1584 = !DILocation(line: 38, column: 52, scope: !1574)
!1585 = !DILocalVariable(name: "buf", arg: 5, scope: !1574, file: !903, line: 39, type: !1457)
!1586 = !DILocation(line: 39, column: 37, scope: !1574)
!1587 = !DILocalVariable(name: "buf_size", arg: 6, scope: !1574, file: !903, line: 39, type: !899)
!1588 = !DILocation(line: 39, column: 46, scope: !1574)
!1589 = !DILocalVariable(name: "t", scope: !1574, file: !903, line: 41, type: !1590)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAKParseContext", file: !903, line: 35, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAKParseContext", file: !903, line: 31, size: 896, align: 64, elements: !1593)
!1593 = !{!1594, !1608, !1623}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !1592, file: !903, line: 32, baseType: !1595, size: 384, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParseContext", file: !1596, line: 38, baseType: !1597)
!1596 = !DIFile(filename: "libavcodec/parser.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParseContext", file: !1596, line: 28, size: 384, align: 64, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1597, file: !1596, line: 29, baseType: !1091, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1597, file: !1596, line: 30, baseType: !899, size: 32, align: 32, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !1597, file: !1596, line: 31, baseType: !899, size: 32, align: 32, offset: 96)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1597, file: !1596, line: 32, baseType: !900, size: 32, align: 32, offset: 128)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1597, file: !1596, line: 33, baseType: !1100, size: 32, align: 32, offset: 160)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_start_found", scope: !1597, file: !1596, line: 34, baseType: !899, size: 32, align: 32, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "overread", scope: !1597, file: !1596, line: 35, baseType: !899, size: 32, align: 32, offset: 224)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "overread_index", scope: !1597, file: !1596, line: 36, baseType: !899, size: 32, align: 32, offset: 256)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "state64", scope: !1597, file: !1596, line: 37, baseType: !1049, size: 64, align: 64, offset: 320)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "ti", scope: !1592, file: !903, line: 33, baseType: !1609, size: 448, align: 64, offset: 384)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "TAKStreamInfo", file: !894, line: 140, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAKStreamInfo", file: !894, line: 128, size: 448, align: 64, elements: !1611)
!1611 = !{!1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1610, file: !894, line: 129, baseType: !899, size: 32, align: 32)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1610, file: !894, line: 130, baseType: !893, size: 32, align: 32, offset: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !1610, file: !894, line: 131, baseType: !899, size: 32, align: 32, offset: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1610, file: !894, line: 132, baseType: !899, size: 32, align: 32, offset: 96)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1610, file: !894, line: 133, baseType: !899, size: 32, align: 32, offset: 128)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "bps", scope: !1610, file: !894, line: 134, baseType: !899, size: 32, align: 32, offset: 160)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_num", scope: !1610, file: !894, line: 135, baseType: !899, size: 32, align: 32, offset: 192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_samples", scope: !1610, file: !894, line: 136, baseType: !899, size: 32, align: 32, offset: 224)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "last_frame_samples", scope: !1610, file: !894, line: 137, baseType: !899, size: 32, align: 32, offset: 256)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "ch_layout", scope: !1610, file: !894, line: 138, baseType: !1049, size: 64, align: 64, offset: 320)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1610, file: !894, line: 139, baseType: !925, size: 64, align: 64, offset: 384)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1592, file: !903, line: 34, baseType: !899, size: 32, align: 32, offset: 832)
!1624 = !DILocation(line: 41, column: 22, scope: !1574)
!1625 = !DILocation(line: 41, column: 26, scope: !1574)
!1626 = !DILocation(line: 41, column: 29, scope: !1574)
!1627 = !DILocalVariable(name: "pc", scope: !1574, file: !903, line: 42, type: !1628)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1629 = !DILocation(line: 42, column: 19, scope: !1574)
!1630 = !DILocation(line: 42, column: 25, scope: !1574)
!1631 = !DILocation(line: 42, column: 28, scope: !1574)
!1632 = !DILocalVariable(name: "next", scope: !1574, file: !903, line: 43, type: !899)
!1633 = !DILocation(line: 43, column: 9, scope: !1574)
!1634 = !DILocalVariable(name: "gb", scope: !1574, file: !903, line: 44, type: !1635)
!1635 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1636, line: 70, baseType: !1637)
!1636 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1636, line: 61, size: 256, align: 64, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642, !1643}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1637, file: !1636, line: 62, baseType: !1457, size: 64, align: 64)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1637, file: !1636, line: 62, baseType: !1457, size: 64, align: 64, offset: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1637, file: !1636, line: 67, baseType: !899, size: 32, align: 32, offset: 128)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1637, file: !1636, line: 68, baseType: !899, size: 32, align: 32, offset: 160)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1637, file: !1636, line: 69, baseType: !899, size: 32, align: 32, offset: 192)
!1644 = !DILocation(line: 44, column: 19, scope: !1574)
!1645 = !DILocalVariable(name: "consumed", scope: !1574, file: !903, line: 45, type: !899)
!1646 = !DILocation(line: 45, column: 9, scope: !1574)
!1647 = !DILocalVariable(name: "needed", scope: !1574, file: !903, line: 46, type: !899)
!1648 = !DILocation(line: 46, column: 9, scope: !1574)
!1649 = !DILocation(line: 46, column: 18, scope: !1574)
!1650 = !DILocalVariable(name: "ret", scope: !1574, file: !903, line: 47, type: !899)
!1651 = !DILocation(line: 47, column: 9, scope: !1574)
!1652 = !DILocation(line: 49, column: 9, scope: !1653)
!1653 = distinct !DILexicalBlock(scope: !1574, file: !903, line: 49, column: 9)
!1654 = !DILocation(line: 49, column: 12, scope: !1653)
!1655 = !DILocation(line: 49, column: 18, scope: !1653)
!1656 = !DILocation(line: 49, column: 9, scope: !1574)
!1657 = !DILocalVariable(name: "ti", scope: !1658, file: !903, line: 50, type: !1609)
!1658 = distinct !DILexicalBlock(scope: !1653, file: !903, line: 49, column: 28)
!1659 = !DILocation(line: 50, column: 23, scope: !1658)
!1660 = !DILocation(line: 51, column: 40, scope: !1661)
!1661 = distinct !DILexicalBlock(scope: !1658, file: !903, line: 51, column: 13)
!1662 = !DILocation(line: 51, column: 45, scope: !1661)
!1663 = !DILocation(line: 51, column: 20, scope: !1661)
!1664 = !DILocation(line: 51, column: 18, scope: !1661)
!1665 = !DILocation(line: 51, column: 56, scope: !1661)
!1666 = !DILocation(line: 51, column: 13, scope: !1658)
!1667 = !DILocation(line: 52, column: 20, scope: !1661)
!1668 = !DILocation(line: 52, column: 13, scope: !1661)
!1669 = !DILocation(line: 53, column: 41, scope: !1670)
!1670 = distinct !DILexicalBlock(scope: !1658, file: !903, line: 53, column: 13)
!1671 = !DILocation(line: 53, column: 14, scope: !1670)
!1672 = !DILocation(line: 53, column: 13, scope: !1658)
!1673 = !DILocation(line: 54, column: 27, scope: !1670)
!1674 = !DILocation(line: 54, column: 30, scope: !1670)
!1675 = !DILocation(line: 54, column: 33, scope: !1670)
!1676 = !DILocation(line: 54, column: 54, scope: !1677)
!1677 = !DILexicalBlockFile(scope: !1670, file: !903, discriminator: 1)
!1678 = !DILocation(line: 54, column: 57, scope: !1677)
!1679 = !DILocation(line: 54, column: 60, scope: !1677)
!1680 = !DILocation(line: 54, column: 27, scope: !1677)
!1681 = !DILocation(line: 55, column: 54, scope: !1670)
!1682 = !DILocation(line: 55, column: 57, scope: !1670)
!1683 = !DILocation(line: 55, column: 60, scope: !1670)
!1684 = !DILocation(line: 54, column: 27, scope: !1685)
!1685 = !DILexicalBlockFile(scope: !1670, file: !903, discriminator: 2)
!1686 = !DILocation(line: 54, column: 27, scope: !1687)
!1687 = !DILexicalBlockFile(scope: !1670, file: !903, discriminator: 3)
!1688 = !DILocation(line: 54, column: 13, scope: !1687)
!1689 = !DILocation(line: 54, column: 16, scope: !1687)
!1690 = !DILocation(line: 54, column: 25, scope: !1687)
!1691 = !DILocation(line: 56, column: 20, scope: !1658)
!1692 = !DILocation(line: 56, column: 10, scope: !1658)
!1693 = !DILocation(line: 56, column: 18, scope: !1658)
!1694 = !DILocation(line: 57, column: 25, scope: !1658)
!1695 = !DILocation(line: 57, column: 10, scope: !1658)
!1696 = !DILocation(line: 57, column: 23, scope: !1658)
!1697 = !DILocation(line: 58, column: 16, scope: !1658)
!1698 = !DILocation(line: 58, column: 9, scope: !1658)
