; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--msmpeg4dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--msmpeg4dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }
%struct.MVTable = type { i32, i16*, i8*, i8*, i8*, i16*, %struct.VLC }
%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }

!905 = !DIEnumerator(name: "FMT_H263", value: 2)
!906 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!907 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !908, line: 37, size: 32, align: 32, elements: !909)
!908 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!909 = !{!910, !911, !912, !913, !914, !915}
!910 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!911 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!912 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!913 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!914 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!915 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923, !924}
!918 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!919 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!920 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!921 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!922 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!923 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!924 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!925 = !{!926, !927, !928, !934, !936}
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !931, line: 221, size: 32, align: 8, elements: !932)
!931 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !930, file: !931, line: 221, baseType: !934, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !935, line: 51, baseType: !927)
!935 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !935, line: 48, baseType: !937)
!937 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!938 = !{!939, !2597, !2608, !2612, !2616, !2620, !2624, !2625, !2629, !2633, !2637, !2641, !2645, !2649, !2653, !2657, !2660, !2664, !2668, !2672, !2676, !2680, !2684, !2688, !2689, !2691, !2692, !2693, !2694, !2703, !2704, !2705, !2706, !2707, !2708}
!939 = distinct !DIGlobalVariable(name: "done", scope: !940, file: !941, line: 304, type: !2596, isLocal: true, isDefinition: true, variable: i32* @ff_msmpeg4_decode_init.done)
!940 = distinct !DISubprogram(name: "ff_msmpeg4_decode_init", scope: !941, file: !941, line: 301, type: !942, isLocal: false, isDefinition: true, scopeLine: 302, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2595)
!941 = !DIFile(filename: "libavcodec/msmpeg4dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!942 = !DISubroutineType(types: !943)
!943 = !{!926, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !947)
!947 = !{!948, !1033, !1034, !1035, !1298, !1299, !1300, !1301, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1454, !1458, !1459, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2533, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2594}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !946, file: !57, line: 1561, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !953)
!953 = !{!954, !958, !963, !992, !993, !994, !995, !999, !1005, !1007, !1011}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !952, file: !26, line: 72, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !952, file: !26, line: 78, baseType: !959, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!955, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !952, file: !26, line: 85, baseType: !964, size: 64, align: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !988, !989, !990, !991}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !966, file: !4, line: 247, baseType: !955, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !966, file: !4, line: 253, baseType: !955, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !966, file: !4, line: 259, baseType: !926, size: 32, align: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !966, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !966, file: !4, line: 271, baseType: !973, size: 64, align: 64, offset: 192)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !966, file: !4, line: 265, size: 64, align: 64, elements: !974)
!974 = !{!975, !978, !980, !981}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !973, file: !4, line: 266, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !935, line: 40, baseType: !977)
!977 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !973, file: !4, line: 267, baseType: !979, size: 64, align: 64)
!979 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !973, file: !4, line: 268, baseType: !955, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !973, file: !4, line: 270, baseType: !982, size: 64, align: 32)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !983, line: 61, baseType: !984)
!983 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !983, line: 58, size: 64, align: 32, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !984, file: !983, line: 59, baseType: !926, size: 32, align: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !984, file: !983, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !966, file: !4, line: 272, baseType: !979, size: 64, align: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !966, file: !4, line: 273, baseType: !979, size: 64, align: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !4, line: 275, baseType: !926, size: 32, align: 32, offset: 384)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !966, file: !4, line: 300, baseType: !955, size: 64, align: 64, offset: 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !952, file: !26, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !952, file: !26, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !952, file: !26, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !952, file: !26, line: 113, baseType: !996, size: 64, align: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!962, !962, !962}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !952, file: !26, line: 123, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!1003, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !952, file: !26, line: 130, baseType: !1006, size: 32, align: 32, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !952, file: !26, line: 136, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!1006, !962}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !952, file: !26, line: 142, baseType: !1012, size: 64, align: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!926, !1015, !962, !955, !926}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1018)
!1018 = !{!1019, !1031, !1032}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1017, file: !4, line: 360, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1023, file: !4, line: 307, baseType: !955, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1023, file: !4, line: 313, baseType: !979, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1023, file: !4, line: 313, baseType: !979, size: 64, align: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1023, file: !4, line: 318, baseType: !979, size: 64, align: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1023, file: !4, line: 318, baseType: !979, size: 64, align: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1023, file: !4, line: 323, baseType: !926, size: 32, align: 32, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1017, file: !4, line: 364, baseType: !926, size: 32, align: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1017, file: !4, line: 368, baseType: !926, size: 32, align: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !946, file: !57, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !946, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !946, file: !57, line: 1565, baseType: !1036, size: 64, align: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1048, !1051, !1054, !1057, !1062, !1063, !1064, !1072, !1073, !1074, !1076, !1078, !1084, !1095, !1099, !1100, !1148, !1269, !1273, !1274, !1278, !1282, !1287, !1291, !1292, !1293}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !57, line: 3475, baseType: !955, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1038, file: !57, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1038, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1038, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1038, file: !57, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1038, file: !57, line: 3488, baseType: !1046, size: 64, align: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1038, file: !57, line: 3489, baseType: !1049, size: 64, align: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1038, file: !57, line: 3490, baseType: !1052, size: 64, align: 64, offset: 384)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1038, file: !57, line: 3491, baseType: !1055, size: 64, align: 64, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1038, file: !57, line: 3492, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !935, line: 55, baseType: !1061)
!1061 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1038, file: !57, line: 3493, baseType: !936, size: 8, align: 8, offset: 576)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1038, file: !57, line: 3494, baseType: !949, size: 64, align: 64, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1038, file: !57, line: 3495, baseType: !1065, size: 64, align: 64, offset: 704)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1069)
!1069 = !{!1070, !1071}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1068, file: !57, line: 3402, baseType: !926, size: 32, align: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1068, file: !57, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1038, file: !57, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1038, file: !57, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1038, file: !57, line: 3517, baseType: !1075, size: 64, align: 64, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1038, file: !57, line: 3527, baseType: !1077, size: 64, align: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1038, file: !57, line: 3535, baseType: !1079, size: 64, align: 64, offset: 1024)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!926, !944, !1082}
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1038, file: !57, line: 3541, baseType: !1085, size: 64, align: 64, offset: 1088)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1089, line: 223, size: 128, align: 64, elements: !1090)
!1089 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1090 = !{!1091, !1094}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1088, file: !1089, line: 224, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1088, file: !1089, line: 225, baseType: !1092, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1038, file: !57, line: 3549, baseType: !1096, size: 64, align: 64, offset: 1152)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{null, !1075}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1038, file: !57, line: 3551, baseType: !1077, size: 64, align: 64, offset: 1216)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1038, file: !57, line: 3552, baseType: !1101, size: 64, align: 64, offset: 1280)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!926, !944, !1104, !926, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1108)
!1108 = !{!1109, !1112, !1113, !1114, !1115, !1147}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1107, file: !57, line: 3921, baseType: !1110, size: 16, align: 16)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !935, line: 49, baseType: !1111)
!1111 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1107, file: !57, line: 3922, baseType: !934, size: 32, align: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1107, file: !57, line: 3923, baseType: !934, size: 32, align: 32, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1107, file: !57, line: 3924, baseType: !927, size: 32, align: 32, offset: 96)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1107, file: !57, line: 3925, baseType: !1116, size: 64, align: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124, !1125, !1126, !1136, !1140, !1142, !1143, !1145, !1146}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1119, file: !57, line: 3886, baseType: !926, size: 32, align: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1119, file: !57, line: 3887, baseType: !926, size: 32, align: 32, offset: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1119, file: !57, line: 3888, baseType: !926, size: 32, align: 32, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1119, file: !57, line: 3889, baseType: !926, size: 32, align: 32, offset: 96)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1119, file: !57, line: 3890, baseType: !926, size: 32, align: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1119, file: !57, line: 3897, baseType: !1127, size: 768, align: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1129)
!1129 = !{!1130, !1134}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !57, line: 3855, baseType: !1131, size: 512, align: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 512, align: 64, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 8)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1128, file: !57, line: 3857, baseType: !1135, size: 256, align: 32, offset: 512)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1132)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !57, line: 3903, baseType: !1137, size: 256, align: 64, offset: 960)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 256, align: 64, elements: !1138)
!1138 = !{!1139}
!1139 = !DISubrange(count: 4)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1119, file: !57, line: 3904, baseType: !1141, size: 128, align: 32, offset: 1216)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1138)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1119, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1119, file: !57, line: 3908, baseType: !1144, size: 64, align: 64, offset: 1408)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1119, file: !57, line: 3915, baseType: !1144, size: 64, align: 64, offset: 1472)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1119, file: !57, line: 3917, baseType: !926, size: 32, align: 32, offset: 1536)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1107, file: !57, line: 3926, baseType: !976, size: 64, align: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1038, file: !57, line: 3564, baseType: !1149, size: 64, align: 64, offset: 1344)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!926, !944, !1152, !1186, !1268}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1155)
!1155 = !{!1156, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1182, !1183, !1184, !1185}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1154, file: !57, line: 1451, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1159, line: 94, baseType: !1160)
!1159 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1159, line: 81, size: 192, align: 64, elements: !1161)
!1161 = !{!1162, !1166, !1167}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1160, file: !1159, line: 82, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1159, line: 73, baseType: !1165)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1159, line: 73, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !1159, line: 89, baseType: !1104, size: 64, align: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1160, file: !1159, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1154, file: !57, line: 1461, baseType: !976, size: 64, align: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1154, file: !57, line: 1467, baseType: !976, size: 64, align: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !57, line: 1468, baseType: !1104, size: 64, align: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1154, file: !57, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1154, file: !57, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1154, file: !57, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1154, file: !57, line: 1479, baseType: !1175, size: 64, align: 64, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !57, line: 1412, baseType: !1104, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1177, file: !57, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1154, file: !57, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1154, file: !57, line: 1486, baseType: !976, size: 64, align: 64, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1154, file: !57, line: 1488, baseType: !976, size: 64, align: 64, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1154, file: !57, line: 1497, baseType: !976, size: 64, align: 64, offset: 640)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1220, !1222, !1223, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1256, !1257, !1258, !1259, !1260, !1261, !1264, !1265, !1266, !1267}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1189, file: !780, line: 282, baseType: !1131, size: 512, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1189, file: !780, line: 299, baseType: !1135, size: 256, align: 32, offset: 512)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1189, file: !780, line: 315, baseType: !1194, size: 64, align: 64, offset: 768)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1189, file: !780, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1189, file: !780, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1189, file: !780, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1189, file: !780, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1189, file: !780, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1189, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1189, file: !780, line: 356, baseType: !982, size: 64, align: 32, offset: 1024)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1189, file: !780, line: 361, baseType: !976, size: 64, align: 64, offset: 1088)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1189, file: !780, line: 369, baseType: !976, size: 64, align: 64, offset: 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1189, file: !780, line: 377, baseType: !976, size: 64, align: 64, offset: 1216)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1189, file: !780, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1189, file: !780, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1189, file: !780, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1189, file: !780, line: 396, baseType: !962, size: 64, align: 64, offset: 1408)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1189, file: !780, line: 403, baseType: !1210, size: 512, align: 64, offset: 1472)
!1210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 512, align: 64, elements: !1132)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1189, file: !780, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1189, file: !780, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1189, file: !780, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1189, file: !780, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1189, file: !780, line: 435, baseType: !976, size: 64, align: 64, offset: 2112)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1189, file: !780, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1189, file: !780, line: 445, baseType: !1060, size: 64, align: 64, offset: 2240)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1189, file: !780, line: 459, baseType: !1219, size: 512, align: 64, offset: 2304)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1157, size: 512, align: 64, elements: !1132)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1189, file: !780, line: 473, baseType: !1221, size: 64, align: 64, offset: 2816)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1189, file: !780, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1189, file: !780, line: 479, baseType: !1224, size: 64, align: 64, offset: 2944)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1237}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1227, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1227, file: !780, line: 203, baseType: !1104, size: 64, align: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !780, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1227, file: !780, line: 205, baseType: !1233, size: 64, align: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1235, line: 86, baseType: !1236)
!1235 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1235, line: 86, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1227, file: !780, line: 206, baseType: !1157, size: 64, align: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1189, file: !780, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1189, file: !780, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1189, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1189, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1189, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1189, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1189, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1189, file: !780, line: 532, baseType: !976, size: 64, align: 64, offset: 3264)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1189, file: !780, line: 539, baseType: !976, size: 64, align: 64, offset: 3328)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1189, file: !780, line: 547, baseType: !976, size: 64, align: 64, offset: 3392)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1189, file: !780, line: 554, baseType: !1233, size: 64, align: 64, offset: 3456)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1189, file: !780, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1189, file: !780, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1189, file: !780, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1189, file: !780, line: 588, baseType: !1253, size: 64, align: 64, offset: 3648)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !935, line: 36, baseType: !1255)
!1255 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1189, file: !780, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1189, file: !780, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1189, file: !780, line: 599, baseType: !1157, size: 64, align: 64, offset: 3776)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1189, file: !780, line: 605, baseType: !1157, size: 64, align: 64, offset: 3840)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1189, file: !780, line: 616, baseType: !1157, size: 64, align: 64, offset: 3904)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1189, file: !780, line: 626, baseType: !1262, size: 64, align: 64, offset: 3968)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1263, line: 216, baseType: !1061)
!1263 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1189, file: !780, line: 627, baseType: !1262, size: 64, align: 64, offset: 4032)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1189, file: !780, line: 628, baseType: !1262, size: 64, align: 64, offset: 4096)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1189, file: !780, line: 629, baseType: !1262, size: 64, align: 64, offset: 4160)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1189, file: !780, line: 645, baseType: !1157, size: 64, align: 64, offset: 4224)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1038, file: !57, line: 3566, baseType: !1270, size: 64, align: 64, offset: 1408)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!926, !944, !962, !1268, !1152}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1038, file: !57, line: 3567, baseType: !1077, size: 64, align: 64, offset: 1472)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1038, file: !57, line: 3576, baseType: !1275, size: 64, align: 64, offset: 1536)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!926, !944, !1186}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1038, file: !57, line: 3577, baseType: !1279, size: 64, align: 64, offset: 1600)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!926, !944, !1152}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1038, file: !57, line: 3584, baseType: !1283, size: 64, align: 64, offset: 1664)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!926, !944, !1286}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1038, file: !57, line: 3589, baseType: !1288, size: 64, align: 64, offset: 1728)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{null, !944}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1038, file: !57, line: 3594, baseType: !926, size: 32, align: 32, offset: 1792)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1038, file: !57, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1038, file: !57, line: 3609, baseType: !1294, size: 64, align: 64, offset: 1920)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1297)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !946, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !946, file: !57, line: 1581, baseType: !927, size: 32, align: 32, offset: 224)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !946, file: !57, line: 1583, baseType: !962, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !946, file: !57, line: 1591, baseType: !1302, size: 64, align: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1089, line: 129, size: 1664, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1327, !1328, !1334, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1303, file: !1089, line: 136, baseType: !926, size: 32, align: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1303, file: !1089, line: 151, baseType: !926, size: 32, align: 32, offset: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1303, file: !1089, line: 157, baseType: !926, size: 32, align: 32, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1303, file: !1089, line: 159, baseType: !1286, size: 64, align: 64, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1303, file: !1089, line: 161, baseType: !1310, size: 64, align: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1089, line: 117, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1089, line: 100, size: 832, align: 64, elements: !1313)
!1313 = !{!1314, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1312, file: !1089, line: 105, baseType: !1315, size: 256, align: 64)
!1315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1316, size: 256, align: 64, elements: !1138)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1159, line: 238, baseType: !1318)
!1318 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1159, line: 238, flags: DIFlagFwdDecl)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1312, file: !1089, line: 110, baseType: !926, size: 32, align: 32, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1312, file: !1089, line: 111, baseType: !926, size: 32, align: 32, offset: 288)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1312, file: !1089, line: 111, baseType: !926, size: 32, align: 32, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1312, file: !1089, line: 112, baseType: !1135, size: 256, align: 32, offset: 352)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1312, file: !1089, line: 113, baseType: !1141, size: 128, align: 32, offset: 608)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1312, file: !1089, line: 114, baseType: !926, size: 32, align: 32, offset: 736)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1312, file: !1089, line: 115, baseType: !926, size: 32, align: 32, offset: 768)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1312, file: !1089, line: 116, baseType: !926, size: 32, align: 32, offset: 800)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1303, file: !1089, line: 163, baseType: !962, size: 64, align: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1303, file: !1089, line: 165, baseType: !1329, size: 128, align: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1089, line: 122, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1089, line: 119, size: 128, align: 64, elements: !1331)
!1331 = !{!1332, !1333}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1330, file: !1089, line: 120, baseType: !1152, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1330, file: !1089, line: 121, baseType: !1286, size: 64, align: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1303, file: !1089, line: 166, baseType: !1335, size: 128, align: 64, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1089, line: 127, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1089, line: 124, size: 128, align: 64, elements: !1337)
!1337 = !{!1338, !1411}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1336, file: !1089, line: 125, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1343)
!1343 = !{!1344, !1345, !1369, !1373, !1374, !1408, !1409, !1410}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1342, file: !57, line: 5751, baseType: !949, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1342, file: !57, line: 5756, baseType: !1346, size: 64, align: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1349)
!1349 = !{!1350, !1351, !1354, !1355, !1356, !1360, !1364, !1368}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1348, file: !57, line: 5797, baseType: !955, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1348, file: !57, line: 5804, baseType: !1352, size: 64, align: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1348, file: !57, line: 5815, baseType: !949, size: 64, align: 64, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1348, file: !57, line: 5825, baseType: !926, size: 32, align: 32, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1348, file: !57, line: 5826, baseType: !1357, size: 64, align: 64, offset: 256)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!926, !1340}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1348, file: !57, line: 5827, baseType: !1361, size: 64, align: 64, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{!926, !1340, !1152}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1348, file: !57, line: 5828, baseType: !1365, size: 64, align: 64, offset: 384)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{null, !1340}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1348, file: !57, line: 5829, baseType: !1365, size: 64, align: 64, offset: 448)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1342, file: !57, line: 5762, baseType: !1370, size: 64, align: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1372)
!1372 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1342, file: !57, line: 5768, baseType: !962, size: 64, align: 64, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1342, file: !57, line: 5775, baseType: !1375, size: 64, align: 64, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1377, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1377, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1377, file: !57, line: 3948, baseType: !934, size: 32, align: 32, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1377, file: !57, line: 3958, baseType: !1104, size: 64, align: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1377, file: !57, line: 3962, baseType: !926, size: 32, align: 32, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1377, file: !57, line: 3968, baseType: !926, size: 32, align: 32, offset: 224)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1377, file: !57, line: 3973, baseType: !976, size: 64, align: 64, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1377, file: !57, line: 3986, baseType: !926, size: 32, align: 32, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1377, file: !57, line: 3999, baseType: !926, size: 32, align: 32, offset: 352)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1377, file: !57, line: 4004, baseType: !926, size: 32, align: 32, offset: 384)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1377, file: !57, line: 4005, baseType: !926, size: 32, align: 32, offset: 416)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1377, file: !57, line: 4010, baseType: !926, size: 32, align: 32, offset: 448)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1377, file: !57, line: 4011, baseType: !926, size: 32, align: 32, offset: 480)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1377, file: !57, line: 4020, baseType: !982, size: 64, align: 32, offset: 512)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1377, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1377, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1377, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1377, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1377, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1377, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1377, file: !57, line: 4039, baseType: !926, size: 32, align: 32, offset: 768)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1377, file: !57, line: 4046, baseType: !1060, size: 64, align: 64, offset: 832)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1377, file: !57, line: 4050, baseType: !926, size: 32, align: 32, offset: 896)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1377, file: !57, line: 4054, baseType: !926, size: 32, align: 32, offset: 928)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1377, file: !57, line: 4061, baseType: !926, size: 32, align: 32, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1377, file: !57, line: 4065, baseType: !926, size: 32, align: 32, offset: 992)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1377, file: !57, line: 4073, baseType: !926, size: 32, align: 32, offset: 1024)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1377, file: !57, line: 4080, baseType: !926, size: 32, align: 32, offset: 1056)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1377, file: !57, line: 4084, baseType: !926, size: 32, align: 32, offset: 1088)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1342, file: !57, line: 5781, baseType: !1375, size: 64, align: 64, offset: 320)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1342, file: !57, line: 5787, baseType: !982, size: 64, align: 32, offset: 384)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1342, file: !57, line: 5793, baseType: !982, size: 64, align: 32, offset: 448)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1336, file: !1089, line: 126, baseType: !926, size: 32, align: 32, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1303, file: !1089, line: 172, baseType: !1152, size: 64, align: 64, offset: 576)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1303, file: !1089, line: 177, baseType: !1104, size: 64, align: 64, offset: 640)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1303, file: !1089, line: 178, baseType: !927, size: 32, align: 32, offset: 704)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1303, file: !1089, line: 180, baseType: !962, size: 64, align: 64, offset: 768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1303, file: !1089, line: 185, baseType: !926, size: 32, align: 32, offset: 832)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1303, file: !1089, line: 190, baseType: !962, size: 64, align: 64, offset: 896)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1303, file: !1089, line: 195, baseType: !926, size: 32, align: 32, offset: 960)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1303, file: !1089, line: 200, baseType: !1152, size: 64, align: 64, offset: 1024)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1303, file: !1089, line: 201, baseType: !926, size: 32, align: 32, offset: 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1303, file: !1089, line: 202, baseType: !1286, size: 64, align: 64, offset: 1152)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1303, file: !1089, line: 203, baseType: !926, size: 32, align: 32, offset: 1216)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1303, file: !1089, line: 205, baseType: !926, size: 32, align: 32, offset: 1248)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1303, file: !1089, line: 206, baseType: !926, size: 32, align: 32, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1303, file: !1089, line: 209, baseType: !1262, size: 64, align: 64, offset: 1344)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1303, file: !1089, line: 212, baseType: !1262, size: 64, align: 64, offset: 1408)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1303, file: !1089, line: 213, baseType: !1286, size: 64, align: 64, offset: 1472)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1303, file: !1089, line: 215, baseType: !926, size: 32, align: 32, offset: 1536)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1303, file: !1089, line: 217, baseType: !926, size: 32, align: 32, offset: 1568)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1303, file: !1089, line: 220, baseType: !926, size: 32, align: 32, offset: 1600)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !946, file: !57, line: 1598, baseType: !962, size: 64, align: 64, offset: 384)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !946, file: !57, line: 1606, baseType: !976, size: 64, align: 64, offset: 448)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !946, file: !57, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !946, file: !57, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !946, file: !57, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !946, file: !57, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !946, file: !57, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !946, file: !57, line: 1657, baseType: !1104, size: 64, align: 64, offset: 704)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !946, file: !57, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !946, file: !57, line: 1679, baseType: !982, size: 64, align: 32, offset: 800)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !946, file: !57, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !946, file: !57, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !946, file: !57, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !946, file: !57, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !946, file: !57, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !946, file: !57, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !946, file: !57, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !946, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !946, file: !57, line: 1791, baseType: !1450, size: 64, align: 64, offset: 1152)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{null, !1453, !1186, !1268, !926, !926, !926}
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !946, file: !57, line: 1808, baseType: !1455, size: 64, align: 64, offset: 1216)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!516, !1453, !1049}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !946, file: !57, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !946, file: !57, line: 1825, baseType: !1460, size: 32, align: 32, offset: 1312)
!1460 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !946, file: !57, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !946, file: !57, line: 1838, baseType: !1460, size: 32, align: 32, offset: 1376)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !946, file: !57, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !946, file: !57, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !946, file: !57, line: 1861, baseType: !1460, size: 32, align: 32, offset: 1472)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !946, file: !57, line: 1868, baseType: !1460, size: 32, align: 32, offset: 1504)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !946, file: !57, line: 1875, baseType: !1460, size: 32, align: 32, offset: 1536)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !946, file: !57, line: 1882, baseType: !1460, size: 32, align: 32, offset: 1568)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !946, file: !57, line: 1889, baseType: !1460, size: 32, align: 32, offset: 1600)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !946, file: !57, line: 1896, baseType: !1460, size: 32, align: 32, offset: 1632)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !946, file: !57, line: 1903, baseType: !1460, size: 32, align: 32, offset: 1664)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !946, file: !57, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !946, file: !57, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !946, file: !57, line: 1926, baseType: !1268, size: 64, align: 64, offset: 1792)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !946, file: !57, line: 1935, baseType: !982, size: 64, align: 32, offset: 1856)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !946, file: !57, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !946, file: !57, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !946, file: !57, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !946, file: !57, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !946, file: !57, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !946, file: !57, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !946, file: !57, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !946, file: !57, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !946, file: !57, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !946, file: !57, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !946, file: !57, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !946, file: !57, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !946, file: !57, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !946, file: !57, line: 2054, baseType: !1490, size: 64, align: 64, offset: 2368)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !946, file: !57, line: 2061, baseType: !1490, size: 64, align: 64, offset: 2432)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !946, file: !57, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !946, file: !57, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !946, file: !57, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !946, file: !57, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !946, file: !57, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !946, file: !57, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !946, file: !57, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !946, file: !57, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !946, file: !57, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !946, file: !57, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !946, file: !57, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !946, file: !57, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !946, file: !57, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !946, file: !57, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !946, file: !57, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !946, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !946, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !946, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !946, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !946, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !946, file: !57, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !946, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !946, file: !57, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !946, file: !57, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !946, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !946, file: !57, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !946, file: !57, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !946, file: !57, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !946, file: !57, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !946, file: !57, line: 2263, baseType: !1060, size: 64, align: 64, offset: 3456)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !946, file: !57, line: 2270, baseType: !1060, size: 64, align: 64, offset: 3520)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !946, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !946, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !946, file: !57, line: 2367, baseType: !1526, size: 64, align: 64, offset: 3648)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{!926, !1453, !1286, !926}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !946, file: !57, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !946, file: !57, line: 2386, baseType: !1460, size: 32, align: 32, offset: 3744)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !946, file: !57, line: 2387, baseType: !1460, size: 32, align: 32, offset: 3776)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !946, file: !57, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !946, file: !57, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !946, file: !57, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !946, file: !57, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !946, file: !57, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !946, file: !57, line: 2423, baseType: !1538, size: 64, align: 64, offset: 3968)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1545}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1540, file: !57, line: 827, baseType: !926, size: 32, align: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1540, file: !57, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1540, file: !57, line: 829, baseType: !926, size: 32, align: 32, offset: 64)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1540, file: !57, line: 830, baseType: !1460, size: 32, align: 32, offset: 96)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !946, file: !57, line: 2430, baseType: !976, size: 64, align: 64, offset: 4032)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !946, file: !57, line: 2437, baseType: !976, size: 64, align: 64, offset: 4096)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !946, file: !57, line: 2444, baseType: !1460, size: 32, align: 32, offset: 4160)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !946, file: !57, line: 2451, baseType: !1460, size: 32, align: 32, offset: 4192)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !946, file: !57, line: 2458, baseType: !926, size: 32, align: 32, offset: 4224)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !946, file: !57, line: 2469, baseType: !926, size: 32, align: 32, offset: 4256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !946, file: !57, line: 2475, baseType: !926, size: 32, align: 32, offset: 4288)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !946, file: !57, line: 2481, baseType: !926, size: 32, align: 32, offset: 4320)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !946, file: !57, line: 2485, baseType: !926, size: 32, align: 32, offset: 4352)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !946, file: !57, line: 2489, baseType: !926, size: 32, align: 32, offset: 4384)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !946, file: !57, line: 2493, baseType: !926, size: 32, align: 32, offset: 4416)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !946, file: !57, line: 2501, baseType: !926, size: 32, align: 32, offset: 4448)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !946, file: !57, line: 2506, baseType: !926, size: 32, align: 32, offset: 4480)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !946, file: !57, line: 2510, baseType: !926, size: 32, align: 32, offset: 4512)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !946, file: !57, line: 2514, baseType: !976, size: 64, align: 64, offset: 4544)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !946, file: !57, line: 2528, baseType: !1562, size: 64, align: 64, offset: 4608)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{null, !1453, !962, !926, !926}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !946, file: !57, line: 2534, baseType: !926, size: 32, align: 32, offset: 4672)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !946, file: !57, line: 2545, baseType: !926, size: 32, align: 32, offset: 4704)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !946, file: !57, line: 2547, baseType: !926, size: 32, align: 32, offset: 4736)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !946, file: !57, line: 2549, baseType: !926, size: 32, align: 32, offset: 4768)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !946, file: !57, line: 2551, baseType: !926, size: 32, align: 32, offset: 4800)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !946, file: !57, line: 2553, baseType: !926, size: 32, align: 32, offset: 4832)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !946, file: !57, line: 2555, baseType: !926, size: 32, align: 32, offset: 4864)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !946, file: !57, line: 2557, baseType: !926, size: 32, align: 32, offset: 4896)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !946, file: !57, line: 2559, baseType: !926, size: 32, align: 32, offset: 4928)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !946, file: !57, line: 2563, baseType: !926, size: 32, align: 32, offset: 4960)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !946, file: !57, line: 2571, baseType: !1144, size: 64, align: 64, offset: 4992)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !946, file: !57, line: 2579, baseType: !1144, size: 64, align: 64, offset: 5056)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !946, file: !57, line: 2586, baseType: !926, size: 32, align: 32, offset: 5120)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !946, file: !57, line: 2615, baseType: !926, size: 32, align: 32, offset: 5152)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !946, file: !57, line: 2627, baseType: !926, size: 32, align: 32, offset: 5184)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !946, file: !57, line: 2637, baseType: !926, size: 32, align: 32, offset: 5216)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !946, file: !57, line: 2681, baseType: !926, size: 32, align: 32, offset: 5248)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !946, file: !57, line: 2709, baseType: !976, size: 64, align: 64, offset: 5312)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !946, file: !57, line: 2716, baseType: !1584, size: 64, align: 64, offset: 5376)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591, !1592, !1593, !1594, !1598, !1602, !1603, !1604, !1605, !2506, !2507, !2508, !2509, !2510}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1586, file: !57, line: 3642, baseType: !955, size: 64, align: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1586, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1586, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1586, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1586, file: !57, line: 3669, baseType: !926, size: 32, align: 32, offset: 160)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1586, file: !57, line: 3682, baseType: !1283, size: 64, align: 64, offset: 192)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1586, file: !57, line: 3698, baseType: !1595, size: 64, align: 64, offset: 256)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DISubroutineType(types: !1597)
!1597 = !{!926, !944, !1092, !934}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1586, file: !57, line: 3712, baseType: !1599, size: 64, align: 64, offset: 320)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!926, !944, !926, !1092, !934}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1586, file: !57, line: 3726, baseType: !1595, size: 64, align: 64, offset: 384)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1586, file: !57, line: 3737, baseType: !1077, size: 64, align: 64, offset: 448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1586, file: !57, line: 3746, baseType: !926, size: 32, align: 32, offset: 512)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1586, file: !57, line: 3757, baseType: !1606, size: 64, align: 64, offset: 576)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{null, !1609}
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1611, line: 81, size: 86208, align: 64, elements: !1612)
!1611 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1612 = !{!1613, !1615, !1616, !1617, !1618, !1622, !1623, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1670, !1671, !1726, !1728, !1729, !1730, !1731, !1732, !1743, !1744, !1745, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1761, !1763, !1765, !1766, !1767, !1768, !1769, !1770, !1775, !1777, !1778, !1779, !1780, !1781, !1782, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1809, !1810, !1811, !1812, !1828, !1835, !1847, !1863, !1885, !1925, !1938, !1965, !1980, !1994, !2007, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2028, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2041, !2043, !2044, !2045, !2046, !2047, !2048, !2051, !2053, !2055, !2056, !2059, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2126, !2127, !2129, !2130, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2152, !2153, !2154, !2157, !2158, !2159, !2160, !2162, !2164, !2165, !2166, !2167, !2168, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2250, !2251, !2252, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2381, !2382, !2383, !2384, !2388, !2389, !2393, !2397, !2401, !2402, !2407, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2422, !2423, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2441, !2442, !2443, !2493, !2494, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1610, file: !1611, line: 82, baseType: !1614, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1610, file: !1611, line: 84, baseType: !926, size: 32, align: 32, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1610, file: !1611, line: 84, baseType: !926, size: 32, align: 32, offset: 96)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1610, file: !1611, line: 85, baseType: !926, size: 32, align: 32, offset: 128)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1610, file: !1611, line: 86, baseType: !1619, size: 384, align: 32, offset: 160)
!1619 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 384, align: 32, elements: !1620)
!1620 = !{!1621}
!1621 = !DISubrange(count: 12)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1610, file: !1611, line: 87, baseType: !926, size: 32, align: 32, offset: 544)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1610, file: !1611, line: 90, baseType: !1624, size: 1088, align: 64, offset: 576)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !908, line: 35, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !908, line: 31, size: 1088, align: 64, elements: !1626)
!1626 = !{!1627, !1628, !1632}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1625, file: !908, line: 32, baseType: !1092, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1625, file: !908, line: 33, baseType: !1629, size: 512, align: 8, offset: 64)
!1629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, align: 8, elements: !1630)
!1630 = !{!1631}
!1631 = !DISubrange(count: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1625, file: !908, line: 34, baseType: !1629, size: 512, align: 8, offset: 576)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1610, file: !1611, line: 91, baseType: !1624, size: 1088, align: 64, offset: 1664)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1610, file: !1611, line: 92, baseType: !1624, size: 1088, align: 64, offset: 2752)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1610, file: !1611, line: 93, baseType: !1624, size: 1088, align: 64, offset: 3840)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1610, file: !1611, line: 98, baseType: !1453, size: 64, align: 64, offset: 4928)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1610, file: !1611, line: 100, baseType: !926, size: 32, align: 32, offset: 4992)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1610, file: !1611, line: 100, baseType: !926, size: 32, align: 32, offset: 5024)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1610, file: !1611, line: 101, baseType: !926, size: 32, align: 32, offset: 5056)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1610, file: !1611, line: 102, baseType: !926, size: 32, align: 32, offset: 5088)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1610, file: !1611, line: 103, baseType: !976, size: 64, align: 64, offset: 5120)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1610, file: !1611, line: 104, baseType: !900, size: 32, align: 32, offset: 5184)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1610, file: !1611, line: 105, baseType: !926, size: 32, align: 32, offset: 5216)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1610, file: !1611, line: 106, baseType: !926, size: 32, align: 32, offset: 5248)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1610, file: !1611, line: 109, baseType: !926, size: 32, align: 32, offset: 5280)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1610, file: !1611, line: 110, baseType: !926, size: 32, align: 32, offset: 5312)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1610, file: !1611, line: 112, baseType: !56, size: 32, align: 32, offset: 5344)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1610, file: !1611, line: 113, baseType: !926, size: 32, align: 32, offset: 5376)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1610, file: !1611, line: 114, baseType: !926, size: 32, align: 32, offset: 5408)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1610, file: !1611, line: 115, baseType: !926, size: 32, align: 32, offset: 5440)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1610, file: !1611, line: 116, baseType: !926, size: 32, align: 32, offset: 5472)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1610, file: !1611, line: 117, baseType: !926, size: 32, align: 32, offset: 5504)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1610, file: !1611, line: 118, baseType: !926, size: 32, align: 32, offset: 5536)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1610, file: !1611, line: 119, baseType: !926, size: 32, align: 32, offset: 5568)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1610, file: !1611, line: 120, baseType: !926, size: 32, align: 32, offset: 5600)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1610, file: !1611, line: 124, baseType: !926, size: 32, align: 32, offset: 5632)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1610, file: !1611, line: 125, baseType: !926, size: 32, align: 32, offset: 5664)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1610, file: !1611, line: 126, baseType: !926, size: 32, align: 32, offset: 5696)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1610, file: !1611, line: 127, baseType: !926, size: 32, align: 32, offset: 5728)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1610, file: !1611, line: 128, baseType: !926, size: 32, align: 32, offset: 5760)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1610, file: !1611, line: 129, baseType: !926, size: 32, align: 32, offset: 5792)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1610, file: !1611, line: 129, baseType: !926, size: 32, align: 32, offset: 5824)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1610, file: !1611, line: 130, baseType: !926, size: 32, align: 32, offset: 5856)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1610, file: !1611, line: 131, baseType: !926, size: 32, align: 32, offset: 5888)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1610, file: !1611, line: 132, baseType: !926, size: 32, align: 32, offset: 5920)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1610, file: !1611, line: 132, baseType: !926, size: 32, align: 32, offset: 5952)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1610, file: !1611, line: 133, baseType: !926, size: 32, align: 32, offset: 5984)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1610, file: !1611, line: 134, baseType: !1669, size: 64, align: 64, offset: 6016)
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1263, line: 149, baseType: !977)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1610, file: !1611, line: 135, baseType: !1669, size: 64, align: 64, offset: 6080)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1610, file: !1611, line: 136, baseType: !1672, size: 64, align: 64, offset: 6144)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1674, line: 91, baseType: !1675)
!1674 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1674, line: 45, size: 2624, align: 64, elements: !1676)
!1676 = !{!1677, !1679, !1690, !1691, !1692, !1694, !1700, !1701, !1703, !1704, !1705, !1706, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1675, file: !1674, line: 46, baseType: !1678, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
