; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--subtitles.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--subtitles.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FFTextReader = type { i32, %struct.AVIOContext*, [8 x i8], i32, i32, %struct.AVIOContext }
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.AVPacketSideData = type { i8*, i32, i32 }
%struct.FFDemuxSubtitlesQueue = type { %struct.AVPacket*, i32, i32, i32, i32, i32 }

!858 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!859 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!860 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!861 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!862 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!863 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!864 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!865 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!866 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!867 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!868 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!869 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!870 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!871 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !40, line: 3865, size: 32, align: 32, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!874 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!875 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!876 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !40, line: 1534, size: 32, align: 32, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884}
!879 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!880 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!881 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!882 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!883 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!884 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !40, line: 810, size: 32, align: 32, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !40, line: 798, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905}
!899 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!900 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!901 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!902 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!903 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!904 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!905 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!906 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !907, line: 782, size: 32, align: 32, elements: !908)
!907 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!908 = !{!909, !910, !911, !912, !913, !914}
!909 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!910 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!911 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!912 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!913 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!914 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !40, line: 5085, size: 32, align: 32, elements: !916)
!916 = !{!917, !918, !919, !920}
!917 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!918 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!919 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!920 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !907, line: 1315, size: 32, align: 32, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!924 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!925 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!928 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!929 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!930 = !{i32 2, !"Dwarf Version", i32 4}
!931 = !{i32 2, !"Debug Info Version", i32 3}
!932 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!933 = distinct !DISubprogram(name: "ff_text_init_avio", scope: !934, file: !934, line: 27, type: !935, isLocal: false, isDefinition: true, scopeLine: 28, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!934 = !DIFile(filename: "libavformat/subtitles.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = !DISubroutineType(types: !936)
!936 = !{null, !927, !937, !943}
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTextReader", file: !34, line: 46, baseType: !939)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 40, size: 2368, align: 64, elements: !940)
!940 = !{!941, !942, !1058, !1062, !1063, !1064}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !939, file: !34, line: 41, baseType: !928, size: 32, align: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !939, file: !34, line: 42, baseType: !943, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !946)
!946 = !{!947, !991, !994, !995, !996, !997, !998, !1005, !1006, !1012, !1013, !1014, !1015, !1016, !1018, !1019, !1025, !1026, !1030, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1048, !1049, !1050, !1051, !1055, !1056, !1057}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !945, file: !25, line: 174, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !952)
!952 = !{!953, !957, !961, !965, !966, !967, !968, !972, !978, !980, !984}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !951, file: !4, line: 72, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !951, file: !4, line: 78, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!954, !927}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !951, file: !4, line: 85, baseType: !962, size: 64, align: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !951, file: !4, line: 93, baseType: !928, size: 32, align: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !951, file: !4, line: 99, baseType: !928, size: 32, align: 32, offset: 224)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !951, file: !4, line: 108, baseType: !928, size: 32, align: 32, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !951, file: !4, line: 113, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!927, !927, !927}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !951, file: !4, line: 123, baseType: !973, size: 64, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !951, file: !4, line: 130, baseType: !979, size: 32, align: 32, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !951, file: !4, line: 136, baseType: !981, size: 64, align: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!979, !927}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !951, file: !4, line: 142, baseType: !985, size: 64, align: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!928, !988, !927, !954, !928}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !945, file: !25, line: 226, baseType: !992, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !945, file: !25, line: 227, baseType: !928, size: 32, align: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !945, file: !25, line: 228, baseType: !992, size: 64, align: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !945, file: !25, line: 229, baseType: !992, size: 64, align: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !945, file: !25, line: 233, baseType: !927, size: 64, align: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !945, file: !25, line: 235, baseType: !999, size: 64, align: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!928, !927, !1002, !928}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1004, line: 48, baseType: !993)
!1004 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !945, file: !25, line: 236, baseType: !999, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !945, file: !25, line: 237, baseType: !1007, size: 64, align: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1010, !927, !1010, !928}
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1004, line: 40, baseType: !1011)
!1011 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !945, file: !25, line: 238, baseType: !1010, size: 64, align: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !945, file: !25, line: 239, baseType: !928, size: 32, align: 32, offset: 640)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !945, file: !25, line: 240, baseType: !928, size: 32, align: 32, offset: 672)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !945, file: !25, line: 241, baseType: !928, size: 32, align: 32, offset: 704)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !945, file: !25, line: 242, baseType: !1017, size: 64, align: 64, offset: 768)
!1017 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !945, file: !25, line: 243, baseType: !992, size: 64, align: 64, offset: 832)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !945, file: !25, line: 244, baseType: !1020, size: 64, align: 64, offset: 896)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1017, !1017, !1023, !929}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !945, file: !25, line: 245, baseType: !928, size: 32, align: 32, offset: 960)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !945, file: !25, line: 249, baseType: !1027, size: 64, align: 64, offset: 1024)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!928, !927, !928}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !945, file: !25, line: 255, baseType: !1031, size: 64, align: 64, offset: 1088)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1010, !927, !928, !1010, !928}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !945, file: !25, line: 260, baseType: !928, size: 32, align: 32, offset: 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !945, file: !25, line: 266, baseType: !1010, size: 64, align: 64, offset: 1216)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !945, file: !25, line: 273, baseType: !928, size: 32, align: 32, offset: 1280)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !945, file: !25, line: 279, baseType: !1010, size: 64, align: 64, offset: 1344)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !945, file: !25, line: 285, baseType: !928, size: 32, align: 32, offset: 1408)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !945, file: !25, line: 291, baseType: !928, size: 32, align: 32, offset: 1440)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !945, file: !25, line: 298, baseType: !928, size: 32, align: 32, offset: 1472)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !945, file: !25, line: 304, baseType: !928, size: 32, align: 32, offset: 1504)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !945, file: !25, line: 309, baseType: !954, size: 64, align: 64, offset: 1536)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !945, file: !25, line: 314, baseType: !954, size: 64, align: 64, offset: 1600)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !945, file: !25, line: 319, baseType: !1045, size: 64, align: 64, offset: 1664)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!928, !927, !1002, !928, !24, !1010}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !945, file: !25, line: 326, baseType: !928, size: 32, align: 32, offset: 1728)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !945, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !945, file: !25, line: 332, baseType: !1010, size: 64, align: 64, offset: 1792)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !945, file: !25, line: 338, baseType: !1052, size: 64, align: 64, offset: 1856)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!928, !927}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !945, file: !25, line: 340, baseType: !1010, size: 64, align: 64, offset: 1920)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !945, file: !25, line: 346, baseType: !992, size: 64, align: 64, offset: 1984)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !945, file: !25, line: 351, baseType: !928, size: 32, align: 32, offset: 2048)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !939, file: !34, line: 43, baseType: !1059, size: 64, align: 8, offset: 128)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 64, align: 8, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 8)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pos", scope: !939, file: !34, line: 44, baseType: !928, size: 32, align: 32, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !939, file: !34, line: 44, baseType: !928, size: 32, align: 32, offset: 224)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "buf_pb", scope: !939, file: !34, line: 45, baseType: !944, size: 2112, align: 64, offset: 256)
!1065 = !{}
!1066 = !DILocalVariable(name: "s", arg: 1, scope: !933, file: !934, line: 27, type: !927)
!1067 = !DIExpression()
!1068 = !DILocation(line: 27, column: 30, scope: !933)
!1069 = !DILocalVariable(name: "r", arg: 2, scope: !933, file: !934, line: 27, type: !937)
!1070 = !DILocation(line: 27, column: 47, scope: !933)
!1071 = !DILocalVariable(name: "pb", arg: 3, scope: !933, file: !934, line: 27, type: !943)
!1072 = !DILocation(line: 27, column: 63, scope: !933)
!1073 = !DILocalVariable(name: "i", scope: !933, file: !934, line: 29, type: !928)
!1074 = !DILocation(line: 29, column: 9, scope: !933)
!1075 = !DILocation(line: 30, column: 13, scope: !933)
!1076 = !DILocation(line: 30, column: 5, scope: !933)
!1077 = !DILocation(line: 30, column: 8, scope: !933)
!1078 = !DILocation(line: 30, column: 11, scope: !933)
!1079 = !DILocation(line: 31, column: 18, scope: !933)
!1080 = !DILocation(line: 31, column: 21, scope: !933)
!1081 = !DILocation(line: 31, column: 29, scope: !933)
!1082 = !DILocation(line: 31, column: 5, scope: !933)
!1083 = !DILocation(line: 31, column: 8, scope: !933)
!1084 = !DILocation(line: 31, column: 16, scope: !933)
!1085 = !DILocation(line: 32, column: 5, scope: !933)
!1086 = !DILocation(line: 32, column: 8, scope: !933)
!1087 = !DILocation(line: 32, column: 13, scope: !933)
!1088 = !DILocation(line: 33, column: 12, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !933, file: !934, line: 33, column: 5)
!1090 = !DILocation(line: 33, column: 10, scope: !1089)
!1091 = !DILocation(line: 33, column: 17, scope: !1092)
!1092 = !DILexicalBlockFile(scope: !1093, file: !934, discriminator: 1)
!1093 = distinct !DILexicalBlock(scope: !1089, file: !934, line: 33, column: 5)
!1094 = !DILocation(line: 33, column: 19, scope: !1092)
!1095 = !DILocation(line: 33, column: 5, scope: !1092)
!1096 = !DILocation(line: 34, column: 40, scope: !1093)
!1097 = !DILocation(line: 34, column: 43, scope: !1093)
!1098 = !DILocation(line: 34, column: 32, scope: !1093)
!1099 = !DILocation(line: 34, column: 16, scope: !1093)
!1100 = !DILocation(line: 34, column: 19, scope: !1093)
!1101 = !DILocation(line: 34, column: 26, scope: !1093)
!1102 = !DILocation(line: 34, column: 9, scope: !1093)
!1103 = !DILocation(line: 34, column: 12, scope: !1093)
!1104 = !DILocation(line: 34, column: 30, scope: !1093)
!1105 = !DILocation(line: 33, column: 25, scope: !1106)
!1106 = !DILexicalBlockFile(scope: !1093, file: !934, discriminator: 2)
!1107 = !DILocation(line: 33, column: 5, scope: !1106)
!1108 = distinct !{!1108, !1109}
!1109 = !DILocation(line: 33, column: 5, scope: !933)
!1110 = !DILocation(line: 35, column: 29, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !933, file: !934, line: 35, column: 9)
!1112 = !DILocation(line: 35, column: 32, scope: !1111)
!1113 = !DILocation(line: 35, column: 9, scope: !1111)
!1114 = !DILocation(line: 35, column: 40, scope: !1111)
!1115 = !DILocation(line: 35, column: 9, scope: !933)
!1116 = !DILocation(line: 36, column: 9, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1111, file: !934, line: 35, column: 46)
!1118 = !DILocation(line: 36, column: 12, scope: !1117)
!1119 = !DILocation(line: 36, column: 17, scope: !1117)
!1120 = !DILocation(line: 37, column: 9, scope: !1117)
!1121 = !DILocation(line: 37, column: 12, scope: !1117)
!1122 = !DILocation(line: 37, column: 20, scope: !1117)
!1123 = !DILocation(line: 38, column: 5, scope: !1117)
!1124 = !DILocation(line: 38, column: 36, scope: !1125)
!1125 = !DILexicalBlockFile(scope: !1126, file: !934, discriminator: 1)
!1126 = distinct !DILexicalBlock(scope: !1111, file: !934, line: 38, column: 16)
!1127 = !DILocation(line: 38, column: 39, scope: !1125)
!1128 = !DILocation(line: 38, column: 16, scope: !1125)
!1129 = !DILocation(line: 38, column: 47, scope: !1125)
!1130 = !DILocation(line: 39, column: 9, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1126, file: !934, line: 38, column: 53)
!1132 = !DILocation(line: 39, column: 12, scope: !1131)
!1133 = !DILocation(line: 39, column: 17, scope: !1131)
!1134 = !DILocation(line: 40, column: 9, scope: !1131)
!1135 = !DILocation(line: 40, column: 12, scope: !1131)
!1136 = !DILocation(line: 40, column: 20, scope: !1131)
!1137 = !DILocation(line: 41, column: 5, scope: !1131)
!1138 = !DILocation(line: 42, column: 40, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1126, file: !934, line: 41, column: 12)
!1140 = !DILocation(line: 42, column: 43, scope: !1139)
!1141 = !DILocation(line: 42, column: 32, scope: !1139)
!1142 = !DILocation(line: 42, column: 16, scope: !1139)
!1143 = !DILocation(line: 42, column: 19, scope: !1139)
!1144 = !DILocation(line: 42, column: 26, scope: !1139)
!1145 = !DILocation(line: 42, column: 9, scope: !1139)
!1146 = !DILocation(line: 42, column: 12, scope: !1139)
!1147 = !DILocation(line: 42, column: 30, scope: !1139)
!1148 = !DILocation(line: 43, column: 37, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1139, file: !934, line: 43, column: 13)
!1150 = !DILocation(line: 43, column: 40, scope: !1149)
!1151 = !DILocation(line: 43, column: 13, scope: !1149)
!1152 = !DILocation(line: 43, column: 48, scope: !1149)
!1153 = !DILocation(line: 43, column: 13, scope: !1139)
!1154 = !DILocation(line: 45, column: 13, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1149, file: !934, line: 43, column: 54)
!1156 = !DILocation(line: 45, column: 16, scope: !1155)
!1157 = !DILocation(line: 45, column: 24, scope: !1155)
!1158 = !DILocation(line: 46, column: 9, scope: !1155)
!1159 = !DILocation(line: 48, column: 9, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !933, file: !934, line: 48, column: 9)
!1161 = !DILocation(line: 48, column: 11, scope: !1160)
!1162 = !DILocation(line: 48, column: 15, scope: !1163)
!1163 = !DILexicalBlockFile(scope: !1160, file: !934, discriminator: 1)
!1164 = !DILocation(line: 48, column: 18, scope: !1163)
!1165 = !DILocation(line: 48, column: 23, scope: !1163)
!1166 = !DILocation(line: 48, column: 37, scope: !1163)
!1167 = !DILocation(line: 48, column: 40, scope: !1168)
!1168 = !DILexicalBlockFile(scope: !1160, file: !934, discriminator: 2)
!1169 = !DILocation(line: 48, column: 43, scope: !1168)
!1170 = !DILocation(line: 48, column: 48, scope: !1168)
!1171 = !DILocation(line: 48, column: 9, scope: !1168)
!1172 = !DILocation(line: 49, column: 16, scope: !1160)
!1173 = !DILocation(line: 49, column: 9, scope: !1160)
!1174 = !DILocation(line: 51, column: 1, scope: !933)
!1175 = distinct !DISubprogram(name: "ff_text_init_buf", scope: !934, file: !934, line: 53, type: !1176, isLocal: false, isDefinition: true, scopeLine: 54, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{null, !937, !927, !1178}
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1179, line: 216, baseType: !1017)
!1179 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1180 = !DILocalVariable(name: "r", arg: 1, scope: !1175, file: !934, line: 53, type: !937)
!1181 = !DILocation(line: 53, column: 37, scope: !1175)
!1182 = !DILocalVariable(name: "buf", arg: 2, scope: !1175, file: !934, line: 53, type: !927)
!1183 = !DILocation(line: 53, column: 46, scope: !1175)
!1184 = !DILocalVariable(name: "size", arg: 3, scope: !1175, file: !934, line: 53, type: !1178)
!1185 = !DILocation(line: 53, column: 58, scope: !1175)
!1186 = !DILocation(line: 55, column: 13, scope: !1175)
!1187 = !DILocation(line: 55, column: 16, scope: !1175)
!1188 = !DILocation(line: 55, column: 5, scope: !1175)
!1189 = !DILocation(line: 56, column: 24, scope: !1175)
!1190 = !DILocation(line: 56, column: 27, scope: !1175)
!1191 = !DILocation(line: 56, column: 35, scope: !1175)
!1192 = !DILocation(line: 56, column: 40, scope: !1175)
!1193 = !DILocation(line: 56, column: 5, scope: !1175)
!1194 = !DILocation(line: 57, column: 28, scope: !1175)
!1195 = !DILocation(line: 57, column: 32, scope: !1175)
!1196 = !DILocation(line: 57, column: 35, scope: !1175)
!1197 = !DILocation(line: 57, column: 5, scope: !1175)
!1198 = !DILocation(line: 58, column: 1, scope: !1175)
!1199 = distinct !DISubprogram(name: "ff_text_pos", scope: !934, file: !934, line: 60, type: !1200, isLocal: false, isDefinition: true, scopeLine: 61, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!1010, !937}
!1202 = !DILocalVariable(name: "s", arg: 1, scope: !1203, file: !25, line: 557, type: !943)
!1203 = distinct !DISubprogram(name: "avio_tell", scope: !25, file: !25, line: 557, type: !1204, isLocal: true, isDefinition: true, scopeLine: 558, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!1010, !943}
!1206 = !DILocation(line: 557, column: 77, scope: !1203, inlinedAt: !1207)
!1207 = distinct !DILocation(line: 62, column: 12, scope: !1199)
!1208 = !DILocalVariable(name: "r", arg: 1, scope: !1199, file: !934, line: 60, type: !937)
!1209 = !DILocation(line: 60, column: 35, scope: !1199)
!1210 = !DILocation(line: 62, column: 22, scope: !1199)
!1211 = !DILocation(line: 62, column: 25, scope: !1199)
!1212 = !DILocation(line: 62, column: 12, scope: !1199)
!1213 = !DILocation(line: 559, column: 22, scope: !1203, inlinedAt: !1207)
!1214 = !DILocation(line: 559, column: 12, scope: !1203, inlinedAt: !1207)
!1215 = !DILocation(line: 62, column: 31, scope: !1199)
!1216 = !DILocation(line: 62, column: 34, scope: !1199)
!1217 = !DILocation(line: 62, column: 29, scope: !1199)
!1218 = !DILocation(line: 62, column: 44, scope: !1199)
!1219 = !DILocation(line: 62, column: 47, scope: !1199)
!1220 = !DILocation(line: 62, column: 42, scope: !1199)
!1221 = !DILocation(line: 62, column: 5, scope: !1199)
!1222 = distinct !DISubprogram(name: "ff_text_r8", scope: !934, file: !934, line: 65, type: !1223, isLocal: false, isDefinition: true, scopeLine: 66, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!928, !937}
!1225 = !DILocalVariable(name: "r", arg: 1, scope: !1222, file: !934, line: 65, type: !937)
!1226 = !DILocation(line: 65, column: 30, scope: !1222)
!1227 = !DILocalVariable(name: "val", scope: !1222, file: !934, line: 67, type: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1004, line: 51, baseType: !929)
!1229 = !DILocation(line: 67, column: 14, scope: !1222)
!1230 = !DILocalVariable(name: "tmp", scope: !1222, file: !934, line: 68, type: !1003)
!1231 = !DILocation(line: 68, column: 13, scope: !1222)
!1232 = !DILocation(line: 69, column: 9, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1222, file: !934, line: 69, column: 9)
!1234 = !DILocation(line: 69, column: 12, scope: !1233)
!1235 = !DILocation(line: 69, column: 22, scope: !1233)
!1236 = !DILocation(line: 69, column: 25, scope: !1233)
!1237 = !DILocation(line: 69, column: 20, scope: !1233)
!1238 = !DILocation(line: 69, column: 9, scope: !1222)
!1239 = !DILocation(line: 70, column: 23, scope: !1233)
!1240 = !DILocation(line: 70, column: 26, scope: !1233)
!1241 = !DILocation(line: 70, column: 33, scope: !1233)
!1242 = !DILocation(line: 70, column: 16, scope: !1233)
!1243 = !DILocation(line: 70, column: 19, scope: !1233)
!1244 = !DILocation(line: 70, column: 9, scope: !1233)
!1245 = !DILocation(line: 71, column: 9, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1222, file: !934, line: 71, column: 9)
!1247 = !DILocation(line: 71, column: 12, scope: !1246)
!1248 = !DILocation(line: 71, column: 17, scope: !1246)
!1249 = !DILocation(line: 71, column: 9, scope: !1222)
!1250 = !DILocation(line: 72, column: 25, scope: !1251)
!1251 = distinct !DILexicalBlock(scope: !1246, file: !934, line: 71, column: 32)
!1252 = !DILocation(line: 72, column: 28, scope: !1251)
!1253 = !DILocation(line: 72, column: 15, scope: !1251)
!1254 = !DILocation(line: 72, column: 13, scope: !1251)
!1255 = !DILocalVariable(name: "hi", scope: !1256, file: !934, line: 72, type: !929)
!1256 = distinct !DILexicalBlock(scope: !1251, file: !934, line: 72, column: 33)
!1257 = !DILocation(line: 72, column: 48, scope: !1256)
!1258 = !DILocation(line: 72, column: 53, scope: !1256)
!1259 = !DILocation(line: 72, column: 57, scope: !1256)
!1260 = !DILocation(line: 72, column: 71, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1256, file: !934, line: 72, column: 71)
!1262 = !DILocation(line: 72, column: 74, scope: !1261)
!1263 = !DILocation(line: 72, column: 71, scope: !1256)
!1264 = !DILocation(line: 72, column: 101, scope: !1265)
!1265 = !DILexicalBlockFile(scope: !1266, file: !934, discriminator: 1)
!1266 = distinct !DILexicalBlock(scope: !1261, file: !934, line: 72, column: 83)
!1267 = !DILocation(line: 72, column: 104, scope: !1265)
!1268 = !DILocation(line: 72, column: 91, scope: !1265)
!1269 = !DILocation(line: 72, column: 108, scope: !1265)
!1270 = !DILocation(line: 72, column: 89, scope: !1265)
!1271 = !DILocation(line: 72, column: 122, scope: !1265)
!1272 = !DILocation(line: 72, column: 126, scope: !1265)
!1273 = !DILocation(line: 72, column: 135, scope: !1265)
!1274 = !DILocation(line: 72, column: 138, scope: !1275)
!1275 = !DILexicalBlockFile(scope: !1276, file: !934, discriminator: 2)
!1276 = distinct !DILexicalBlock(scope: !1266, file: !934, line: 72, column: 122)
!1277 = !DILocation(line: 72, column: 141, scope: !1275)
!1278 = !DILocation(line: 72, column: 122, scope: !1275)
!1279 = !DILocation(line: 72, column: 151, scope: !1280)
!1280 = !DILexicalBlockFile(scope: !1276, file: !934, discriminator: 3)
!1281 = !DILocation(line: 72, column: 169, scope: !1282)
!1282 = !DILexicalBlockFile(scope: !1266, file: !934, discriminator: 4)
!1283 = !DILocation(line: 72, column: 171, scope: !1282)
!1284 = !DILocation(line: 72, column: 177, scope: !1282)
!1285 = !DILocation(line: 72, column: 165, scope: !1282)
!1286 = !DILocation(line: 72, column: 188, scope: !1282)
!1287 = !DILocation(line: 73, column: 5, scope: !1251)
!1288 = !DILocation(line: 73, column: 16, scope: !1289)
!1289 = !DILexicalBlockFile(scope: !1290, file: !934, discriminator: 1)
!1290 = distinct !DILexicalBlock(scope: !1246, file: !934, line: 73, column: 16)
!1291 = !DILocation(line: 73, column: 19, scope: !1289)
!1292 = !DILocation(line: 73, column: 24, scope: !1289)
!1293 = !DILocation(line: 74, column: 25, scope: !1294)
!1294 = distinct !DILexicalBlock(scope: !1290, file: !934, line: 73, column: 39)
!1295 = !DILocation(line: 74, column: 28, scope: !1294)
!1296 = !DILocation(line: 74, column: 15, scope: !1294)
!1297 = !DILocation(line: 74, column: 13, scope: !1294)
!1298 = !DILocalVariable(name: "hi", scope: !1299, file: !934, line: 74, type: !929)
!1299 = distinct !DILexicalBlock(scope: !1294, file: !934, line: 74, column: 33)
!1300 = !DILocation(line: 74, column: 48, scope: !1299)
!1301 = !DILocation(line: 74, column: 53, scope: !1299)
!1302 = !DILocation(line: 74, column: 57, scope: !1299)
!1303 = !DILocation(line: 74, column: 71, scope: !1304)
!1304 = distinct !DILexicalBlock(scope: !1299, file: !934, line: 74, column: 71)
!1305 = !DILocation(line: 74, column: 74, scope: !1304)
!1306 = !DILocation(line: 74, column: 71, scope: !1299)
!1307 = !DILocation(line: 74, column: 101, scope: !1308)
!1308 = !DILexicalBlockFile(scope: !1309, file: !934, discriminator: 1)
!1309 = distinct !DILexicalBlock(scope: !1304, file: !934, line: 74, column: 83)
!1310 = !DILocation(line: 74, column: 104, scope: !1308)
!1311 = !DILocation(line: 74, column: 91, scope: !1308)
!1312 = !DILocation(line: 74, column: 108, scope: !1308)
!1313 = !DILocation(line: 74, column: 89, scope: !1308)
!1314 = !DILocation(line: 74, column: 122, scope: !1308)
!1315 = !DILocation(line: 74, column: 126, scope: !1308)
!1316 = !DILocation(line: 74, column: 135, scope: !1308)
!1317 = !DILocation(line: 74, column: 138, scope: !1318)
!1318 = !DILexicalBlockFile(scope: !1319, file: !934, discriminator: 2)
!1319 = distinct !DILexicalBlock(scope: !1309, file: !934, line: 74, column: 122)
!1320 = !DILocation(line: 74, column: 141, scope: !1318)
!1321 = !DILocation(line: 74, column: 122, scope: !1318)
!1322 = !DILocation(line: 74, column: 151, scope: !1323)
!1323 = !DILexicalBlockFile(scope: !1319, file: !934, discriminator: 3)
!1324 = !DILocation(line: 74, column: 169, scope: !1325)
!1325 = !DILexicalBlockFile(scope: !1309, file: !934, discriminator: 4)
!1326 = !DILocation(line: 74, column: 171, scope: !1325)
!1327 = !DILocation(line: 74, column: 177, scope: !1325)
!1328 = !DILocation(line: 74, column: 165, scope: !1325)
!1329 = !DILocation(line: 74, column: 188, scope: !1325)
!1330 = !DILocation(line: 75, column: 5, scope: !1294)
!1331 = !DILocation(line: 76, column: 24, scope: !1332)
!1332 = distinct !DILexicalBlock(scope: !1290, file: !934, line: 75, column: 12)
!1333 = !DILocation(line: 76, column: 27, scope: !1332)
!1334 = !DILocation(line: 76, column: 16, scope: !1332)
!1335 = !DILocation(line: 76, column: 9, scope: !1332)
!1336 = !DILocation(line: 78, column: 10, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1222, file: !934, line: 78, column: 9)
!1338 = !DILocation(line: 78, column: 9, scope: !1222)
!1339 = !DILocation(line: 79, column: 9, scope: !1337)
!1340 = !DILocation(line: 80, column: 5, scope: !1222)
!1341 = !DILocation(line: 80, column: 8, scope: !1222)
!1342 = !DILocation(line: 80, column: 16, scope: !1222)
!1343 = !DILocation(line: 81, column: 5, scope: !1222)
!1344 = !DILocation(line: 81, column: 8, scope: !1222)
!1345 = !DILocation(line: 81, column: 16, scope: !1222)
!1346 = !DILocalVariable(name: "bytes", scope: !1347, file: !934, line: 82, type: !928)
!1347 = distinct !DILexicalBlock(scope: !1222, file: !934, line: 82, column: 5)
!1348 = !DILocation(line: 82, column: 11, scope: !1347)
!1349 = !DILocalVariable(name: "shift", scope: !1347, file: !934, line: 82, type: !928)
!1350 = !DILocation(line: 82, column: 18, scope: !1347)
!1351 = !DILocalVariable(name: "in", scope: !1347, file: !934, line: 82, type: !1228)
!1352 = !DILocation(line: 82, column: 34, scope: !1347)
!1353 = !DILocation(line: 82, column: 39, scope: !1347)
!1354 = !DILocation(line: 82, column: 48, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1347, file: !934, line: 82, column: 48)
!1356 = !DILocation(line: 82, column: 51, scope: !1355)
!1357 = !DILocation(line: 82, column: 48, scope: !1347)
!1358 = !DILocation(line: 82, column: 67, scope: !1359)
!1359 = !DILexicalBlockFile(scope: !1360, file: !934, discriminator: 1)
!1360 = distinct !DILexicalBlock(scope: !1355, file: !934, line: 82, column: 59)
!1361 = !DILocation(line: 82, column: 65, scope: !1359)
!1362 = !DILocation(line: 82, column: 94, scope: !1359)
!1363 = !DILocation(line: 82, column: 78, scope: !1359)
!1364 = !DILocation(line: 82, column: 81, scope: !1359)
!1365 = !DILocation(line: 82, column: 88, scope: !1359)
!1366 = !DILocation(line: 82, column: 71, scope: !1359)
!1367 = !DILocation(line: 82, column: 74, scope: !1359)
!1368 = !DILocation(line: 82, column: 92, scope: !1359)
!1369 = !DILocation(line: 82, column: 99, scope: !1359)
!1370 = !DILocation(line: 82, column: 138, scope: !1371)
!1371 = !DILexicalBlockFile(scope: !1372, file: !934, discriminator: 2)
!1372 = distinct !DILexicalBlock(scope: !1355, file: !934, line: 82, column: 106)
!1373 = !DILocation(line: 82, column: 141, scope: !1371)
!1374 = !DILocation(line: 82, column: 123, scope: !1371)
!1375 = !DILocation(line: 82, column: 121, scope: !1371)
!1376 = !DILocation(line: 82, column: 146, scope: !1371)
!1377 = !DILocation(line: 82, column: 151, scope: !1371)
!1378 = !DILocation(line: 82, column: 114, scope: !1371)
!1379 = !DILocation(line: 82, column: 165, scope: !1371)
!1380 = !DILocation(line: 82, column: 171, scope: !1371)
!1381 = !DILocation(line: 82, column: 176, scope: !1371)
!1382 = !DILocation(line: 82, column: 162, scope: !1371)
!1383 = !DILocation(line: 82, column: 202, scope: !1371)
!1384 = !DILocation(line: 82, column: 199, scope: !1371)
!1385 = !DILocation(line: 82, column: 192, scope: !1371)
!1386 = !DILocation(line: 82, column: 213, scope: !1371)
!1387 = !DILocation(line: 82, column: 219, scope: !1371)
!1388 = !DILocation(line: 82, column: 216, scope: !1371)
!1389 = !DILocation(line: 82, column: 210, scope: !1371)
!1390 = !DILocation(line: 82, column: 187, scope: !1371)
!1391 = !DILocation(line: 82, column: 185, scope: !1371)
!1392 = !DILocation(line: 82, column: 250, scope: !1371)
!1393 = !DILocation(line: 82, column: 234, scope: !1371)
!1394 = !DILocation(line: 82, column: 237, scope: !1371)
!1395 = !DILocation(line: 82, column: 244, scope: !1371)
!1396 = !DILocation(line: 82, column: 227, scope: !1371)
!1397 = !DILocation(line: 82, column: 230, scope: !1371)
!1398 = !DILocation(line: 82, column: 248, scope: !1371)
!1399 = !DILocation(line: 82, column: 255, scope: !1371)
!1400 = !DILocation(line: 82, column: 262, scope: !1401)
!1401 = !DILexicalBlockFile(scope: !1372, file: !934, discriminator: 3)
!1402 = !DILocation(line: 82, column: 268, scope: !1401)
!1403 = !DILocation(line: 82, column: 255, scope: !1401)
!1404 = !DILocation(line: 82, column: 282, scope: !1405)
!1405 = !DILexicalBlockFile(scope: !1406, file: !934, discriminator: 4)
!1406 = distinct !DILexicalBlock(scope: !1372, file: !934, line: 82, column: 274)
!1407 = !DILocation(line: 82, column: 303, scope: !1405)
!1408 = !DILocation(line: 82, column: 309, scope: !1405)
!1409 = !DILocation(line: 82, column: 306, scope: !1405)
!1410 = !DILocation(line: 82, column: 316, scope: !1405)
!1411 = !DILocation(line: 82, column: 299, scope: !1405)
!1412 = !DILocation(line: 82, column: 294, scope: !1405)
!1413 = !DILocation(line: 82, column: 292, scope: !1405)
!1414 = !DILocation(line: 82, column: 348, scope: !1405)
!1415 = !DILocation(line: 82, column: 332, scope: !1405)
!1416 = !DILocation(line: 82, column: 335, scope: !1405)
!1417 = !DILocation(line: 82, column: 342, scope: !1405)
!1418 = !DILocation(line: 82, column: 325, scope: !1405)
!1419 = !DILocation(line: 82, column: 328, scope: !1405)
!1420 = !DILocation(line: 82, column: 346, scope: !1405)
!1421 = !DILocation(line: 82, column: 255, scope: !1405)
!1422 = distinct !{!1422, !1423}
!1423 = !DILocation(line: 82, column: 255, scope: !1372)
!1424 = !DILocation(line: 83, column: 19, scope: !1222)
!1425 = !DILocation(line: 83, column: 22, scope: !1222)
!1426 = !DILocation(line: 83, column: 29, scope: !1222)
!1427 = !DILocation(line: 83, column: 12, scope: !1222)
!1428 = !DILocation(line: 83, column: 15, scope: !1222)
!1429 = !DILocation(line: 83, column: 5, scope: !1222)
!1430 = !DILocation(line: 84, column: 1, scope: !1222)
!1431 = distinct !DISubprogram(name: "ff_text_read", scope: !934, file: !934, line: 86, type: !1432, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1432 = !DISubroutineType(types: !1433)
!1433 = !{null, !937, !1434, !1178}
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1435 = !DILocalVariable(name: "r", arg: 1, scope: !1431, file: !934, line: 86, type: !937)
!1436 = !DILocation(line: 86, column: 33, scope: !1431)
!1437 = !DILocalVariable(name: "buf", arg: 2, scope: !1431, file: !934, line: 86, type: !1434)
!1438 = !DILocation(line: 86, column: 42, scope: !1431)
!1439 = !DILocalVariable(name: "size", arg: 3, scope: !1431, file: !934, line: 86, type: !1178)
!1440 = !DILocation(line: 86, column: 54, scope: !1431)
!1441 = !DILocation(line: 88, column: 5, scope: !1431)
!1442 = !DILocation(line: 88, column: 13, scope: !1443)
!1443 = !DILexicalBlockFile(scope: !1444, file: !934, discriminator: 1)
!1444 = distinct !DILexicalBlock(scope: !1445, file: !934, line: 88, column: 5)
!1445 = distinct !DILexicalBlock(scope: !1431, file: !934, line: 88, column: 5)
!1446 = !DILocation(line: 88, column: 18, scope: !1443)
!1447 = !DILocation(line: 88, column: 5, scope: !1443)
!1448 = !DILocation(line: 89, column: 29, scope: !1444)
!1449 = !DILocation(line: 89, column: 18, scope: !1444)
!1450 = !DILocation(line: 89, column: 13, scope: !1444)
!1451 = !DILocation(line: 89, column: 16, scope: !1444)
!1452 = !DILocation(line: 89, column: 9, scope: !1444)
!1453 = !DILocation(line: 88, column: 27, scope: !1454)
!1454 = !DILexicalBlockFile(scope: !1444, file: !934, discriminator: 2)
!1455 = !DILocation(line: 88, column: 5, scope: !1454)
!1456 = distinct !{!1456, !1441}
!1457 = !DILocation(line: 90, column: 1, scope: !1431)
!1458 = distinct !DISubprogram(name: "ff_text_eof", scope: !934, file: !934, line: 92, type: !1223, isLocal: false, isDefinition: true, scopeLine: 93, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1459 = !DILocalVariable(name: "r", arg: 1, scope: !1458, file: !934, line: 92, type: !937)
!1460 = !DILocation(line: 92, column: 31, scope: !1458)
!1461 = !DILocation(line: 94, column: 12, scope: !1458)
!1462 = !DILocation(line: 94, column: 15, scope: !1458)
!1463 = !DILocation(line: 94, column: 26, scope: !1458)
!1464 = !DILocation(line: 94, column: 29, scope: !1458)
!1465 = !DILocation(line: 94, column: 23, scope: !1458)
!1466 = !DILocation(line: 94, column: 37, scope: !1458)
!1467 = !DILocation(line: 94, column: 50, scope: !1468)
!1468 = !DILexicalBlockFile(scope: !1458, file: !934, discriminator: 1)
!1469 = !DILocation(line: 94, column: 53, scope: !1468)
!1470 = !DILocation(line: 94, column: 40, scope: !1468)
!1471 = !DILocation(line: 94, column: 37, scope: !1468)
!1472 = !DILocation(line: 94, column: 37, scope: !1473)
!1473 = !DILexicalBlockFile(scope: !1458, file: !934, discriminator: 2)
!1474 = !DILocation(line: 94, column: 5, scope: !1473)
!1475 = distinct !DISubprogram(name: "ff_text_peek_r8", scope: !934, file: !934, line: 97, type: !1223, isLocal: false, isDefinition: true, scopeLine: 98, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1476 = !DILocalVariable(name: "r", arg: 1, scope: !1475, file: !934, line: 97, type: !937)
!1477 = !DILocation(line: 97, column: 35, scope: !1475)
!1478 = !DILocalVariable(name: "c", scope: !1475, file: !934, line: 99, type: !928)
!1479 = !DILocation(line: 99, column: 9, scope: !1475)
!1480 = !DILocation(line: 100, column: 9, scope: !1481)
!1481 = distinct !DILexicalBlock(scope: !1475, file: !934, line: 100, column: 9)
!1482 = !DILocation(line: 100, column: 12, scope: !1481)
!1483 = !DILocation(line: 100, column: 22, scope: !1481)
!1484 = !DILocation(line: 100, column: 25, scope: !1481)
!1485 = !DILocation(line: 100, column: 20, scope: !1481)
!1486 = !DILocation(line: 100, column: 9, scope: !1475)
!1487 = !DILocation(line: 101, column: 23, scope: !1481)
!1488 = !DILocation(line: 101, column: 26, scope: !1481)
!1489 = !DILocation(line: 101, column: 16, scope: !1481)
!1490 = !DILocation(line: 101, column: 19, scope: !1481)
!1491 = !DILocation(line: 101, column: 9, scope: !1481)
!1492 = !DILocation(line: 102, column: 20, scope: !1475)
!1493 = !DILocation(line: 102, column: 9, scope: !1475)
!1494 = !DILocation(line: 102, column: 7, scope: !1475)
!1495 = !DILocation(line: 103, column: 20, scope: !1496)
!1496 = distinct !DILexicalBlock(scope: !1475, file: !934, line: 103, column: 9)
!1497 = !DILocation(line: 103, column: 23, scope: !1496)
!1498 = !DILocation(line: 103, column: 10, scope: !1496)
!1499 = !DILocation(line: 103, column: 9, scope: !1475)
!1500 = !DILocation(line: 104, column: 9, scope: !1501)
!1501 = distinct !DILexicalBlock(scope: !1496, file: !934, line: 103, column: 28)
!1502 = !DILocation(line: 104, column: 12, scope: !1501)
!1503 = !DILocation(line: 104, column: 20, scope: !1501)
!1504 = !DILocation(line: 105, column: 9, scope: !1501)
!1505 = !DILocation(line: 105, column: 12, scope: !1501)
!1506 = !DILocation(line: 105, column: 20, scope: !1501)
!1507 = !DILocation(line: 106, column: 21, scope: !1501)
!1508 = !DILocation(line: 106, column: 9, scope: !1501)
!1509 = !DILocation(line: 106, column: 12, scope: !1501)
!1510 = !DILocation(line: 106, column: 19, scope: !1501)
!1511 = !DILocation(line: 107, column: 5, scope: !1501)
!1512 = !DILocation(line: 108, column: 12, scope: !1475)
!1513 = !DILocation(line: 108, column: 5, scope: !1475)
!1514 = !DILocation(line: 109, column: 1, scope: !1475)
!1515 = distinct !DISubprogram(name: "ff_subtitles_queue_insert", scope: !934, file: !934, line: 111, type: !1516, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!1518, !1552, !1023, !1178, !928}
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !40, line: 1499, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !40, line: 1445, size: 704, align: 64, elements: !1521)
!1521 = !{!1522, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1548, !1549, !1550, !1551}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1520, file: !40, line: 1451, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1525, line: 94, baseType: !1526)
!1525 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1525, line: 81, size: 192, align: 64, elements: !1527)
!1527 = !{!1528, !1532, !1533}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1526, file: !1525, line: 82, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1525, line: 73, baseType: !1531)
!1531 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1525, line: 73, flags: DIFlagFwdDecl)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1526, file: !1525, line: 89, baseType: !1002, size: 64, align: 64, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1526, file: !1525, line: 93, baseType: !928, size: 32, align: 32, offset: 128)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1520, file: !40, line: 1461, baseType: !1010, size: 64, align: 64, offset: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1520, file: !40, line: 1467, baseType: !1010, size: 64, align: 64, offset: 128)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1520, file: !40, line: 1468, baseType: !1002, size: 64, align: 64, offset: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1520, file: !40, line: 1469, baseType: !928, size: 32, align: 32, offset: 256)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1520, file: !40, line: 1470, baseType: !928, size: 32, align: 32, offset: 288)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1520, file: !40, line: 1474, baseType: !928, size: 32, align: 32, offset: 320)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1520, file: !40, line: 1479, baseType: !1541, size: 64, align: 64, offset: 384)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !40, line: 1415, baseType: !1543)
!1543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !40, line: 1411, size: 128, align: 64, elements: !1544)
!1544 = !{!1545, !1546, !1547}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1543, file: !40, line: 1412, baseType: !1002, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1543, file: !40, line: 1413, baseType: !928, size: 32, align: 32, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1543, file: !40, line: 1414, baseType: !39, size: 32, align: 32, offset: 96)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1520, file: !40, line: 1480, baseType: !928, size: 32, align: 32, offset: 448)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1520, file: !40, line: 1486, baseType: !1010, size: 64, align: 64, offset: 512)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1520, file: !40, line: 1488, baseType: !1010, size: 64, align: 64, offset: 576)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1520, file: !40, line: 1497, baseType: !1010, size: 64, align: 64, offset: 640)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFDemuxSubtitlesQueue", file: !34, line: 109, baseType: !1554)
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 102, size: 256, align: 64, elements: !1555)
!1555 = !{!1556, !1557, !1558, !1559, !1560, !1561}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !1554, file: !34, line: 103, baseType: !1518, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "nb_subs", scope: !1554, file: !34, line: 104, baseType: !928, size: 32, align: 32, offset: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !1554, file: !34, line: 105, baseType: !928, size: 32, align: 32, offset: 96)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "current_sub_idx", scope: !1554, file: !34, line: 106, baseType: !928, size: 32, align: 32, offset: 128)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sort", scope: !1554, file: !34, line: 107, baseType: !70, size: 32, align: 32, offset: 160)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "keep_duplicates", scope: !1554, file: !34, line: 108, baseType: !928, size: 32, align: 32, offset: 192)
!1562 = !DILocalVariable(name: "q", arg: 1, scope: !1515, file: !934, line: 111, type: !1552)
!1563 = !DILocation(line: 111, column: 60, scope: !1515)
!1564 = !DILocalVariable(name: "event", arg: 2, scope: !1515, file: !934, line: 112, type: !1023)
!1565 = !DILocation(line: 112, column: 52, scope: !1515)
!1566 = !DILocalVariable(name: "len", arg: 3, scope: !1515, file: !934, line: 112, type: !1178)
!1567 = !DILocation(line: 112, column: 66, scope: !1515)
!1568 = !DILocalVariable(name: "merge", arg: 4, scope: !1515, file: !934, line: 112, type: !928)
!1569 = !DILocation(line: 112, column: 75, scope: !1515)
!1570 = !DILocalVariable(name: "subs", scope: !1515, file: !934, line: 114, type: !1518)
!1571 = !DILocation(line: 114, column: 15, scope: !1515)
!1572 = !DILocalVariable(name: "sub", scope: !1515, file: !934, line: 114, type: !1518)
!1573 = !DILocation(line: 114, column: 22, scope: !1515)
!1574 = !DILocation(line: 116, column: 9, scope: !1575)
!1575 = distinct !DILexicalBlock(scope: !1515, file: !934, line: 116, column: 9)
!1576 = !DILocation(line: 116, column: 15, scope: !1575)
!1577 = !DILocation(line: 116, column: 18, scope: !1578)
!1578 = !DILexicalBlockFile(scope: !1575, file: !934, discriminator: 1)
!1579 = !DILocation(line: 116, column: 21, scope: !1578)
!1580 = !DILocation(line: 116, column: 29, scope: !1578)
!1581 = !DILocation(line: 116, column: 9, scope: !1578)
!1582 = !DILocalVariable(name: "old_len", scope: !1583, file: !934, line: 119, type: !928)
!1583 = distinct !DILexicalBlock(scope: !1575, file: !934, line: 116, column: 34)
!1584 = !DILocation(line: 119, column: 13, scope: !1583)
!1585 = !DILocation(line: 120, column: 24, scope: !1583)
!1586 = !DILocation(line: 120, column: 27, scope: !1583)
!1587 = !DILocation(line: 120, column: 35, scope: !1583)
!1588 = !DILocation(line: 120, column: 16, scope: !1583)
!1589 = !DILocation(line: 120, column: 19, scope: !1583)
!1590 = !DILocation(line: 120, column: 13, scope: !1583)
!1591 = !DILocation(line: 121, column: 19, scope: !1583)
!1592 = !DILocation(line: 121, column: 24, scope: !1583)
!1593 = !DILocation(line: 121, column: 17, scope: !1583)
!1594 = !DILocation(line: 122, column: 28, scope: !1595)
!1595 = distinct !DILexicalBlock(scope: !1583, file: !934, line: 122, column: 13)
!1596 = !DILocation(line: 122, column: 33, scope: !1595)
!1597 = !DILocation(line: 122, column: 13, scope: !1595)
!1598 = !DILocation(line: 122, column: 38, scope: !1595)
!1599 = !DILocation(line: 122, column: 13, scope: !1583)
!1600 = !DILocation(line: 123, column: 13, scope: !1595)
!1601 = !DILocation(line: 124, column: 16, scope: !1583)
!1602 = !DILocation(line: 124, column: 21, scope: !1583)
!1603 = !DILocation(line: 124, column: 28, scope: !1583)
!1604 = !DILocation(line: 124, column: 26, scope: !1583)
!1605 = !DILocation(line: 124, column: 37, scope: !1583)
!1606 = !DILocation(line: 124, column: 44, scope: !1583)
!1607 = !DILocation(line: 124, column: 9, scope: !1583)
!1608 = !DILocation(line: 125, column: 5, scope: !1583)
!1609 = !DILocation(line: 128, column: 13, scope: !1610)
!1610 = distinct !DILexicalBlock(scope: !1611, file: !934, line: 128, column: 13)
!1611 = distinct !DILexicalBlock(scope: !1575, file: !934, line: 125, column: 12)
!1612 = !DILocation(line: 128, column: 16, scope: !1610)
!1613 = !DILocation(line: 128, column: 24, scope: !1610)
!1614 = !DILocation(line: 128, column: 13, scope: !1611)
!1615 = !DILocation(line: 129, column: 13, scope: !1610)
!1616 = !DILocation(line: 130, column: 32, scope: !1611)
!1617 = !DILocation(line: 130, column: 35, scope: !1611)
!1618 = !DILocation(line: 130, column: 42, scope: !1611)
!1619 = !DILocation(line: 130, column: 45, scope: !1611)
!1620 = !DILocation(line: 131, column: 33, scope: !1611)
!1621 = !DILocation(line: 131, column: 36, scope: !1611)
!1622 = !DILocation(line: 131, column: 44, scope: !1611)
!1623 = !DILocation(line: 131, column: 32, scope: !1611)
!1624 = !DILocation(line: 131, column: 49, scope: !1611)
!1625 = !DILocation(line: 130, column: 16, scope: !1611)
!1626 = !DILocation(line: 130, column: 14, scope: !1611)
!1627 = !DILocation(line: 132, column: 14, scope: !1628)
!1628 = distinct !DILexicalBlock(scope: !1611, file: !934, line: 132, column: 13)
!1629 = !DILocation(line: 132, column: 13, scope: !1611)
!1630 = !DILocation(line: 133, column: 13, scope: !1628)
!1631 = !DILocation(line: 134, column: 19, scope: !1611)
!1632 = !DILocation(line: 134, column: 9, scope: !1611)
!1633 = !DILocation(line: 134, column: 12, scope: !1611)
!1634 = !DILocation(line: 134, column: 17, scope: !1611)
!1635 = !DILocation(line: 135, column: 21, scope: !1611)
!1636 = !DILocation(line: 135, column: 24, scope: !1611)
!1637 = !DILocation(line: 135, column: 31, scope: !1611)
!1638 = !DILocation(line: 135, column: 16, scope: !1611)
!1639 = !DILocation(line: 135, column: 13, scope: !1611)
!1640 = !DILocation(line: 136, column: 27, scope: !1641)
!1641 = distinct !DILexicalBlock(scope: !1611, file: !934, line: 136, column: 13)
!1642 = !DILocation(line: 136, column: 32, scope: !1641)
!1643 = !DILocation(line: 136, column: 13, scope: !1641)
!1644 = !DILocation(line: 136, column: 37, scope: !1641)
!1645 = !DILocation(line: 136, column: 13, scope: !1611)
!1646 = !DILocation(line: 137, column: 13, scope: !1641)
!1647 = !DILocation(line: 138, column: 9, scope: !1611)
!1648 = !DILocation(line: 138, column: 14, scope: !1611)
!1649 = !DILocation(line: 138, column: 20, scope: !1611)
!1650 = !DILocation(line: 139, column: 20, scope: !1611)
!1651 = !DILocation(line: 139, column: 25, scope: !1611)
!1652 = !DILocation(line: 139, column: 29, scope: !1611)
!1653 = !DILocation(line: 139, column: 9, scope: !1611)
!1654 = !DILocation(line: 139, column: 14, scope: !1611)
!1655 = !DILocation(line: 139, column: 18, scope: !1611)
!1656 = !DILocation(line: 140, column: 16, scope: !1611)
!1657 = !DILocation(line: 140, column: 21, scope: !1611)
!1658 = !DILocation(line: 140, column: 27, scope: !1611)
!1659 = !DILocation(line: 140, column: 34, scope: !1611)
!1660 = !DILocation(line: 140, column: 9, scope: !1611)
!1661 = !DILocation(line: 142, column: 12, scope: !1515)
!1662 = !DILocation(line: 142, column: 5, scope: !1515)
!1663 = !DILocation(line: 143, column: 1, scope: !1515)
!1664 = distinct !DISubprogram(name: "ff_subtitles_queue_finalize", scope: !934, file: !934, line: 193, type: !1665, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1665 = !DISubroutineType(types: !1666)
!1666 = !{null, !927, !1552}
!1667 = !DILocalVariable(name: "log_ctx", arg: 1, scope: !1664, file: !934, line: 193, type: !927)
!1668 = !DILocation(line: 193, column: 40, scope: !1664)
!1669 = !DILocalVariable(name: "q", arg: 2, scope: !1664, file: !934, line: 193, type: !1552)
!1670 = !DILocation(line: 193, column: 72, scope: !1664)
!1671 = !DILocalVariable(name: "i", scope: !1664, file: !934, line: 195, type: !928)
!1672 = !DILocation(line: 195, column: 9, scope: !1664)
!1673 = !DILocation(line: 197, column: 11, scope: !1664)
!1674 = !DILocation(line: 197, column: 14, scope: !1664)
!1675 = !DILocation(line: 197, column: 20, scope: !1664)
!1676 = !DILocation(line: 197, column: 23, scope: !1664)
!1677 = !DILocation(line: 198, column: 11, scope: !1664)
!1678 = !DILocation(line: 198, column: 14, scope: !1664)
!1679 = !DILocation(line: 198, column: 19, scope: !1664)
!1680 = !DILocation(line: 197, column: 5, scope: !1664)
!1681 = !DILocation(line: 200, column: 12, scope: !1682)
!1682 = distinct !DILexicalBlock(scope: !1664, file: !934, line: 200, column: 5)
!1683 = !DILocation(line: 200, column: 10, scope: !1682)
!1684 = !DILocation(line: 200, column: 17, scope: !1685)
!1685 = !DILexicalBlockFile(scope: !1686, file: !934, discriminator: 1)
!1686 = distinct !DILexicalBlock(scope: !1682, file: !934, line: 200, column: 5)
!1687 = !DILocation(line: 200, column: 21, scope: !1685)
!1688 = !DILocation(line: 200, column: 24, scope: !1685)
!1689 = !DILocation(line: 200, column: 19, scope: !1685)
!1690 = !DILocation(line: 200, column: 5, scope: !1685)
!1691 = !DILocation(line: 201, column: 21, scope: !1692)
!1692 = distinct !DILexicalBlock(scope: !1686, file: !934, line: 201, column: 13)
!1693 = !DILocation(line: 201, column: 13, scope: !1692)
!1694 = !DILocation(line: 201, column: 16, scope: !1692)
!1695 = !DILocation(line: 201, column: 24, scope: !1692)
!1696 = !DILocation(line: 201, column: 33, scope: !1692)
!1697 = !DILocation(line: 201, column: 37, scope: !1692)
!1698 = !DILocation(line: 201, column: 40, scope: !1699)
!1699 = !DILexicalBlockFile(scope: !1692, file: !934, discriminator: 1)
!1700 = !DILocation(line: 201, column: 44, scope: !1699)
!1701 = !DILocation(line: 201, column: 47, scope: !1699)
!1702 = !DILocation(line: 201, column: 55, scope: !1699)
!1703 = !DILocation(line: 201, column: 42, scope: !1699)
!1704 = !DILocation(line: 201, column: 13, scope: !1699)
!1705 = !DILocation(line: 202, column: 43, scope: !1692)
!1706 = !DILocation(line: 202, column: 45, scope: !1692)
!1707 = !DILocation(line: 202, column: 35, scope: !1692)
!1708 = !DILocation(line: 202, column: 38, scope: !1692)
!1709 = !DILocation(line: 202, column: 50, scope: !1692)
!1710 = !DILocation(line: 202, column: 64, scope: !1692)
!1711 = !DILocation(line: 202, column: 56, scope: !1692)
!1712 = !DILocation(line: 202, column: 59, scope: !1692)
!1713 = !DILocation(line: 202, column: 67, scope: !1692)
!1714 = !DILocation(line: 202, column: 54, scope: !1692)
!1715 = !DILocation(line: 202, column: 21, scope: !1692)
!1716 = !DILocation(line: 202, column: 13, scope: !1692)
!1717 = !DILocation(line: 202, column: 16, scope: !1692)
!1718 = !DILocation(line: 202, column: 24, scope: !1692)
!1719 = !DILocation(line: 202, column: 33, scope: !1692)
!1720 = !DILocation(line: 201, column: 57, scope: !1721)
!1721 = !DILexicalBlockFile(scope: !1692, file: !934, discriminator: 2)
!1722 = !DILocation(line: 200, column: 34, scope: !1723)
!1723 = !DILexicalBlockFile(scope: !1686, file: !934, discriminator: 2)
!1724 = !DILocation(line: 200, column: 5, scope: !1723)
!1725 = distinct !{!1725, !1726}
!1726 = !DILocation(line: 200, column: 5, scope: !1664)
!1727 = !DILocation(line: 204, column: 10, scope: !1728)
!1728 = distinct !DILexicalBlock(scope: !1664, file: !934, line: 204, column: 9)
!1729 = !DILocation(line: 204, column: 13, scope: !1728)
!1730 = !DILocation(line: 204, column: 9, scope: !1664)
!1731 = !DILocation(line: 205, column: 19, scope: !1728)
!1732 = !DILocation(line: 205, column: 28, scope: !1728)
!1733 = !DILocation(line: 205, column: 9, scope: !1728)
!1734 = !DILocation(line: 206, column: 1, scope: !1664)
!1735 = distinct !DISubprogram(name: "cmp_pkt_sub_ts_pos", scope: !934, file: !934, line: 145, type: !1736, isLocal: true, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1736 = !DISubroutineType(types: !1737)
!1737 = !{!928, !1738, !1738}
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1740 = !DILocalVariable(name: "a", arg: 1, scope: !1735, file: !934, line: 145, type: !1738)
!1741 = !DILocation(line: 145, column: 43, scope: !1735)
!1742 = !DILocalVariable(name: "b", arg: 2, scope: !1735, file: !934, line: 145, type: !1738)
!1743 = !DILocation(line: 145, column: 58, scope: !1735)
!1744 = !DILocalVariable(name: "s1", scope: !1735, file: !934, line: 147, type: !1745)
!1745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1746, size: 64, align: 64)
!1746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1519)
!1747 = !DILocation(line: 147, column: 21, scope: !1735)
!1748 = !DILocation(line: 147, column: 26, scope: !1735)
!1749 = !DILocalVariable(name: "s2", scope: !1735, file: !934, line: 148, type: !1745)
!1750 = !DILocation(line: 148, column: 21, scope: !1735)
!1751 = !DILocation(line: 148, column: 26, scope: !1735)
!1752 = !DILocation(line: 149, column: 9, scope: !1753)
!1753 = distinct !DILexicalBlock(scope: !1735, file: !934, line: 149, column: 9)
!1754 = !DILocation(line: 149, column: 13, scope: !1753)
!1755 = !DILocation(line: 149, column: 20, scope: !1753)
!1756 = !DILocation(line: 149, column: 24, scope: !1753)
!1757 = !DILocation(line: 149, column: 17, scope: !1753)
!1758 = !DILocation(line: 149, column: 9, scope: !1735)
!1759 = !DILocation(line: 150, column: 19, scope: !1753)
!1760 = !DILocation(line: 150, column: 23, scope: !1753)
!1761 = !DILocation(line: 150, column: 29, scope: !1753)
!1762 = !DILocation(line: 150, column: 33, scope: !1753)
!1763 = !DILocation(line: 150, column: 27, scope: !1753)
!1764 = !DILocation(line: 150, column: 43, scope: !1753)
!1765 = !DILocation(line: 150, column: 47, scope: !1753)
!1766 = !DILocation(line: 150, column: 53, scope: !1753)
!1767 = !DILocation(line: 150, column: 57, scope: !1753)
!1768 = !DILocation(line: 150, column: 51, scope: !1753)
!1769 = !DILocation(line: 150, column: 39, scope: !1753)
!1770 = !DILocation(line: 150, column: 9, scope: !1753)
!1771 = !DILocation(line: 151, column: 15, scope: !1735)
!1772 = !DILocation(line: 151, column: 19, scope: !1735)
!1773 = !DILocation(line: 151, column: 25, scope: !1735)
!1774 = !DILocation(line: 151, column: 29, scope: !1735)
!1775 = !DILocation(line: 151, column: 23, scope: !1735)
!1776 = !DILocation(line: 151, column: 39, scope: !1735)
!1777 = !DILocation(line: 151, column: 43, scope: !1735)
!1778 = !DILocation(line: 151, column: 49, scope: !1735)
!1779 = !DILocation(line: 151, column: 53, scope: !1735)
!1780 = !DILocation(line: 151, column: 47, scope: !1735)
!1781 = !DILocation(line: 151, column: 35, scope: !1735)
!1782 = !DILocation(line: 151, column: 5, scope: !1735)
!1783 = !DILocation(line: 152, column: 1, scope: !1735)
!1784 = distinct !DISubprogram(name: "cmp_pkt_sub_pos_ts", scope: !934, file: !934, line: 154, type: !1736, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1785 = !DILocalVariable(name: "a", arg: 1, scope: !1784, file: !934, line: 154, type: !1738)
!1786 = !DILocation(line: 154, column: 43, scope: !1784)
!1787 = !DILocalVariable(name: "b", arg: 2, scope: !1784, file: !934, line: 154, type: !1738)
!1788 = !DILocation(line: 154, column: 58, scope: !1784)
!1789 = !DILocalVariable(name: "s1", scope: !1784, file: !934, line: 156, type: !1745)
!1790 = !DILocation(line: 156, column: 21, scope: !1784)
!1791 = !DILocation(line: 156, column: 26, scope: !1784)
!1792 = !DILocalVariable(name: "s2", scope: !1784, file: !934, line: 157, type: !1745)
!1793 = !DILocation(line: 157, column: 21, scope: !1784)
!1794 = !DILocation(line: 157, column: 26, scope: !1784)
!1795 = !DILocation(line: 158, column: 9, scope: !1796)
!1796 = distinct !DILexicalBlock(scope: !1784, file: !934, line: 158, column: 9)
!1797 = !DILocation(line: 158, column: 13, scope: !1796)
!1798 = !DILocation(line: 158, column: 20, scope: !1796)
!1799 = !DILocation(line: 158, column: 24, scope: !1796)
!1800 = !DILocation(line: 158, column: 17, scope: !1796)
!1801 = !DILocation(line: 158, column: 9, scope: !1784)
!1802 = !DILocation(line: 159, column: 13, scope: !1803)
!1803 = distinct !DILexicalBlock(scope: !1804, file: !934, line: 159, column: 13)
!1804 = distinct !DILexicalBlock(scope: !1796, file: !934, line: 158, column: 29)
!1805 = !DILocation(line: 159, column: 17, scope: !1803)
!1806 = !DILocation(line: 159, column: 24, scope: !1803)
!1807 = !DILocation(line: 159, column: 28, scope: !1803)
!1808 = !DILocation(line: 159, column: 21, scope: !1803)
!1809 = !DILocation(line: 159, column: 13, scope: !1804)
!1810 = !DILocation(line: 160, column: 13, scope: !1803)
!1811 = !DILocation(line: 161, column: 16, scope: !1804)
!1812 = !DILocation(line: 161, column: 20, scope: !1804)
!1813 = !DILocation(line: 161, column: 26, scope: !1804)
!1814 = !DILocation(line: 161, column: 30, scope: !1804)
!1815 = !DILocation(line: 161, column: 24, scope: !1804)
!1816 = !DILocation(line: 161, column: 9, scope: !1804)
!1817 = !DILocation(line: 163, column: 12, scope: !1784)
!1818 = !DILocation(line: 163, column: 16, scope: !1784)
!1819 = !DILocation(line: 163, column: 22, scope: !1784)
!1820 = !DILocation(line: 163, column: 26, scope: !1784)
!1821 = !DILocation(line: 163, column: 20, scope: !1784)
!1822 = !DILocation(line: 163, column: 5, scope: !1784)
!1823 = !DILocation(line: 164, column: 1, scope: !1784)
!1824 = distinct !DISubprogram(name: "drop_dups", scope: !934, file: !934, line: 166, type: !1665, isLocal: true, isDefinition: true, scopeLine: 167, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1825 = !DILocalVariable(name: "log_ctx", arg: 1, scope: !1824, file: !934, line: 166, type: !927)
!1826 = !DILocation(line: 166, column: 29, scope: !1824)
!1827 = !DILocalVariable(name: "q", arg: 2, scope: !1824, file: !934, line: 166, type: !1552)
!1828 = !DILocation(line: 166, column: 61, scope: !1824)
!1829 = !DILocalVariable(name: "i", scope: !1824, file: !934, line: 168, type: !928)
!1830 = !DILocation(line: 168, column: 9, scope: !1824)
!1831 = !DILocalVariable(name: "drop", scope: !1824, file: !934, line: 168, type: !928)
!1832 = !DILocation(line: 168, column: 12, scope: !1824)
!1833 = !DILocation(line: 170, column: 12, scope: !1834)
!1834 = distinct !DILexicalBlock(scope: !1824, file: !934, line: 170, column: 5)
!1835 = !DILocation(line: 170, column: 10, scope: !1834)
!1836 = !DILocation(line: 170, column: 17, scope: !1837)
!1837 = !DILexicalBlockFile(scope: !1838, file: !934, discriminator: 1)
!1838 = distinct !DILexicalBlock(scope: !1834, file: !934, line: 170, column: 5)
!1839 = !DILocation(line: 170, column: 21, scope: !1837)
!1840 = !DILocation(line: 170, column: 24, scope: !1837)
!1841 = !DILocation(line: 170, column: 19, scope: !1837)
!1842 = !DILocation(line: 170, column: 5, scope: !1837)
!1843 = !DILocalVariable(name: "last_id", scope: !1844, file: !934, line: 171, type: !1845)
!1844 = distinct !DILexicalBlock(scope: !1838, file: !934, line: 170, column: 38)
!1845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!1846 = !DILocation(line: 171, column: 19, scope: !1844)
!1847 = !DILocation(line: 171, column: 29, scope: !1844)
!1848 = !DILocation(line: 171, column: 31, scope: !1844)
!1849 = !DILocation(line: 171, column: 37, scope: !1844)
!1850 = !DILocation(line: 171, column: 35, scope: !1844)
!1851 = !DILocalVariable(name: "last", scope: !1844, file: !934, line: 172, type: !1745)
!1852 = !DILocation(line: 172, column: 25, scope: !1844)
!1853 = !DILocation(line: 172, column: 41, scope: !1844)
!1854 = !DILocation(line: 172, column: 33, scope: !1844)
!1855 = !DILocation(line: 172, column: 36, scope: !1844)
!1856 = !DILocation(line: 174, column: 21, scope: !1857)
!1857 = distinct !DILexicalBlock(scope: !1844, file: !934, line: 174, column: 13)
!1858 = !DILocation(line: 174, column: 13, scope: !1857)
!1859 = !DILocation(line: 174, column: 16, scope: !1857)
!1860 = !DILocation(line: 174, column: 24, scope: !1857)
!1861 = !DILocation(line: 174, column: 31, scope: !1857)
!1862 = !DILocation(line: 174, column: 37, scope: !1857)
!1863 = !DILocation(line: 174, column: 28, scope: !1857)
!1864 = !DILocation(line: 174, column: 41, scope: !1857)
!1865 = !DILocation(line: 175, column: 21, scope: !1857)
!1866 = !DILocation(line: 175, column: 13, scope: !1857)
!1867 = !DILocation(line: 175, column: 16, scope: !1857)
!1868 = !DILocation(line: 175, column: 24, scope: !1857)
!1869 = !DILocation(line: 175, column: 36, scope: !1857)
!1870 = !DILocation(line: 175, column: 42, scope: !1857)
!1871 = !DILocation(line: 175, column: 33, scope: !1857)
!1872 = !DILocation(line: 175, column: 51, scope: !1857)
!1873 = !DILocation(line: 176, column: 21, scope: !1857)
!1874 = !DILocation(line: 176, column: 13, scope: !1857)
!1875 = !DILocation(line: 176, column: 16, scope: !1857)
!1876 = !DILocation(line: 176, column: 24, scope: !1857)
!1877 = !DILocation(line: 176, column: 40, scope: !1857)
!1878 = !DILocation(line: 176, column: 46, scope: !1857)
!1879 = !DILocation(line: 176, column: 37, scope: !1857)
!1880 = !DILocation(line: 176, column: 59, scope: !1857)
!1881 = !DILocation(line: 177, column: 29, scope: !1857)
!1882 = !DILocation(line: 177, column: 21, scope: !1857)
!1883 = !DILocation(line: 177, column: 24, scope: !1857)
!1884 = !DILocation(line: 177, column: 32, scope: !1857)
!1885 = !DILocation(line: 177, column: 38, scope: !1857)
!1886 = !DILocation(line: 177, column: 44, scope: !1857)
!1887 = !DILocation(line: 177, column: 14, scope: !1857)
!1888 = !DILocation(line: 174, column: 13, scope: !1889)
!1889 = !DILexicalBlockFile(scope: !1844, file: !934, discriminator: 1)
!1890 = !DILocation(line: 179, column: 38, scope: !1891)
!1891 = distinct !DILexicalBlock(scope: !1857, file: !934, line: 177, column: 51)
!1892 = !DILocation(line: 179, column: 30, scope: !1891)
!1893 = !DILocation(line: 179, column: 33, scope: !1891)
!1894 = !DILocation(line: 179, column: 13, scope: !1891)
!1895 = !DILocation(line: 180, column: 17, scope: !1891)
!1896 = !DILocation(line: 181, column: 9, scope: !1891)
!1897 = !DILocation(line: 181, column: 20, scope: !1898)
!1898 = !DILexicalBlockFile(scope: !1899, file: !934, discriminator: 1)
!1899 = distinct !DILexicalBlock(scope: !1857, file: !934, line: 181, column: 20)
!1900 = !DILocation(line: 182, column: 21, scope: !1901)
!1901 = distinct !DILexicalBlock(scope: !1899, file: !934, line: 181, column: 26)
!1902 = !DILocation(line: 182, column: 29, scope: !1901)
!1903 = !DILocation(line: 182, column: 13, scope: !1901)
!1904 = !DILocation(line: 182, column: 16, scope: !1901)
!1905 = !DILocation(line: 182, column: 44, scope: !1901)
!1906 = !DILocation(line: 182, column: 36, scope: !1901)
!1907 = !DILocation(line: 182, column: 39, scope: !1901)
!1908 = !DILocation(line: 183, column: 29, scope: !1901)
!1909 = !DILocation(line: 183, column: 21, scope: !1901)
!1910 = !DILocation(line: 183, column: 24, scope: !1901)
!1911 = !DILocation(line: 183, column: 13, scope: !1901)
!1912 = !DILocation(line: 184, column: 9, scope: !1901)
!1913 = !DILocation(line: 185, column: 5, scope: !1844)
!1914 = !DILocation(line: 170, column: 34, scope: !1915)
!1915 = !DILexicalBlockFile(scope: !1838, file: !934, discriminator: 2)
!1916 = !DILocation(line: 170, column: 5, scope: !1915)
!1917 = distinct !{!1917, !1918}
!1918 = !DILocation(line: 170, column: 5, scope: !1824)
!1919 = !DILocation(line: 187, column: 9, scope: !1920)
!1920 = distinct !DILexicalBlock(scope: !1824, file: !934, line: 187, column: 9)
!1921 = !DILocation(line: 187, column: 9, scope: !1824)
!1922 = !DILocation(line: 188, column: 23, scope: !1923)
!1923 = distinct !DILexicalBlock(scope: !1920, file: !934, line: 187, column: 15)
!1924 = !DILocation(line: 188, column: 9, scope: !1923)
!1925 = !DILocation(line: 188, column: 12, scope: !1923)
!1926 = !DILocation(line: 188, column: 20, scope: !1923)
!1927 = !DILocation(line: 189, column: 16, scope: !1923)
!1928 = !DILocation(line: 189, column: 73, scope: !1923)
!1929 = !DILocation(line: 189, column: 9, scope: !1923)
!1930 = !DILocation(line: 190, column: 5, scope: !1923)
!1931 = !DILocation(line: 191, column: 1, scope: !1824)
!1932 = distinct !DISubprogram(name: "ff_subtitles_queue_read_packet", scope: !934, file: !934, line: 208, type: !1933, isLocal: false, isDefinition: true, scopeLine: 209, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1933 = !DISubroutineType(types: !1934)
!1934 = !{!928, !1552, !1518}
!1935 = !DILocalVariable(name: "q", arg: 1, scope: !1932, file: !934, line: 208, type: !1552)
!1936 = !DILocation(line: 208, column: 59, scope: !1932)
!1937 = !DILocalVariable(name: "pkt", arg: 2, scope: !1932, file: !934, line: 208, type: !1518)
!1938 = !DILocation(line: 208, column: 72, scope: !1932)
!1939 = !DILocalVariable(name: "sub", scope: !1932, file: !934, line: 210, type: !1518)
!1940 = !DILocation(line: 210, column: 15, scope: !1932)
!1941 = !DILocation(line: 210, column: 21, scope: !1932)
!1942 = !DILocation(line: 210, column: 24, scope: !1932)
!1943 = !DILocation(line: 210, column: 31, scope: !1932)
!1944 = !DILocation(line: 210, column: 34, scope: !1932)
!1945 = !DILocation(line: 210, column: 29, scope: !1932)
!1946 = !DILocation(line: 212, column: 9, scope: !1947)
!1947 = distinct !DILexicalBlock(scope: !1932, file: !934, line: 212, column: 9)
!1948 = !DILocation(line: 212, column: 12, scope: !1947)
!1949 = !DILocation(line: 212, column: 31, scope: !1947)
!1950 = !DILocation(line: 212, column: 34, scope: !1947)
!1951 = !DILocation(line: 212, column: 28, scope: !1947)
!1952 = !DILocation(line: 212, column: 9, scope: !1932)
!1953 = !DILocation(line: 213, column: 9, scope: !1947)
!1954 = !DILocation(line: 214, column: 23, scope: !1955)
!1955 = distinct !DILexicalBlock(scope: !1932, file: !934, line: 214, column: 9)
!1956 = !DILocation(line: 214, column: 28, scope: !1955)
!1957 = !DILocation(line: 214, column: 9, scope: !1955)
!1958 = !DILocation(line: 214, column: 33, scope: !1955)
!1959 = !DILocation(line: 214, column: 9, scope: !1932)
!1960 = !DILocation(line: 215, column: 9, scope: !1961)
!1961 = distinct !DILexicalBlock(scope: !1955, file: !934, line: 214, column: 38)
!1962 = !DILocation(line: 218, column: 16, scope: !1932)
!1963 = !DILocation(line: 218, column: 21, scope: !1932)
!1964 = !DILocation(line: 218, column: 5, scope: !1932)
!1965 = !DILocation(line: 218, column: 10, scope: !1932)
!1966 = !DILocation(line: 218, column: 14, scope: !1932)
!1967 = !DILocation(line: 219, column: 5, scope: !1932)
!1968 = !DILocation(line: 219, column: 8, scope: !1932)
!1969 = !DILocation(line: 219, column: 23, scope: !1932)
!1970 = !DILocation(line: 220, column: 5, scope: !1932)
!1971 = !DILocation(line: 221, column: 1, scope: !1932)
!1972 = distinct !DISubprogram(name: "ff_subtitles_queue_seek", scope: !934, file: !934, line: 245, type: !1973, isLocal: false, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1065)
!1973 = !DISubroutineType(types: !1974)
!1974 = !{!928, !1552, !1975, !928, !1010, !1010, !1010, !928}
!1975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1976, size: 64, align: 64)
!1976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !907, line: 1947, baseType: !1977)
!1977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !907, line: 1337, size: 11968, align: 64, elements: !1978)
!1978 = !{!1979, !1980, !2049, !2190, !2191, !2192, !2193, !2194, !2823, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2877, !2878, !2879, !2880, !2881, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2912, !2913, !2916, !2917, !2918, !2919, !2920, !2921, !2923, !2924, !2925, !2926, !2934, !2935, !2939, !2943, !2944, !2945}
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1977, file: !907, line: 1342, baseType: !948, size: 64, align: 64)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1977, file: !907, line: 1349, baseType: !1981, size: 64, align: 64, offset: 64)
!1981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1982, size: 64, align: 64)
!1982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !907, line: 633, size: 1344, align: 64, elements: !1983)
!1983 = !{!1984, !1985, !1986, !1987, !1988, !1994, !1995, !1996, !1997, !1998, !1999, !2011, !2016, !2020, !2021, !2025, !2030, !2031, !2032, !2036, !2042, !2048}
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1982, file: !907, line: 638, baseType: !954, size: 64, align: 64)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1982, file: !907, line: 645, baseType: !954, size: 64, align: 64, offset: 64)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1982, file: !907, line: 652, baseType: !928, size: 32, align: 32, offset: 128)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1982, file: !907, line: 659, baseType: !954, size: 64, align: 64, offset: 192)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1982, file: !907, line: 661, baseType: !1989, size: 64, align: 64, offset: 256)
!1989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1990, size: 64, align: 64)
!1990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1991)
!1991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1992, size: 64, align: 64)
!1992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1993)
!1993 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !907, line: 443, flags: DIFlagFwdDecl)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1982, file: !907, line: 663, baseType: !948, size: 64, align: 64, offset: 320)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1982, file: !907, line: 670, baseType: !954, size: 64, align: 64, offset: 384)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1982, file: !907, line: 679, baseType: !1981, size: 64, align: 64, offset: 448)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1982, file: !907, line: 684, baseType: !928, size: 32, align: 32, offset: 512)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1982, file: !907, line: 689, baseType: !928, size: 32, align: 32, offset: 544)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1982, file: !907, line: 696, baseType: !2000, size: 64, align: 64, offset: 576)
!2000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2001, size: 64, align: 64)
!2001 = !DISubroutineType(types: !2002)
!2002 = !{!928, !2003}
!2003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2004, size: 64, align: 64)
!2004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !907, line: 453, baseType: !2005)
!2005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !907, line: 448, size: 256, align: 64, elements: !2006)
!2006 = !{!2007, !2008, !2009, !2010}
!2007 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !2005, file: !907, line: 449, baseType: !954, size: 64, align: 64)
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !2005, file: !907, line: 450, baseType: !992, size: 64, align: 64, offset: 64)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !2005, file: !907, line: 451, baseType: !928, size: 32, align: 32, offset: 128)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !2005, file: !907, line: 452, baseType: !954, size: 64, align: 64, offset: 192)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1982, file: !907, line: 703, baseType: !2012, size: 64, align: 64, offset: 640)
!2012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2013, size: 64, align: 64)
!2013 = !DISubroutineType(types: !2014)
!2014 = !{!928, !2015}
!2015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1977, size: 64, align: 64)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1982, file: !907, line: 714, baseType: !2017, size: 64, align: 64, offset: 704)
!2017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2018, size: 64, align: 64)
!2018 = !DISubroutineType(types: !2019)
!2019 = !{!928, !2015, !1518}
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1982, file: !907, line: 720, baseType: !2012, size: 64, align: 64, offset: 768)
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1982, file: !907, line: 730, baseType: !2022, size: 64, align: 64, offset: 832)
!2022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2023, size: 64, align: 64)
!2023 = !DISubroutineType(types: !2024)
!2024 = !{!928, !2015, !928, !1010, !928}
!2025 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1982, file: !907, line: 737, baseType: !2026, size: 64, align: 64, offset: 896)
!2026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2027, size: 64, align: 64)
!2027 = !DISubroutineType(types: !2028)
!2028 = !{!1010, !2015, !928, !2029, !1010}
!2029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1982, file: !907, line: 744, baseType: !2012, size: 64, align: 64, offset: 960)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1982, file: !907, line: 750, baseType: !2012, size: 64, align: 64, offset: 1024)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1982, file: !907, line: 758, baseType: !2033, size: 64, align: 64, offset: 1088)
!2033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2034, size: 64, align: 64)
!2034 = !DISubroutineType(types: !2035)
!2035 = !{!928, !2015, !928, !1010, !1010, !1010, !928}
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1982, file: !907, line: 764, baseType: !2037, size: 64, align: 64, offset: 1152)
!2037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2038, size: 64, align: 64)
!2038 = !DISubroutineType(types: !2039)
!2039 = !{!928, !2015, !2040}
!2040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2041, size: 64, align: 64)
!2041 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !907, line: 328, flags: DIFlagFwdDecl)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1982, file: !907, line: 770, baseType: !2043, size: 64, align: 64, offset: 1216)
!2043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2044, size: 64, align: 64)
!2044 = !DISubroutineType(types: !2045)
!2045 = !{!928, !2015, !2046}
!2046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2047, size: 64, align: 64)
!2047 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !907, line: 329, flags: DIFlagFwdDecl)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1982, file: !907, line: 776, baseType: !2043, size: 64, align: 64, offset: 1280)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1977, file: !907, line: 1356, baseType: !2050, size: 64, align: 64, offset: 128)
!2050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2051, size: 64, align: 64)
!2051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !907, line: 497, size: 1600, align: 64, elements: !2052)
!2052 = !{!2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2072, !2076, !2080, !2084, !2177, !2178, !2179, !2180, !2181, !2182, !2186}
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2051, file: !907, line: 498, baseType: !954, size: 64, align: 64)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !2051, file: !907, line: 504, baseType: !954, size: 64, align: 64, offset: 64)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !2051, file: !907, line: 505, baseType: !954, size: 64, align: 64, offset: 128)
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !2051, file: !907, line: 506, baseType: !954, size: 64, align: 64, offset: 192)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !2051, file: !907, line: 508, baseType: !74, size: 32, align: 32, offset: 256)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !2051, file: !907, line: 509, baseType: !74, size: 32, align: 32, offset: 288)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !2051, file: !907, line: 510, baseType: !74, size: 32, align: 32, offset: 320)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2051, file: !907, line: 517, baseType: !928, size: 32, align: 32, offset: 352)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !2051, file: !907, line: 523, baseType: !1989, size: 64, align: 64, offset: 384)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !2051, file: !907, line: 526, baseType: !948, size: 64, align: 64, offset: 448)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2051, file: !907, line: 535, baseType: !2050, size: 64, align: 64, offset: 512)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !2051, file: !907, line: 539, baseType: !928, size: 32, align: 32, offset: 576)
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !2051, file: !907, line: 541, baseType: !2012, size: 64, align: 64, offset: 640)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !2051, file: !907, line: 549, baseType: !2017, size: 64, align: 64, offset: 704)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !2051, file: !907, line: 550, baseType: !2012, size: 64, align: 64, offset: 768)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !2051, file: !907, line: 554, baseType: !2069, size: 64, align: 64, offset: 832)
!2069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2070, size: 64, align: 64)
!2070 = !DISubroutineType(types: !2071)
!2071 = !{!928, !2015, !1518, !1518, !928}
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !2051, file: !907, line: 563, baseType: !2073, size: 64, align: 64, offset: 896)
!2073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2074, size: 64, align: 64)
!2074 = !DISubroutineType(types: !2075)
!2075 = !{!928, !74, !928}
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !2051, file: !907, line: 565, baseType: !2077, size: 64, align: 64, offset: 960)
!2077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2078, size: 64, align: 64)
!2078 = !DISubroutineType(types: !2079)
!2079 = !{null, !2015, !928, !2029, !2029}
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !2051, file: !907, line: 570, baseType: !2081, size: 64, align: 64, offset: 1024)
!2081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2082, size: 64, align: 64)
!2082 = !DISubroutineType(types: !2083)
!2083 = !{!928, !2015, !928, !927, !1178}
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !2051, file: !907, line: 581, baseType: !2085, size: 64, align: 64, offset: 1088)
!2085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2086, size: 64, align: 64)
!2086 = !DISubroutineType(types: !2087)
!2087 = !{!928, !2015, !928, !2088, !929}
!2088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2089, size: 64, align: 64)
!2089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2090, size: 64, align: 64)
!2090 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !545, line: 646, baseType: !2091)
!2091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !545, line: 268, size: 4288, align: 64, elements: !2092)
!2092 = !{!2093, !2095, !2097, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2131, !2133, !2134, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2167, !2168, !2169, !2170, !2171, !2172, !2173, !2174, !2175, !2176}
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2091, file: !545, line: 282, baseType: !2094, size: 512, align: 64)
!2094 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 512, align: 64, elements: !1060)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !2091, file: !545, line: 299, baseType: !2096, size: 256, align: 32, offset: 512)
!2096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 256, align: 32, elements: !1060)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !2091, file: !545, line: 315, baseType: !2098, size: 64, align: 64, offset: 768)
!2098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !2091, file: !545, line: 326, baseType: !928, size: 32, align: 32, offset: 832)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !2091, file: !545, line: 326, baseType: !928, size: 32, align: 32, offset: 864)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !2091, file: !545, line: 334, baseType: !928, size: 32, align: 32, offset: 896)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !2091, file: !545, line: 341, baseType: !928, size: 32, align: 32, offset: 928)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !2091, file: !545, line: 346, baseType: !928, size: 32, align: 32, offset: 960)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !2091, file: !545, line: 351, baseType: !533, size: 32, align: 32, offset: 992)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !2091, file: !545, line: 356, baseType: !2106, size: 64, align: 32, offset: 1024)
!2106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !2107, line: 61, baseType: !2108)
!2107 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !2107, line: 58, size: 64, align: 32, elements: !2109)
!2109 = !{!2110, !2111}
!2110 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2108, file: !2107, line: 59, baseType: !928, size: 32, align: 32)
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !2108, file: !2107, line: 60, baseType: !928, size: 32, align: 32, offset: 32)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !2091, file: !545, line: 361, baseType: !1010, size: 64, align: 64, offset: 1088)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !2091, file: !545, line: 369, baseType: !1010, size: 64, align: 64, offset: 1152)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !2091, file: !545, line: 377, baseType: !1010, size: 64, align: 64, offset: 1216)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !2091, file: !545, line: 382, baseType: !928, size: 32, align: 32, offset: 1280)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !2091, file: !545, line: 386, baseType: !928, size: 32, align: 32, offset: 1312)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !2091, file: !545, line: 391, baseType: !928, size: 32, align: 32, offset: 1344)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !2091, file: !545, line: 396, baseType: !927, size: 64, align: 64, offset: 1408)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !2091, file: !545, line: 403, baseType: !2120, size: 512, align: 64, offset: 1472)
!2120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2121, size: 512, align: 64, elements: !1060)
!2121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1004, line: 55, baseType: !1017)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !2091, file: !545, line: 410, baseType: !928, size: 32, align: 32, offset: 1984)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !2091, file: !545, line: 415, baseType: !928, size: 32, align: 32, offset: 2016)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !2091, file: !545, line: 420, baseType: !928, size: 32, align: 32, offset: 2048)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !2091, file: !545, line: 425, baseType: !928, size: 32, align: 32, offset: 2080)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !2091, file: !545, line: 435, baseType: !1010, size: 64, align: 64, offset: 2112)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !2091, file: !545, line: 440, baseType: !928, size: 32, align: 32, offset: 2176)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !2091, file: !545, line: 445, baseType: !2121, size: 64, align: 64, offset: 2240)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !2091, file: !545, line: 459, baseType: !2130, size: 512, align: 64, offset: 2304)
!2130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1523, size: 512, align: 64, elements: !1060)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !2091, file: !545, line: 473, baseType: !2132, size: 64, align: 64, offset: 2816)
!2132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !2091, file: !545, line: 477, baseType: !928, size: 32, align: 32, offset: 2880)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !2091, file: !545, line: 479, baseType: !2135, size: 64, align: 64, offset: 2944)
!2135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2136, size: 64, align: 64)
!2136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2137, size: 64, align: 64)
!2137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !545, line: 207, baseType: !2138)
