; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]fftools--ffmpeg_filter.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]fftools--ffmpeg_filter.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.FilterGraph = type { i32, i8*, %struct.AVFilterGraph*, i32, %struct.InputFilter**, i32, %struct.OutputFilter**, i32 }
%struct.AVFilterGraph = type { %struct.AVClass*, %struct.AVFilterContext**, i32, i8*, i8*, i32, i32, %struct.AVFilterGraphInternal*, i8*, i32 (%struct.AVFilterContext*, i32 (%struct.AVFilterContext*, i8*, i32, i32)*, i8*, i32*, i32)*, i8*, %struct.AVFilterLink**, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVFilterContext = type { %struct.AVClass*, %struct.AVFilter*, i8*, %struct.AVFilterPad*, %struct.AVFilterLink**, i32, %struct.AVFilterPad*, %struct.AVFilterLink**, i32, i8*, %struct.AVFilterGraph*, i32, %struct.AVFilterInternal*, %struct.AVFilterCommand*, i8*, i8*, double*, i32, %struct.AVBufferRef*, i32, i32, i32 }

!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !4, line: 538, size: 32, align: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879}
!872 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!873 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!874 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !257, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !257, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !257, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !910, line: 782, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "./libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917}
!912 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!913 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!914 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!915 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!916 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!917 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !257, line: 5085, size: 32, align: 32, elements: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!921 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!922 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!923 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !926, file: !925, line: 503, size: 32, align: 32, elements: !1271)
!925 = !DIFile(filename: "./libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !925, line: 439, size: 493504, align: 64, elements: !927)
!927 = !{!928, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1154, !1155, !1156, !1157, !1161, !1162, !1163, !1164, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !926, file: !925, line: 440, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !925, line: 67, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !925, line: 338, size: 1344, align: 64, elements: !932)
!932 = !{!933, !1020, !1069, !1070, !1072, !1076, !1078, !1079, !1080, !1081, !1082, !1113, !1114, !1118, !1121, !1122, !1123, !1125, !1126, !1141, !1142, !1143}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !931, file: !925, line: 339, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !226, line: 143, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !226, line: 67, size: 640, align: 64, elements: !938)
!938 = !{!939, !943, !948, !979, !980, !981, !982, !986, !992, !994, !998}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !937, file: !226, line: 72, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !937, file: !226, line: 78, baseType: !944, size: 64, align: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DISubroutineType(types: !946)
!946 = !{!940, !947}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !937, file: !226, line: 85, baseType: !949, size: 64, align: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !204, line: 246, size: 512, align: 64, elements: !952)
!952 = !{!953, !954, !955, !957, !958, !975, !976, !977, !978}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !951, file: !204, line: 247, baseType: !940, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !951, file: !204, line: 253, baseType: !940, size: 64, align: 64, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !951, file: !204, line: 259, baseType: !956, size: 32, align: 32, offset: 128)
!956 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !951, file: !204, line: 260, baseType: !203, size: 32, align: 32, offset: 160)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !951, file: !204, line: 271, baseType: !959, size: 64, align: 64, offset: 192)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !951, file: !204, line: 265, size: 64, align: 64, elements: !960)
!960 = !{!961, !965, !967, !968}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !959, file: !204, line: 266, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !963, line: 40, baseType: !964)
!963 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!964 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !959, file: !204, line: 267, baseType: !966, size: 64, align: 64)
!966 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !959, file: !204, line: 268, baseType: !940, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !959, file: !204, line: 270, baseType: !969, size: 64, align: 32)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !970, line: 61, baseType: !971)
!970 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !970, line: 58, size: 64, align: 32, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !971, file: !970, line: 59, baseType: !956, size: 32, align: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !971, file: !970, line: 60, baseType: !956, size: 32, align: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !951, file: !204, line: 272, baseType: !966, size: 64, align: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !951, file: !204, line: 273, baseType: !966, size: 64, align: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !951, file: !204, line: 275, baseType: !956, size: 32, align: 32, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !951, file: !204, line: 300, baseType: !940, size: 64, align: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !937, file: !226, line: 93, baseType: !956, size: 32, align: 32, offset: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !937, file: !226, line: 99, baseType: !956, size: 32, align: 32, offset: 224)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !937, file: !226, line: 108, baseType: !956, size: 32, align: 32, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !937, file: !226, line: 113, baseType: !983, size: 64, align: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{!947, !947, !947}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !937, file: !226, line: 123, baseType: !987, size: 64, align: 64, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{!990, !990}
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !937, file: !226, line: 130, baseType: !993, size: 32, align: 32, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !226, line: 48, baseType: !225)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !937, file: !226, line: 136, baseType: !995, size: 64, align: 64, offset: 512)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!993, !947}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !937, file: !226, line: 142, baseType: !999, size: 64, align: 64, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!956, !1002, !947, !940, !956}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !204, line: 329, size: 128, align: 64, elements: !1005)
!1005 = !{!1006, !1018, !1019}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1004, file: !204, line: 360, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !204, line: 324, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !204, line: 306, size: 384, align: 64, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1010, file: !204, line: 307, baseType: !940, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1010, file: !204, line: 313, baseType: !966, size: 64, align: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1010, file: !204, line: 313, baseType: !966, size: 64, align: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1010, file: !204, line: 318, baseType: !966, size: 64, align: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1010, file: !204, line: 318, baseType: !966, size: 64, align: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1010, file: !204, line: 323, baseType: !956, size: 32, align: 32, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1004, file: !204, line: 364, baseType: !956, size: 32, align: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1004, file: !204, line: 368, baseType: !956, size: 32, align: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !931, file: !925, line: 341, baseType: !1021, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !925, line: 328, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !925, line: 144, size: 1024, align: 64, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1033, !1034, !1035, !1036, !1040, !1041, !1050, !1054, !1055, !1056, !1057, !1059, !1064, !1068}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1024, file: !925, line: 148, baseType: !940, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !1024, file: !925, line: 155, baseType: !940, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !1024, file: !925, line: 164, baseType: !1029, size: 64, align: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !925, line: 69, baseType: !1032)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !925, line: 69, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !1024, file: !925, line: 172, baseType: !1029, size: 64, align: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1024, file: !925, line: 182, baseType: !934, size: 64, align: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1024, file: !925, line: 187, baseType: !956, size: 32, align: 32, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !1024, file: !925, line: 210, baseType: !1037, size: 64, align: 64, offset: 384)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!956, !929}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1024, file: !925, line: 233, baseType: !1037, size: 64, align: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !1024, file: !925, line: 246, baseType: !1042, size: 64, align: 64, offset: 512)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!956, !929, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1048, line: 86, baseType: !1049)
!1048 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1049 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1048, line: 86, flags: DIFlagFwdDecl)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1024, file: !925, line: 258, baseType: !1051, size: 64, align: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{null, !929}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !1024, file: !925, line: 282, baseType: !1037, size: 64, align: 64, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !1024, file: !925, line: 284, baseType: !956, size: 32, align: 32, offset: 704)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !1024, file: !925, line: 286, baseType: !956, size: 32, align: 32, offset: 736)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1024, file: !925, line: 292, baseType: !1058, size: 64, align: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !1024, file: !925, line: 306, baseType: !1060, size: 64, align: 64, offset: 832)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!956, !929, !940, !940, !1063, !956, !956}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !1024, file: !925, line: 313, baseType: !1065, size: 64, align: 64, offset: 896)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!956, !929, !947}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !1024, file: !925, line: 327, baseType: !1037, size: 64, align: 64, offset: 960)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !925, line: 343, baseType: !1063, size: 64, align: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !931, file: !925, line: 345, baseType: !1071, size: 64, align: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !931, file: !925, line: 346, baseType: !1073, size: 64, align: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !925, line: 68, baseType: !926)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !931, file: !925, line: 347, baseType: !1077, size: 32, align: 32, offset: 320)
!1077 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !931, file: !925, line: 349, baseType: !1071, size: 64, align: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !931, file: !925, line: 350, baseType: !1073, size: 64, align: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !931, file: !925, line: 351, baseType: !1077, size: 32, align: 32, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !931, file: !925, line: 353, baseType: !947, size: 64, align: 64, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !931, file: !925, line: 355, baseType: !1083, size: 64, align: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !925, line: 840, size: 768, align: 64, elements: !1085)
!1085 = !{!1086, !1087, !1089, !1090, !1091, !1092, !1093, !1094, !1098, !1099, !1109, !1110, !1111, !1112}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1084, file: !925, line: 841, baseType: !934, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !1084, file: !925, line: 842, baseType: !1088, size: 64, align: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !1084, file: !925, line: 843, baseType: !1077, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !1084, file: !925, line: 845, baseType: !1063, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !1084, file: !925, line: 847, baseType: !1063, size: 64, align: 64, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1084, file: !925, line: 862, baseType: !956, size: 32, align: 32, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !1084, file: !925, line: 869, baseType: !956, size: 32, align: 32, offset: 352)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1084, file: !925, line: 874, baseType: !1095, size: 64, align: 64, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !925, line: 809, baseType: !1097)
!1097 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !925, line: 809, flags: DIFlagFwdDecl)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1084, file: !925, line: 881, baseType: !947, size: 64, align: 64, offset: 448)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1084, file: !925, line: 895, baseType: !1100, size: 64, align: 64, offset: 512)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !925, line: 837, baseType: !1102)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!956, !929, !1104, !947, !1108, !956}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !925, line: 823, baseType: !1106)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!956, !929, !947, !956, !956}
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !1084, file: !925, line: 897, baseType: !1063, size: 64, align: 64, offset: 576)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !1084, file: !925, line: 906, baseType: !1073, size: 64, align: 64, offset: 640)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !1084, file: !925, line: 907, baseType: !956, size: 32, align: 32, offset: 704)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !1084, file: !925, line: 909, baseType: !1077, size: 32, align: 32, offset: 736)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !931, file: !925, line: 373, baseType: !956, size: 32, align: 32, offset: 704)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !931, file: !925, line: 378, baseType: !1115, size: 64, align: 64, offset: 768)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !925, line: 335, baseType: !1117)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !925, line: 335, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !931, file: !925, line: 380, baseType: !1119, size: 64, align: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !925, line: 380, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !931, file: !925, line: 382, baseType: !1063, size: 64, align: 64, offset: 896)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !931, file: !925, line: 383, baseType: !947, size: 64, align: 64, offset: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !931, file: !925, line: 384, baseType: !1124, size: 64, align: 64, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !931, file: !925, line: 385, baseType: !956, size: 32, align: 32, offset: 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !931, file: !925, line: 394, baseType: !1127, size: 64, align: 64, offset: 1152)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1129, line: 94, baseType: !1130)
!1129 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1129, line: 81, size: 192, align: 64, elements: !1131)
!1131 = !{!1132, !1136, !1140}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1130, file: !1129, line: 82, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1129, line: 73, baseType: !1135)
!1135 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1129, line: 73, flags: DIFlagFwdDecl)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1130, file: !1129, line: 89, baseType: !1137, size: 64, align: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !963, line: 48, baseType: !1139)
!1139 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1130, file: !1129, line: 93, baseType: !956, size: 32, align: 32, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !931, file: !925, line: 401, baseType: !956, size: 32, align: 32, offset: 1216)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !931, file: !925, line: 408, baseType: !1077, size: 32, align: 32, offset: 1248)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !931, file: !925, line: 424, baseType: !956, size: 32, align: 32, offset: 1280)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !926, file: !925, line: 441, baseType: !1071, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !926, file: !925, line: 443, baseType: !929, size: 64, align: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !926, file: !925, line: 444, baseType: !1071, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !926, file: !925, line: 446, baseType: !246, size: 32, align: 32, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !926, file: !925, line: 449, baseType: !956, size: 32, align: 32, offset: 288)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !926, file: !925, line: 450, baseType: !956, size: 32, align: 32, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !926, file: !925, line: 451, baseType: !969, size: 64, align: 32, offset: 352)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !926, file: !925, line: 453, baseType: !1152, size: 64, align: 64, offset: 448)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !963, line: 55, baseType: !1153)
!1153 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !926, file: !925, line: 454, baseType: !956, size: 32, align: 32, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !926, file: !925, line: 456, baseType: !956, size: 32, align: 32, offset: 544)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !926, file: !925, line: 465, baseType: !969, size: 64, align: 32, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !926, file: !925, line: 481, baseType: !1158, size: 64, align: 64, offset: 640)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !925, line: 70, baseType: !1160)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !925, line: 70, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !926, file: !925, line: 482, baseType: !1158, size: 64, align: 64, offset: 704)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !926, file: !925, line: 488, baseType: !1158, size: 64, align: 64, offset: 768)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !926, file: !925, line: 489, baseType: !1158, size: 64, align: 64, offset: 832)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !926, file: !925, line: 490, baseType: !1165, size: 64, align: 64, offset: 896)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !925, line: 490, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !926, file: !925, line: 491, baseType: !1165, size: 64, align: 64, offset: 960)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !926, file: !925, line: 500, baseType: !956, size: 32, align: 32, offset: 1024)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !926, file: !925, line: 507, baseType: !924, size: 32, align: 32, offset: 1056)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !926, file: !925, line: 512, baseType: !1083, size: 64, align: 64, offset: 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !926, file: !925, line: 518, baseType: !962, size: 64, align: 64, offset: 1152)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !926, file: !925, line: 524, baseType: !962, size: 64, align: 64, offset: 1216)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !926, file: !925, line: 529, baseType: !956, size: 32, align: 32, offset: 1280)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !926, file: !925, line: 542, baseType: !969, size: 64, align: 32, offset: 1312)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !926, file: !925, line: 547, baseType: !1176, size: 64, align: 64, offset: 1408)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1179)
!1179 = !{!1180, !1184, !1186, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1215, !1216, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1245, !1246, !1247, !1248, !1249, !1250, !1253, !1254, !1255, !1256}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1178, file: !780, line: 282, baseType: !1181, size: 512, align: 64)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 512, align: 64, elements: !1182)
!1182 = !{!1183}
!1183 = !DISubrange(count: 8)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1178, file: !780, line: 299, baseType: !1185, size: 256, align: 32, offset: 512)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 256, align: 32, elements: !1182)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1178, file: !780, line: 315, baseType: !1187, size: 64, align: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1178, file: !780, line: 326, baseType: !956, size: 32, align: 32, offset: 832)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1178, file: !780, line: 326, baseType: !956, size: 32, align: 32, offset: 864)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1178, file: !780, line: 334, baseType: !956, size: 32, align: 32, offset: 896)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1178, file: !780, line: 341, baseType: !956, size: 32, align: 32, offset: 928)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1178, file: !780, line: 346, baseType: !956, size: 32, align: 32, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1178, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1178, file: !780, line: 356, baseType: !969, size: 64, align: 32, offset: 1024)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1178, file: !780, line: 361, baseType: !962, size: 64, align: 64, offset: 1088)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1178, file: !780, line: 369, baseType: !962, size: 64, align: 64, offset: 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1178, file: !780, line: 377, baseType: !962, size: 64, align: 64, offset: 1216)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1178, file: !780, line: 382, baseType: !956, size: 32, align: 32, offset: 1280)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1178, file: !780, line: 386, baseType: !956, size: 32, align: 32, offset: 1312)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1178, file: !780, line: 391, baseType: !956, size: 32, align: 32, offset: 1344)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1178, file: !780, line: 396, baseType: !947, size: 64, align: 64, offset: 1408)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1178, file: !780, line: 403, baseType: !1203, size: 512, align: 64, offset: 1472)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 512, align: 64, elements: !1182)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1178, file: !780, line: 410, baseType: !956, size: 32, align: 32, offset: 1984)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1178, file: !780, line: 415, baseType: !956, size: 32, align: 32, offset: 2016)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1178, file: !780, line: 420, baseType: !956, size: 32, align: 32, offset: 2048)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1178, file: !780, line: 425, baseType: !956, size: 32, align: 32, offset: 2080)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1178, file: !780, line: 435, baseType: !962, size: 64, align: 64, offset: 2112)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1178, file: !780, line: 440, baseType: !956, size: 32, align: 32, offset: 2176)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1178, file: !780, line: 445, baseType: !1152, size: 64, align: 64, offset: 2240)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1178, file: !780, line: 459, baseType: !1212, size: 512, align: 64, offset: 2304)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1127, size: 512, align: 64, elements: !1182)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1178, file: !780, line: 473, baseType: !1214, size: 64, align: 64, offset: 2816)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1178, file: !780, line: 477, baseType: !956, size: 32, align: 32, offset: 2880)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1178, file: !780, line: 479, baseType: !1217, size: 64, align: 64, offset: 2944)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225, !1226}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1220, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1220, file: !780, line: 203, baseType: !1137, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1220, file: !780, line: 204, baseType: !956, size: 32, align: 32, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1220, file: !780, line: 205, baseType: !1046, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1220, file: !780, line: 206, baseType: !1127, size: 64, align: 64, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1178, file: !780, line: 480, baseType: !956, size: 32, align: 32, offset: 3008)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1178, file: !780, line: 505, baseType: !956, size: 32, align: 32, offset: 3040)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1178, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1178, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1178, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1178, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1178, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1178, file: !780, line: 532, baseType: !962, size: 64, align: 64, offset: 3264)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1178, file: !780, line: 539, baseType: !962, size: 64, align: 64, offset: 3328)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1178, file: !780, line: 547, baseType: !962, size: 64, align: 64, offset: 3392)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1178, file: !780, line: 554, baseType: !1046, size: 64, align: 64, offset: 3456)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1178, file: !780, line: 563, baseType: !956, size: 32, align: 32, offset: 3520)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1178, file: !780, line: 572, baseType: !956, size: 32, align: 32, offset: 3552)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1178, file: !780, line: 581, baseType: !956, size: 32, align: 32, offset: 3584)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1178, file: !780, line: 588, baseType: !1242, size: 64, align: 64, offset: 3648)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !963, line: 36, baseType: !1244)
!1244 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1178, file: !780, line: 593, baseType: !956, size: 32, align: 32, offset: 3712)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1178, file: !780, line: 596, baseType: !956, size: 32, align: 32, offset: 3744)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1178, file: !780, line: 599, baseType: !1127, size: 64, align: 64, offset: 3776)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1178, file: !780, line: 605, baseType: !1127, size: 64, align: 64, offset: 3840)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1178, file: !780, line: 616, baseType: !1127, size: 64, align: 64, offset: 3904)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1178, file: !780, line: 626, baseType: !1251, size: 64, align: 64, offset: 3968)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1252, line: 216, baseType: !1153)
!1252 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1178, file: !780, line: 627, baseType: !1251, size: 64, align: 64, offset: 4032)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1178, file: !780, line: 628, baseType: !1251, size: 64, align: 64, offset: 4096)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1178, file: !780, line: 629, baseType: !1251, size: 64, align: 64, offset: 4160)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1178, file: !780, line: 645, baseType: !1127, size: 64, align: 64, offset: 4224)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !926, file: !925, line: 553, baseType: !956, size: 32, align: 32, offset: 1472)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !926, file: !925, line: 562, baseType: !956, size: 32, align: 32, offset: 1504)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !926, file: !925, line: 568, baseType: !956, size: 32, align: 32, offset: 1536)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !926, file: !925, line: 573, baseType: !956, size: 32, align: 32, offset: 1568)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !926, file: !925, line: 578, baseType: !1077, size: 32, align: 32, offset: 1600)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !926, file: !925, line: 583, baseType: !962, size: 64, align: 64, offset: 1664)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !926, file: !925, line: 583, baseType: !962, size: 64, align: 64, offset: 1728)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !926, file: !925, line: 588, baseType: !947, size: 64, align: 64, offset: 1792)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !926, file: !925, line: 595, baseType: !956, size: 32, align: 32, offset: 1856)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !926, file: !925, line: 601, baseType: !1127, size: 64, align: 64, offset: 1920)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !926, file: !925, line: 610, baseType: !1268, size: 491520, align: 8, offset: 1984)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 491520, align: 8, elements: !1269)
!1269 = !{!1270}
!1270 = !DISubrange(count: 61440)
!1271 = !{!1272, !1273, !1274}
!1272 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!1273 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!1274 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!1275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1276, line: 437, size: 32, align: 32, elements: !1277)
!1276 = !DIFile(filename: "fftools/ffmpeg.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1277 = !{!1278, !1279}
!1278 = !DIEnumerator(name: "ENCODER_FINISHED", value: 1)
!1279 = !DIEnumerator(name: "MUXER_FINISHED", value: 2)
!1280 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HWAccelID", file: !1276, line: 58, size: 32, align: 32, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1285, !1286, !1287}
!1282 = !DIEnumerator(name: "HWACCEL_NONE", value: 0)
!1283 = !DIEnumerator(name: "HWACCEL_AUTO", value: 1)
!1284 = !DIEnumerator(name: "HWACCEL_GENERIC", value: 2)
!1285 = !DIEnumerator(name: "HWACCEL_VIDEOTOOLBOX", value: 3)
!1286 = !DIEnumerator(name: "HWACCEL_QSV", value: 4)
!1287 = !DIEnumerator(name: "HWACCEL_CUVID", value: 5)
!1288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVHWDeviceType", file: !1289, line: 27, size: 32, align: 32, elements: !1290)
!1289 = !DIFile(filename: "./libavutil/hwcontext.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1290 = !{!1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301}
!1291 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_NONE", value: 0)
!1292 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VDPAU", value: 1)
!1293 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_CUDA", value: 2)
!1294 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VAAPI", value: 3)
!1295 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DXVA2", value: 4)
!1296 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_QSV", value: 5)
!1297 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_VIDEOTOOLBOX", value: 6)
!1298 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_D3D11VA", value: 7)
!1299 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_DRM", value: 8)
!1300 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_OPENCL", value: 9)
!1301 = !DIEnumerator(name: "AV_HWDEVICE_TYPE_MEDIACODEC", value: 10)
!1302 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !1303, line: 111, size: 32, align: 32, elements: !1304)
!1303 = !DIFile(filename: "./libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1304 = !{!1305, !1306, !1307, !1308, !1309, !1310}
!1305 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!1306 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!1307 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!1308 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!1309 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!1310 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!1311 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !910, line: 1315, size: 32, align: 32, elements: !1312)
!1312 = !{!1313, !1314, !1315}
!1313 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!1314 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!1315 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!1316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !925, line: 974, size: 32, align: 32, elements: !1317)
!1317 = !{!1318, !1319}
!1318 = !DIEnumerator(name: "AVFILTER_AUTO_CONVERT_ALL", value: 0)
!1319 = !DIEnumerator(name: "AVFILTER_AUTO_CONVERT_NONE", value: -1)
!1320 = !{!947, !962, !956, !1077, !929}
!1321 = !{!1322, !1333}
!1322 = distinct !DIGlobalVariable(name: "mjpeg_formats", scope: !1323, file: !1324, line: 44, type: !1330, isLocal: true, isDefinition: true, variable: [7 x i32]* @get_compliance_unofficial_pix_fmts.mjpeg_formats)
!1323 = distinct !DISubprogram(name: "get_compliance_unofficial_pix_fmts", scope: !1324, file: !1324, line: 42, type: !1325, isLocal: true, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1329)
!1324 = !DIFile(filename: "fftools/ffmpeg_filter.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!1327, !256, !1327}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1329 = !{}
!1330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1328, size: 224, align: 32, elements: !1331)
!1331 = !{!1332}
!1332 = !DISubrange(count: 7)
!1333 = distinct !DIGlobalVariable(name: "ljpeg_formats", scope: !1323, file: !1324, line: 48, type: !1334, isLocal: true, isDefinition: true, variable: [10 x i32]* @get_compliance_unofficial_pix_fmts.ljpeg_formats)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1328, size: 320, align: 32, elements: !1335)
!1335 = !{!1336}
!1336 = !DISubrange(count: 10)
!1337 = !{i32 2, !"Dwarf Version", i32 4}
!1338 = !{i32 2, !"Debug Info Version", i32 3}
!1339 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1340 = distinct !DISubprogram(name: "choose_pixel_fmt", scope: !1324, file: !1324, line: 63, type: !1341, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1329)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!3, !1343, !1350, !2001, !3}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !910, line: 1223, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !910, line: 865, size: 6144, align: 64, elements: !1346)
!1346 = !{!1347, !1348, !1349, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1841, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1941, !1947, !1956, !1960, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1992, !1993, !1994, !1995, !1996, !1997}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1345, file: !910, line: 866, baseType: !956, size: 32, align: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1345, file: !910, line: 872, baseType: !956, size: 32, align: 32, offset: 32)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1345, file: !910, line: 878, baseType: !1350, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !257, line: 3360, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !257, line: 1556, size: 8448, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1514, !1515, !1516, !1517, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1543, !1547, !1548, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1729, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1352, file: !257, line: 1561, baseType: !934, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1352, file: !257, line: 1562, baseType: !956, size: 32, align: 32, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1352, file: !257, line: 1564, baseType: !246, size: 32, align: 32, offset: 96)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1352, file: !257, line: 1565, baseType: !1358, size: 64, align: 64, offset: 128)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !257, line: 3468, size: 1984, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1365, !1366, !1367, !1370, !1371, !1374, !1377, !1380, !1381, !1382, !1390, !1391, !1392, !1394, !1398, !1404, !1409, !1413, !1414, !1457, !1486, !1490, !1491, !1495, !1499, !1503, !1507, !1508, !1509}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1360, file: !257, line: 3475, baseType: !940, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1360, file: !257, line: 3480, baseType: !940, size: 64, align: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1360, file: !257, line: 3481, baseType: !246, size: 32, align: 32, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1360, file: !257, line: 3482, baseType: !256, size: 32, align: 32, offset: 160)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1360, file: !257, line: 3487, baseType: !956, size: 32, align: 32, offset: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1360, file: !257, line: 3488, baseType: !1368, size: 64, align: 64, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1360, file: !257, line: 3489, baseType: !1327, size: 64, align: 64, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1360, file: !257, line: 3490, baseType: !1372, size: 64, align: 64, offset: 384)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1360, file: !257, line: 3491, baseType: !1375, size: 64, align: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1360, file: !257, line: 3492, baseType: !1378, size: 64, align: 64, offset: 512)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1360, file: !257, line: 3493, baseType: !1138, size: 8, align: 8, offset: 576)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1360, file: !257, line: 3494, baseType: !934, size: 64, align: 64, offset: 640)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1360, file: !257, line: 3495, baseType: !1383, size: 64, align: 64, offset: 704)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1385)
!1385 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !257, line: 3404, baseType: !1386)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !257, line: 3401, size: 128, align: 64, elements: !1387)
!1387 = !{!1388, !1389}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1386, file: !257, line: 3402, baseType: !956, size: 32, align: 32)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1386, file: !257, line: 3403, baseType: !940, size: 64, align: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1360, file: !257, line: 3507, baseType: !940, size: 64, align: 64, offset: 768)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1360, file: !257, line: 3516, baseType: !956, size: 32, align: 32, offset: 832)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1360, file: !257, line: 3517, baseType: !1393, size: 64, align: 64, offset: 896)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1360, file: !257, line: 3527, baseType: !1395, size: 64, align: 64, offset: 960)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DISubroutineType(types: !1397)
!1397 = !{!956, !1350}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1360, file: !257, line: 3535, baseType: !1399, size: 64, align: 64, offset: 1024)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!956, !1350, !1402}
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1351)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1360, file: !257, line: 3541, baseType: !1405, size: 64, align: 64, offset: 1088)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1407)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !257, line: 3461, baseType: !1408)
!1408 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !257, line: 3461, flags: DIFlagFwdDecl)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1360, file: !257, line: 3549, baseType: !1410, size: 64, align: 64, offset: 1152)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{null, !1393}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1360, file: !257, line: 3551, baseType: !1395, size: 64, align: 64, offset: 1216)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1360, file: !257, line: 3552, baseType: !1415, size: 64, align: 64, offset: 1280)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!956, !1350, !1137, !956, !1418}
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !257, line: 3920, size: 256, align: 64, elements: !1421)
!1421 = !{!1422, !1425, !1427, !1428, !1429, !1456}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1420, file: !257, line: 3921, baseType: !1423, size: 16, align: 16)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !963, line: 49, baseType: !1424)
!1424 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1420, file: !257, line: 3922, baseType: !1426, size: 32, align: 32, offset: 32)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !963, line: 51, baseType: !1077)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1420, file: !257, line: 3923, baseType: !1426, size: 32, align: 32, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1420, file: !257, line: 3924, baseType: !1077, size: 32, align: 32, offset: 96)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1420, file: !257, line: 3925, baseType: !1430, size: 64, align: 64, offset: 128)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !257, line: 3918, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !257, line: 3885, size: 1600, align: 64, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1438, !1439, !1440, !1446, !1450, !1452, !1453, !1454, !1455}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1433, file: !257, line: 3886, baseType: !956, size: 32, align: 32)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1433, file: !257, line: 3887, baseType: !956, size: 32, align: 32, offset: 32)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1433, file: !257, line: 3888, baseType: !956, size: 32, align: 32, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1433, file: !257, line: 3889, baseType: !956, size: 32, align: 32, offset: 96)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1433, file: !257, line: 3890, baseType: !956, size: 32, align: 32, offset: 128)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1433, file: !257, line: 3897, baseType: !1441, size: 768, align: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !257, line: 3858, baseType: !1442)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !257, line: 3853, size: 768, align: 64, elements: !1443)
!1443 = !{!1444, !1445}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1442, file: !257, line: 3855, baseType: !1181, size: 512, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1442, file: !257, line: 3857, baseType: !1185, size: 256, align: 32, offset: 512)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1433, file: !257, line: 3903, baseType: !1447, size: 256, align: 64, offset: 960)
!1447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 256, align: 64, elements: !1448)
!1448 = !{!1449}
!1449 = !DISubrange(count: 4)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1433, file: !257, line: 3904, baseType: !1451, size: 128, align: 32, offset: 1216)
!1451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !956, size: 128, align: 32, elements: !1448)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1433, file: !257, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1433, file: !257, line: 3908, baseType: !1063, size: 64, align: 64, offset: 1408)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1433, file: !257, line: 3915, baseType: !1063, size: 64, align: 64, offset: 1472)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1433, file: !257, line: 3917, baseType: !956, size: 32, align: 32, offset: 1536)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1420, file: !257, line: 3926, baseType: !962, size: 64, align: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1360, file: !257, line: 3564, baseType: !1458, size: 64, align: 64, offset: 1344)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!956, !1350, !1461, !1484, !1108}
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !257, line: 1499, baseType: !1463)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !257, line: 1445, size: 704, align: 64, elements: !1464)
!1464 = !{!1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1480, !1481, !1482, !1483}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1463, file: !257, line: 1451, baseType: !1127, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1463, file: !257, line: 1461, baseType: !962, size: 64, align: 64, offset: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1463, file: !257, line: 1467, baseType: !962, size: 64, align: 64, offset: 128)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1463, file: !257, line: 1468, baseType: !1137, size: 64, align: 64, offset: 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1463, file: !257, line: 1469, baseType: !956, size: 32, align: 32, offset: 256)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1463, file: !257, line: 1470, baseType: !956, size: 32, align: 32, offset: 288)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1463, file: !257, line: 1474, baseType: !956, size: 32, align: 32, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1463, file: !257, line: 1479, baseType: !1473, size: 64, align: 64, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !257, line: 1415, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !257, line: 1411, size: 128, align: 64, elements: !1476)
!1476 = !{!1477, !1478, !1479}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1475, file: !257, line: 1412, baseType: !1137, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1475, file: !257, line: 1413, baseType: !956, size: 32, align: 32, offset: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1475, file: !257, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1463, file: !257, line: 1480, baseType: !956, size: 32, align: 32, offset: 448)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1463, file: !257, line: 1486, baseType: !962, size: 64, align: 64, offset: 512)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1463, file: !257, line: 1488, baseType: !962, size: 64, align: 64, offset: 576)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1463, file: !257, line: 1497, baseType: !962, size: 64, align: 64, offset: 640)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1360, file: !257, line: 3566, baseType: !1487, size: 64, align: 64, offset: 1408)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!956, !1350, !947, !1108, !1461}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1360, file: !257, line: 3567, baseType: !1395, size: 64, align: 64, offset: 1472)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1360, file: !257, line: 3576, baseType: !1492, size: 64, align: 64, offset: 1536)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!956, !1350, !1484}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1360, file: !257, line: 3577, baseType: !1496, size: 64, align: 64, offset: 1600)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!956, !1350, !1461}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1360, file: !257, line: 3584, baseType: !1500, size: 64, align: 64, offset: 1664)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{!956, !1350, !1176}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1360, file: !257, line: 3589, baseType: !1504, size: 64, align: 64, offset: 1728)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{null, !1350}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1360, file: !257, line: 3594, baseType: !956, size: 32, align: 32, offset: 1792)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1360, file: !257, line: 3600, baseType: !940, size: 64, align: 64, offset: 1856)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1360, file: !257, line: 3609, baseType: !1510, size: 64, align: 64, offset: 1920)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1513)
!1513 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !257, line: 3609, flags: DIFlagFwdDecl)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1352, file: !257, line: 1566, baseType: !256, size: 32, align: 32, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1352, file: !257, line: 1581, baseType: !1077, size: 32, align: 32, offset: 224)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1352, file: !257, line: 1583, baseType: !947, size: 64, align: 64, offset: 256)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1352, file: !257, line: 1591, baseType: !1518, size: 64, align: 64, offset: 320)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !257, line: 1532, flags: DIFlagFwdDecl)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1352, file: !257, line: 1598, baseType: !947, size: 64, align: 64, offset: 384)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1352, file: !257, line: 1606, baseType: !962, size: 64, align: 64, offset: 448)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1352, file: !257, line: 1614, baseType: !956, size: 32, align: 32, offset: 512)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1352, file: !257, line: 1622, baseType: !956, size: 32, align: 32, offset: 544)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1352, file: !257, line: 1628, baseType: !956, size: 32, align: 32, offset: 576)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1352, file: !257, line: 1636, baseType: !956, size: 32, align: 32, offset: 608)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1352, file: !257, line: 1643, baseType: !956, size: 32, align: 32, offset: 640)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1352, file: !257, line: 1657, baseType: !1137, size: 64, align: 64, offset: 704)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1352, file: !257, line: 1658, baseType: !956, size: 32, align: 32, offset: 768)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1352, file: !257, line: 1679, baseType: !969, size: 64, align: 32, offset: 800)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1352, file: !257, line: 1688, baseType: !956, size: 32, align: 32, offset: 864)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1352, file: !257, line: 1712, baseType: !956, size: 32, align: 32, offset: 896)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1352, file: !257, line: 1729, baseType: !956, size: 32, align: 32, offset: 928)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1352, file: !257, line: 1729, baseType: !956, size: 32, align: 32, offset: 960)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1352, file: !257, line: 1744, baseType: !956, size: 32, align: 32, offset: 992)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1352, file: !257, line: 1744, baseType: !956, size: 32, align: 32, offset: 1024)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1352, file: !257, line: 1751, baseType: !956, size: 32, align: 32, offset: 1056)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1352, file: !257, line: 1766, baseType: !3, size: 32, align: 32, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1352, file: !257, line: 1791, baseType: !1539, size: 64, align: 64, offset: 1152)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{null, !1542, !1484, !1108, !956, !956, !956}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1352, file: !257, line: 1808, baseType: !1544, size: 64, align: 64, offset: 1216)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!3, !1542, !1327}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1352, file: !257, line: 1816, baseType: !956, size: 32, align: 32, offset: 1280)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1352, file: !257, line: 1825, baseType: !1549, size: 32, align: 32, offset: 1312)
!1549 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1352, file: !257, line: 1830, baseType: !956, size: 32, align: 32, offset: 1344)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1352, file: !257, line: 1838, baseType: !1549, size: 32, align: 32, offset: 1376)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1352, file: !257, line: 1846, baseType: !956, size: 32, align: 32, offset: 1408)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1352, file: !257, line: 1851, baseType: !956, size: 32, align: 32, offset: 1440)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1352, file: !257, line: 1861, baseType: !1549, size: 32, align: 32, offset: 1472)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1352, file: !257, line: 1868, baseType: !1549, size: 32, align: 32, offset: 1504)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1352, file: !257, line: 1875, baseType: !1549, size: 32, align: 32, offset: 1536)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1352, file: !257, line: 1882, baseType: !1549, size: 32, align: 32, offset: 1568)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1352, file: !257, line: 1889, baseType: !1549, size: 32, align: 32, offset: 1600)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1352, file: !257, line: 1896, baseType: !1549, size: 32, align: 32, offset: 1632)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1352, file: !257, line: 1903, baseType: !1549, size: 32, align: 32, offset: 1664)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1352, file: !257, line: 1910, baseType: !956, size: 32, align: 32, offset: 1696)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1352, file: !257, line: 1915, baseType: !956, size: 32, align: 32, offset: 1728)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1352, file: !257, line: 1926, baseType: !1108, size: 64, align: 64, offset: 1792)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1352, file: !257, line: 1935, baseType: !969, size: 64, align: 32, offset: 1856)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1352, file: !257, line: 1942, baseType: !956, size: 32, align: 32, offset: 1920)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1352, file: !257, line: 1948, baseType: !956, size: 32, align: 32, offset: 1952)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1352, file: !257, line: 1954, baseType: !956, size: 32, align: 32, offset: 1984)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1352, file: !257, line: 1960, baseType: !956, size: 32, align: 32, offset: 2016)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1352, file: !257, line: 1984, baseType: !956, size: 32, align: 32, offset: 2048)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1352, file: !257, line: 1991, baseType: !956, size: 32, align: 32, offset: 2080)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1352, file: !257, line: 1996, baseType: !956, size: 32, align: 32, offset: 2112)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1352, file: !257, line: 2004, baseType: !956, size: 32, align: 32, offset: 2144)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1352, file: !257, line: 2011, baseType: !956, size: 32, align: 32, offset: 2176)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1352, file: !257, line: 2018, baseType: !956, size: 32, align: 32, offset: 2208)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1352, file: !257, line: 2027, baseType: !956, size: 32, align: 32, offset: 2240)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1352, file: !257, line: 2034, baseType: !956, size: 32, align: 32, offset: 2272)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1352, file: !257, line: 2044, baseType: !956, size: 32, align: 32, offset: 2304)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1352, file: !257, line: 2054, baseType: !1579, size: 64, align: 64, offset: 2368)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1352, file: !257, line: 2061, baseType: !1579, size: 64, align: 64, offset: 2432)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1352, file: !257, line: 2066, baseType: !956, size: 32, align: 32, offset: 2496)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1352, file: !257, line: 2070, baseType: !956, size: 32, align: 32, offset: 2528)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1352, file: !257, line: 2078, baseType: !956, size: 32, align: 32, offset: 2560)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1352, file: !257, line: 2085, baseType: !956, size: 32, align: 32, offset: 2592)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1352, file: !257, line: 2092, baseType: !956, size: 32, align: 32, offset: 2624)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1352, file: !257, line: 2099, baseType: !956, size: 32, align: 32, offset: 2656)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1352, file: !257, line: 2106, baseType: !956, size: 32, align: 32, offset: 2688)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1352, file: !257, line: 2113, baseType: !956, size: 32, align: 32, offset: 2720)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1352, file: !257, line: 2120, baseType: !956, size: 32, align: 32, offset: 2752)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1352, file: !257, line: 2125, baseType: !956, size: 32, align: 32, offset: 2784)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1352, file: !257, line: 2133, baseType: !956, size: 32, align: 32, offset: 2816)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1352, file: !257, line: 2140, baseType: !956, size: 32, align: 32, offset: 2848)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1352, file: !257, line: 2145, baseType: !956, size: 32, align: 32, offset: 2880)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1352, file: !257, line: 2153, baseType: !956, size: 32, align: 32, offset: 2912)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1352, file: !257, line: 2158, baseType: !956, size: 32, align: 32, offset: 2944)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1352, file: !257, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1352, file: !257, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1352, file: !257, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1352, file: !257, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1352, file: !257, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1352, file: !257, line: 2203, baseType: !956, size: 32, align: 32, offset: 3136)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1352, file: !257, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1352, file: !257, line: 2212, baseType: !956, size: 32, align: 32, offset: 3200)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1352, file: !257, line: 2213, baseType: !956, size: 32, align: 32, offset: 3232)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1352, file: !257, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1352, file: !257, line: 2232, baseType: !956, size: 32, align: 32, offset: 3296)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1352, file: !257, line: 2243, baseType: !956, size: 32, align: 32, offset: 3328)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1352, file: !257, line: 2249, baseType: !956, size: 32, align: 32, offset: 3360)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1352, file: !257, line: 2256, baseType: !956, size: 32, align: 32, offset: 3392)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1352, file: !257, line: 2263, baseType: !1152, size: 64, align: 64, offset: 3456)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1352, file: !257, line: 2270, baseType: !1152, size: 64, align: 64, offset: 3520)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1352, file: !257, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1352, file: !257, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1352, file: !257, line: 2367, baseType: !1615, size: 64, align: 64, offset: 3648)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!956, !1542, !1176, !956}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1352, file: !257, line: 2383, baseType: !956, size: 32, align: 32, offset: 3712)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1352, file: !257, line: 2386, baseType: !1549, size: 32, align: 32, offset: 3744)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1352, file: !257, line: 2387, baseType: !1549, size: 32, align: 32, offset: 3776)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1352, file: !257, line: 2394, baseType: !956, size: 32, align: 32, offset: 3808)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1352, file: !257, line: 2401, baseType: !956, size: 32, align: 32, offset: 3840)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1352, file: !257, line: 2408, baseType: !956, size: 32, align: 32, offset: 3872)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1352, file: !257, line: 2415, baseType: !956, size: 32, align: 32, offset: 3904)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1352, file: !257, line: 2422, baseType: !956, size: 32, align: 32, offset: 3936)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1352, file: !257, line: 2423, baseType: !1627, size: 64, align: 64, offset: 3968)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !257, line: 831, baseType: !1629)
!1629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !257, line: 826, size: 128, align: 32, elements: !1630)
!1630 = !{!1631, !1632, !1633, !1634}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1629, file: !257, line: 827, baseType: !956, size: 32, align: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1629, file: !257, line: 828, baseType: !956, size: 32, align: 32, offset: 32)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1629, file: !257, line: 829, baseType: !956, size: 32, align: 32, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1629, file: !257, line: 830, baseType: !1549, size: 32, align: 32, offset: 96)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1352, file: !257, line: 2430, baseType: !962, size: 64, align: 64, offset: 4032)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1352, file: !257, line: 2437, baseType: !962, size: 64, align: 64, offset: 4096)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1352, file: !257, line: 2444, baseType: !1549, size: 32, align: 32, offset: 4160)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1352, file: !257, line: 2451, baseType: !1549, size: 32, align: 32, offset: 4192)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1352, file: !257, line: 2458, baseType: !956, size: 32, align: 32, offset: 4224)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1352, file: !257, line: 2469, baseType: !956, size: 32, align: 32, offset: 4256)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1352, file: !257, line: 2475, baseType: !956, size: 32, align: 32, offset: 4288)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1352, file: !257, line: 2481, baseType: !956, size: 32, align: 32, offset: 4320)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1352, file: !257, line: 2485, baseType: !956, size: 32, align: 32, offset: 4352)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1352, file: !257, line: 2489, baseType: !956, size: 32, align: 32, offset: 4384)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1352, file: !257, line: 2493, baseType: !956, size: 32, align: 32, offset: 4416)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1352, file: !257, line: 2501, baseType: !956, size: 32, align: 32, offset: 4448)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1352, file: !257, line: 2506, baseType: !956, size: 32, align: 32, offset: 4480)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1352, file: !257, line: 2510, baseType: !956, size: 32, align: 32, offset: 4512)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1352, file: !257, line: 2514, baseType: !962, size: 64, align: 64, offset: 4544)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1352, file: !257, line: 2528, baseType: !1651, size: 64, align: 64, offset: 4608)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DISubroutineType(types: !1653)
!1653 = !{null, !1542, !947, !956, !956}
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1352, file: !257, line: 2534, baseType: !956, size: 32, align: 32, offset: 4672)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1352, file: !257, line: 2545, baseType: !956, size: 32, align: 32, offset: 4704)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1352, file: !257, line: 2547, baseType: !956, size: 32, align: 32, offset: 4736)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1352, file: !257, line: 2549, baseType: !956, size: 32, align: 32, offset: 4768)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1352, file: !257, line: 2551, baseType: !956, size: 32, align: 32, offset: 4800)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1352, file: !257, line: 2553, baseType: !956, size: 32, align: 32, offset: 4832)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1352, file: !257, line: 2555, baseType: !956, size: 32, align: 32, offset: 4864)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1352, file: !257, line: 2557, baseType: !956, size: 32, align: 32, offset: 4896)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1352, file: !257, line: 2559, baseType: !956, size: 32, align: 32, offset: 4928)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1352, file: !257, line: 2563, baseType: !956, size: 32, align: 32, offset: 4960)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1352, file: !257, line: 2571, baseType: !1063, size: 64, align: 64, offset: 4992)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1352, file: !257, line: 2579, baseType: !1063, size: 64, align: 64, offset: 5056)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1352, file: !257, line: 2586, baseType: !956, size: 32, align: 32, offset: 5120)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1352, file: !257, line: 2615, baseType: !956, size: 32, align: 32, offset: 5152)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1352, file: !257, line: 2627, baseType: !956, size: 32, align: 32, offset: 5184)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1352, file: !257, line: 2637, baseType: !956, size: 32, align: 32, offset: 5216)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1352, file: !257, line: 2681, baseType: !956, size: 32, align: 32, offset: 5248)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1352, file: !257, line: 2709, baseType: !962, size: 64, align: 64, offset: 5312)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1352, file: !257, line: 2716, baseType: !1673, size: 64, align: 64, offset: 5376)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1675)
!1675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !257, line: 3636, size: 896, align: 64, elements: !1676)
!1676 = !{!1677, !1678, !1679, !1680, !1681, !1682, !1683, !1689, !1693, !1694, !1695, !1696, !1702, !1703, !1704, !1705, !1706}
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1675, file: !257, line: 3642, baseType: !940, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1675, file: !257, line: 3649, baseType: !246, size: 32, align: 32, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1675, file: !257, line: 3656, baseType: !256, size: 32, align: 32, offset: 96)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1675, file: !257, line: 3663, baseType: !3, size: 32, align: 32, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1675, file: !257, line: 3669, baseType: !956, size: 32, align: 32, offset: 160)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1675, file: !257, line: 3682, baseType: !1500, size: 64, align: 64, offset: 192)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1675, file: !257, line: 3698, baseType: !1684, size: 64, align: 64, offset: 256)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!956, !1350, !1687, !1426}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1138)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1675, file: !257, line: 3712, baseType: !1690, size: 64, align: 64, offset: 320)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!956, !1350, !956, !1687, !1426}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1675, file: !257, line: 3726, baseType: !1684, size: 64, align: 64, offset: 384)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1675, file: !257, line: 3737, baseType: !1395, size: 64, align: 64, offset: 448)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1675, file: !257, line: 3746, baseType: !956, size: 32, align: 32, offset: 512)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1675, file: !257, line: 3757, baseType: !1697, size: 64, align: 64, offset: 576)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{null, !1700}
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !257, line: 3617, flags: DIFlagFwdDecl)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1675, file: !257, line: 3766, baseType: !1395, size: 64, align: 64, offset: 640)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1675, file: !257, line: 3774, baseType: !1395, size: 64, align: 64, offset: 704)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1675, file: !257, line: 3780, baseType: !956, size: 32, align: 32, offset: 768)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1675, file: !257, line: 3785, baseType: !956, size: 32, align: 32, offset: 800)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1675, file: !257, line: 3795, baseType: !1707, size: 64, align: 64, offset: 832)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64, align: 64)
!1708 = !DISubroutineType(types: !1709)
!1709 = !{!956, !1350, !1127}
