; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mlpdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mlpdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMatrixEncoding", file: !888, line: 114, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "./libavutil/channel_layout.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897}
!890 = !DIEnumerator(name: "AV_MATRIX_ENCODING_NONE", value: 0)
!891 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBY", value: 1)
!892 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLII", value: 2)
!893 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLIIX", value: 3)
!894 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DPLIIZ", value: 4)
!895 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBYEX", value: 5)
!896 = !DIEnumerator(name: "AV_MATRIX_ENCODING_DOLBYHEADPHONE", value: 6)
!897 = !DIEnumerator(name: "AV_MATRIX_ENCODING_NB", value: 7)
!898 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "THDChannelModifier", file: !899, line: 167, size: 32, align: 32, elements: !900)
!899 = !DIFile(filename: "libavcodec/mlp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!900 = !{!901, !902, !903, !904, !905, !906, !907}
!901 = !DIEnumerator(name: "THD_CH_MODIFIER_NOTINDICATED", value: 0)
!902 = !DIEnumerator(name: "THD_CH_MODIFIER_STEREO", value: 0)
!903 = !DIEnumerator(name: "THD_CH_MODIFIER_LTRT", value: 1)
!904 = !DIEnumerator(name: "THD_CH_MODIFIER_LBINRBIN", value: 2)
!905 = !DIEnumerator(name: "THD_CH_MODIFIER_MONO", value: 3)
!906 = !DIEnumerator(name: "THD_CH_MODIFIER_NOTSURROUNDEX", value: 1)
!907 = !DIEnumerator(name: "THD_CH_MODIFIER_SURROUNDEX", value: 2)
!908 = !{!909, !910, !911, !920, !926, !928, !929}
!909 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!910 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !914, line: 222, size: 16, align: 8, elements: !915)
!914 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!915 = !{!916}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !913, file: !914, line: 222, baseType: !917, size: 16, align: 16)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !918, line: 49, baseType: !919)
!918 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !914, line: 221, size: 32, align: 8, elements: !923)
!923 = !{!924}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !922, file: !914, line: 221, baseType: !925, size: 32, align: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !918, line: 51, baseType: !910)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !918, line: 48, baseType: !927)
!927 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !918, line: 36, baseType: !930)
!930 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!931 = !{!932, !1656, !1657, !1668, !1669, !1670, !1685, !1689}
!932 = distinct !DIGlobalVariable(name: "ff_mlp_decoder", scope: !0, file: !933, line: 1333, type: !934, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_mlp_decoder)
!933 = !DIFile(filename: "libavcodec/mlpdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !936)
!936 = !{!937, !941, !942, !943, !944, !945, !954, !957, !960, !963, !968, !969, !1010, !1018, !1019, !1020, !1022, !1571, !1577, !1585, !1589, !1590, !1627, !1631, !1635, !1636, !1640, !1644, !1645, !1649, !1650, !1651}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !14, line: 3475, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !935, file: !14, line: 3480, baseType: !938, size: 64, align: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !935, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !935, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !935, file: !14, line: 3487, baseType: !909, size: 32, align: 32, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !935, file: !14, line: 3488, baseType: !946, size: 64, align: 64, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !949, line: 61, baseType: !950)
!949 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !949, line: 58, size: 64, align: 32, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !950, file: !949, line: 59, baseType: !909, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !950, file: !949, line: 60, baseType: !909, size: 32, align: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !935, file: !14, line: 3489, baseType: !955, size: 64, align: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !935, file: !14, line: 3490, baseType: !958, size: 64, align: 64, offset: 384)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !935, file: !14, line: 3491, baseType: !961, size: 64, align: 64, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !935, file: !14, line: 3492, baseType: !964, size: 64, align: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !918, line: 55, baseType: !967)
!967 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !935, file: !14, line: 3493, baseType: !926, size: 8, align: 8, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !935, file: !14, line: 3494, baseType: !970, size: 64, align: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !974)
!974 = !{!975, !976, !980, !984, !985, !986, !987, !991, !997, !999, !1003}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !973, file: !691, line: 72, baseType: !938, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !973, file: !691, line: 78, baseType: !977, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!938, !928}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !973, file: !691, line: 85, baseType: !981, size: 64, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !973, file: !691, line: 93, baseType: !909, size: 32, align: 32, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !973, file: !691, line: 99, baseType: !909, size: 32, align: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !973, file: !691, line: 108, baseType: !909, size: 32, align: 32, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !973, file: !691, line: 113, baseType: !988, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!928, !928, !928}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !973, file: !691, line: 123, baseType: !992, size: 64, align: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!995, !995}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !973, file: !691, line: 130, baseType: !998, size: 32, align: 32, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !973, file: !691, line: 136, baseType: !1000, size: 64, align: 64, offset: 512)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!998, !928}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !973, file: !691, line: 142, baseType: !1004, size: 64, align: 64, offset: 576)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!909, !1007, !928, !938, !909}
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !935, file: !14, line: 3495, baseType: !1011, size: 64, align: 64, offset: 704)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1014, file: !14, line: 3402, baseType: !909, size: 32, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !14, line: 3403, baseType: !938, size: 64, align: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !935, file: !14, line: 3507, baseType: !938, size: 64, align: 64, offset: 768)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !935, file: !14, line: 3516, baseType: !909, size: 32, align: 32, offset: 832)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !935, file: !14, line: 3517, baseType: !1021, size: 64, align: 64, offset: 896)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !935, file: !14, line: 3527, baseType: !1023, size: 64, align: 64, offset: 960)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!909, !1026}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1036, !1037, !1038, !1039, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1319, !1323, !1324, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1509, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1028, file: !14, line: 1561, baseType: !970, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1028, file: !14, line: 1562, baseType: !909, size: 32, align: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1028, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1028, file: !14, line: 1565, baseType: !1034, size: 64, align: 64, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1028, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1028, file: !14, line: 1581, baseType: !910, size: 32, align: 32, offset: 224)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1028, file: !14, line: 1583, baseType: !928, size: 64, align: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1028, file: !14, line: 1591, baseType: !1040, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1042, line: 129, size: 1664, align: 64, elements: !1043)
!1042 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1043 = !{!1044, !1045, !1046, !1047, !1145, !1166, !1167, !1196, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1041, file: !1042, line: 136, baseType: !909, size: 32, align: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1041, file: !1042, line: 151, baseType: !909, size: 32, align: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1041, file: !1042, line: 157, baseType: !909, size: 32, align: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1041, file: !1042, line: 159, baseType: !1048, size: 64, align: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1051)
!1051 = !{!1052, !1057, !1059, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1099, !1101, !1102, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1133, !1134, !1135, !1136, !1137, !1138, !1141, !1142, !1143, !1144}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1050, file: !722, line: 282, baseType: !1053, size: 512, align: 64)
!1053 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 512, align: 64, elements: !1055)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1055 = !{!1056}
!1056 = !DISubrange(count: 8)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1050, file: !722, line: 299, baseType: !1058, size: 256, align: 32, offset: 512)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 256, align: 32, elements: !1055)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1050, file: !722, line: 315, baseType: !1060, size: 64, align: 64, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1050, file: !722, line: 326, baseType: !909, size: 32, align: 32, offset: 832)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1050, file: !722, line: 326, baseType: !909, size: 32, align: 32, offset: 864)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1050, file: !722, line: 334, baseType: !909, size: 32, align: 32, offset: 896)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1050, file: !722, line: 341, baseType: !909, size: 32, align: 32, offset: 928)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1050, file: !722, line: 346, baseType: !909, size: 32, align: 32, offset: 960)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1050, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1050, file: !722, line: 356, baseType: !948, size: 64, align: 32, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1050, file: !722, line: 361, baseType: !1069, size: 64, align: 64, offset: 1088)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !918, line: 40, baseType: !1070)
!1070 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1050, file: !722, line: 369, baseType: !1069, size: 64, align: 64, offset: 1152)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1050, file: !722, line: 377, baseType: !1069, size: 64, align: 64, offset: 1216)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1050, file: !722, line: 382, baseType: !909, size: 32, align: 32, offset: 1280)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1050, file: !722, line: 386, baseType: !909, size: 32, align: 32, offset: 1312)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1050, file: !722, line: 391, baseType: !909, size: 32, align: 32, offset: 1344)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1050, file: !722, line: 396, baseType: !928, size: 64, align: 64, offset: 1408)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1050, file: !722, line: 403, baseType: !1078, size: 512, align: 64, offset: 1472)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 512, align: 64, elements: !1055)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1050, file: !722, line: 410, baseType: !909, size: 32, align: 32, offset: 1984)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1050, file: !722, line: 415, baseType: !909, size: 32, align: 32, offset: 2016)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1050, file: !722, line: 420, baseType: !909, size: 32, align: 32, offset: 2048)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1050, file: !722, line: 425, baseType: !909, size: 32, align: 32, offset: 2080)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1050, file: !722, line: 435, baseType: !1069, size: 64, align: 64, offset: 2112)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1050, file: !722, line: 440, baseType: !909, size: 32, align: 32, offset: 2176)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1050, file: !722, line: 445, baseType: !966, size: 64, align: 64, offset: 2240)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1050, file: !722, line: 459, baseType: !1087, size: 512, align: 64, offset: 2304)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 512, align: 64, elements: !1055)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1090, line: 94, baseType: !1091)
!1090 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1090, line: 81, size: 192, align: 64, elements: !1092)
!1092 = !{!1093, !1097, !1098}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1091, file: !1090, line: 82, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1090, line: 73, baseType: !1096)
!1096 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1090, line: 73, flags: DIFlagFwdDecl)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1091, file: !1090, line: 89, baseType: !1054, size: 64, align: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1091, file: !1090, line: 93, baseType: !909, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1050, file: !722, line: 473, baseType: !1100, size: 64, align: 64, offset: 2816)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1050, file: !722, line: 477, baseType: !909, size: 32, align: 32, offset: 2880)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1050, file: !722, line: 479, baseType: !1103, size: 64, align: 64, offset: 2944)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1116}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1106, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !722, line: 203, baseType: !1054, size: 64, align: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !722, line: 204, baseType: !909, size: 32, align: 32, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1106, file: !722, line: 205, baseType: !1112, size: 64, align: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1114, line: 86, baseType: !1115)
!1114 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1114, line: 86, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !722, line: 206, baseType: !1088, size: 64, align: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1050, file: !722, line: 480, baseType: !909, size: 32, align: 32, offset: 3008)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1050, file: !722, line: 505, baseType: !909, size: 32, align: 32, offset: 3040)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1050, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1050, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1050, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1050, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1050, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1050, file: !722, line: 532, baseType: !1069, size: 64, align: 64, offset: 3264)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1050, file: !722, line: 539, baseType: !1069, size: 64, align: 64, offset: 3328)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1050, file: !722, line: 547, baseType: !1069, size: 64, align: 64, offset: 3392)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1050, file: !722, line: 554, baseType: !1112, size: 64, align: 64, offset: 3456)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1050, file: !722, line: 563, baseType: !909, size: 32, align: 32, offset: 3520)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1050, file: !722, line: 572, baseType: !909, size: 32, align: 32, offset: 3552)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1050, file: !722, line: 581, baseType: !909, size: 32, align: 32, offset: 3584)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1050, file: !722, line: 588, baseType: !1132, size: 64, align: 64, offset: 3648)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1050, file: !722, line: 593, baseType: !909, size: 32, align: 32, offset: 3712)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1050, file: !722, line: 596, baseType: !909, size: 32, align: 32, offset: 3744)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1050, file: !722, line: 599, baseType: !1088, size: 64, align: 64, offset: 3776)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1050, file: !722, line: 605, baseType: !1088, size: 64, align: 64, offset: 3840)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1050, file: !722, line: 616, baseType: !1088, size: 64, align: 64, offset: 3904)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1050, file: !722, line: 626, baseType: !1139, size: 64, align: 64, offset: 3968)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1140, line: 216, baseType: !967)
!1140 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1050, file: !722, line: 627, baseType: !1139, size: 64, align: 64, offset: 4032)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1050, file: !722, line: 628, baseType: !1139, size: 64, align: 64, offset: 4096)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1050, file: !722, line: 629, baseType: !1139, size: 64, align: 64, offset: 4160)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1050, file: !722, line: 645, baseType: !1088, size: 64, align: 64, offset: 4224)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1041, file: !1042, line: 161, baseType: !1146, size: 64, align: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1042, line: 117, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1042, line: 100, size: 832, align: 64, elements: !1149)
!1149 = !{!1150, !1157, !1158, !1159, !1160, !1161, !1163, !1164, !1165}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1148, file: !1042, line: 105, baseType: !1151, size: 256, align: 64)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 256, align: 64, elements: !1155)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1090, line: 238, baseType: !1154)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1090, line: 238, flags: DIFlagFwdDecl)
!1155 = !{!1156}
!1156 = !DISubrange(count: 4)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1148, file: !1042, line: 110, baseType: !909, size: 32, align: 32, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1148, file: !1042, line: 111, baseType: !909, size: 32, align: 32, offset: 288)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1148, file: !1042, line: 111, baseType: !909, size: 32, align: 32, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1148, file: !1042, line: 112, baseType: !1058, size: 256, align: 32, offset: 352)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1148, file: !1042, line: 113, baseType: !1162, size: 128, align: 32, offset: 608)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 128, align: 32, elements: !1155)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1148, file: !1042, line: 114, baseType: !909, size: 32, align: 32, offset: 736)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1148, file: !1042, line: 115, baseType: !909, size: 32, align: 32, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1148, file: !1042, line: 116, baseType: !909, size: 32, align: 32, offset: 800)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1041, file: !1042, line: 163, baseType: !928, size: 64, align: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1041, file: !1042, line: 165, baseType: !1168, size: 128, align: 64, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1042, line: 122, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1042, line: 119, size: 128, align: 64, elements: !1170)
!1170 = !{!1171, !1195}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1169, file: !1042, line: 120, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1191, !1192, !1193, !1194}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1174, file: !14, line: 1451, baseType: !1088, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1174, file: !14, line: 1461, baseType: !1069, size: 64, align: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1174, file: !14, line: 1467, baseType: !1069, size: 64, align: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1174, file: !14, line: 1468, baseType: !1054, size: 64, align: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1174, file: !14, line: 1469, baseType: !909, size: 32, align: 32, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1174, file: !14, line: 1470, baseType: !909, size: 32, align: 32, offset: 288)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1174, file: !14, line: 1474, baseType: !909, size: 32, align: 32, offset: 320)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1174, file: !14, line: 1479, baseType: !1184, size: 64, align: 64, offset: 384)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1187)
!1187 = !{!1188, !1189, !1190}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !14, line: 1412, baseType: !1054, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1186, file: !14, line: 1413, baseType: !909, size: 32, align: 32, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1186, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1174, file: !14, line: 1480, baseType: !909, size: 32, align: 32, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1174, file: !14, line: 1486, baseType: !1069, size: 64, align: 64, offset: 512)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1174, file: !14, line: 1488, baseType: !1069, size: 64, align: 64, offset: 576)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1174, file: !14, line: 1497, baseType: !1069, size: 64, align: 64, offset: 640)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1169, file: !1042, line: 121, baseType: !1048, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1041, file: !1042, line: 166, baseType: !1197, size: 128, align: 64, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1042, line: 127, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1042, line: 124, size: 128, align: 64, elements: !1199)
!1199 = !{!1200, !1273}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1198, file: !1042, line: 125, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1205)
!1205 = !{!1206, !1207, !1231, !1235, !1236, !1270, !1271, !1272}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1204, file: !14, line: 5751, baseType: !970, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1204, file: !14, line: 5756, baseType: !1208, size: 64, align: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1210)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1211)
!1211 = !{!1212, !1213, !1216, !1217, !1218, !1222, !1226, !1230}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1210, file: !14, line: 5797, baseType: !938, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1210, file: !14, line: 5804, baseType: !1214, size: 64, align: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1210, file: !14, line: 5815, baseType: !970, size: 64, align: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1210, file: !14, line: 5825, baseType: !909, size: 32, align: 32, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1210, file: !14, line: 5826, baseType: !1219, size: 64, align: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!909, !1202}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1210, file: !14, line: 5827, baseType: !1223, size: 64, align: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{!909, !1202, !1172}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1210, file: !14, line: 5828, baseType: !1227, size: 64, align: 64, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{null, !1202}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1210, file: !14, line: 5829, baseType: !1227, size: 64, align: 64, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1204, file: !14, line: 5762, baseType: !1232, size: 64, align: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1234)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1204, file: !14, line: 5768, baseType: !928, size: 64, align: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1204, file: !14, line: 5775, baseType: !1237, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1239, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1239, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1239, file: !14, line: 3948, baseType: !925, size: 32, align: 32, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1239, file: !14, line: 3958, baseType: !1054, size: 64, align: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1239, file: !14, line: 3962, baseType: !909, size: 32, align: 32, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1239, file: !14, line: 3968, baseType: !909, size: 32, align: 32, offset: 224)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1239, file: !14, line: 3973, baseType: !1069, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1239, file: !14, line: 3986, baseType: !909, size: 32, align: 32, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1239, file: !14, line: 3999, baseType: !909, size: 32, align: 32, offset: 352)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1239, file: !14, line: 4004, baseType: !909, size: 32, align: 32, offset: 384)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1239, file: !14, line: 4005, baseType: !909, size: 32, align: 32, offset: 416)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1239, file: !14, line: 4010, baseType: !909, size: 32, align: 32, offset: 448)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1239, file: !14, line: 4011, baseType: !909, size: 32, align: 32, offset: 480)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1239, file: !14, line: 4020, baseType: !948, size: 64, align: 32, offset: 512)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1239, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1239, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1239, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1239, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1239, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1239, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1239, file: !14, line: 4039, baseType: !909, size: 32, align: 32, offset: 768)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1239, file: !14, line: 4046, baseType: !966, size: 64, align: 64, offset: 832)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1239, file: !14, line: 4050, baseType: !909, size: 32, align: 32, offset: 896)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1239, file: !14, line: 4054, baseType: !909, size: 32, align: 32, offset: 928)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1239, file: !14, line: 4061, baseType: !909, size: 32, align: 32, offset: 960)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1239, file: !14, line: 4065, baseType: !909, size: 32, align: 32, offset: 992)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1239, file: !14, line: 4073, baseType: !909, size: 32, align: 32, offset: 1024)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1239, file: !14, line: 4080, baseType: !909, size: 32, align: 32, offset: 1056)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1239, file: !14, line: 4084, baseType: !909, size: 32, align: 32, offset: 1088)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1204, file: !14, line: 5781, baseType: !1237, size: 64, align: 64, offset: 320)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1204, file: !14, line: 5787, baseType: !948, size: 64, align: 32, offset: 384)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1204, file: !14, line: 5793, baseType: !948, size: 64, align: 32, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1198, file: !1042, line: 126, baseType: !909, size: 32, align: 32, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1041, file: !1042, line: 172, baseType: !1172, size: 64, align: 64, offset: 576)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1041, file: !1042, line: 177, baseType: !1054, size: 64, align: 64, offset: 640)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1041, file: !1042, line: 178, baseType: !910, size: 32, align: 32, offset: 704)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1041, file: !1042, line: 180, baseType: !928, size: 64, align: 64, offset: 768)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1041, file: !1042, line: 185, baseType: !909, size: 32, align: 32, offset: 832)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1041, file: !1042, line: 190, baseType: !928, size: 64, align: 64, offset: 896)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1041, file: !1042, line: 195, baseType: !909, size: 32, align: 32, offset: 960)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1041, file: !1042, line: 200, baseType: !1172, size: 64, align: 64, offset: 1024)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1041, file: !1042, line: 201, baseType: !909, size: 32, align: 32, offset: 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1041, file: !1042, line: 202, baseType: !1048, size: 64, align: 64, offset: 1152)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1041, file: !1042, line: 203, baseType: !909, size: 32, align: 32, offset: 1216)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1041, file: !1042, line: 205, baseType: !909, size: 32, align: 32, offset: 1248)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1041, file: !1042, line: 206, baseType: !909, size: 32, align: 32, offset: 1280)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1041, file: !1042, line: 209, baseType: !1139, size: 64, align: 64, offset: 1344)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1041, file: !1042, line: 212, baseType: !1139, size: 64, align: 64, offset: 1408)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1041, file: !1042, line: 213, baseType: !1048, size: 64, align: 64, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1041, file: !1042, line: 215, baseType: !909, size: 32, align: 32, offset: 1536)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1041, file: !1042, line: 217, baseType: !909, size: 32, align: 32, offset: 1568)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1041, file: !1042, line: 220, baseType: !909, size: 32, align: 32, offset: 1600)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1028, file: !14, line: 1598, baseType: !928, size: 64, align: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1028, file: !14, line: 1606, baseType: !1069, size: 64, align: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1028, file: !14, line: 1614, baseType: !909, size: 32, align: 32, offset: 512)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1028, file: !14, line: 1622, baseType: !909, size: 32, align: 32, offset: 544)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1028, file: !14, line: 1628, baseType: !909, size: 32, align: 32, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !14, line: 1636, baseType: !909, size: 32, align: 32, offset: 608)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1028, file: !14, line: 1643, baseType: !909, size: 32, align: 32, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1028, file: !14, line: 1657, baseType: !1054, size: 64, align: 64, offset: 704)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1028, file: !14, line: 1658, baseType: !909, size: 32, align: 32, offset: 768)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1028, file: !14, line: 1679, baseType: !948, size: 64, align: 32, offset: 800)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1028, file: !14, line: 1688, baseType: !909, size: 32, align: 32, offset: 864)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1028, file: !14, line: 1712, baseType: !909, size: 32, align: 32, offset: 896)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1028, file: !14, line: 1729, baseType: !909, size: 32, align: 32, offset: 928)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1028, file: !14, line: 1729, baseType: !909, size: 32, align: 32, offset: 960)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1028, file: !14, line: 1744, baseType: !909, size: 32, align: 32, offset: 992)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1028, file: !14, line: 1744, baseType: !909, size: 32, align: 32, offset: 1024)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1028, file: !14, line: 1751, baseType: !909, size: 32, align: 32, offset: 1056)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1028, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1028, file: !14, line: 1791, baseType: !1312, size: 64, align: 64, offset: 1152)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !1315, !1316, !1318, !909, !909, !909}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1049)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1028, file: !14, line: 1808, baseType: !1320, size: 64, align: 64, offset: 1216)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!473, !1315, !955}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1028, file: !14, line: 1816, baseType: !909, size: 32, align: 32, offset: 1280)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1028, file: !14, line: 1825, baseType: !1325, size: 32, align: 32, offset: 1312)
!1325 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1028, file: !14, line: 1830, baseType: !909, size: 32, align: 32, offset: 1344)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1028, file: !14, line: 1838, baseType: !1325, size: 32, align: 32, offset: 1376)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1028, file: !14, line: 1846, baseType: !909, size: 32, align: 32, offset: 1408)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1028, file: !14, line: 1851, baseType: !909, size: 32, align: 32, offset: 1440)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1028, file: !14, line: 1861, baseType: !1325, size: 32, align: 32, offset: 1472)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1028, file: !14, line: 1868, baseType: !1325, size: 32, align: 32, offset: 1504)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1028, file: !14, line: 1875, baseType: !1325, size: 32, align: 32, offset: 1536)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1028, file: !14, line: 1882, baseType: !1325, size: 32, align: 32, offset: 1568)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1028, file: !14, line: 1889, baseType: !1325, size: 32, align: 32, offset: 1600)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1028, file: !14, line: 1896, baseType: !1325, size: 32, align: 32, offset: 1632)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1028, file: !14, line: 1903, baseType: !1325, size: 32, align: 32, offset: 1664)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1028, file: !14, line: 1910, baseType: !909, size: 32, align: 32, offset: 1696)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1028, file: !14, line: 1915, baseType: !909, size: 32, align: 32, offset: 1728)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1028, file: !14, line: 1926, baseType: !1318, size: 64, align: 64, offset: 1792)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1028, file: !14, line: 1935, baseType: !948, size: 64, align: 32, offset: 1856)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1028, file: !14, line: 1942, baseType: !909, size: 32, align: 32, offset: 1920)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1028, file: !14, line: 1948, baseType: !909, size: 32, align: 32, offset: 1952)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1028, file: !14, line: 1954, baseType: !909, size: 32, align: 32, offset: 1984)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1028, file: !14, line: 1960, baseType: !909, size: 32, align: 32, offset: 2016)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1028, file: !14, line: 1984, baseType: !909, size: 32, align: 32, offset: 2048)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1028, file: !14, line: 1991, baseType: !909, size: 32, align: 32, offset: 2080)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1028, file: !14, line: 1996, baseType: !909, size: 32, align: 32, offset: 2112)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1028, file: !14, line: 2004, baseType: !909, size: 32, align: 32, offset: 2144)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1028, file: !14, line: 2011, baseType: !909, size: 32, align: 32, offset: 2176)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1028, file: !14, line: 2018, baseType: !909, size: 32, align: 32, offset: 2208)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1028, file: !14, line: 2027, baseType: !909, size: 32, align: 32, offset: 2240)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1028, file: !14, line: 2034, baseType: !909, size: 32, align: 32, offset: 2272)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1028, file: !14, line: 2044, baseType: !909, size: 32, align: 32, offset: 2304)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1028, file: !14, line: 2054, baseType: !1355, size: 64, align: 64, offset: 2368)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1028, file: !14, line: 2061, baseType: !1355, size: 64, align: 64, offset: 2432)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1028, file: !14, line: 2066, baseType: !909, size: 32, align: 32, offset: 2496)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1028, file: !14, line: 2070, baseType: !909, size: 32, align: 32, offset: 2528)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1028, file: !14, line: 2078, baseType: !909, size: 32, align: 32, offset: 2560)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1028, file: !14, line: 2085, baseType: !909, size: 32, align: 32, offset: 2592)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1028, file: !14, line: 2092, baseType: !909, size: 32, align: 32, offset: 2624)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1028, file: !14, line: 2099, baseType: !909, size: 32, align: 32, offset: 2656)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1028, file: !14, line: 2106, baseType: !909, size: 32, align: 32, offset: 2688)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1028, file: !14, line: 2113, baseType: !909, size: 32, align: 32, offset: 2720)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1028, file: !14, line: 2120, baseType: !909, size: 32, align: 32, offset: 2752)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1028, file: !14, line: 2125, baseType: !909, size: 32, align: 32, offset: 2784)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1028, file: !14, line: 2133, baseType: !909, size: 32, align: 32, offset: 2816)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1028, file: !14, line: 2140, baseType: !909, size: 32, align: 32, offset: 2848)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1028, file: !14, line: 2145, baseType: !909, size: 32, align: 32, offset: 2880)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1028, file: !14, line: 2153, baseType: !909, size: 32, align: 32, offset: 2912)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1028, file: !14, line: 2158, baseType: !909, size: 32, align: 32, offset: 2944)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1028, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1028, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1028, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1028, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1028, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1028, file: !14, line: 2203, baseType: !909, size: 32, align: 32, offset: 3136)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1028, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1028, file: !14, line: 2212, baseType: !909, size: 32, align: 32, offset: 3200)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1028, file: !14, line: 2213, baseType: !909, size: 32, align: 32, offset: 3232)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1028, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1028, file: !14, line: 2232, baseType: !909, size: 32, align: 32, offset: 3296)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1028, file: !14, line: 2243, baseType: !909, size: 32, align: 32, offset: 3328)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1028, file: !14, line: 2249, baseType: !909, size: 32, align: 32, offset: 3360)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1028, file: !14, line: 2256, baseType: !909, size: 32, align: 32, offset: 3392)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1028, file: !14, line: 2263, baseType: !966, size: 64, align: 64, offset: 3456)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1028, file: !14, line: 2270, baseType: !966, size: 64, align: 64, offset: 3520)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1028, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1028, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1028, file: !14, line: 2367, baseType: !1391, size: 64, align: 64, offset: 3648)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!909, !1315, !1048, !909}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1028, file: !14, line: 2383, baseType: !909, size: 32, align: 32, offset: 3712)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1028, file: !14, line: 2386, baseType: !1325, size: 32, align: 32, offset: 3744)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1028, file: !14, line: 2387, baseType: !1325, size: 32, align: 32, offset: 3776)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1028, file: !14, line: 2394, baseType: !909, size: 32, align: 32, offset: 3808)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1028, file: !14, line: 2401, baseType: !909, size: 32, align: 32, offset: 3840)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1028, file: !14, line: 2408, baseType: !909, size: 32, align: 32, offset: 3872)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1028, file: !14, line: 2415, baseType: !909, size: 32, align: 32, offset: 3904)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1028, file: !14, line: 2422, baseType: !909, size: 32, align: 32, offset: 3936)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1028, file: !14, line: 2423, baseType: !1403, size: 64, align: 64, offset: 3968)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1405, file: !14, line: 827, baseType: !909, size: 32, align: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1405, file: !14, line: 828, baseType: !909, size: 32, align: 32, offset: 32)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1405, file: !14, line: 829, baseType: !909, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1405, file: !14, line: 830, baseType: !1325, size: 32, align: 32, offset: 96)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1028, file: !14, line: 2430, baseType: !1069, size: 64, align: 64, offset: 4032)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1028, file: !14, line: 2437, baseType: !1069, size: 64, align: 64, offset: 4096)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1028, file: !14, line: 2444, baseType: !1325, size: 32, align: 32, offset: 4160)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1028, file: !14, line: 2451, baseType: !1325, size: 32, align: 32, offset: 4192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1028, file: !14, line: 2458, baseType: !909, size: 32, align: 32, offset: 4224)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1028, file: !14, line: 2469, baseType: !909, size: 32, align: 32, offset: 4256)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1028, file: !14, line: 2475, baseType: !909, size: 32, align: 32, offset: 4288)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1028, file: !14, line: 2481, baseType: !909, size: 32, align: 32, offset: 4320)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1028, file: !14, line: 2485, baseType: !909, size: 32, align: 32, offset: 4352)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1028, file: !14, line: 2489, baseType: !909, size: 32, align: 32, offset: 4384)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1028, file: !14, line: 2493, baseType: !909, size: 32, align: 32, offset: 4416)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1028, file: !14, line: 2501, baseType: !909, size: 32, align: 32, offset: 4448)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1028, file: !14, line: 2506, baseType: !909, size: 32, align: 32, offset: 4480)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1028, file: !14, line: 2510, baseType: !909, size: 32, align: 32, offset: 4512)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1028, file: !14, line: 2514, baseType: !1069, size: 64, align: 64, offset: 4544)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1028, file: !14, line: 2528, baseType: !1427, size: 64, align: 64, offset: 4608)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{null, !1315, !928, !909, !909}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1028, file: !14, line: 2534, baseType: !909, size: 32, align: 32, offset: 4672)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1028, file: !14, line: 2545, baseType: !909, size: 32, align: 32, offset: 4704)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1028, file: !14, line: 2547, baseType: !909, size: 32, align: 32, offset: 4736)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1028, file: !14, line: 2549, baseType: !909, size: 32, align: 32, offset: 4768)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1028, file: !14, line: 2551, baseType: !909, size: 32, align: 32, offset: 4800)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1028, file: !14, line: 2553, baseType: !909, size: 32, align: 32, offset: 4832)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1028, file: !14, line: 2555, baseType: !909, size: 32, align: 32, offset: 4864)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1028, file: !14, line: 2557, baseType: !909, size: 32, align: 32, offset: 4896)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1028, file: !14, line: 2559, baseType: !909, size: 32, align: 32, offset: 4928)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1028, file: !14, line: 2563, baseType: !909, size: 32, align: 32, offset: 4960)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1028, file: !14, line: 2571, baseType: !1441, size: 64, align: 64, offset: 4992)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1028, file: !14, line: 2579, baseType: !1441, size: 64, align: 64, offset: 5056)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1028, file: !14, line: 2586, baseType: !909, size: 32, align: 32, offset: 5120)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1028, file: !14, line: 2615, baseType: !909, size: 32, align: 32, offset: 5152)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1028, file: !14, line: 2627, baseType: !909, size: 32, align: 32, offset: 5184)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1028, file: !14, line: 2637, baseType: !909, size: 32, align: 32, offset: 5216)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1028, file: !14, line: 2681, baseType: !909, size: 32, align: 32, offset: 5248)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1028, file: !14, line: 2709, baseType: !1069, size: 64, align: 64, offset: 5312)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1028, file: !14, line: 2716, baseType: !1450, size: 64, align: 64, offset: 5376)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1452)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1453)
!1453 = !{!1454, !1455, !1456, !1457, !1458, !1459, !1463, !1469, !1473, !1474, !1475, !1476, !1482, !1483, !1484, !1485, !1486}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1452, file: !14, line: 3642, baseType: !938, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1452, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1452, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1452, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1452, file: !14, line: 3669, baseType: !909, size: 32, align: 32, offset: 160)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1452, file: !14, line: 3682, baseType: !1460, size: 64, align: 64, offset: 192)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!909, !1026, !1048}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1452, file: !14, line: 3698, baseType: !1464, size: 64, align: 64, offset: 256)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!909, !1026, !1467, !925}
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1452, file: !14, line: 3712, baseType: !1470, size: 64, align: 64, offset: 320)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!909, !1026, !909, !1467, !925}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1452, file: !14, line: 3726, baseType: !1464, size: 64, align: 64, offset: 384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1452, file: !14, line: 3737, baseType: !1023, size: 64, align: 64, offset: 448)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1452, file: !14, line: 3746, baseType: !909, size: 32, align: 32, offset: 512)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1452, file: !14, line: 3757, baseType: !1477, size: 64, align: 64, offset: 576)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{null, !1480}
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1452, file: !14, line: 3766, baseType: !1023, size: 64, align: 64, offset: 640)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1452, file: !14, line: 3774, baseType: !1023, size: 64, align: 64, offset: 704)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1452, file: !14, line: 3780, baseType: !909, size: 32, align: 32, offset: 768)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1452, file: !14, line: 3785, baseType: !909, size: 32, align: 32, offset: 800)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1452, file: !14, line: 3795, baseType: !1487, size: 64, align: 64, offset: 832)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = !DISubroutineType(types: !1489)
!1489 = !{!909, !1026, !1088}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1028, file: !14, line: 2728, baseType: !928, size: 64, align: 64, offset: 5440)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1028, file: !14, line: 2735, baseType: !1078, size: 512, align: 64, offset: 5504)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1028, file: !14, line: 2742, baseType: !909, size: 32, align: 32, offset: 6016)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1028, file: !14, line: 2755, baseType: !909, size: 32, align: 32, offset: 6048)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1028, file: !14, line: 2776, baseType: !909, size: 32, align: 32, offset: 6080)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1028, file: !14, line: 2783, baseType: !909, size: 32, align: 32, offset: 6112)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1028, file: !14, line: 2791, baseType: !909, size: 32, align: 32, offset: 6144)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1028, file: !14, line: 2802, baseType: !1048, size: 64, align: 64, offset: 6208)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1028, file: !14, line: 2811, baseType: !909, size: 32, align: 32, offset: 6272)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1028, file: !14, line: 2821, baseType: !909, size: 32, align: 32, offset: 6304)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1028, file: !14, line: 2830, baseType: !909, size: 32, align: 32, offset: 6336)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1028, file: !14, line: 2840, baseType: !909, size: 32, align: 32, offset: 6368)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1028, file: !14, line: 2851, baseType: !1503, size: 64, align: 64, offset: 6400)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!909, !1315, !1506, !928, !1318, !909, !909}
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!909, !1315, !928}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1028, file: !14, line: 2871, baseType: !1510, size: 64, align: 64, offset: 6464)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!909, !1315, !1513, !928, !1318, !909}
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!909, !1315, !928, !909, !909}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1028, file: !14, line: 2878, baseType: !909, size: 32, align: 32, offset: 6528)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1028, file: !14, line: 2885, baseType: !909, size: 32, align: 32, offset: 6560)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1028, file: !14, line: 3005, baseType: !909, size: 32, align: 32, offset: 6592)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1028, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1028, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1028, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1028, file: !14, line: 3037, baseType: !1054, size: 64, align: 64, offset: 6720)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1028, file: !14, line: 3038, baseType: !909, size: 32, align: 32, offset: 6784)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1028, file: !14, line: 3050, baseType: !966, size: 64, align: 64, offset: 6848)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1028, file: !14, line: 3065, baseType: !909, size: 32, align: 32, offset: 6912)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1028, file: !14, line: 3083, baseType: !909, size: 32, align: 32, offset: 6944)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1028, file: !14, line: 3092, baseType: !948, size: 64, align: 32, offset: 6976)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1028, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1028, file: !14, line: 3106, baseType: !948, size: 64, align: 32, offset: 7072)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1028, file: !14, line: 3113, baseType: !1531, size: 64, align: 64, offset: 7168)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1533)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1535)
!1535 = !{!1536, !1537, !1538, !1539, !1540, !1541, !1544}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1534, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1534, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1534, file: !14, line: 720, baseType: !938, size: 64, align: 64, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1534, file: !14, line: 724, baseType: !938, size: 64, align: 64, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1534, file: !14, line: 728, baseType: !909, size: 32, align: 32, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1534, file: !14, line: 734, baseType: !1542, size: 64, align: 64, offset: 256)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1534, file: !14, line: 739, baseType: !1545, size: 64, align: 64, offset: 320)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1028, file: !14, line: 3129, baseType: !1069, size: 64, align: 64, offset: 7232)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1028, file: !14, line: 3130, baseType: !1069, size: 64, align: 64, offset: 7296)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1028, file: !14, line: 3131, baseType: !1069, size: 64, align: 64, offset: 7360)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1028, file: !14, line: 3132, baseType: !1069, size: 64, align: 64, offset: 7424)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1028, file: !14, line: 3139, baseType: !1441, size: 64, align: 64, offset: 7488)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1028, file: !14, line: 3147, baseType: !909, size: 32, align: 32, offset: 7552)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1028, file: !14, line: 3165, baseType: !909, size: 32, align: 32, offset: 7584)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1028, file: !14, line: 3172, baseType: !909, size: 32, align: 32, offset: 7616)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1028, file: !14, line: 3180, baseType: !909, size: 32, align: 32, offset: 7648)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1028, file: !14, line: 3191, baseType: !1355, size: 64, align: 64, offset: 7680)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1028, file: !14, line: 3199, baseType: !1054, size: 64, align: 64, offset: 7744)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1028, file: !14, line: 3207, baseType: !1441, size: 64, align: 64, offset: 7808)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1028, file: !14, line: 3214, baseType: !910, size: 32, align: 32, offset: 7872)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1028, file: !14, line: 3224, baseType: !1184, size: 64, align: 64, offset: 7936)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1028, file: !14, line: 3225, baseType: !909, size: 32, align: 32, offset: 8000)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1028, file: !14, line: 3249, baseType: !1088, size: 64, align: 64, offset: 8064)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1028, file: !14, line: 3256, baseType: !909, size: 32, align: 32, offset: 8128)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1028, file: !14, line: 3271, baseType: !909, size: 32, align: 32, offset: 8160)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1028, file: !14, line: 3279, baseType: !1069, size: 64, align: 64, offset: 8192)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1028, file: !14, line: 3301, baseType: !1088, size: 64, align: 64, offset: 8256)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1028, file: !14, line: 3310, baseType: !909, size: 32, align: 32, offset: 8320)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1028, file: !14, line: 3337, baseType: !909, size: 32, align: 32, offset: 8352)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1028, file: !14, line: 3351, baseType: !909, size: 32, align: 32, offset: 8384)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1028, file: !14, line: 3359, baseType: !909, size: 32, align: 32, offset: 8416)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !935, file: !14, line: 3535, baseType: !1572, size: 64, align: 64, offset: 1024)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!909, !1026, !1575}
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !935, file: !14, line: 3541, baseType: !1578, size: 64, align: 64, offset: 1088)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1580)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1581)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1042, line: 223, size: 128, align: 64, elements: !1582)
!1582 = !{!1583, !1584}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1581, file: !1042, line: 224, baseType: !1467, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1581, file: !1042, line: 225, baseType: !1467, size: 64, align: 64, offset: 64)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !935, file: !14, line: 3549, baseType: !1586, size: 64, align: 64, offset: 1152)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{null, !1021}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !935, file: !14, line: 3551, baseType: !1023, size: 64, align: 64, offset: 1216)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !935, file: !14, line: 3552, baseType: !1591, size: 64, align: 64, offset: 1280)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{!909, !1026, !1054, !909, !1594}
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1597)
!1597 = !{!1598, !1599, !1600, !1601, !1602, !1626}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1596, file: !14, line: 3921, baseType: !917, size: 16, align: 16)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1596, file: !14, line: 3922, baseType: !925, size: 32, align: 32, offset: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1596, file: !14, line: 3923, baseType: !925, size: 32, align: 32, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1596, file: !14, line: 3924, baseType: !910, size: 32, align: 32, offset: 96)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1596, file: !14, line: 3925, baseType: !1603, size: 64, align: 64, offset: 128)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1606)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1607)
!1607 = !{!1608, !1609, !1610, !1611, !1612, !1613, !1619, !1621, !1622, !1623, !1624, !1625}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1606, file: !14, line: 3886, baseType: !909, size: 32, align: 32)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1606, file: !14, line: 3887, baseType: !909, size: 32, align: 32, offset: 32)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1606, file: !14, line: 3888, baseType: !909, size: 32, align: 32, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1606, file: !14, line: 3889, baseType: !909, size: 32, align: 32, offset: 96)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1606, file: !14, line: 3890, baseType: !909, size: 32, align: 32, offset: 128)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1606, file: !14, line: 3897, baseType: !1614, size: 768, align: 64, offset: 192)
!1614 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1615)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1616)
!1616 = !{!1617, !1618}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1615, file: !14, line: 3855, baseType: !1053, size: 512, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1615, file: !14, line: 3857, baseType: !1058, size: 256, align: 32, offset: 512)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1606, file: !14, line: 3903, baseType: !1620, size: 256, align: 64, offset: 960)
!1620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1054, size: 256, align: 64, elements: !1155)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1606, file: !14, line: 3904, baseType: !1162, size: 128, align: 32, offset: 1216)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1606, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1606, file: !14, line: 3908, baseType: !1441, size: 64, align: 64, offset: 1408)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1606, file: !14, line: 3915, baseType: !1441, size: 64, align: 64, offset: 1472)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1606, file: !14, line: 3917, baseType: !909, size: 32, align: 32, offset: 1536)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1596, file: !14, line: 3926, baseType: !1069, size: 64, align: 64, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !935, file: !14, line: 3564, baseType: !1628, size: 64, align: 64, offset: 1344)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DISubroutineType(types: !1630)
!1630 = !{!909, !1026, !1172, !1316, !1318}
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !935, file: !14, line: 3566, baseType: !1632, size: 64, align: 64, offset: 1408)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!909, !1026, !928, !1318, !1172}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !935, file: !14, line: 3567, baseType: !1023, size: 64, align: 64, offset: 1472)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !935, file: !14, line: 3576, baseType: !1637, size: 64, align: 64, offset: 1536)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{!909, !1026, !1316}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !935, file: !14, line: 3577, baseType: !1641, size: 64, align: 64, offset: 1600)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!909, !1026, !1172}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !935, file: !14, line: 3584, baseType: !1460, size: 64, align: 64, offset: 1664)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !935, file: !14, line: 3589, baseType: !1646, size: 64, align: 64, offset: 1728)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{null, !1026}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !935, file: !14, line: 3594, baseType: !909, size: 32, align: 32, offset: 1792)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !935, file: !14, line: 3600, baseType: !938, size: 64, align: 64, offset: 1856)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !935, file: !14, line: 3609, baseType: !1652, size: 64, align: 64, offset: 1920)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1655)
!1655 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1656 = distinct !DIGlobalVariable(name: "ff_truehd_decoder", scope: !0, file: !933, line: 1345, type: !934, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_truehd_decoder)
!1657 = distinct !DIGlobalVariable(name: "table", scope: !1658, file: !933, line: 209, type: !1662, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @init_static.table)
!1658 = distinct !DISubprogram(name: "init_static", scope: !933, file: !933, line: 206, type: !1659, isLocal: true, isDefinition: true, scopeLine: 207, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1661)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{null}
!1661 = !{}
!1662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1663, size: 16384, align: 16, elements: !1665)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !918, line: 37, baseType: !1664)
!1664 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1665 = !{!1666, !1667}
!1666 = !DISubrange(count: 512)
!1667 = !DISubrange(count: 2)
!1668 = distinct !DIGlobalVariable(name: "table", scope: !1658, file: !933, line: 212, type: !1662, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @init_static.table.4)
!1669 = distinct !DIGlobalVariable(name: "table", scope: !1658, file: !933, line: 215, type: !1662, isLocal: true, isDefinition: true, variable: [512 x [2 x i16]]* @init_static.table.5)
!1670 = distinct !DIGlobalVariable(name: "huff_vlc", scope: !0, file: !933, line: 202, type: !1671, isLocal: true, isDefinition: true, variable: [3 x %struct.VLC]* @huff_vlc)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1672, size: 576, align: 64, elements: !1683)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "VLC", file: !1673, line: 30, baseType: !1674)
!1673 = !DIFile(filename: "libavcodec/vlc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
