; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_mpegts.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtpenc_mpegts.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type opaque
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!851 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!853 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!854 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!855 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!856 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !534, line: 538, size: 32, align: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866}
!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !918, line: 40, baseType: !919)
!918 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!920 = !{!921}
!921 = distinct !DIGlobalVariable(name: "ff_rtp_mpegts_muxer", scope: !0, file: !922, line: 150, type: !923, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_rtp_mpegts_muxer)
!922 = !DIFile(filename: "libavformat/rtpenc_mpegts.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !925)
!925 = !{!926, !930, !931, !932, !933, !934, !935, !936, !938, !944, !986, !988, !989, !2016, !2017, !2018, !2022, !2026, !2030, !2031, !2036, !2037, !2038, !2039, !2040, !2041, !2045}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !924, file: !897, line: 498, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !924, file: !897, line: 504, baseType: !927, size: 64, align: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !924, file: !897, line: 505, baseType: !927, size: 64, align: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !924, file: !897, line: 506, baseType: !927, size: 64, align: 64, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !924, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !924, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !924, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !924, file: !897, line: 517, baseType: !937, size: 32, align: 32, offset: 352)
!937 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !924, file: !897, line: 523, baseType: !939, size: 64, align: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !924, file: !897, line: 526, baseType: !945, size: 64, align: 64, offset: 448)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !949)
!949 = !{!950, !951, !956, !960, !961, !962, !963, !967, !973, !975, !979}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !948, file: !464, line: 72, baseType: !927, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !948, file: !464, line: 78, baseType: !952, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!927, !955}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !948, file: !464, line: 85, baseType: !957, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !948, file: !464, line: 93, baseType: !937, size: 32, align: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !948, file: !464, line: 99, baseType: !937, size: 32, align: 32, offset: 224)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !948, file: !464, line: 108, baseType: !937, size: 32, align: 32, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !948, file: !464, line: 113, baseType: !964, size: 64, align: 64, offset: 320)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{!955, !955, !955}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !948, file: !464, line: 123, baseType: !968, size: 64, align: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!971, !971}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !948, file: !464, line: 130, baseType: !974, size: 32, align: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !948, file: !464, line: 136, baseType: !976, size: 64, align: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!974, !955}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !948, file: !464, line: 142, baseType: !980, size: 64, align: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!937, !983, !955, !927, !937}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !924, file: !897, line: 535, baseType: !987, size: 64, align: 64, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !924, file: !897, line: 539, baseType: !937, size: 32, align: 32, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !924, file: !897, line: 541, baseType: !990, size: 64, align: 64, offset: 640)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!937, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !995)
!995 = !{!996, !997, !1095, !1096, !1097, !1164, !1165, !1166, !1890, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1944, !1945, !1946, !1947, !1948, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1979, !1980, !1983, !1984, !1985, !1986, !1987, !1988, !1993, !1994, !1995, !1996, !2004, !2005, !2009, !2013, !2014, !2015}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !994, file: !897, line: 1342, baseType: !945, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !994, file: !897, line: 1349, baseType: !998, size: 64, align: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1025, !1026, !1066, !1067, !1071, !1076, !1077, !1078, !1082, !1088, !1094}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !999, file: !897, line: 638, baseType: !927, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !999, file: !897, line: 645, baseType: !927, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !999, file: !897, line: 652, baseType: !937, size: 32, align: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !999, file: !897, line: 659, baseType: !927, size: 64, align: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !999, file: !897, line: 661, baseType: !939, size: 64, align: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !999, file: !897, line: 663, baseType: !945, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !999, file: !897, line: 670, baseType: !927, size: 64, align: 64, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !999, file: !897, line: 679, baseType: !998, size: 64, align: 64, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !999, file: !897, line: 684, baseType: !937, size: 32, align: 32, offset: 512)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !999, file: !897, line: 689, baseType: !937, size: 32, align: 32, offset: 544)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !999, file: !897, line: 696, baseType: !1012, size: 64, align: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!937, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1023, !1024}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1017, file: !897, line: 449, baseType: !927, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1017, file: !897, line: 450, baseType: !1021, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1017, file: !897, line: 451, baseType: !937, size: 32, align: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1017, file: !897, line: 452, baseType: !927, size: 64, align: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !999, file: !897, line: 703, baseType: !990, size: 64, align: 64, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !999, file: !897, line: 714, baseType: !1027, size: 64, align: 64, offset: 704)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!937, !993, !1030}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1033)
!1033 = !{!1034, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1062, !1063, !1064, !1065}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1032, file: !4, line: 1451, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1037, line: 94, baseType: !1038)
!1037 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1037, line: 81, size: 192, align: 64, elements: !1039)
!1039 = !{!1040, !1044, !1047}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1038, file: !1037, line: 82, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1037, line: 73, baseType: !1043)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1037, line: 73, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1038, file: !1037, line: 89, baseType: !1045, size: 64, align: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !918, line: 48, baseType: !1022)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1038, file: !1037, line: 93, baseType: !937, size: 32, align: 32, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1032, file: !4, line: 1461, baseType: !917, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1032, file: !4, line: 1467, baseType: !917, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1032, file: !4, line: 1468, baseType: !1045, size: 64, align: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1032, file: !4, line: 1469, baseType: !937, size: 32, align: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1032, file: !4, line: 1470, baseType: !937, size: 32, align: 32, offset: 288)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1032, file: !4, line: 1474, baseType: !937, size: 32, align: 32, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1032, file: !4, line: 1479, baseType: !1055, size: 64, align: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1057, file: !4, line: 1412, baseType: !1045, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1057, file: !4, line: 1413, baseType: !937, size: 32, align: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1057, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1032, file: !4, line: 1480, baseType: !937, size: 32, align: 32, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1032, file: !4, line: 1486, baseType: !917, size: 64, align: 64, offset: 512)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1032, file: !4, line: 1488, baseType: !917, size: 64, align: 64, offset: 576)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1032, file: !4, line: 1497, baseType: !917, size: 64, align: 64, offset: 640)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !999, file: !897, line: 720, baseType: !990, size: 64, align: 64, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !999, file: !897, line: 730, baseType: !1068, size: 64, align: 64, offset: 832)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!937, !993, !937, !917, !937}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !999, file: !897, line: 737, baseType: !1072, size: 64, align: 64, offset: 896)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!917, !993, !937, !1075, !917}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !999, file: !897, line: 744, baseType: !990, size: 64, align: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !999, file: !897, line: 750, baseType: !990, size: 64, align: 64, offset: 1024)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !999, file: !897, line: 758, baseType: !1079, size: 64, align: 64, offset: 1088)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!937, !993, !937, !917, !917, !917, !937}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !999, file: !897, line: 764, baseType: !1083, size: 64, align: 64, offset: 1152)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!937, !993, !1086}
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !999, file: !897, line: 770, baseType: !1089, size: 64, align: 64, offset: 1216)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!937, !993, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !999, file: !897, line: 776, baseType: !1089, size: 64, align: 64, offset: 1280)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !994, file: !897, line: 1356, baseType: !987, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !994, file: !897, line: 1365, baseType: !955, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !994, file: !897, line: 1379, baseType: !1098, size: 64, align: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1108, !1112, !1113, !1117, !1118, !1119, !1120, !1121, !1123, !1124, !1131, !1132, !1136, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1154, !1155, !1156, !1157, !1161, !1162, !1163}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1100, file: !515, line: 174, baseType: !945, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1100, file: !515, line: 226, baseType: !1021, size: 64, align: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1100, file: !515, line: 227, baseType: !937, size: 32, align: 32, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1100, file: !515, line: 228, baseType: !1021, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1100, file: !515, line: 229, baseType: !1021, size: 64, align: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1100, file: !515, line: 233, baseType: !955, size: 64, align: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1100, file: !515, line: 235, baseType: !1109, size: 64, align: 64, offset: 384)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!937, !955, !1045, !937}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1100, file: !515, line: 236, baseType: !1109, size: 64, align: 64, offset: 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1100, file: !515, line: 237, baseType: !1114, size: 64, align: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{!917, !955, !917, !937}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1100, file: !515, line: 238, baseType: !917, size: 64, align: 64, offset: 576)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1100, file: !515, line: 239, baseType: !937, size: 32, align: 32, offset: 640)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1100, file: !515, line: 240, baseType: !937, size: 32, align: 32, offset: 672)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1100, file: !515, line: 241, baseType: !937, size: 32, align: 32, offset: 704)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1100, file: !515, line: 242, baseType: !1122, size: 64, align: 64, offset: 768)
!1122 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1100, file: !515, line: 243, baseType: !1021, size: 64, align: 64, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1100, file: !515, line: 244, baseType: !1125, size: 64, align: 64, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!1122, !1122, !1128, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1130 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1100, file: !515, line: 245, baseType: !937, size: 32, align: 32, offset: 960)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1100, file: !515, line: 249, baseType: !1133, size: 64, align: 64, offset: 1024)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!937, !955, !937}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1100, file: !515, line: 255, baseType: !1137, size: 64, align: 64, offset: 1088)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!917, !955, !937, !917, !937}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1100, file: !515, line: 260, baseType: !937, size: 32, align: 32, offset: 1152)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1100, file: !515, line: 266, baseType: !917, size: 64, align: 64, offset: 1216)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1100, file: !515, line: 273, baseType: !937, size: 32, align: 32, offset: 1280)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1100, file: !515, line: 279, baseType: !917, size: 64, align: 64, offset: 1344)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1100, file: !515, line: 285, baseType: !937, size: 32, align: 32, offset: 1408)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1100, file: !515, line: 291, baseType: !937, size: 32, align: 32, offset: 1440)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1100, file: !515, line: 298, baseType: !937, size: 32, align: 32, offset: 1472)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1100, file: !515, line: 304, baseType: !937, size: 32, align: 32, offset: 1504)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1100, file: !515, line: 309, baseType: !927, size: 64, align: 64, offset: 1536)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1100, file: !515, line: 314, baseType: !927, size: 64, align: 64, offset: 1600)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1100, file: !515, line: 319, baseType: !1151, size: 64, align: 64, offset: 1664)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!937, !955, !1045, !937, !514, !917}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1100, file: !515, line: 326, baseType: !937, size: 32, align: 32, offset: 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1100, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1100, file: !515, line: 332, baseType: !917, size: 64, align: 64, offset: 1792)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1100, file: !515, line: 338, baseType: !1158, size: 64, align: 64, offset: 1856)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!937, !955}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1100, file: !515, line: 340, baseType: !917, size: 64, align: 64, offset: 1920)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1100, file: !515, line: 346, baseType: !1021, size: 64, align: 64, offset: 1984)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1100, file: !515, line: 351, baseType: !937, size: 32, align: 32, offset: 2048)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !994, file: !897, line: 1386, baseType: !937, size: 32, align: 32, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !994, file: !897, line: 1393, baseType: !1130, size: 32, align: 32, offset: 352)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !994, file: !897, line: 1405, baseType: !1167, size: 64, align: 64, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1737, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1838, !1844, !1845, !1849, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1881, !1882, !1883, !1884, !1885, !1886}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1170, file: !897, line: 866, baseType: !937, size: 32, align: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1170, file: !897, line: 872, baseType: !937, size: 32, align: 32, offset: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1170, file: !897, line: 878, baseType: !1175, size: 64, align: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1412, !1413, !1414, !1415, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1441, !1445, !1446, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1625, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1177, file: !4, line: 1561, baseType: !945, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1177, file: !4, line: 1562, baseType: !937, size: 32, align: 32, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1177, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1177, file: !4, line: 1565, baseType: !1183, size: 64, align: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191, !1192, !1201, !1204, !1207, !1210, !1214, !1215, !1216, !1224, !1225, !1226, !1228, !1232, !1238, !1243, !1247, !1248, !1296, !1383, !1387, !1388, !1392, !1396, !1401, !1405, !1406, !1407}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1185, file: !4, line: 3475, baseType: !927, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1185, file: !4, line: 3480, baseType: !927, size: 64, align: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1185, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1185, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1185, file: !4, line: 3487, baseType: !937, size: 32, align: 32, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1185, file: !4, line: 3488, baseType: !1193, size: 64, align: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1196, line: 61, baseType: !1197)
!1196 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1196, line: 58, size: 64, align: 32, elements: !1198)
!1198 = !{!1199, !1200}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1197, file: !1196, line: 59, baseType: !937, size: 32, align: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1197, file: !1196, line: 60, baseType: !937, size: 32, align: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1185, file: !4, line: 3489, baseType: !1202, size: 64, align: 64, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1185, file: !4, line: 3490, baseType: !1205, size: 64, align: 64, offset: 384)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1185, file: !4, line: 3491, baseType: !1208, size: 64, align: 64, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1185, file: !4, line: 3492, baseType: !1211, size: 64, align: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !918, line: 55, baseType: !1122)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1185, file: !4, line: 3493, baseType: !1046, size: 8, align: 8, offset: 576)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1185, file: !4, line: 3494, baseType: !945, size: 64, align: 64, offset: 640)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1185, file: !4, line: 3495, baseType: !1217, size: 64, align: 64, offset: 704)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1221)
!1221 = !{!1222, !1223}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1220, file: !4, line: 3402, baseType: !937, size: 32, align: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1220, file: !4, line: 3403, baseType: !927, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1185, file: !4, line: 3507, baseType: !927, size: 64, align: 64, offset: 768)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1185, file: !4, line: 3516, baseType: !937, size: 32, align: 32, offset: 832)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1185, file: !4, line: 3517, baseType: !1227, size: 64, align: 64, offset: 896)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1185, file: !4, line: 3527, baseType: !1229, size: 64, align: 64, offset: 960)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!937, !1175}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1185, file: !4, line: 3535, baseType: !1233, size: 64, align: 64, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!937, !1175, !1236}
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1185, file: !4, line: 3541, baseType: !1239, size: 64, align: 64, offset: 1088)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1242)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1185, file: !4, line: 3549, baseType: !1244, size: 64, align: 64, offset: 1152)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{null, !1227}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1185, file: !4, line: 3551, baseType: !1229, size: 64, align: 64, offset: 1216)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1185, file: !4, line: 3552, baseType: !1249, size: 64, align: 64, offset: 1280)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!937, !1175, !1045, !937, !1252}
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1255)
!1255 = !{!1256, !1259, !1261, !1262, !1263, !1295}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1254, file: !4, line: 3921, baseType: !1257, size: 16, align: 16)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !918, line: 49, baseType: !1258)
!1258 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1254, file: !4, line: 3922, baseType: !1260, size: 32, align: 32, offset: 32)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !918, line: 51, baseType: !1130)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1254, file: !4, line: 3923, baseType: !1260, size: 32, align: 32, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1254, file: !4, line: 3924, baseType: !1130, size: 32, align: 32, offset: 96)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1254, file: !4, line: 3925, baseType: !1264, size: 64, align: 64, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272, !1273, !1274, !1284, !1288, !1290, !1291, !1293, !1294}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1267, file: !4, line: 3886, baseType: !937, size: 32, align: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1267, file: !4, line: 3887, baseType: !937, size: 32, align: 32, offset: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1267, file: !4, line: 3888, baseType: !937, size: 32, align: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1267, file: !4, line: 3889, baseType: !937, size: 32, align: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1267, file: !4, line: 3890, baseType: !937, size: 32, align: 32, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1267, file: !4, line: 3897, baseType: !1275, size: 768, align: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1277)
!1277 = !{!1278, !1282}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1276, file: !4, line: 3855, baseType: !1279, size: 512, align: 64)
!1279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 512, align: 64, elements: !1280)
!1280 = !{!1281}
!1281 = !DISubrange(count: 8)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1276, file: !4, line: 3857, baseType: !1283, size: 256, align: 32, offset: 512)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 256, align: 32, elements: !1280)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1267, file: !4, line: 3903, baseType: !1285, size: 256, align: 64, offset: 960)
!1285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 256, align: 64, elements: !1286)
!1286 = !{!1287}
!1287 = !DISubrange(count: 4)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1267, file: !4, line: 3904, baseType: !1289, size: 128, align: 32, offset: 1216)
!1289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 128, align: 32, elements: !1286)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1267, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1267, file: !4, line: 3908, baseType: !1292, size: 64, align: 64, offset: 1408)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1267, file: !4, line: 3915, baseType: !1292, size: 64, align: 64, offset: 1472)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1267, file: !4, line: 3917, baseType: !937, size: 32, align: 32, offset: 1536)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1254, file: !4, line: 3926, baseType: !917, size: 64, align: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1185, file: !4, line: 3564, baseType: !1297, size: 64, align: 64, offset: 1344)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!937, !1175, !1030, !1300, !1382}
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1334, !1336, !1337, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1370, !1371, !1372, !1373, !1374, !1375, !1378, !1379, !1380, !1381}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1303, file: !767, line: 282, baseType: !1279, size: 512, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1303, file: !767, line: 299, baseType: !1283, size: 256, align: 32, offset: 512)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1303, file: !767, line: 315, baseType: !1308, size: 64, align: 64, offset: 768)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1303, file: !767, line: 326, baseType: !937, size: 32, align: 32, offset: 832)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1303, file: !767, line: 326, baseType: !937, size: 32, align: 32, offset: 864)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1303, file: !767, line: 334, baseType: !937, size: 32, align: 32, offset: 896)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1303, file: !767, line: 341, baseType: !937, size: 32, align: 32, offset: 928)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1303, file: !767, line: 346, baseType: !937, size: 32, align: 32, offset: 960)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1303, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1303, file: !767, line: 356, baseType: !1195, size: 64, align: 32, offset: 1024)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1303, file: !767, line: 361, baseType: !917, size: 64, align: 64, offset: 1088)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1303, file: !767, line: 369, baseType: !917, size: 64, align: 64, offset: 1152)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1303, file: !767, line: 377, baseType: !917, size: 64, align: 64, offset: 1216)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1303, file: !767, line: 382, baseType: !937, size: 32, align: 32, offset: 1280)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1303, file: !767, line: 386, baseType: !937, size: 32, align: 32, offset: 1312)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1303, file: !767, line: 391, baseType: !937, size: 32, align: 32, offset: 1344)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1303, file: !767, line: 396, baseType: !955, size: 64, align: 64, offset: 1408)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1303, file: !767, line: 403, baseType: !1324, size: 512, align: 64, offset: 1472)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1213, size: 512, align: 64, elements: !1280)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1303, file: !767, line: 410, baseType: !937, size: 32, align: 32, offset: 1984)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1303, file: !767, line: 415, baseType: !937, size: 32, align: 32, offset: 2016)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1303, file: !767, line: 420, baseType: !937, size: 32, align: 32, offset: 2048)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1303, file: !767, line: 425, baseType: !937, size: 32, align: 32, offset: 2080)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1303, file: !767, line: 435, baseType: !917, size: 64, align: 64, offset: 2112)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1303, file: !767, line: 440, baseType: !937, size: 32, align: 32, offset: 2176)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1303, file: !767, line: 445, baseType: !1213, size: 64, align: 64, offset: 2240)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1303, file: !767, line: 459, baseType: !1333, size: 512, align: 64, offset: 2304)
!1333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 512, align: 64, elements: !1280)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1303, file: !767, line: 473, baseType: !1335, size: 64, align: 64, offset: 2816)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1303, file: !767, line: 477, baseType: !937, size: 32, align: 32, offset: 2880)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1303, file: !767, line: 479, baseType: !1338, size: 64, align: 64, offset: 2944)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1342)
!1342 = !{!1343, !1344, !1345, !1346, !1351}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1341, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1341, file: !767, line: 203, baseType: !1045, size: 64, align: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1341, file: !767, line: 204, baseType: !937, size: 32, align: 32, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1341, file: !767, line: 205, baseType: !1347, size: 64, align: 64, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1349, line: 86, baseType: !1350)
!1349 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1349, line: 86, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1341, file: !767, line: 206, baseType: !1035, size: 64, align: 64, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1303, file: !767, line: 480, baseType: !937, size: 32, align: 32, offset: 3008)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1303, file: !767, line: 505, baseType: !937, size: 32, align: 32, offset: 3040)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1303, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1303, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1303, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1303, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1303, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1303, file: !767, line: 532, baseType: !917, size: 64, align: 64, offset: 3264)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1303, file: !767, line: 539, baseType: !917, size: 64, align: 64, offset: 3328)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1303, file: !767, line: 547, baseType: !917, size: 64, align: 64, offset: 3392)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1303, file: !767, line: 554, baseType: !1347, size: 64, align: 64, offset: 3456)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1303, file: !767, line: 563, baseType: !937, size: 32, align: 32, offset: 3520)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1303, file: !767, line: 572, baseType: !937, size: 32, align: 32, offset: 3552)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1303, file: !767, line: 581, baseType: !937, size: 32, align: 32, offset: 3584)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1303, file: !767, line: 588, baseType: !1367, size: 64, align: 64, offset: 3648)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !918, line: 36, baseType: !1369)
!1369 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1303, file: !767, line: 593, baseType: !937, size: 32, align: 32, offset: 3712)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1303, file: !767, line: 596, baseType: !937, size: 32, align: 32, offset: 3744)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1303, file: !767, line: 599, baseType: !1035, size: 64, align: 64, offset: 3776)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1303, file: !767, line: 605, baseType: !1035, size: 64, align: 64, offset: 3840)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1303, file: !767, line: 616, baseType: !1035, size: 64, align: 64, offset: 3904)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1303, file: !767, line: 626, baseType: !1376, size: 64, align: 64, offset: 3968)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1377, line: 216, baseType: !1122)
!1377 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1303, file: !767, line: 627, baseType: !1376, size: 64, align: 64, offset: 4032)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1303, file: !767, line: 628, baseType: !1376, size: 64, align: 64, offset: 4096)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1303, file: !767, line: 629, baseType: !1376, size: 64, align: 64, offset: 4160)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1303, file: !767, line: 645, baseType: !1035, size: 64, align: 64, offset: 4224)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1185, file: !4, line: 3566, baseType: !1384, size: 64, align: 64, offset: 1408)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!937, !1175, !955, !1382, !1030}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1185, file: !4, line: 3567, baseType: !1229, size: 64, align: 64, offset: 1472)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1185, file: !4, line: 3576, baseType: !1389, size: 64, align: 64, offset: 1536)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!937, !1175, !1300}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1185, file: !4, line: 3577, baseType: !1393, size: 64, align: 64, offset: 1600)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!937, !1175, !1030}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1185, file: !4, line: 3584, baseType: !1397, size: 64, align: 64, offset: 1664)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DISubroutineType(types: !1399)
!1399 = !{!937, !1175, !1400}
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1185, file: !4, line: 3589, baseType: !1402, size: 64, align: 64, offset: 1728)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DISubroutineType(types: !1404)
!1404 = !{null, !1175}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1185, file: !4, line: 3594, baseType: !937, size: 32, align: 32, offset: 1792)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1185, file: !4, line: 3600, baseType: !927, size: 64, align: 64, offset: 1856)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1185, file: !4, line: 3609, baseType: !1408, size: 64, align: 64, offset: 1920)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1411 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1177, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1177, file: !4, line: 1581, baseType: !1130, size: 32, align: 32, offset: 224)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1177, file: !4, line: 1583, baseType: !955, size: 64, align: 64, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1177, file: !4, line: 1591, baseType: !1416, size: 64, align: 64, offset: 320)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1177, file: !4, line: 1598, baseType: !955, size: 64, align: 64, offset: 384)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1177, file: !4, line: 1606, baseType: !917, size: 64, align: 64, offset: 448)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1177, file: !4, line: 1614, baseType: !937, size: 32, align: 32, offset: 512)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1177, file: !4, line: 1622, baseType: !937, size: 32, align: 32, offset: 544)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1177, file: !4, line: 1628, baseType: !937, size: 32, align: 32, offset: 576)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !4, line: 1636, baseType: !937, size: 32, align: 32, offset: 608)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1177, file: !4, line: 1643, baseType: !937, size: 32, align: 32, offset: 640)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1177, file: !4, line: 1657, baseType: !1045, size: 64, align: 64, offset: 704)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1177, file: !4, line: 1658, baseType: !937, size: 32, align: 32, offset: 768)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1177, file: !4, line: 1679, baseType: !1195, size: 64, align: 32, offset: 800)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1177, file: !4, line: 1688, baseType: !937, size: 32, align: 32, offset: 864)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1177, file: !4, line: 1712, baseType: !937, size: 32, align: 32, offset: 896)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1177, file: !4, line: 1729, baseType: !937, size: 32, align: 32, offset: 928)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1177, file: !4, line: 1729, baseType: !937, size: 32, align: 32, offset: 960)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1177, file: !4, line: 1744, baseType: !937, size: 32, align: 32, offset: 992)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1177, file: !4, line: 1744, baseType: !937, size: 32, align: 32, offset: 1024)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1177, file: !4, line: 1751, baseType: !937, size: 32, align: 32, offset: 1056)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1177, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1177, file: !4, line: 1791, baseType: !1437, size: 64, align: 64, offset: 1152)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DISubroutineType(types: !1439)
!1439 = !{null, !1440, !1300, !1382, !937, !937, !937}
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1177, file: !4, line: 1808, baseType: !1442, size: 64, align: 64, offset: 1216)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!533, !1440, !1202}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1177, file: !4, line: 1816, baseType: !937, size: 32, align: 32, offset: 1280)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1177, file: !4, line: 1825, baseType: !1447, size: 32, align: 32, offset: 1312)
!1447 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1177, file: !4, line: 1830, baseType: !937, size: 32, align: 32, offset: 1344)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1177, file: !4, line: 1838, baseType: !1447, size: 32, align: 32, offset: 1376)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1177, file: !4, line: 1846, baseType: !937, size: 32, align: 32, offset: 1408)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1177, file: !4, line: 1851, baseType: !937, size: 32, align: 32, offset: 1440)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1177, file: !4, line: 1861, baseType: !1447, size: 32, align: 32, offset: 1472)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1177, file: !4, line: 1868, baseType: !1447, size: 32, align: 32, offset: 1504)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1177, file: !4, line: 1875, baseType: !1447, size: 32, align: 32, offset: 1536)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1177, file: !4, line: 1882, baseType: !1447, size: 32, align: 32, offset: 1568)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1177, file: !4, line: 1889, baseType: !1447, size: 32, align: 32, offset: 1600)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1177, file: !4, line: 1896, baseType: !1447, size: 32, align: 32, offset: 1632)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1177, file: !4, line: 1903, baseType: !1447, size: 32, align: 32, offset: 1664)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1177, file: !4, line: 1910, baseType: !937, size: 32, align: 32, offset: 1696)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1177, file: !4, line: 1915, baseType: !937, size: 32, align: 32, offset: 1728)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1177, file: !4, line: 1926, baseType: !1382, size: 64, align: 64, offset: 1792)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1177, file: !4, line: 1935, baseType: !1195, size: 64, align: 32, offset: 1856)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1177, file: !4, line: 1942, baseType: !937, size: 32, align: 32, offset: 1920)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1177, file: !4, line: 1948, baseType: !937, size: 32, align: 32, offset: 1952)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1177, file: !4, line: 1954, baseType: !937, size: 32, align: 32, offset: 1984)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1177, file: !4, line: 1960, baseType: !937, size: 32, align: 32, offset: 2016)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1177, file: !4, line: 1984, baseType: !937, size: 32, align: 32, offset: 2048)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1177, file: !4, line: 1991, baseType: !937, size: 32, align: 32, offset: 2080)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1177, file: !4, line: 1996, baseType: !937, size: 32, align: 32, offset: 2112)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1177, file: !4, line: 2004, baseType: !937, size: 32, align: 32, offset: 2144)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1177, file: !4, line: 2011, baseType: !937, size: 32, align: 32, offset: 2176)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1177, file: !4, line: 2018, baseType: !937, size: 32, align: 32, offset: 2208)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1177, file: !4, line: 2027, baseType: !937, size: 32, align: 32, offset: 2240)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1177, file: !4, line: 2034, baseType: !937, size: 32, align: 32, offset: 2272)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1177, file: !4, line: 2044, baseType: !937, size: 32, align: 32, offset: 2304)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1177, file: !4, line: 2054, baseType: !1477, size: 64, align: 64, offset: 2368)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1177, file: !4, line: 2061, baseType: !1477, size: 64, align: 64, offset: 2432)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1177, file: !4, line: 2066, baseType: !937, size: 32, align: 32, offset: 2496)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1177, file: !4, line: 2070, baseType: !937, size: 32, align: 32, offset: 2528)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1177, file: !4, line: 2078, baseType: !937, size: 32, align: 32, offset: 2560)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1177, file: !4, line: 2085, baseType: !937, size: 32, align: 32, offset: 2592)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1177, file: !4, line: 2092, baseType: !937, size: 32, align: 32, offset: 2624)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1177, file: !4, line: 2099, baseType: !937, size: 32, align: 32, offset: 2656)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1177, file: !4, line: 2106, baseType: !937, size: 32, align: 32, offset: 2688)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1177, file: !4, line: 2113, baseType: !937, size: 32, align: 32, offset: 2720)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1177, file: !4, line: 2120, baseType: !937, size: 32, align: 32, offset: 2752)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1177, file: !4, line: 2125, baseType: !937, size: 32, align: 32, offset: 2784)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1177, file: !4, line: 2133, baseType: !937, size: 32, align: 32, offset: 2816)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1177, file: !4, line: 2140, baseType: !937, size: 32, align: 32, offset: 2848)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1177, file: !4, line: 2145, baseType: !937, size: 32, align: 32, offset: 2880)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1177, file: !4, line: 2153, baseType: !937, size: 32, align: 32, offset: 2912)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1177, file: !4, line: 2158, baseType: !937, size: 32, align: 32, offset: 2944)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1177, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1177, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1177, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1177, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1177, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1177, file: !4, line: 2203, baseType: !937, size: 32, align: 32, offset: 3136)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1177, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1177, file: !4, line: 2212, baseType: !937, size: 32, align: 32, offset: 3200)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1177, file: !4, line: 2213, baseType: !937, size: 32, align: 32, offset: 3232)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1177, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1177, file: !4, line: 2232, baseType: !937, size: 32, align: 32, offset: 3296)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1177, file: !4, line: 2243, baseType: !937, size: 32, align: 32, offset: 3328)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1177, file: !4, line: 2249, baseType: !937, size: 32, align: 32, offset: 3360)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1177, file: !4, line: 2256, baseType: !937, size: 32, align: 32, offset: 3392)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1177, file: !4, line: 2263, baseType: !1213, size: 64, align: 64, offset: 3456)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1177, file: !4, line: 2270, baseType: !1213, size: 64, align: 64, offset: 3520)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1177, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1177, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1177, file: !4, line: 2367, baseType: !1513, size: 64, align: 64, offset: 3648)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!937, !1440, !1400, !937}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1177, file: !4, line: 2383, baseType: !937, size: 32, align: 32, offset: 3712)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1177, file: !4, line: 2386, baseType: !1447, size: 32, align: 32, offset: 3744)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1177, file: !4, line: 2387, baseType: !1447, size: 32, align: 32, offset: 3776)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1177, file: !4, line: 2394, baseType: !937, size: 32, align: 32, offset: 3808)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1177, file: !4, line: 2401, baseType: !937, size: 32, align: 32, offset: 3840)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1177, file: !4, line: 2408, baseType: !937, size: 32, align: 32, offset: 3872)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1177, file: !4, line: 2415, baseType: !937, size: 32, align: 32, offset: 3904)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1177, file: !4, line: 2422, baseType: !937, size: 32, align: 32, offset: 3936)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1177, file: !4, line: 2423, baseType: !1525, size: 64, align: 64, offset: 3968)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1527, file: !4, line: 827, baseType: !937, size: 32, align: 32)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1527, file: !4, line: 828, baseType: !937, size: 32, align: 32, offset: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1527, file: !4, line: 829, baseType: !937, size: 32, align: 32, offset: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1527, file: !4, line: 830, baseType: !1447, size: 32, align: 32, offset: 96)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1177, file: !4, line: 2430, baseType: !917, size: 64, align: 64, offset: 4032)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1177, file: !4, line: 2437, baseType: !917, size: 64, align: 64, offset: 4096)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1177, file: !4, line: 2444, baseType: !1447, size: 32, align: 32, offset: 4160)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1177, file: !4, line: 2451, baseType: !1447, size: 32, align: 32, offset: 4192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1177, file: !4, line: 2458, baseType: !937, size: 32, align: 32, offset: 4224)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1177, file: !4, line: 2469, baseType: !937, size: 32, align: 32, offset: 4256)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1177, file: !4, line: 2475, baseType: !937, size: 32, align: 32, offset: 4288)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1177, file: !4, line: 2481, baseType: !937, size: 32, align: 32, offset: 4320)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1177, file: !4, line: 2485, baseType: !937, size: 32, align: 32, offset: 4352)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1177, file: !4, line: 2489, baseType: !937, size: 32, align: 32, offset: 4384)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1177, file: !4, line: 2493, baseType: !937, size: 32, align: 32, offset: 4416)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1177, file: !4, line: 2501, baseType: !937, size: 32, align: 32, offset: 4448)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1177, file: !4, line: 2506, baseType: !937, size: 32, align: 32, offset: 4480)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1177, file: !4, line: 2510, baseType: !937, size: 32, align: 32, offset: 4512)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1177, file: !4, line: 2514, baseType: !917, size: 64, align: 64, offset: 4544)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1177, file: !4, line: 2528, baseType: !1549, size: 64, align: 64, offset: 4608)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{null, !1440, !955, !937, !937}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1177, file: !4, line: 2534, baseType: !937, size: 32, align: 32, offset: 4672)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1177, file: !4, line: 2545, baseType: !937, size: 32, align: 32, offset: 4704)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1177, file: !4, line: 2547, baseType: !937, size: 32, align: 32, offset: 4736)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1177, file: !4, line: 2549, baseType: !937, size: 32, align: 32, offset: 4768)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1177, file: !4, line: 2551, baseType: !937, size: 32, align: 32, offset: 4800)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1177, file: !4, line: 2553, baseType: !937, size: 32, align: 32, offset: 4832)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1177, file: !4, line: 2555, baseType: !937, size: 32, align: 32, offset: 4864)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1177, file: !4, line: 2557, baseType: !937, size: 32, align: 32, offset: 4896)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1177, file: !4, line: 2559, baseType: !937, size: 32, align: 32, offset: 4928)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1177, file: !4, line: 2563, baseType: !937, size: 32, align: 32, offset: 4960)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1177, file: !4, line: 2571, baseType: !1292, size: 64, align: 64, offset: 4992)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1177, file: !4, line: 2579, baseType: !1292, size: 64, align: 64, offset: 5056)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1177, file: !4, line: 2586, baseType: !937, size: 32, align: 32, offset: 5120)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1177, file: !4, line: 2615, baseType: !937, size: 32, align: 32, offset: 5152)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1177, file: !4, line: 2627, baseType: !937, size: 32, align: 32, offset: 5184)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1177, file: !4, line: 2637, baseType: !937, size: 32, align: 32, offset: 5216)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1177, file: !4, line: 2681, baseType: !937, size: 32, align: 32, offset: 5248)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1177, file: !4, line: 2709, baseType: !917, size: 64, align: 64, offset: 5312)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1177, file: !4, line: 2716, baseType: !1571, size: 64, align: 64, offset: 5376)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1573)
!1573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1574)
!1574 = !{!1575, !1576, !1577, !1578, !1579, !1580, !1581, !1585, !1589, !1590, !1591, !1592, !1598, !1599, !1600, !1601, !1602}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1573, file: !4, line: 3642, baseType: !927, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1573, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1573, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1573, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1573, file: !4, line: 3669, baseType: !937, size: 32, align: 32, offset: 160)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1573, file: !4, line: 3682, baseType: !1397, size: 64, align: 64, offset: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1573, file: !4, line: 3698, baseType: !1582, size: 64, align: 64, offset: 256)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!937, !1175, !1128, !1260}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1573, file: !4, line: 3712, baseType: !1586, size: 64, align: 64, offset: 320)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{!937, !1175, !937, !1128, !1260}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1573, file: !4, line: 3726, baseType: !1582, size: 64, align: 64, offset: 384)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1573, file: !4, line: 3737, baseType: !1229, size: 64, align: 64, offset: 448)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1573, file: !4, line: 3746, baseType: !937, size: 32, align: 32, offset: 512)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1573, file: !4, line: 3757, baseType: !1593, size: 64, align: 64, offset: 576)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1596}
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1573, file: !4, line: 3766, baseType: !1229, size: 64, align: 64, offset: 640)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1573, file: !4, line: 3774, baseType: !1229, size: 64, align: 64, offset: 704)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1573, file: !4, line: 3780, baseType: !937, size: 32, align: 32, offset: 768)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1573, file: !4, line: 3785, baseType: !937, size: 32, align: 32, offset: 800)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1573, file: !4, line: 3795, baseType: !1603, size: 64, align: 64, offset: 832)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!937, !1175, !1035}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1177, file: !4, line: 2728, baseType: !955, size: 64, align: 64, offset: 5440)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1177, file: !4, line: 2735, baseType: !1324, size: 512, align: 64, offset: 5504)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1177, file: !4, line: 2742, baseType: !937, size: 32, align: 32, offset: 6016)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1177, file: !4, line: 2755, baseType: !937, size: 32, align: 32, offset: 6048)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1177, file: !4, line: 2776, baseType: !937, size: 32, align: 32, offset: 6080)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1177, file: !4, line: 2783, baseType: !937, size: 32, align: 32, offset: 6112)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1177, file: !4, line: 2791, baseType: !937, size: 32, align: 32, offset: 6144)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1177, file: !4, line: 2802, baseType: !1400, size: 64, align: 64, offset: 6208)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1177, file: !4, line: 2811, baseType: !937, size: 32, align: 32, offset: 6272)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1177, file: !4, line: 2821, baseType: !937, size: 32, align: 32, offset: 6304)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1177, file: !4, line: 2830, baseType: !937, size: 32, align: 32, offset: 6336)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1177, file: !4, line: 2840, baseType: !937, size: 32, align: 32, offset: 6368)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1177, file: !4, line: 2851, baseType: !1619, size: 64, align: 64, offset: 6400)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!937, !1440, !1622, !955, !1382, !937, !937}
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!937, !1440, !955}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1177, file: !4, line: 2871, baseType: !1626, size: 64, align: 64, offset: 6464)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!937, !1440, !1629, !955, !1382, !937}
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!937, !1440, !955, !937, !937}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1177, file: !4, line: 2878, baseType: !937, size: 32, align: 32, offset: 6528)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1177, file: !4, line: 2885, baseType: !937, size: 32, align: 32, offset: 6560)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1177, file: !4, line: 3005, baseType: !937, size: 32, align: 32, offset: 6592)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1177, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1177, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1177, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1177, file: !4, line: 3037, baseType: !1045, size: 64, align: 64, offset: 6720)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1177, file: !4, line: 3038, baseType: !937, size: 32, align: 32, offset: 6784)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1177, file: !4, line: 3050, baseType: !1213, size: 64, align: 64, offset: 6848)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1177, file: !4, line: 3065, baseType: !937, size: 32, align: 32, offset: 6912)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1177, file: !4, line: 3083, baseType: !937, size: 32, align: 32, offset: 6944)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1177, file: !4, line: 3092, baseType: !1195, size: 64, align: 32, offset: 6976)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1177, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1177, file: !4, line: 3106, baseType: !1195, size: 64, align: 32, offset: 7072)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1177, file: !4, line: 3113, baseType: !1647, size: 64, align: 64, offset: 7168)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1649)
!1649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1660}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1650, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1650, file: !4, line: 720, baseType: !927, size: 64, align: 64, offset: 64)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1650, file: !4, line: 724, baseType: !927, size: 64, align: 64, offset: 128)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1650, file: !4, line: 728, baseType: !937, size: 32, align: 32, offset: 192)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1650, file: !4, line: 734, baseType: !1658, size: 64, align: 64, offset: 256)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1650, file: !4, line: 739, baseType: !1661, size: 64, align: 64, offset: 320)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1220)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1177, file: !4, line: 3129, baseType: !917, size: 64, align: 64, offset: 7232)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1177, file: !4, line: 3130, baseType: !917, size: 64, align: 64, offset: 7296)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1177, file: !4, line: 3131, baseType: !917, size: 64, align: 64, offset: 7360)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1177, file: !4, line: 3132, baseType: !917, size: 64, align: 64, offset: 7424)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1177, file: !4, line: 3139, baseType: !1292, size: 64, align: 64, offset: 7488)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1177, file: !4, line: 3147, baseType: !937, size: 32, align: 32, offset: 7552)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1177, file: !4, line: 3165, baseType: !937, size: 32, align: 32, offset: 7584)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1177, file: !4, line: 3172, baseType: !937, size: 32, align: 32, offset: 7616)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1177, file: !4, line: 3180, baseType: !937, size: 32, align: 32, offset: 7648)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1177, file: !4, line: 3191, baseType: !1477, size: 64, align: 64, offset: 7680)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1177, file: !4, line: 3199, baseType: !1045, size: 64, align: 64, offset: 7744)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1177, file: !4, line: 3207, baseType: !1292, size: 64, align: 64, offset: 7808)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1177, file: !4, line: 3214, baseType: !1130, size: 32, align: 32, offset: 7872)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1177, file: !4, line: 3224, baseType: !1055, size: 64, align: 64, offset: 7936)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1177, file: !4, line: 3225, baseType: !937, size: 32, align: 32, offset: 8000)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1177, file: !4, line: 3249, baseType: !1035, size: 64, align: 64, offset: 8064)
