; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp9_superframe_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp9_superframe_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }
%struct.AVPacket = type { %struct.AVBufferRef*, i64, i64, i8*, i32, i32, i32, %struct.AVPacketSideData*, i32, i64, i64, i64 }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!570 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !503, line: 538, size: 32, align: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!573 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!574 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!575 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!576 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!577 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!578 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!579 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !{!611, !612, !613, !614, !622, !624, !630, !631}
!611 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!612 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64, align: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !617, line: 221, size: 32, align: 8, elements: !618)
!617 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !616, file: !617, line: 221, baseType: !620, size: 32, align: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !621, line: 51, baseType: !612)
!621 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !621, line: 48, baseType: !623)
!623 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64, align: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !617, line: 222, size: 16, align: 8, elements: !626)
!626 = !{!627}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !625, file: !617, line: 222, baseType: !628, size: 16, align: 16)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !621, line: 49, baseType: !629)
!629 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64, align: 64)
!632 = !{!633, !796}
!633 = distinct !DIGlobalVariable(name: "ff_vp9_superframe_bsf", scope: !0, file: !634, line: 217, type: !635, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_vp9_superframe_bsf)
!634 = !DIFile(filename: "libavcodec/vp9_superframe_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !638)
!638 = !{!639, !643, !646, !687, !688, !753, !791, !795}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !4, line: 5797, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !637, file: !4, line: 5804, baseType: !644, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !637, file: !4, line: 5815, baseType: !647, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !651)
!651 = !{!652, !653, !657, !661, !662, !663, !664, !668, !674, !676, !680}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !650, file: !464, line: 72, baseType: !640, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !650, file: !464, line: 78, baseType: !654, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!640, !613}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !650, file: !464, line: 85, baseType: !658, size: 64, align: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !650, file: !464, line: 93, baseType: !611, size: 32, align: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !650, file: !464, line: 99, baseType: !611, size: 32, align: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !650, file: !464, line: 108, baseType: !611, size: 32, align: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !650, file: !464, line: 113, baseType: !665, size: 64, align: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DISubroutineType(types: !667)
!667 = !{!613, !613, !613}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !650, file: !464, line: 123, baseType: !669, size: 64, align: 64, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{!672, !672}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !650, file: !464, line: 130, baseType: !675, size: 32, align: 32, offset: 448)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !650, file: !464, line: 136, baseType: !677, size: 64, align: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DISubroutineType(types: !679)
!679 = !{!675, !613}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !650, file: !464, line: 142, baseType: !681, size: 64, align: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64, align: 64)
!682 = !DISubroutineType(types: !683)
!683 = !{!611, !684, !613, !640, !611}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64, align: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64, align: 64)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !637, file: !4, line: 5825, baseType: !611, size: 32, align: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !637, file: !4, line: 5826, baseType: !689, size: 64, align: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64, align: 64)
!690 = !DISubroutineType(types: !691)
!691 = !{!611, !692}
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !695)
!695 = !{!696, !697, !700, !704, !705, !750, !751, !752}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !694, file: !4, line: 5751, baseType: !647, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !694, file: !4, line: 5756, baseType: !698, size: 64, align: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64, align: 64)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !694, file: !4, line: 5762, baseType: !701, size: 64, align: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64, align: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !703)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !694, file: !4, line: 5768, baseType: !613, size: 64, align: 64, offset: 192)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !694, file: !4, line: 5775, baseType: !706, size: 64, align: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !720, !721, !722, !723, !724, !725, !726, !733, !734, !735, !736, !737, !738, !739, !740, !743, !744, !745, !746, !747, !748, !749}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !708, file: !4, line: 3940, baseType: !484, size: 32, align: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !708, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !708, file: !4, line: 3948, baseType: !620, size: 32, align: 32, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !708, file: !4, line: 3958, baseType: !630, size: 64, align: 64, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !708, file: !4, line: 3962, baseType: !611, size: 32, align: 32, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !708, file: !4, line: 3968, baseType: !611, size: 32, align: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !708, file: !4, line: 3973, baseType: !717, size: 64, align: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !718, line: 197, baseType: !719)
!718 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!719 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !708, file: !4, line: 3986, baseType: !611, size: 32, align: 32, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !708, file: !4, line: 3999, baseType: !611, size: 32, align: 32, offset: 352)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !708, file: !4, line: 4004, baseType: !611, size: 32, align: 32, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !708, file: !4, line: 4005, baseType: !611, size: 32, align: 32, offset: 416)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !708, file: !4, line: 4010, baseType: !611, size: 32, align: 32, offset: 448)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !708, file: !4, line: 4011, baseType: !611, size: 32, align: 32, offset: 480)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !708, file: !4, line: 4020, baseType: !727, size: 64, align: 32, offset: 512)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !728, line: 61, baseType: !729)
!728 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !728, line: 58, size: 64, align: 32, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !729, file: !728, line: 59, baseType: !611, size: 32, align: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !729, file: !728, line: 60, baseType: !611, size: 32, align: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !708, file: !4, line: 4025, baseType: !494, size: 32, align: 32, offset: 576)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !708, file: !4, line: 4030, baseType: !502, size: 32, align: 32, offset: 608)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !708, file: !4, line: 4031, baseType: !509, size: 32, align: 32, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !708, file: !4, line: 4032, baseType: !527, size: 32, align: 32, offset: 672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !708, file: !4, line: 4033, baseType: !551, size: 32, align: 32, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !708, file: !4, line: 4034, baseType: !570, size: 32, align: 32, offset: 736)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !708, file: !4, line: 4039, baseType: !611, size: 32, align: 32, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !708, file: !4, line: 4046, baseType: !741, size: 64, align: 64, offset: 832)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !621, line: 55, baseType: !742)
!742 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !708, file: !4, line: 4050, baseType: !611, size: 32, align: 32, offset: 896)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !708, file: !4, line: 4054, baseType: !611, size: 32, align: 32, offset: 928)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !708, file: !4, line: 4061, baseType: !611, size: 32, align: 32, offset: 960)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !708, file: !4, line: 4065, baseType: !611, size: 32, align: 32, offset: 992)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !708, file: !4, line: 4073, baseType: !611, size: 32, align: 32, offset: 1024)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !708, file: !4, line: 4080, baseType: !611, size: 32, align: 32, offset: 1056)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !708, file: !4, line: 4084, baseType: !611, size: 32, align: 32, offset: 1088)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !694, file: !4, line: 5781, baseType: !706, size: 64, align: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !694, file: !4, line: 5787, baseType: !727, size: 64, align: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !694, file: !4, line: 5793, baseType: !727, size: 64, align: 32, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !637, file: !4, line: 5827, baseType: !754, size: 64, align: 64, offset: 320)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{!611, !692, !757}
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !760)
!760 = !{!761, !773, !774, !775, !776, !777, !778, !779, !787, !788, !789, !790}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !759, file: !4, line: 1451, baseType: !762, size: 64, align: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !764, line: 94, baseType: !765)
!764 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !764, line: 81, size: 192, align: 64, elements: !766)
!766 = !{!767, !771, !772}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !765, file: !764, line: 82, baseType: !768, size: 64, align: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64, align: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !764, line: 73, baseType: !770)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !764, line: 73, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !765, file: !764, line: 89, baseType: !630, size: 64, align: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !765, file: !764, line: 93, baseType: !611, size: 32, align: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !759, file: !4, line: 1461, baseType: !717, size: 64, align: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !759, file: !4, line: 1467, baseType: !717, size: 64, align: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !759, file: !4, line: 1468, baseType: !630, size: 64, align: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !759, file: !4, line: 1469, baseType: !611, size: 32, align: 32, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !759, file: !4, line: 1470, baseType: !611, size: 32, align: 32, offset: 288)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !4, line: 1474, baseType: !611, size: 32, align: 32, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !759, file: !4, line: 1479, baseType: !780, size: 64, align: 64, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !782, file: !4, line: 1412, baseType: !630, size: 64, align: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !782, file: !4, line: 1413, baseType: !611, size: 32, align: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !782, file: !4, line: 1414, baseType: !580, size: 32, align: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !759, file: !4, line: 1480, baseType: !611, size: 32, align: 32, offset: 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !759, file: !4, line: 1486, baseType: !717, size: 64, align: 64, offset: 512)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !759, file: !4, line: 1488, baseType: !717, size: 64, align: 64, offset: 576)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !759, file: !4, line: 1497, baseType: !717, size: 64, align: 64, offset: 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !637, file: !4, line: 5828, baseType: !792, size: 64, align: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64, align: 64)
!793 = !DISubroutineType(types: !794)
!794 = !{null, !692}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !637, file: !4, line: 5829, baseType: !792, size: 64, align: 64, offset: 448)
!796 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !634, line: 213, type: !797, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 64, align: 32, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 2)
!800 = !{i32 2, !"Dwarf Version", i32 4}
!801 = !{i32 2, !"Debug Info Version", i32 3}
!802 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!803 = distinct !DISubprogram(name: "vp9_superframe_init", scope: !634, file: !634, line: 177, type: !690, isLocal: true, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !804)
!804 = !{}
!805 = !DILocalVariable(name: "ctx", arg: 1, scope: !803, file: !634, line: 177, type: !692)
!806 = !DIExpression()
!807 = !DILocation(line: 177, column: 46, scope: !803)
!808 = !DILocalVariable(name: "s", scope: !803, file: !634, line: 179, type: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9BSFContext", file: !634, line: 31, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9BSFContext", file: !634, line: 28, size: 576, align: 64, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "n_cache", scope: !811, file: !634, line: 29, baseType: !611, size: 32, align: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !811, file: !634, line: 30, baseType: !815, size: 512, align: 64, offset: 64)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 512, align: 64, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 8)
!818 = !DILocation(line: 179, column: 20, scope: !803)
!819 = !DILocation(line: 179, column: 24, scope: !803)
!820 = !DILocation(line: 179, column: 29, scope: !803)
!821 = !DILocalVariable(name: "n", scope: !803, file: !634, line: 180, type: !611)
!822 = !DILocation(line: 180, column: 9, scope: !803)
!823 = !DILocation(line: 183, column: 12, scope: !824)
!824 = distinct !DILexicalBlock(scope: !803, file: !634, line: 183, column: 5)
!825 = !DILocation(line: 183, column: 10, scope: !824)
!826 = !DILocation(line: 183, column: 17, scope: !827)
!827 = !DILexicalBlockFile(scope: !828, file: !634, discriminator: 1)
!828 = distinct !DILexicalBlock(scope: !824, file: !634, line: 183, column: 5)
!829 = !DILocation(line: 183, column: 19, scope: !827)
!830 = !DILocation(line: 183, column: 5, scope: !827)
!831 = !DILocation(line: 184, column: 23, scope: !832)
!832 = distinct !DILexicalBlock(scope: !828, file: !634, line: 183, column: 29)
!833 = !DILocation(line: 184, column: 18, scope: !832)
!834 = !DILocation(line: 184, column: 9, scope: !832)
!835 = !DILocation(line: 184, column: 12, scope: !832)
!836 = !DILocation(line: 184, column: 21, scope: !832)
!837 = !DILocation(line: 185, column: 23, scope: !838)
!838 = distinct !DILexicalBlock(scope: !832, file: !634, line: 185, column: 13)
!839 = !DILocation(line: 185, column: 14, scope: !838)
!840 = !DILocation(line: 185, column: 17, scope: !838)
!841 = !DILocation(line: 185, column: 13, scope: !832)
!842 = !DILocation(line: 186, column: 13, scope: !838)
!843 = !DILocation(line: 187, column: 5, scope: !832)
!844 = !DILocation(line: 183, column: 25, scope: !845)
!845 = !DILexicalBlockFile(scope: !828, file: !634, discriminator: 2)
!846 = !DILocation(line: 183, column: 5, scope: !845)
!847 = distinct !{!847, !848}
!848 = !DILocation(line: 183, column: 5, scope: !803)
!849 = !DILocation(line: 189, column: 5, scope: !803)
!850 = !DILocation(line: 190, column: 1, scope: !803)
!851 = distinct !DISubprogram(name: "vp9_superframe_filter", scope: !634, file: !634, line: 100, type: !755, isLocal: true, isDefinition: true, scopeLine: 101, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !804)
!852 = !DILocalVariable(name: "ctx", arg: 1, scope: !851, file: !634, line: 100, type: !692)
!853 = !DILocation(line: 100, column: 48, scope: !851)
!854 = !DILocalVariable(name: "out", arg: 2, scope: !851, file: !634, line: 100, type: !757)
!855 = !DILocation(line: 100, column: 63, scope: !851)
!856 = !DILocalVariable(name: "gb", scope: !851, file: !634, line: 102, type: !857)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !858, line: 70, baseType: !859)
!858 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !858, line: 61, size: 256, align: 64, elements: !860)
!860 = !{!861, !864, !865, !866, !867}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !859, file: !858, line: 62, baseType: !862, size: 64, align: 64)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !859, file: !858, line: 62, baseType: !862, size: 64, align: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !859, file: !858, line: 67, baseType: !611, size: 32, align: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !859, file: !858, line: 68, baseType: !611, size: 32, align: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !859, file: !858, line: 69, baseType: !611, size: 32, align: 32, offset: 192)
!868 = !DILocation(line: 102, column: 19, scope: !851)
!869 = !DILocalVariable(name: "s", scope: !851, file: !634, line: 103, type: !809)
!870 = !DILocation(line: 103, column: 20, scope: !851)
!871 = !DILocation(line: 103, column: 24, scope: !851)
!872 = !DILocation(line: 103, column: 29, scope: !851)
!873 = !DILocalVariable(name: "in", scope: !851, file: !634, line: 104, type: !757)
!874 = !DILocation(line: 104, column: 15, scope: !851)
!875 = !DILocalVariable(name: "res", scope: !851, file: !634, line: 105, type: !611)
!876 = !DILocation(line: 105, column: 9, scope: !851)
!877 = !DILocalVariable(name: "invisible", scope: !851, file: !634, line: 105, type: !611)
!878 = !DILocation(line: 105, column: 14, scope: !851)
!879 = !DILocalVariable(name: "profile", scope: !851, file: !634, line: 105, type: !611)
!880 = !DILocation(line: 105, column: 25, scope: !851)
!881 = !DILocalVariable(name: "marker", scope: !851, file: !634, line: 105, type: !611)
!882 = !DILocation(line: 105, column: 34, scope: !851)
!883 = !DILocalVariable(name: "uses_superframe_syntax", scope: !851, file: !634, line: 105, type: !611)
!884 = !DILocation(line: 105, column: 42, scope: !851)
!885 = !DILocalVariable(name: "n", scope: !851, file: !634, line: 105, type: !611)
!886 = !DILocation(line: 105, column: 70, scope: !851)
!887 = !DILocation(line: 107, column: 29, scope: !851)
!888 = !DILocation(line: 107, column: 11, scope: !851)
!889 = !DILocation(line: 107, column: 9, scope: !851)
!890 = !DILocation(line: 108, column: 9, scope: !891)
!891 = distinct !DILexicalBlock(scope: !851, file: !634, line: 108, column: 9)
!892 = !DILocation(line: 108, column: 13, scope: !891)
!893 = !DILocation(line: 108, column: 9, scope: !851)
!894 = !DILocation(line: 109, column: 16, scope: !891)
!895 = !DILocation(line: 109, column: 9, scope: !891)
!896 = !DILocation(line: 111, column: 23, scope: !851)
!897 = !DILocation(line: 111, column: 27, scope: !851)
!898 = !DILocation(line: 111, column: 32, scope: !851)
!899 = !DILocation(line: 111, column: 14, scope: !851)
!900 = !DILocation(line: 111, column: 18, scope: !851)
!901 = !DILocation(line: 111, column: 12, scope: !851)
!902 = !DILocation(line: 112, column: 10, scope: !903)
!903 = distinct !DILexicalBlock(scope: !851, file: !634, line: 112, column: 9)
!904 = !DILocation(line: 112, column: 17, scope: !903)
!905 = !DILocation(line: 112, column: 25, scope: !903)
!906 = !DILocation(line: 112, column: 9, scope: !851)
!907 = !DILocalVariable(name: "nbytes", scope: !908, file: !634, line: 113, type: !611)
!908 = distinct !DILexicalBlock(scope: !903, file: !634, line: 112, column: 34)
!909 = !DILocation(line: 113, column: 13, scope: !908)
!910 = !DILocation(line: 113, column: 28, scope: !908)
!911 = !DILocation(line: 113, column: 35, scope: !908)
!912 = !DILocation(line: 113, column: 41, scope: !908)
!913 = !DILocation(line: 113, column: 24, scope: !908)
!914 = !DILocalVariable(name: "n_frames", scope: !908, file: !634, line: 114, type: !611)
!915 = !DILocation(line: 114, column: 13, scope: !908)
!916 = !DILocation(line: 114, column: 29, scope: !908)
!917 = !DILocation(line: 114, column: 36, scope: !908)
!918 = !DILocation(line: 114, column: 26, scope: !908)
!919 = !DILocalVariable(name: "idx_sz", scope: !908, file: !634, line: 114, type: !611)
!920 = !DILocation(line: 114, column: 44, scope: !908)
!921 = !DILocation(line: 114, column: 57, scope: !908)
!922 = !DILocation(line: 114, column: 68, scope: !908)
!923 = !DILocation(line: 114, column: 66, scope: !908)
!924 = !DILocation(line: 114, column: 55, scope: !908)
!925 = !DILocation(line: 116, column: 34, scope: !908)
!926 = !DILocation(line: 116, column: 38, scope: !908)
!927 = !DILocation(line: 116, column: 46, scope: !908)
!928 = !DILocation(line: 116, column: 43, scope: !908)
!929 = !DILocation(line: 116, column: 53, scope: !908)
