; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ljpegenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ljpegenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!856 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!857 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!858 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!860 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!861 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!862 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!863 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!864 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!865 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!866 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!868 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!869 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!870 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!871 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !895, line: 123, size: 32, align: 32, elements: !896)
!895 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!896 = !{!897, !898, !899, !900}
!897 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!898 = !DIEnumerator(name: "FMT_H261", value: 1)
!899 = !DIEnumerator(name: "FMT_H263", value: 2)
!900 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !902, line: 37, size: 32, align: 32, elements: !903)
!902 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!905 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!906 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!907 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!908 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!909 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !{!926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!927 = !{!928, !2589, !2590}
!928 = distinct !DIGlobalVariable(name: "ff_ljpeg_encoder", scope: !0, file: !929, line: 353, type: !930, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_ljpeg_encoder)
!929 = !DIFile(filename: "libavcodec/ljpegenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !932)
!932 = !{!933, !937, !938, !939, !940, !942, !951, !954, !957, !960, !966, !969, !1044, !1052, !1053, !1054, !1056, !2504, !2510, !2518, !2522, !2523, !2560, !2564, !2568, !2569, !2573, !2577, !2578, !2582, !2583, !2584}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !14, line: 3475, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !931, file: !14, line: 3480, baseType: !934, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !931, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !931, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !931, file: !14, line: 3487, baseType: !941, size: 32, align: 32, offset: 192)
!941 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !931, file: !14, line: 3488, baseType: !943, size: 64, align: 64, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !946, line: 61, baseType: !947)
!946 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !946, line: 58, size: 64, align: 32, elements: !948)
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !947, file: !946, line: 59, baseType: !941, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !947, file: !946, line: 60, baseType: !941, size: 32, align: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !931, file: !14, line: 3489, baseType: !952, size: 64, align: 64, offset: 320)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !931, file: !14, line: 3490, baseType: !955, size: 64, align: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !931, file: !14, line: 3491, baseType: !958, size: 64, align: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !931, file: !14, line: 3492, baseType: !961, size: 64, align: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !964, line: 55, baseType: !965)
!964 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!965 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !931, file: !14, line: 3493, baseType: !967, size: 8, align: 8, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !964, line: 48, baseType: !968)
!968 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !931, file: !14, line: 3494, baseType: !970, size: 64, align: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !974)
!974 = !{!975, !976, !980, !1003, !1004, !1005, !1006, !1010, !1016, !1018, !1022}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !973, file: !713, line: 72, baseType: !934, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !973, file: !713, line: 78, baseType: !977, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DISubroutineType(types: !979)
!979 = !{!934, !926}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !973, file: !713, line: 85, baseType: !981, size: 64, align: 64, offset: 128)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !999, !1000, !1001, !1002}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !691, line: 247, baseType: !934, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !983, file: !691, line: 253, baseType: !934, size: 64, align: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !983, file: !691, line: 259, baseType: !941, size: 32, align: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !983, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !983, file: !691, line: 271, baseType: !990, size: 64, align: 64, offset: 192)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !691, line: 265, size: 64, align: 64, elements: !991)
!991 = !{!992, !995, !997, !998}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !990, file: !691, line: 266, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !964, line: 40, baseType: !994)
!994 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !990, file: !691, line: 267, baseType: !996, size: 64, align: 64)
!996 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !990, file: !691, line: 268, baseType: !934, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !990, file: !691, line: 270, baseType: !945, size: 64, align: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !983, file: !691, line: 272, baseType: !996, size: 64, align: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !983, file: !691, line: 273, baseType: !996, size: 64, align: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !691, line: 275, baseType: !941, size: 32, align: 32, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !983, file: !691, line: 300, baseType: !934, size: 64, align: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !973, file: !713, line: 93, baseType: !941, size: 32, align: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !973, file: !713, line: 99, baseType: !941, size: 32, align: 32, offset: 224)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !973, file: !713, line: 108, baseType: !941, size: 32, align: 32, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !973, file: !713, line: 113, baseType: !1007, size: 64, align: 64, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!926, !926, !926}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !973, file: !713, line: 123, baseType: !1011, size: 64, align: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!1014, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !973, file: !713, line: 130, baseType: !1017, size: 32, align: 32, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !973, file: !713, line: 136, baseType: !1019, size: 64, align: 64, offset: 512)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1017, !926}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !973, file: !713, line: 142, baseType: !1023, size: 64, align: 64, offset: 576)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!941, !1026, !926, !934, !941}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1029)
!1029 = !{!1030, !1042, !1043}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1028, file: !691, line: 360, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1040, !1041}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1034, file: !691, line: 307, baseType: !934, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1034, file: !691, line: 313, baseType: !996, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1034, file: !691, line: 313, baseType: !996, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1034, file: !691, line: 318, baseType: !996, size: 64, align: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1034, file: !691, line: 318, baseType: !996, size: 64, align: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1034, file: !691, line: 323, baseType: !941, size: 32, align: 32, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1028, file: !691, line: 364, baseType: !941, size: 32, align: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1028, file: !691, line: 368, baseType: !941, size: 32, align: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !931, file: !14, line: 3495, baseType: !1045, size: 64, align: 64, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1048, file: !14, line: 3402, baseType: !941, size: 32, align: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1048, file: !14, line: 3403, baseType: !934, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !931, file: !14, line: 3507, baseType: !934, size: 64, align: 64, offset: 768)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !931, file: !14, line: 3516, baseType: !941, size: 32, align: 32, offset: 832)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !14, line: 3517, baseType: !1055, size: 64, align: 64, offset: 896)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !931, file: !14, line: 3527, baseType: !1057, size: 64, align: 64, offset: 960)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!941, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1070, !1071, !1073, !1074, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1355, !1359, !1360, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2442, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1062, file: !14, line: 1561, baseType: !970, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1062, file: !14, line: 1562, baseType: !941, size: 32, align: 32, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1062, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1062, file: !14, line: 1565, baseType: !1068, size: 64, align: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1062, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1062, file: !14, line: 1581, baseType: !1072, size: 32, align: 32, offset: 224)
!1072 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1062, file: !14, line: 1583, baseType: !926, size: 64, align: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1062, file: !14, line: 1591, baseType: !1075, size: 64, align: 64, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1077, line: 129, size: 1664, align: 64, elements: !1078)
!1077 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1078 = !{!1079, !1080, !1081, !1082, !1180, !1201, !1202, !1231, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1076, file: !1077, line: 136, baseType: !941, size: 32, align: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1076, file: !1077, line: 151, baseType: !941, size: 32, align: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1076, file: !1077, line: 157, baseType: !941, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1076, file: !1077, line: 159, baseType: !1083, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1086)
!1086 = !{!1087, !1092, !1094, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1132, !1134, !1135, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1168, !1169, !1170, !1171, !1172, !1173, !1176, !1177, !1178, !1179}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1085, file: !744, line: 282, baseType: !1088, size: 512, align: 64)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 512, align: 64, elements: !1090)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1090 = !{!1091}
!1091 = !DISubrange(count: 8)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1085, file: !744, line: 299, baseType: !1093, size: 256, align: 32, offset: 512)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 256, align: 32, elements: !1090)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1085, file: !744, line: 315, baseType: !1095, size: 64, align: 64, offset: 768)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1085, file: !744, line: 326, baseType: !941, size: 32, align: 32, offset: 832)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1085, file: !744, line: 326, baseType: !941, size: 32, align: 32, offset: 864)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1085, file: !744, line: 334, baseType: !941, size: 32, align: 32, offset: 896)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1085, file: !744, line: 341, baseType: !941, size: 32, align: 32, offset: 928)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1085, file: !744, line: 346, baseType: !941, size: 32, align: 32, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1085, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1085, file: !744, line: 356, baseType: !945, size: 64, align: 32, offset: 1024)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1085, file: !744, line: 361, baseType: !993, size: 64, align: 64, offset: 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1085, file: !744, line: 369, baseType: !993, size: 64, align: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1085, file: !744, line: 377, baseType: !993, size: 64, align: 64, offset: 1216)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1085, file: !744, line: 382, baseType: !941, size: 32, align: 32, offset: 1280)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1085, file: !744, line: 386, baseType: !941, size: 32, align: 32, offset: 1312)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1085, file: !744, line: 391, baseType: !941, size: 32, align: 32, offset: 1344)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1085, file: !744, line: 396, baseType: !926, size: 64, align: 64, offset: 1408)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1085, file: !744, line: 403, baseType: !1111, size: 512, align: 64, offset: 1472)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 512, align: 64, elements: !1090)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1085, file: !744, line: 410, baseType: !941, size: 32, align: 32, offset: 1984)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1085, file: !744, line: 415, baseType: !941, size: 32, align: 32, offset: 2016)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1085, file: !744, line: 420, baseType: !941, size: 32, align: 32, offset: 2048)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1085, file: !744, line: 425, baseType: !941, size: 32, align: 32, offset: 2080)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1085, file: !744, line: 435, baseType: !993, size: 64, align: 64, offset: 2112)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1085, file: !744, line: 440, baseType: !941, size: 32, align: 32, offset: 2176)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1085, file: !744, line: 445, baseType: !963, size: 64, align: 64, offset: 2240)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1085, file: !744, line: 459, baseType: !1120, size: 512, align: 64, offset: 2304)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 512, align: 64, elements: !1090)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1123, line: 94, baseType: !1124)
!1123 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1123, line: 81, size: 192, align: 64, elements: !1125)
!1125 = !{!1126, !1130, !1131}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1124, file: !1123, line: 82, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1123, line: 73, baseType: !1129)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1123, line: 73, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !1123, line: 89, baseType: !1089, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1124, file: !1123, line: 93, baseType: !941, size: 32, align: 32, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1085, file: !744, line: 473, baseType: !1133, size: 64, align: 64, offset: 2816)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1085, file: !744, line: 477, baseType: !941, size: 32, align: 32, offset: 2880)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1085, file: !744, line: 479, baseType: !1136, size: 64, align: 64, offset: 2944)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1149}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1139, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !744, line: 203, baseType: !1089, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !744, line: 204, baseType: !941, size: 32, align: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1139, file: !744, line: 205, baseType: !1145, size: 64, align: 64, offset: 192)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1147, line: 86, baseType: !1148)
!1147 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1147, line: 86, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1139, file: !744, line: 206, baseType: !1121, size: 64, align: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1085, file: !744, line: 480, baseType: !941, size: 32, align: 32, offset: 3008)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1085, file: !744, line: 505, baseType: !941, size: 32, align: 32, offset: 3040)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1085, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1085, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1085, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1085, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1085, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1085, file: !744, line: 532, baseType: !993, size: 64, align: 64, offset: 3264)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1085, file: !744, line: 539, baseType: !993, size: 64, align: 64, offset: 3328)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1085, file: !744, line: 547, baseType: !993, size: 64, align: 64, offset: 3392)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1085, file: !744, line: 554, baseType: !1145, size: 64, align: 64, offset: 3456)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1085, file: !744, line: 563, baseType: !941, size: 32, align: 32, offset: 3520)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1085, file: !744, line: 572, baseType: !941, size: 32, align: 32, offset: 3552)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1085, file: !744, line: 581, baseType: !941, size: 32, align: 32, offset: 3584)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1085, file: !744, line: 588, baseType: !1165, size: 64, align: 64, offset: 3648)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !964, line: 36, baseType: !1167)
!1167 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1085, file: !744, line: 593, baseType: !941, size: 32, align: 32, offset: 3712)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1085, file: !744, line: 596, baseType: !941, size: 32, align: 32, offset: 3744)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1085, file: !744, line: 599, baseType: !1121, size: 64, align: 64, offset: 3776)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1085, file: !744, line: 605, baseType: !1121, size: 64, align: 64, offset: 3840)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1085, file: !744, line: 616, baseType: !1121, size: 64, align: 64, offset: 3904)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1085, file: !744, line: 626, baseType: !1174, size: 64, align: 64, offset: 3968)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1175, line: 216, baseType: !965)
!1175 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1085, file: !744, line: 627, baseType: !1174, size: 64, align: 64, offset: 4032)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1085, file: !744, line: 628, baseType: !1174, size: 64, align: 64, offset: 4096)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1085, file: !744, line: 629, baseType: !1174, size: 64, align: 64, offset: 4160)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1085, file: !744, line: 645, baseType: !1121, size: 64, align: 64, offset: 4224)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1076, file: !1077, line: 161, baseType: !1181, size: 64, align: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1077, line: 117, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1077, line: 100, size: 832, align: 64, elements: !1184)
!1184 = !{!1185, !1192, !1193, !1194, !1195, !1196, !1198, !1199, !1200}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1183, file: !1077, line: 105, baseType: !1186, size: 256, align: 64)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1187, size: 256, align: 64, elements: !1190)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1123, line: 238, baseType: !1189)
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1123, line: 238, flags: DIFlagFwdDecl)
!1190 = !{!1191}
!1191 = !DISubrange(count: 4)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1183, file: !1077, line: 110, baseType: !941, size: 32, align: 32, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1183, file: !1077, line: 111, baseType: !941, size: 32, align: 32, offset: 288)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1183, file: !1077, line: 111, baseType: !941, size: 32, align: 32, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1183, file: !1077, line: 112, baseType: !1093, size: 256, align: 32, offset: 352)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1183, file: !1077, line: 113, baseType: !1197, size: 128, align: 32, offset: 608)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 128, align: 32, elements: !1190)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1183, file: !1077, line: 114, baseType: !941, size: 32, align: 32, offset: 736)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1183, file: !1077, line: 115, baseType: !941, size: 32, align: 32, offset: 768)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1183, file: !1077, line: 116, baseType: !941, size: 32, align: 32, offset: 800)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1076, file: !1077, line: 163, baseType: !926, size: 64, align: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1076, file: !1077, line: 165, baseType: !1203, size: 128, align: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1077, line: 122, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1077, line: 119, size: 128, align: 64, elements: !1205)
!1205 = !{!1206, !1230}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1204, file: !1077, line: 120, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1226, !1227, !1228, !1229}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1209, file: !14, line: 1451, baseType: !1121, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1209, file: !14, line: 1461, baseType: !993, size: 64, align: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1209, file: !14, line: 1467, baseType: !993, size: 64, align: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1209, file: !14, line: 1468, baseType: !1089, size: 64, align: 64, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1209, file: !14, line: 1469, baseType: !941, size: 32, align: 32, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1209, file: !14, line: 1470, baseType: !941, size: 32, align: 32, offset: 288)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1209, file: !14, line: 1474, baseType: !941, size: 32, align: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1209, file: !14, line: 1479, baseType: !1219, size: 64, align: 64, offset: 384)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !14, line: 1412, baseType: !1089, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !14, line: 1413, baseType: !941, size: 32, align: 32, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1221, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1209, file: !14, line: 1480, baseType: !941, size: 32, align: 32, offset: 448)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1209, file: !14, line: 1486, baseType: !993, size: 64, align: 64, offset: 512)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1209, file: !14, line: 1488, baseType: !993, size: 64, align: 64, offset: 576)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1209, file: !14, line: 1497, baseType: !993, size: 64, align: 64, offset: 640)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1204, file: !1077, line: 121, baseType: !1083, size: 64, align: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1076, file: !1077, line: 166, baseType: !1232, size: 128, align: 64, offset: 448)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1077, line: 127, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1077, line: 124, size: 128, align: 64, elements: !1234)
!1234 = !{!1235, !1309}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1233, file: !1077, line: 125, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1266, !1270, !1271, !1306, !1307, !1308}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1239, file: !14, line: 5751, baseType: !970, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1239, file: !14, line: 5756, baseType: !1243, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1251, !1252, !1253, !1257, !1261, !1265}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1245, file: !14, line: 5797, baseType: !934, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1245, file: !14, line: 5804, baseType: !1249, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1245, file: !14, line: 5815, baseType: !970, size: 64, align: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1245, file: !14, line: 5825, baseType: !941, size: 32, align: 32, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1245, file: !14, line: 5826, baseType: !1254, size: 64, align: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!941, !1237}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1245, file: !14, line: 5827, baseType: !1258, size: 64, align: 64, offset: 320)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!941, !1237, !1207}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1245, file: !14, line: 5828, baseType: !1262, size: 64, align: 64, offset: 384)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !1237}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1245, file: !14, line: 5829, baseType: !1262, size: 64, align: 64, offset: 448)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1239, file: !14, line: 5762, baseType: !1267, size: 64, align: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1269)
!1269 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1239, file: !14, line: 5768, baseType: !926, size: 64, align: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1239, file: !14, line: 5775, baseType: !1272, size: 64, align: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1274, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1274, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1274, file: !14, line: 3948, baseType: !1279, size: 32, align: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !964, line: 51, baseType: !1072)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1274, file: !14, line: 3958, baseType: !1089, size: 64, align: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1274, file: !14, line: 3962, baseType: !941, size: 32, align: 32, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1274, file: !14, line: 3968, baseType: !941, size: 32, align: 32, offset: 224)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1274, file: !14, line: 3973, baseType: !993, size: 64, align: 64, offset: 256)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1274, file: !14, line: 3986, baseType: !941, size: 32, align: 32, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1274, file: !14, line: 3999, baseType: !941, size: 32, align: 32, offset: 352)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1274, file: !14, line: 4004, baseType: !941, size: 32, align: 32, offset: 384)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1274, file: !14, line: 4005, baseType: !941, size: 32, align: 32, offset: 416)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1274, file: !14, line: 4010, baseType: !941, size: 32, align: 32, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1274, file: !14, line: 4011, baseType: !941, size: 32, align: 32, offset: 480)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1274, file: !14, line: 4020, baseType: !945, size: 64, align: 32, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1274, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1274, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1274, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1274, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1274, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1274, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1274, file: !14, line: 4039, baseType: !941, size: 32, align: 32, offset: 768)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1274, file: !14, line: 4046, baseType: !963, size: 64, align: 64, offset: 832)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1274, file: !14, line: 4050, baseType: !941, size: 32, align: 32, offset: 896)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1274, file: !14, line: 4054, baseType: !941, size: 32, align: 32, offset: 928)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1274, file: !14, line: 4061, baseType: !941, size: 32, align: 32, offset: 960)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1274, file: !14, line: 4065, baseType: !941, size: 32, align: 32, offset: 992)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1274, file: !14, line: 4073, baseType: !941, size: 32, align: 32, offset: 1024)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1274, file: !14, line: 4080, baseType: !941, size: 32, align: 32, offset: 1056)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1274, file: !14, line: 4084, baseType: !941, size: 32, align: 32, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1239, file: !14, line: 5781, baseType: !1272, size: 64, align: 64, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1239, file: !14, line: 5787, baseType: !945, size: 64, align: 32, offset: 384)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1239, file: !14, line: 5793, baseType: !945, size: 64, align: 32, offset: 448)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1233, file: !1077, line: 126, baseType: !941, size: 32, align: 32, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1076, file: !1077, line: 172, baseType: !1207, size: 64, align: 64, offset: 576)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1076, file: !1077, line: 177, baseType: !1089, size: 64, align: 64, offset: 640)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1076, file: !1077, line: 178, baseType: !1072, size: 32, align: 32, offset: 704)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1076, file: !1077, line: 180, baseType: !926, size: 64, align: 64, offset: 768)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1076, file: !1077, line: 185, baseType: !941, size: 32, align: 32, offset: 832)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1076, file: !1077, line: 190, baseType: !926, size: 64, align: 64, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1076, file: !1077, line: 195, baseType: !941, size: 32, align: 32, offset: 960)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1076, file: !1077, line: 200, baseType: !1207, size: 64, align: 64, offset: 1024)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1076, file: !1077, line: 201, baseType: !941, size: 32, align: 32, offset: 1088)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1076, file: !1077, line: 202, baseType: !1083, size: 64, align: 64, offset: 1152)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1076, file: !1077, line: 203, baseType: !941, size: 32, align: 32, offset: 1216)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1076, file: !1077, line: 205, baseType: !941, size: 32, align: 32, offset: 1248)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1076, file: !1077, line: 206, baseType: !941, size: 32, align: 32, offset: 1280)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1076, file: !1077, line: 209, baseType: !1174, size: 64, align: 64, offset: 1344)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1076, file: !1077, line: 212, baseType: !1174, size: 64, align: 64, offset: 1408)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1076, file: !1077, line: 213, baseType: !1083, size: 64, align: 64, offset: 1472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1076, file: !1077, line: 215, baseType: !941, size: 32, align: 32, offset: 1536)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1076, file: !1077, line: 217, baseType: !941, size: 32, align: 32, offset: 1568)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1076, file: !1077, line: 220, baseType: !941, size: 32, align: 32, offset: 1600)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1062, file: !14, line: 1598, baseType: !926, size: 64, align: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1062, file: !14, line: 1606, baseType: !993, size: 64, align: 64, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1062, file: !14, line: 1614, baseType: !941, size: 32, align: 32, offset: 512)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1062, file: !14, line: 1622, baseType: !941, size: 32, align: 32, offset: 544)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1062, file: !14, line: 1628, baseType: !941, size: 32, align: 32, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1062, file: !14, line: 1636, baseType: !941, size: 32, align: 32, offset: 608)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1062, file: !14, line: 1643, baseType: !941, size: 32, align: 32, offset: 640)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1062, file: !14, line: 1657, baseType: !1089, size: 64, align: 64, offset: 704)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1062, file: !14, line: 1658, baseType: !941, size: 32, align: 32, offset: 768)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1062, file: !14, line: 1679, baseType: !945, size: 64, align: 32, offset: 800)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1062, file: !14, line: 1688, baseType: !941, size: 32, align: 32, offset: 864)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1062, file: !14, line: 1712, baseType: !941, size: 32, align: 32, offset: 896)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1062, file: !14, line: 1729, baseType: !941, size: 32, align: 32, offset: 928)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1062, file: !14, line: 1729, baseType: !941, size: 32, align: 32, offset: 960)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1062, file: !14, line: 1744, baseType: !941, size: 32, align: 32, offset: 992)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1062, file: !14, line: 1744, baseType: !941, size: 32, align: 32, offset: 1024)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1062, file: !14, line: 1751, baseType: !941, size: 32, align: 32, offset: 1056)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1062, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1062, file: !14, line: 1791, baseType: !1348, size: 64, align: 64, offset: 1152)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{null, !1351, !1352, !1354, !941, !941, !941}
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1084)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1062, file: !14, line: 1808, baseType: !1356, size: 64, align: 64, offset: 1216)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!473, !1351, !952}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1062, file: !14, line: 1816, baseType: !941, size: 32, align: 32, offset: 1280)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1062, file: !14, line: 1825, baseType: !1361, size: 32, align: 32, offset: 1312)
!1361 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1062, file: !14, line: 1830, baseType: !941, size: 32, align: 32, offset: 1344)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1062, file: !14, line: 1838, baseType: !1361, size: 32, align: 32, offset: 1376)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1062, file: !14, line: 1846, baseType: !941, size: 32, align: 32, offset: 1408)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1062, file: !14, line: 1851, baseType: !941, size: 32, align: 32, offset: 1440)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1062, file: !14, line: 1861, baseType: !1361, size: 32, align: 32, offset: 1472)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1062, file: !14, line: 1868, baseType: !1361, size: 32, align: 32, offset: 1504)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1062, file: !14, line: 1875, baseType: !1361, size: 32, align: 32, offset: 1536)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1062, file: !14, line: 1882, baseType: !1361, size: 32, align: 32, offset: 1568)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1062, file: !14, line: 1889, baseType: !1361, size: 32, align: 32, offset: 1600)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1062, file: !14, line: 1896, baseType: !1361, size: 32, align: 32, offset: 1632)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1062, file: !14, line: 1903, baseType: !1361, size: 32, align: 32, offset: 1664)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1062, file: !14, line: 1910, baseType: !941, size: 32, align: 32, offset: 1696)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1062, file: !14, line: 1915, baseType: !941, size: 32, align: 32, offset: 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1062, file: !14, line: 1926, baseType: !1354, size: 64, align: 64, offset: 1792)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1062, file: !14, line: 1935, baseType: !945, size: 64, align: 32, offset: 1856)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1062, file: !14, line: 1942, baseType: !941, size: 32, align: 32, offset: 1920)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1062, file: !14, line: 1948, baseType: !941, size: 32, align: 32, offset: 1952)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1062, file: !14, line: 1954, baseType: !941, size: 32, align: 32, offset: 1984)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1062, file: !14, line: 1960, baseType: !941, size: 32, align: 32, offset: 2016)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1062, file: !14, line: 1984, baseType: !941, size: 32, align: 32, offset: 2048)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1062, file: !14, line: 1991, baseType: !941, size: 32, align: 32, offset: 2080)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1062, file: !14, line: 1996, baseType: !941, size: 32, align: 32, offset: 2112)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1062, file: !14, line: 2004, baseType: !941, size: 32, align: 32, offset: 2144)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1062, file: !14, line: 2011, baseType: !941, size: 32, align: 32, offset: 2176)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1062, file: !14, line: 2018, baseType: !941, size: 32, align: 32, offset: 2208)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1062, file: !14, line: 2027, baseType: !941, size: 32, align: 32, offset: 2240)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1062, file: !14, line: 2034, baseType: !941, size: 32, align: 32, offset: 2272)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1062, file: !14, line: 2044, baseType: !941, size: 32, align: 32, offset: 2304)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1062, file: !14, line: 2054, baseType: !1391, size: 64, align: 64, offset: 2368)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !964, line: 49, baseType: !1393)
!1393 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1062, file: !14, line: 2061, baseType: !1391, size: 64, align: 64, offset: 2432)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1062, file: !14, line: 2066, baseType: !941, size: 32, align: 32, offset: 2496)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1062, file: !14, line: 2070, baseType: !941, size: 32, align: 32, offset: 2528)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1062, file: !14, line: 2078, baseType: !941, size: 32, align: 32, offset: 2560)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1062, file: !14, line: 2085, baseType: !941, size: 32, align: 32, offset: 2592)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1062, file: !14, line: 2092, baseType: !941, size: 32, align: 32, offset: 2624)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1062, file: !14, line: 2099, baseType: !941, size: 32, align: 32, offset: 2656)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1062, file: !14, line: 2106, baseType: !941, size: 32, align: 32, offset: 2688)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1062, file: !14, line: 2113, baseType: !941, size: 32, align: 32, offset: 2720)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1062, file: !14, line: 2120, baseType: !941, size: 32, align: 32, offset: 2752)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1062, file: !14, line: 2125, baseType: !941, size: 32, align: 32, offset: 2784)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1062, file: !14, line: 2133, baseType: !941, size: 32, align: 32, offset: 2816)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1062, file: !14, line: 2140, baseType: !941, size: 32, align: 32, offset: 2848)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1062, file: !14, line: 2145, baseType: !941, size: 32, align: 32, offset: 2880)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1062, file: !14, line: 2153, baseType: !941, size: 32, align: 32, offset: 2912)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1062, file: !14, line: 2158, baseType: !941, size: 32, align: 32, offset: 2944)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1062, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1062, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1062, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1062, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1062, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1062, file: !14, line: 2203, baseType: !941, size: 32, align: 32, offset: 3136)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1062, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1062, file: !14, line: 2212, baseType: !941, size: 32, align: 32, offset: 3200)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1062, file: !14, line: 2213, baseType: !941, size: 32, align: 32, offset: 3232)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1062, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1062, file: !14, line: 2232, baseType: !941, size: 32, align: 32, offset: 3296)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1062, file: !14, line: 2243, baseType: !941, size: 32, align: 32, offset: 3328)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1062, file: !14, line: 2249, baseType: !941, size: 32, align: 32, offset: 3360)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1062, file: !14, line: 2256, baseType: !941, size: 32, align: 32, offset: 3392)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1062, file: !14, line: 2263, baseType: !963, size: 64, align: 64, offset: 3456)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1062, file: !14, line: 2270, baseType: !963, size: 64, align: 64, offset: 3520)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1062, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1062, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1062, file: !14, line: 2367, baseType: !1429, size: 64, align: 64, offset: 3648)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!941, !1351, !1083, !941}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1062, file: !14, line: 2383, baseType: !941, size: 32, align: 32, offset: 3712)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1062, file: !14, line: 2386, baseType: !1361, size: 32, align: 32, offset: 3744)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1062, file: !14, line: 2387, baseType: !1361, size: 32, align: 32, offset: 3776)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1062, file: !14, line: 2394, baseType: !941, size: 32, align: 32, offset: 3808)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1062, file: !14, line: 2401, baseType: !941, size: 32, align: 32, offset: 3840)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1062, file: !14, line: 2408, baseType: !941, size: 32, align: 32, offset: 3872)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1062, file: !14, line: 2415, baseType: !941, size: 32, align: 32, offset: 3904)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1062, file: !14, line: 2422, baseType: !941, size: 32, align: 32, offset: 3936)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1062, file: !14, line: 2423, baseType: !1441, size: 64, align: 64, offset: 3968)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1443)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1444)
!1444 = !{!1445, !1446, !1447, !1448}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1443, file: !14, line: 827, baseType: !941, size: 32, align: 32)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1443, file: !14, line: 828, baseType: !941, size: 32, align: 32, offset: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1443, file: !14, line: 829, baseType: !941, size: 32, align: 32, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1443, file: !14, line: 830, baseType: !1361, size: 32, align: 32, offset: 96)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1062, file: !14, line: 2430, baseType: !993, size: 64, align: 64, offset: 4032)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1062, file: !14, line: 2437, baseType: !993, size: 64, align: 64, offset: 4096)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1062, file: !14, line: 2444, baseType: !1361, size: 32, align: 32, offset: 4160)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1062, file: !14, line: 2451, baseType: !1361, size: 32, align: 32, offset: 4192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1062, file: !14, line: 2458, baseType: !941, size: 32, align: 32, offset: 4224)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1062, file: !14, line: 2469, baseType: !941, size: 32, align: 32, offset: 4256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1062, file: !14, line: 2475, baseType: !941, size: 32, align: 32, offset: 4288)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1062, file: !14, line: 2481, baseType: !941, size: 32, align: 32, offset: 4320)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1062, file: !14, line: 2485, baseType: !941, size: 32, align: 32, offset: 4352)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1062, file: !14, line: 2489, baseType: !941, size: 32, align: 32, offset: 4384)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1062, file: !14, line: 2493, baseType: !941, size: 32, align: 32, offset: 4416)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1062, file: !14, line: 2501, baseType: !941, size: 32, align: 32, offset: 4448)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1062, file: !14, line: 2506, baseType: !941, size: 32, align: 32, offset: 4480)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1062, file: !14, line: 2510, baseType: !941, size: 32, align: 32, offset: 4512)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1062, file: !14, line: 2514, baseType: !993, size: 64, align: 64, offset: 4544)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1062, file: !14, line: 2528, baseType: !1465, size: 64, align: 64, offset: 4608)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{null, !1351, !926, !941, !941}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1062, file: !14, line: 2534, baseType: !941, size: 32, align: 32, offset: 4672)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1062, file: !14, line: 2545, baseType: !941, size: 32, align: 32, offset: 4704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1062, file: !14, line: 2547, baseType: !941, size: 32, align: 32, offset: 4736)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1062, file: !14, line: 2549, baseType: !941, size: 32, align: 32, offset: 4768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1062, file: !14, line: 2551, baseType: !941, size: 32, align: 32, offset: 4800)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1062, file: !14, line: 2553, baseType: !941, size: 32, align: 32, offset: 4832)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1062, file: !14, line: 2555, baseType: !941, size: 32, align: 32, offset: 4864)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1062, file: !14, line: 2557, baseType: !941, size: 32, align: 32, offset: 4896)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1062, file: !14, line: 2559, baseType: !941, size: 32, align: 32, offset: 4928)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1062, file: !14, line: 2563, baseType: !941, size: 32, align: 32, offset: 4960)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1062, file: !14, line: 2571, baseType: !1479, size: 64, align: 64, offset: 4992)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1062, file: !14, line: 2579, baseType: !1479, size: 64, align: 64, offset: 5056)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1062, file: !14, line: 2586, baseType: !941, size: 32, align: 32, offset: 5120)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1062, file: !14, line: 2615, baseType: !941, size: 32, align: 32, offset: 5152)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1062, file: !14, line: 2627, baseType: !941, size: 32, align: 32, offset: 5184)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1062, file: !14, line: 2637, baseType: !941, size: 32, align: 32, offset: 5216)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1062, file: !14, line: 2681, baseType: !941, size: 32, align: 32, offset: 5248)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1062, file: !14, line: 2709, baseType: !993, size: 64, align: 64, offset: 5312)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1062, file: !14, line: 2716, baseType: !1488, size: 64, align: 64, offset: 5376)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1490)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1491)
!1491 = !{!1492, !1493, !1494, !1495, !1496, !1497, !1501, !1507, !1511, !1512, !1513, !1514, !2415, !2416, !2417, !2418, !2419}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1490, file: !14, line: 3642, baseType: !934, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1490, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1490, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1490, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1490, file: !14, line: 3669, baseType: !941, size: 32, align: 32, offset: 160)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1490, file: !14, line: 3682, baseType: !1498, size: 64, align: 64, offset: 192)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!941, !1060, !1083}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1490, file: !14, line: 3698, baseType: !1502, size: 64, align: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!941, !1060, !1505, !1279}
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1490, file: !14, line: 3712, baseType: !1508, size: 64, align: 64, offset: 320)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!941, !1060, !941, !1505, !1279}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1490, file: !14, line: 3726, baseType: !1502, size: 64, align: 64, offset: 384)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1490, file: !14, line: 3737, baseType: !1057, size: 64, align: 64, offset: 448)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1490, file: !14, line: 3746, baseType: !941, size: 32, align: 32, offset: 512)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1490, file: !14, line: 3757, baseType: !1515, size: 64, align: 64, offset: 576)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{null, !1518}
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1520, line: 81, size: 86208, align: 64, elements: !1521)
!1520 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1521 = !{!1522, !1524, !1525, !1526, !1527, !1531, !1532, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1579, !1580, !1635, !1637, !1638, !1639, !1640, !1641, !1652, !1653, !1654, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1670, !1672, !1674, !1675, !1676, !1677, !1678, !1679, !1684, !1686, !1687, !1688, !1689, !1690, !1691, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1718, !1719, !1720, !1721, !1737, !1744, !1756, !1772, !1794, !1834, !1847, !1874, !1889, !1903, !1916, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1937, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1950, !1952, !1953, !1954, !1955, !1956, !1957, !1960, !1962, !1964, !1965, !1968, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2035, !2036, !2038, !2039, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2061, !2062, !2063, !2066, !2067, !2068, !2069, !2071, !2073, !2074, !2075, !2076, !2077, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2159, !2160, !2161, !2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2290, !2291, !2292, !2293, !2297, !2298, !2302, !2306, !2310, !2311, !2316, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2331, !2332, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2350, !2351, !2352, !2402, !2403, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1519, file: !1520, line: 82, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1519, file: !1520, line: 84, baseType: !941, size: 32, align: 32, offset: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1519, file: !1520, line: 84, baseType: !941, size: 32, align: 32, offset: 96)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1519, file: !1520, line: 85, baseType: !941, size: 32, align: 32, offset: 128)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1519, file: !1520, line: 86, baseType: !1528, size: 384, align: 32, offset: 160)
!1528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 384, align: 32, elements: !1529)
!1529 = !{!1530}
!1530 = !DISubrange(count: 12)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1519, file: !1520, line: 87, baseType: !941, size: 32, align: 32, offset: 544)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1519, file: !1520, line: 90, baseType: !1533, size: 1088, align: 64, offset: 576)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1535)
!1535 = !{!1536, !1537, !1541}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1534, file: !902, line: 32, baseType: !1505, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1534, file: !902, line: 33, baseType: !1538, size: 512, align: 8, offset: 64)
!1538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 512, align: 8, elements: !1539)
!1539 = !{!1540}
!1540 = !DISubrange(count: 64)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1534, file: !902, line: 34, baseType: !1538, size: 512, align: 8, offset: 576)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1519, file: !1520, line: 91, baseType: !1533, size: 1088, align: 64, offset: 1664)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1519, file: !1520, line: 92, baseType: !1533, size: 1088, align: 64, offset: 2752)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1519, file: !1520, line: 93, baseType: !1533, size: 1088, align: 64, offset: 3840)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1519, file: !1520, line: 98, baseType: !1351, size: 64, align: 64, offset: 4928)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1519, file: !1520, line: 100, baseType: !941, size: 32, align: 32, offset: 4992)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1519, file: !1520, line: 100, baseType: !941, size: 32, align: 32, offset: 5024)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1519, file: !1520, line: 101, baseType: !941, size: 32, align: 32, offset: 5056)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1519, file: !1520, line: 102, baseType: !941, size: 32, align: 32, offset: 5088)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1519, file: !1520, line: 103, baseType: !993, size: 64, align: 64, offset: 5120)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1519, file: !1520, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1519, file: !1520, line: 105, baseType: !941, size: 32, align: 32, offset: 5216)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1519, file: !1520, line: 106, baseType: !941, size: 32, align: 32, offset: 5248)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1519, file: !1520, line: 109, baseType: !941, size: 32, align: 32, offset: 5280)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1519, file: !1520, line: 110, baseType: !941, size: 32, align: 32, offset: 5312)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1519, file: !1520, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1519, file: !1520, line: 113, baseType: !941, size: 32, align: 32, offset: 5376)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1519, file: !1520, line: 114, baseType: !941, size: 32, align: 32, offset: 5408)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1519, file: !1520, line: 115, baseType: !941, size: 32, align: 32, offset: 5440)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1519, file: !1520, line: 116, baseType: !941, size: 32, align: 32, offset: 5472)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1519, file: !1520, line: 117, baseType: !941, size: 32, align: 32, offset: 5504)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1519, file: !1520, line: 118, baseType: !941, size: 32, align: 32, offset: 5536)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1519, file: !1520, line: 119, baseType: !941, size: 32, align: 32, offset: 5568)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1519, file: !1520, line: 120, baseType: !941, size: 32, align: 32, offset: 5600)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1519, file: !1520, line: 124, baseType: !941, size: 32, align: 32, offset: 5632)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1519, file: !1520, line: 125, baseType: !941, size: 32, align: 32, offset: 5664)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1519, file: !1520, line: 126, baseType: !941, size: 32, align: 32, offset: 5696)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1519, file: !1520, line: 127, baseType: !941, size: 32, align: 32, offset: 5728)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1519, file: !1520, line: 128, baseType: !941, size: 32, align: 32, offset: 5760)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1519, file: !1520, line: 129, baseType: !941, size: 32, align: 32, offset: 5792)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1519, file: !1520, line: 129, baseType: !941, size: 32, align: 32, offset: 5824)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1519, file: !1520, line: 130, baseType: !941, size: 32, align: 32, offset: 5856)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1519, file: !1520, line: 131, baseType: !941, size: 32, align: 32, offset: 5888)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1519, file: !1520, line: 132, baseType: !941, size: 32, align: 32, offset: 5920)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1519, file: !1520, line: 132, baseType: !941, size: 32, align: 32, offset: 5952)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1519, file: !1520, line: 133, baseType: !941, size: 32, align: 32, offset: 5984)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1519, file: !1520, line: 134, baseType: !1578, size: 64, align: 64, offset: 6016)
!1578 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1175, line: 149, baseType: !994)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1519, file: !1520, line: 135, baseType: !1578, size: 64, align: 64, offset: 6080)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1519, file: !1520, line: 136, baseType: !1581, size: 64, align: 64, offset: 6144)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1583, line: 91, baseType: !1584)
!1583 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1583, line: 45, size: 2624, align: 64, elements: !1585)
!1585 = !{!1586, !1588, !1599, !1600, !1601, !1603, !1609, !1610, !1612, !1613, !1614, !1615, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1584, file: !1583, line: 46, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1584, file: !1583, line: 47, baseType: !1589, size: 256, align: 64, offset: 64)
!1589 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1590, line: 40, baseType: !1591)
!1590 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1590, line: 34, size: 256, align: 64, elements: !1592)
!1592 = !{!1593, !1594, !1598}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1591, file: !1590, line: 35, baseType: !1083, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1591, file: !1590, line: 36, baseType: !1595, size: 128, align: 64, offset: 64)
!1595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1060, size: 128, align: 64, elements: !1596)
!1596 = !{!1597}
!1597 = !DISubrange(count: 2)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1591, file: !1590, line: 39, baseType: !1121, size: 64, align: 64, offset: 192)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1584, file: !1583, line: 49, baseType: !1121, size: 64, align: 64, offset: 320)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1584, file: !1583, line: 50, baseType: !1165, size: 64, align: 64, offset: 384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1584, file: !1583, line: 52, baseType: !1602, size: 128, align: 64, offset: 448)
!1602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1121, size: 128, align: 64, elements: !1596)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1584, file: !1583, line: 53, baseType: !1604, size: 128, align: 64, offset: 576)
!1604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1605, size: 128, align: 64, elements: !1596)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1607, size: 32, align: 16, elements: !1596)
!1607 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !964, line: 37, baseType: !1608)
!1608 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1584, file: !1583, line: 55, baseType: !1121, size: 64, align: 64, offset: 704)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1584, file: !1583, line: 56, baseType: !1611, size: 64, align: 64, offset: 768)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1584, file: !1583, line: 58, baseType: !1121, size: 64, align: 64, offset: 832)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1584, file: !1583, line: 59, baseType: !1089, size: 64, align: 64, offset: 896)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1584, file: !1583, line: 61, baseType: !1602, size: 128, align: 64, offset: 960)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1584, file: !1583, line: 62, baseType: !1616, size: 128, align: 64, offset: 1088)
!1616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1165, size: 128, align: 64, elements: !1596)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1584, file: !1583, line: 64, baseType: !1121, size: 64, align: 64, offset: 1216)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1584, file: !1583, line: 65, baseType: !1391, size: 64, align: 64, offset: 1280)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1584, file: !1583, line: 67, baseType: !1121, size: 64, align: 64, offset: 1344)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1584, file: !1583, line: 68, baseType: !1391, size: 64, align: 64, offset: 1408)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1584, file: !1583, line: 70, baseType: !941, size: 32, align: 32, offset: 1472)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1584, file: !1583, line: 71, baseType: !941, size: 32, align: 32, offset: 1504)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1584, file: !1583, line: 73, baseType: !1121, size: 64, align: 64, offset: 1536)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1584, file: !1583, line: 74, baseType: !1089, size: 64, align: 64, offset: 1600)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1584, file: !1583, line: 76, baseType: !1121, size: 64, align: 64, offset: 1664)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1584, file: !1583, line: 77, baseType: !926, size: 64, align: 64, offset: 1728)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1584, file: !1583, line: 79, baseType: !941, size: 32, align: 32, offset: 1792)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1584, file: !1583, line: 81, baseType: !993, size: 64, align: 64, offset: 1856)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1584, file: !1583, line: 82, baseType: !993, size: 64, align: 64, offset: 1920)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1584, file: !1583, line: 84, baseType: !941, size: 32, align: 32, offset: 1984)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1584, file: !1583, line: 85, baseType: !941, size: 32, align: 32, offset: 2016)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1584, file: !1583, line: 87, baseType: !941, size: 32, align: 32, offset: 2048)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1584, file: !1583, line: 88, baseType: !941, size: 32, align: 32, offset: 2080)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1584, file: !1583, line: 90, baseType: !1111, size: 512, align: 64, offset: 2112)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1519, file: !1520, line: 137, baseType: !1636, size: 64, align: 64, offset: 6208)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_input_picture", scope: !1519, file: !1520, line: 138, baseType: !1636, size: 64, align: 64, offset: 6272)
