; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--xvididct_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--xvididct_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.IDCTDSPContext = type { void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i16*)*, [64 x i8], i32, i32 }

!841 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!842 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!843 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!844 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!845 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!846 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!847 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!848 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!849 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!851 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!853 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!854 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!855 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!856 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !504, line: 538, size: 32, align: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866}
!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !44, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !44, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !44, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !{i32 2, !"Dwarf Version", i32 4}
!897 = !{i32 2, !"Debug Info Version", i32 3}
!898 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!899 = distinct !DISubprogram(name: "ff_xvid_idct_init_x86", scope: !900, file: !900, line: 55, type: !901, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1536)
!900 = !DIFile(filename: "libavcodec/x86/xvididct_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!901 = !DISubroutineType(types: !902)
!902 = !{null, !903, !942, !1073}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDCTDSPContext", file: !4, line: 100, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDCTDSPContext", file: !4, line: 53, size: 960, align: 64, elements: !906)
!906 = !{!907, !923, !924, !925, !930, !934, !935, !939, !940}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_clamped", scope: !905, file: !4, line: 55, baseType: !908, size: 64, align: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !911, !916, !920}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !914, line: 37, baseType: !915)
!914 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!915 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!916 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !914, line: 48, baseType: !919)
!919 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !921, line: 149, baseType: !922)
!921 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!922 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_pixels_clamped", scope: !905, file: !4, line: 58, baseType: !908, size: 64, align: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixels_clamped", scope: !905, file: !4, line: 61, baseType: !908, size: 64, align: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !905, file: !4, line: 65, baseType: !926, size: 64, align: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !905, file: !4, line: 72, baseType: !931, size: 64, align: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !917, !920, !929}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !905, file: !4, line: 79, baseType: !931, size: 64, align: 64, offset: 320)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !905, file: !4, line: 96, baseType: !936, size: 512, align: 8, offset: 384)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 512, align: 8, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "perm_type", scope: !905, file: !4, line: 97, baseType: !3, size: 32, align: 32, offset: 896)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg4_studio_profile", scope: !905, file: !4, line: 99, baseType: !941, size: 32, align: 32, offset: 928)
!941 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !44, line: 3360, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !44, line: 1556, size: 8448, align: 64, elements: !945)
!945 = !{!946, !991, !992, !993, !1259, !1260, !1261, !1262, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1288, !1292, !1293, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1474, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !944, file: !44, line: 1561, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !13, line: 143, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !13, line: 67, size: 640, align: 64, elements: !951)
!951 = !{!952, !956, !961, !965, !966, !967, !968, !972, !978, !980, !984}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !950, file: !13, line: 72, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !950, file: !13, line: 78, baseType: !957, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!953, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !950, file: !13, line: 85, baseType: !962, size: 64, align: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !13, line: 85, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !950, file: !13, line: 93, baseType: !941, size: 32, align: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !950, file: !13, line: 99, baseType: !941, size: 32, align: 32, offset: 224)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !950, file: !13, line: 108, baseType: !941, size: 32, align: 32, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !950, file: !13, line: 113, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!960, !960, !960}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !950, file: !13, line: 123, baseType: !973, size: 64, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !950, file: !13, line: 130, baseType: !979, size: 32, align: 32, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !13, line: 48, baseType: !12)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !950, file: !13, line: 136, baseType: !981, size: 64, align: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!979, !960}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !950, file: !13, line: 142, baseType: !985, size: 64, align: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!941, !988, !960, !953, !941}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !13, line: 60, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !944, file: !44, line: 1562, baseType: !941, size: 32, align: 32, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !944, file: !44, line: 1564, baseType: !33, size: 32, align: 32, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !944, file: !44, line: 1565, baseType: !994, size: 64, align: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !44, line: 3468, size: 1984, align: 64, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1012, !1015, !1018, !1021, !1026, !1027, !1028, !1036, !1037, !1038, !1040, !1044, !1050, !1055, !1059, !1060, !1110, !1230, !1234, !1235, !1239, !1243, !1248, !1252, !1253, !1254}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !44, line: 3475, baseType: !953, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !996, file: !44, line: 3480, baseType: !953, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !996, file: !44, line: 3481, baseType: !33, size: 32, align: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !996, file: !44, line: 3482, baseType: !43, size: 32, align: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !996, file: !44, line: 3487, baseType: !941, size: 32, align: 32, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !996, file: !44, line: 3488, baseType: !1004, size: 64, align: 64, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1007, line: 61, baseType: !1008)
!1007 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1007, line: 58, size: 64, align: 32, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1008, file: !1007, line: 59, baseType: !941, size: 32, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1008, file: !1007, line: 60, baseType: !941, size: 32, align: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !996, file: !44, line: 3489, baseType: !1013, size: 64, align: 64, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !996, file: !44, line: 3490, baseType: !1016, size: 64, align: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !996, file: !44, line: 3491, baseType: !1019, size: 64, align: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !996, file: !44, line: 3492, baseType: !1022, size: 64, align: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !914, line: 55, baseType: !1025)
!1025 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !996, file: !44, line: 3493, baseType: !918, size: 8, align: 8, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !996, file: !44, line: 3494, baseType: !947, size: 64, align: 64, offset: 640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !996, file: !44, line: 3495, baseType: !1029, size: 64, align: 64, offset: 704)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !44, line: 3404, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !44, line: 3401, size: 128, align: 64, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1032, file: !44, line: 3402, baseType: !941, size: 32, align: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1032, file: !44, line: 3403, baseType: !953, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !996, file: !44, line: 3507, baseType: !953, size: 64, align: 64, offset: 768)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !996, file: !44, line: 3516, baseType: !941, size: 32, align: 32, offset: 832)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !44, line: 3517, baseType: !1039, size: 64, align: 64, offset: 896)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !996, file: !44, line: 3527, baseType: !1041, size: 64, align: 64, offset: 960)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!941, !942}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !996, file: !44, line: 3535, baseType: !1045, size: 64, align: 64, offset: 1024)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!941, !942, !1048}
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !996, file: !44, line: 3541, baseType: !1051, size: 64, align: 64, offset: 1088)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !44, line: 3461, baseType: !1054)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !44, line: 3461, flags: DIFlagFwdDecl)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !996, file: !44, line: 3549, baseType: !1056, size: 64, align: 64, offset: 1152)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1039}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !996, file: !44, line: 3551, baseType: !1041, size: 64, align: 64, offset: 1216)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !996, file: !44, line: 3552, baseType: !1061, size: 64, align: 64, offset: 1280)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!941, !942, !917, !941, !1064}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !44, line: 3920, size: 256, align: 64, elements: !1067)
!1067 = !{!1068, !1071, !1074, !1075, !1076, !1108}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1066, file: !44, line: 3921, baseType: !1069, size: 16, align: 16)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !914, line: 49, baseType: !1070)
!1070 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1066, file: !44, line: 3922, baseType: !1072, size: 32, align: 32, offset: 32)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !914, line: 51, baseType: !1073)
!1073 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1066, file: !44, line: 3923, baseType: !1072, size: 32, align: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1066, file: !44, line: 3924, baseType: !1073, size: 32, align: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1066, file: !44, line: 3925, baseType: !1077, size: 64, align: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !44, line: 3918, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !44, line: 3885, size: 1600, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1097, !1101, !1103, !1104, !1106, !1107}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1080, file: !44, line: 3886, baseType: !941, size: 32, align: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1080, file: !44, line: 3887, baseType: !941, size: 32, align: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1080, file: !44, line: 3888, baseType: !941, size: 32, align: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1080, file: !44, line: 3889, baseType: !941, size: 32, align: 32, offset: 96)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1080, file: !44, line: 3890, baseType: !941, size: 32, align: 32, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1080, file: !44, line: 3897, baseType: !1088, size: 768, align: 64, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !44, line: 3858, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !44, line: 3853, size: 768, align: 64, elements: !1090)
!1090 = !{!1091, !1095}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !44, line: 3855, baseType: !1092, size: 512, align: 64)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 512, align: 64, elements: !1093)
!1093 = !{!1094}
!1094 = !DISubrange(count: 8)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1089, file: !44, line: 3857, baseType: !1096, size: 256, align: 32, offset: 512)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 256, align: 32, elements: !1093)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1080, file: !44, line: 3903, baseType: !1098, size: 256, align: 64, offset: 960)
!1098 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 64, elements: !1099)
!1099 = !{!1100}
!1100 = !DISubrange(count: 4)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1080, file: !44, line: 3904, baseType: !1102, size: 128, align: 32, offset: 1216)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 128, align: 32, elements: !1099)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1080, file: !44, line: 3906, baseType: !720, size: 32, align: 32, offset: 1344)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1080, file: !44, line: 3908, baseType: !1105, size: 64, align: 64, offset: 1408)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1080, file: !44, line: 3915, baseType: !1105, size: 64, align: 64, offset: 1472)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !44, line: 3917, baseType: !941, size: 32, align: 32, offset: 1536)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1066, file: !44, line: 3926, baseType: !1109, size: 64, align: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !914, line: 40, baseType: !922)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !996, file: !44, line: 3564, baseType: !1111, size: 64, align: 64, offset: 1344)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!941, !942, !1114, !1148, !1229}
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !44, line: 1499, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !44, line: 1445, size: 704, align: 64, elements: !1117)
!1117 = !{!1118, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1144, !1145, !1146, !1147}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1116, file: !44, line: 1451, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1121, line: 94, baseType: !1122)
!1121 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1121, line: 81, size: 192, align: 64, elements: !1123)
!1123 = !{!1124, !1128, !1129}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1122, file: !1121, line: 82, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1121, line: 73, baseType: !1127)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1121, line: 73, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !1121, line: 89, baseType: !917, size: 64, align: 64, offset: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1122, file: !1121, line: 93, baseType: !941, size: 32, align: 32, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1116, file: !44, line: 1461, baseType: !1109, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1116, file: !44, line: 1467, baseType: !1109, size: 64, align: 64, offset: 128)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1116, file: !44, line: 1468, baseType: !917, size: 64, align: 64, offset: 192)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1116, file: !44, line: 1469, baseType: !941, size: 32, align: 32, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1116, file: !44, line: 1470, baseType: !941, size: 32, align: 32, offset: 288)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !44, line: 1474, baseType: !941, size: 32, align: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1116, file: !44, line: 1479, baseType: !1137, size: 64, align: 64, offset: 384)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !44, line: 1415, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !44, line: 1411, size: 128, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !44, line: 1412, baseType: !917, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !44, line: 1413, baseType: !941, size: 32, align: 32, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1139, file: !44, line: 1414, baseType: !726, size: 32, align: 32, offset: 96)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1116, file: !44, line: 1480, baseType: !941, size: 32, align: 32, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1116, file: !44, line: 1486, baseType: !1109, size: 64, align: 64, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1116, file: !44, line: 1488, baseType: !1109, size: 64, align: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1116, file: !44, line: 1497, baseType: !1109, size: 64, align: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1182, !1184, !1185, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1218, !1219, !1220, !1221, !1222, !1223, !1225, !1226, !1227, !1228}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !767, line: 282, baseType: !1092, size: 512, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1151, file: !767, line: 299, baseType: !1096, size: 256, align: 32, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1151, file: !767, line: 315, baseType: !1156, size: 64, align: 64, offset: 768)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1151, file: !767, line: 326, baseType: !941, size: 32, align: 32, offset: 832)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1151, file: !767, line: 326, baseType: !941, size: 32, align: 32, offset: 864)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1151, file: !767, line: 334, baseType: !941, size: 32, align: 32, offset: 896)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1151, file: !767, line: 341, baseType: !941, size: 32, align: 32, offset: 928)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1151, file: !767, line: 346, baseType: !941, size: 32, align: 32, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1151, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1151, file: !767, line: 356, baseType: !1006, size: 64, align: 32, offset: 1024)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1151, file: !767, line: 361, baseType: !1109, size: 64, align: 64, offset: 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1151, file: !767, line: 369, baseType: !1109, size: 64, align: 64, offset: 1152)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1151, file: !767, line: 377, baseType: !1109, size: 64, align: 64, offset: 1216)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1151, file: !767, line: 382, baseType: !941, size: 32, align: 32, offset: 1280)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1151, file: !767, line: 386, baseType: !941, size: 32, align: 32, offset: 1312)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1151, file: !767, line: 391, baseType: !941, size: 32, align: 32, offset: 1344)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1151, file: !767, line: 396, baseType: !960, size: 64, align: 64, offset: 1408)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1151, file: !767, line: 403, baseType: !1172, size: 512, align: 64, offset: 1472)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 512, align: 64, elements: !1093)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1151, file: !767, line: 410, baseType: !941, size: 32, align: 32, offset: 1984)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1151, file: !767, line: 415, baseType: !941, size: 32, align: 32, offset: 2016)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1151, file: !767, line: 420, baseType: !941, size: 32, align: 32, offset: 2048)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1151, file: !767, line: 425, baseType: !941, size: 32, align: 32, offset: 2080)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1151, file: !767, line: 435, baseType: !1109, size: 64, align: 64, offset: 2112)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1151, file: !767, line: 440, baseType: !941, size: 32, align: 32, offset: 2176)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1151, file: !767, line: 445, baseType: !1024, size: 64, align: 64, offset: 2240)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1151, file: !767, line: 459, baseType: !1181, size: 512, align: 64, offset: 2304)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1119, size: 512, align: 64, elements: !1093)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1151, file: !767, line: 473, baseType: !1183, size: 64, align: 64, offset: 2816)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1151, file: !767, line: 477, baseType: !941, size: 32, align: 32, offset: 2880)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1151, file: !767, line: 479, baseType: !1186, size: 64, align: 64, offset: 2944)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1189)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1199}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1189, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1189, file: !767, line: 203, baseType: !917, size: 64, align: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1189, file: !767, line: 204, baseType: !941, size: 32, align: 32, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1189, file: !767, line: 205, baseType: !1195, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1197, line: 86, baseType: !1198)
!1197 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1197, line: 86, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1189, file: !767, line: 206, baseType: !1119, size: 64, align: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1151, file: !767, line: 480, baseType: !941, size: 32, align: 32, offset: 3008)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1151, file: !767, line: 505, baseType: !941, size: 32, align: 32, offset: 3040)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1151, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1151, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1151, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1151, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1151, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1151, file: !767, line: 532, baseType: !1109, size: 64, align: 64, offset: 3264)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1151, file: !767, line: 539, baseType: !1109, size: 64, align: 64, offset: 3328)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1151, file: !767, line: 547, baseType: !1109, size: 64, align: 64, offset: 3392)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1151, file: !767, line: 554, baseType: !1195, size: 64, align: 64, offset: 3456)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1151, file: !767, line: 563, baseType: !941, size: 32, align: 32, offset: 3520)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1151, file: !767, line: 572, baseType: !941, size: 32, align: 32, offset: 3552)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1151, file: !767, line: 581, baseType: !941, size: 32, align: 32, offset: 3584)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1151, file: !767, line: 588, baseType: !1215, size: 64, align: 64, offset: 3648)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !914, line: 36, baseType: !1217)
!1217 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1151, file: !767, line: 593, baseType: !941, size: 32, align: 32, offset: 3712)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1151, file: !767, line: 596, baseType: !941, size: 32, align: 32, offset: 3744)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1151, file: !767, line: 599, baseType: !1119, size: 64, align: 64, offset: 3776)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1151, file: !767, line: 605, baseType: !1119, size: 64, align: 64, offset: 3840)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1151, file: !767, line: 616, baseType: !1119, size: 64, align: 64, offset: 3904)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1151, file: !767, line: 626, baseType: !1224, size: 64, align: 64, offset: 3968)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !921, line: 216, baseType: !1025)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1151, file: !767, line: 627, baseType: !1224, size: 64, align: 64, offset: 4032)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1151, file: !767, line: 628, baseType: !1224, size: 64, align: 64, offset: 4096)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1151, file: !767, line: 629, baseType: !1224, size: 64, align: 64, offset: 4160)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1151, file: !767, line: 645, baseType: !1119, size: 64, align: 64, offset: 4224)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !996, file: !44, line: 3566, baseType: !1231, size: 64, align: 64, offset: 1408)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!941, !942, !960, !1229, !1114}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !996, file: !44, line: 3567, baseType: !1041, size: 64, align: 64, offset: 1472)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !996, file: !44, line: 3576, baseType: !1236, size: 64, align: 64, offset: 1536)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!941, !942, !1148}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !996, file: !44, line: 3577, baseType: !1240, size: 64, align: 64, offset: 1600)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!941, !942, !1114}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !996, file: !44, line: 3584, baseType: !1244, size: 64, align: 64, offset: 1664)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!941, !942, !1247}
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !996, file: !44, line: 3589, baseType: !1249, size: 64, align: 64, offset: 1728)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{null, !942}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !996, file: !44, line: 3594, baseType: !941, size: 32, align: 32, offset: 1792)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !996, file: !44, line: 3600, baseType: !953, size: 64, align: 64, offset: 1856)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !996, file: !44, line: 3609, baseType: !1255, size: 64, align: 64, offset: 1920)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1258)
!1258 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !44, line: 3609, flags: DIFlagFwdDecl)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !944, file: !44, line: 1566, baseType: !43, size: 32, align: 32, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !944, file: !44, line: 1581, baseType: !1073, size: 32, align: 32, offset: 224)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !944, file: !44, line: 1583, baseType: !960, size: 64, align: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !944, file: !44, line: 1591, baseType: !1263, size: 64, align: 64, offset: 320)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !44, line: 1532, flags: DIFlagFwdDecl)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !944, file: !44, line: 1598, baseType: !960, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !944, file: !44, line: 1606, baseType: !1109, size: 64, align: 64, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !944, file: !44, line: 1614, baseType: !941, size: 32, align: 32, offset: 512)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !944, file: !44, line: 1622, baseType: !941, size: 32, align: 32, offset: 544)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !944, file: !44, line: 1628, baseType: !941, size: 32, align: 32, offset: 576)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !44, line: 1636, baseType: !941, size: 32, align: 32, offset: 608)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !944, file: !44, line: 1643, baseType: !941, size: 32, align: 32, offset: 640)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !944, file: !44, line: 1657, baseType: !917, size: 64, align: 64, offset: 704)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !944, file: !44, line: 1658, baseType: !941, size: 32, align: 32, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !944, file: !44, line: 1679, baseType: !1006, size: 64, align: 32, offset: 800)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !944, file: !44, line: 1688, baseType: !941, size: 32, align: 32, offset: 864)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !944, file: !44, line: 1712, baseType: !941, size: 32, align: 32, offset: 896)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !944, file: !44, line: 1729, baseType: !941, size: 32, align: 32, offset: 928)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !944, file: !44, line: 1729, baseType: !941, size: 32, align: 32, offset: 960)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !944, file: !44, line: 1744, baseType: !941, size: 32, align: 32, offset: 992)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !944, file: !44, line: 1744, baseType: !941, size: 32, align: 32, offset: 1024)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !944, file: !44, line: 1751, baseType: !941, size: 32, align: 32, offset: 1056)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !944, file: !44, line: 1766, baseType: !503, size: 32, align: 32, offset: 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !944, file: !44, line: 1791, baseType: !1284, size: 64, align: 64, offset: 1152)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !1287, !1148, !1229, !941, !941, !941}
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !944, file: !44, line: 1808, baseType: !1289, size: 64, align: 64, offset: 1216)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!503, !1287, !1013}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !944, file: !44, line: 1816, baseType: !941, size: 32, align: 32, offset: 1280)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !944, file: !44, line: 1825, baseType: !1294, size: 32, align: 32, offset: 1312)
!1294 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !944, file: !44, line: 1830, baseType: !941, size: 32, align: 32, offset: 1344)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !944, file: !44, line: 1838, baseType: !1294, size: 32, align: 32, offset: 1376)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !944, file: !44, line: 1846, baseType: !941, size: 32, align: 32, offset: 1408)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !944, file: !44, line: 1851, baseType: !941, size: 32, align: 32, offset: 1440)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !944, file: !44, line: 1861, baseType: !1294, size: 32, align: 32, offset: 1472)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !944, file: !44, line: 1868, baseType: !1294, size: 32, align: 32, offset: 1504)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !944, file: !44, line: 1875, baseType: !1294, size: 32, align: 32, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !944, file: !44, line: 1882, baseType: !1294, size: 32, align: 32, offset: 1568)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !944, file: !44, line: 1889, baseType: !1294, size: 32, align: 32, offset: 1600)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !944, file: !44, line: 1896, baseType: !1294, size: 32, align: 32, offset: 1632)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !944, file: !44, line: 1903, baseType: !1294, size: 32, align: 32, offset: 1664)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !944, file: !44, line: 1910, baseType: !941, size: 32, align: 32, offset: 1696)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !944, file: !44, line: 1915, baseType: !941, size: 32, align: 32, offset: 1728)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !944, file: !44, line: 1926, baseType: !1229, size: 64, align: 64, offset: 1792)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !944, file: !44, line: 1935, baseType: !1006, size: 64, align: 32, offset: 1856)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !944, file: !44, line: 1942, baseType: !941, size: 32, align: 32, offset: 1920)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !944, file: !44, line: 1948, baseType: !941, size: 32, align: 32, offset: 1952)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !944, file: !44, line: 1954, baseType: !941, size: 32, align: 32, offset: 1984)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !944, file: !44, line: 1960, baseType: !941, size: 32, align: 32, offset: 2016)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !944, file: !44, line: 1984, baseType: !941, size: 32, align: 32, offset: 2048)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !944, file: !44, line: 1991, baseType: !941, size: 32, align: 32, offset: 2080)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !944, file: !44, line: 1996, baseType: !941, size: 32, align: 32, offset: 2112)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !944, file: !44, line: 2004, baseType: !941, size: 32, align: 32, offset: 2144)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !944, file: !44, line: 2011, baseType: !941, size: 32, align: 32, offset: 2176)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !944, file: !44, line: 2018, baseType: !941, size: 32, align: 32, offset: 2208)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !944, file: !44, line: 2027, baseType: !941, size: 32, align: 32, offset: 2240)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !944, file: !44, line: 2034, baseType: !941, size: 32, align: 32, offset: 2272)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !944, file: !44, line: 2044, baseType: !941, size: 32, align: 32, offset: 2304)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !944, file: !44, line: 2054, baseType: !1324, size: 64, align: 64, offset: 2368)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !944, file: !44, line: 2061, baseType: !1324, size: 64, align: 64, offset: 2432)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !944, file: !44, line: 2066, baseType: !941, size: 32, align: 32, offset: 2496)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !944, file: !44, line: 2070, baseType: !941, size: 32, align: 32, offset: 2528)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !944, file: !44, line: 2078, baseType: !941, size: 32, align: 32, offset: 2560)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !944, file: !44, line: 2085, baseType: !941, size: 32, align: 32, offset: 2592)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !944, file: !44, line: 2092, baseType: !941, size: 32, align: 32, offset: 2624)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !944, file: !44, line: 2099, baseType: !941, size: 32, align: 32, offset: 2656)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !944, file: !44, line: 2106, baseType: !941, size: 32, align: 32, offset: 2688)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !944, file: !44, line: 2113, baseType: !941, size: 32, align: 32, offset: 2720)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !944, file: !44, line: 2120, baseType: !941, size: 32, align: 32, offset: 2752)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !944, file: !44, line: 2125, baseType: !941, size: 32, align: 32, offset: 2784)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !944, file: !44, line: 2133, baseType: !941, size: 32, align: 32, offset: 2816)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !944, file: !44, line: 2140, baseType: !941, size: 32, align: 32, offset: 2848)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !944, file: !44, line: 2145, baseType: !941, size: 32, align: 32, offset: 2880)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !944, file: !44, line: 2153, baseType: !941, size: 32, align: 32, offset: 2912)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !944, file: !44, line: 2158, baseType: !941, size: 32, align: 32, offset: 2944)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !944, file: !44, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !944, file: !44, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !944, file: !44, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !944, file: !44, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !944, file: !44, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !944, file: !44, line: 2203, baseType: !941, size: 32, align: 32, offset: 3136)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !944, file: !44, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !944, file: !44, line: 2212, baseType: !941, size: 32, align: 32, offset: 3200)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !944, file: !44, line: 2213, baseType: !941, size: 32, align: 32, offset: 3232)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !944, file: !44, line: 2220, baseType: !703, size: 32, align: 32, offset: 3264)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !944, file: !44, line: 2232, baseType: !941, size: 32, align: 32, offset: 3296)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !944, file: !44, line: 2243, baseType: !941, size: 32, align: 32, offset: 3328)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !944, file: !44, line: 2249, baseType: !941, size: 32, align: 32, offset: 3360)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !944, file: !44, line: 2256, baseType: !941, size: 32, align: 32, offset: 3392)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !944, file: !44, line: 2263, baseType: !1024, size: 64, align: 64, offset: 3456)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !944, file: !44, line: 2270, baseType: !1024, size: 64, align: 64, offset: 3520)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !944, file: !44, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !944, file: !44, line: 2285, baseType: !703, size: 32, align: 32, offset: 3616)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !944, file: !44, line: 2367, baseType: !1360, size: 64, align: 64, offset: 3648)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!941, !1287, !1247, !941}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !944, file: !44, line: 2383, baseType: !941, size: 32, align: 32, offset: 3712)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !944, file: !44, line: 2386, baseType: !1294, size: 32, align: 32, offset: 3744)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !944, file: !44, line: 2387, baseType: !1294, size: 32, align: 32, offset: 3776)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !944, file: !44, line: 2394, baseType: !941, size: 32, align: 32, offset: 3808)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !944, file: !44, line: 2401, baseType: !941, size: 32, align: 32, offset: 3840)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !944, file: !44, line: 2408, baseType: !941, size: 32, align: 32, offset: 3872)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !944, file: !44, line: 2415, baseType: !941, size: 32, align: 32, offset: 3904)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !944, file: !44, line: 2422, baseType: !941, size: 32, align: 32, offset: 3936)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !944, file: !44, line: 2423, baseType: !1372, size: 64, align: 64, offset: 3968)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !44, line: 831, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !44, line: 826, size: 128, align: 32, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1374, file: !44, line: 827, baseType: !941, size: 32, align: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1374, file: !44, line: 828, baseType: !941, size: 32, align: 32, offset: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1374, file: !44, line: 829, baseType: !941, size: 32, align: 32, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1374, file: !44, line: 830, baseType: !1294, size: 32, align: 32, offset: 96)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !944, file: !44, line: 2430, baseType: !1109, size: 64, align: 64, offset: 4032)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !944, file: !44, line: 2437, baseType: !1109, size: 64, align: 64, offset: 4096)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !944, file: !44, line: 2444, baseType: !1294, size: 32, align: 32, offset: 4160)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !944, file: !44, line: 2451, baseType: !1294, size: 32, align: 32, offset: 4192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !944, file: !44, line: 2458, baseType: !941, size: 32, align: 32, offset: 4224)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !944, file: !44, line: 2469, baseType: !941, size: 32, align: 32, offset: 4256)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !944, file: !44, line: 2475, baseType: !941, size: 32, align: 32, offset: 4288)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !944, file: !44, line: 2481, baseType: !941, size: 32, align: 32, offset: 4320)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !944, file: !44, line: 2485, baseType: !941, size: 32, align: 32, offset: 4352)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !944, file: !44, line: 2489, baseType: !941, size: 32, align: 32, offset: 4384)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !944, file: !44, line: 2493, baseType: !941, size: 32, align: 32, offset: 4416)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !944, file: !44, line: 2501, baseType: !941, size: 32, align: 32, offset: 4448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !944, file: !44, line: 2506, baseType: !941, size: 32, align: 32, offset: 4480)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !944, file: !44, line: 2510, baseType: !941, size: 32, align: 32, offset: 4512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !944, file: !44, line: 2514, baseType: !1109, size: 64, align: 64, offset: 4544)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !944, file: !44, line: 2528, baseType: !1396, size: 64, align: 64, offset: 4608)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{null, !1287, !960, !941, !941}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !944, file: !44, line: 2534, baseType: !941, size: 32, align: 32, offset: 4672)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !944, file: !44, line: 2545, baseType: !941, size: 32, align: 32, offset: 4704)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !944, file: !44, line: 2547, baseType: !941, size: 32, align: 32, offset: 4736)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !944, file: !44, line: 2549, baseType: !941, size: 32, align: 32, offset: 4768)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !944, file: !44, line: 2551, baseType: !941, size: 32, align: 32, offset: 4800)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !944, file: !44, line: 2553, baseType: !941, size: 32, align: 32, offset: 4832)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !944, file: !44, line: 2555, baseType: !941, size: 32, align: 32, offset: 4864)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !944, file: !44, line: 2557, baseType: !941, size: 32, align: 32, offset: 4896)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !944, file: !44, line: 2559, baseType: !941, size: 32, align: 32, offset: 4928)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !944, file: !44, line: 2563, baseType: !941, size: 32, align: 32, offset: 4960)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !944, file: !44, line: 2571, baseType: !1105, size: 64, align: 64, offset: 4992)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !944, file: !44, line: 2579, baseType: !1105, size: 64, align: 64, offset: 5056)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !944, file: !44, line: 2586, baseType: !941, size: 32, align: 32, offset: 5120)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !944, file: !44, line: 2615, baseType: !941, size: 32, align: 32, offset: 5152)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !944, file: !44, line: 2627, baseType: !941, size: 32, align: 32, offset: 5184)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !944, file: !44, line: 2637, baseType: !941, size: 32, align: 32, offset: 5216)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !944, file: !44, line: 2681, baseType: !941, size: 32, align: 32, offset: 5248)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !944, file: !44, line: 2709, baseType: !1109, size: 64, align: 64, offset: 5312)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !944, file: !44, line: 2716, baseType: !1418, size: 64, align: 64, offset: 5376)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !44, line: 3636, size: 896, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1426, !1427, !1428, !1434, !1438, !1439, !1440, !1441, !1447, !1448, !1449, !1450, !1451}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1420, file: !44, line: 3642, baseType: !953, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1420, file: !44, line: 3649, baseType: !33, size: 32, align: 32, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1420, file: !44, line: 3656, baseType: !43, size: 32, align: 32, offset: 96)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1420, file: !44, line: 3663, baseType: !503, size: 32, align: 32, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1420, file: !44, line: 3669, baseType: !941, size: 32, align: 32, offset: 160)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1420, file: !44, line: 3682, baseType: !1244, size: 64, align: 64, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1420, file: !44, line: 3698, baseType: !1429, size: 64, align: 64, offset: 256)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!941, !942, !1432, !1072}
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1420, file: !44, line: 3712, baseType: !1435, size: 64, align: 64, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!941, !942, !941, !1432, !1072}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1420, file: !44, line: 3726, baseType: !1429, size: 64, align: 64, offset: 384)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1420, file: !44, line: 3737, baseType: !1041, size: 64, align: 64, offset: 448)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1420, file: !44, line: 3746, baseType: !941, size: 32, align: 32, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1420, file: !44, line: 3757, baseType: !1442, size: 64, align: 64, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{null, !1445}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !44, line: 3617, flags: DIFlagFwdDecl)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1420, file: !44, line: 3766, baseType: !1041, size: 64, align: 64, offset: 640)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1420, file: !44, line: 3774, baseType: !1041, size: 64, align: 64, offset: 704)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1420, file: !44, line: 3780, baseType: !941, size: 32, align: 32, offset: 768)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1420, file: !44, line: 3785, baseType: !941, size: 32, align: 32, offset: 800)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1420, file: !44, line: 3795, baseType: !1452, size: 64, align: 64, offset: 832)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!941, !942, !1119}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !944, file: !44, line: 2728, baseType: !960, size: 64, align: 64, offset: 5440)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !944, file: !44, line: 2735, baseType: !1172, size: 512, align: 64, offset: 5504)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !944, file: !44, line: 2742, baseType: !941, size: 32, align: 32, offset: 6016)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !944, file: !44, line: 2755, baseType: !941, size: 32, align: 32, offset: 6048)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !944, file: !44, line: 2776, baseType: !941, size: 32, align: 32, offset: 6080)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !944, file: !44, line: 2783, baseType: !941, size: 32, align: 32, offset: 6112)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !944, file: !44, line: 2791, baseType: !941, size: 32, align: 32, offset: 6144)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !944, file: !44, line: 2802, baseType: !1247, size: 64, align: 64, offset: 6208)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !944, file: !44, line: 2811, baseType: !941, size: 32, align: 32, offset: 6272)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !944, file: !44, line: 2821, baseType: !941, size: 32, align: 32, offset: 6304)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !944, file: !44, line: 2830, baseType: !941, size: 32, align: 32, offset: 6336)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !944, file: !44, line: 2840, baseType: !941, size: 32, align: 32, offset: 6368)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !944, file: !44, line: 2851, baseType: !1468, size: 64, align: 64, offset: 6400)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!941, !1287, !1471, !960, !1229, !941, !941}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!941, !1287, !960}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !944, file: !44, line: 2871, baseType: !1475, size: 64, align: 64, offset: 6464)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!941, !1287, !1478, !960, !1229, !941}
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DISubroutineType(types: !1480)
!1480 = !{!941, !1287, !960, !941, !941}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !944, file: !44, line: 2878, baseType: !941, size: 32, align: 32, offset: 6528)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !944, file: !44, line: 2885, baseType: !941, size: 32, align: 32, offset: 6560)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !944, file: !44, line: 3005, baseType: !941, size: 32, align: 32, offset: 6592)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !944, file: !44, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !944, file: !44, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !944, file: !44, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !944, file: !44, line: 3037, baseType: !917, size: 64, align: 64, offset: 6720)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !944, file: !44, line: 3038, baseType: !941, size: 32, align: 32, offset: 6784)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !944, file: !44, line: 3050, baseType: !1024, size: 64, align: 64, offset: 6848)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !944, file: !44, line: 3065, baseType: !941, size: 32, align: 32, offset: 6912)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !944, file: !44, line: 3083, baseType: !941, size: 32, align: 32, offset: 6944)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !944, file: !44, line: 3092, baseType: !1006, size: 64, align: 32, offset: 6976)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !944, file: !44, line: 3099, baseType: !503, size: 32, align: 32, offset: 7040)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !944, file: !44, line: 3106, baseType: !1006, size: 64, align: 32, offset: 7072)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !944, file: !44, line: 3113, baseType: !1496, size: 64, align: 64, offset: 7168)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1498)
!1498 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !44, line: 740, baseType: !1499)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !44, line: 712, size: 384, align: 64, elements: !1500)
!1500 = !{!1501, !1502, !1503, !1504, !1505, !1506, !1509}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1499, file: !44, line: 713, baseType: !43, size: 32, align: 32)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1499, file: !44, line: 714, baseType: !33, size: 32, align: 32, offset: 32)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1499, file: !44, line: 720, baseType: !953, size: 64, align: 64, offset: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1499, file: !44, line: 724, baseType: !953, size: 64, align: 64, offset: 128)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1499, file: !44, line: 728, baseType: !941, size: 32, align: 32, offset: 192)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1499, file: !44, line: 734, baseType: !1507, size: 64, align: 64, offset: 256)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1499, file: !44, line: 739, baseType: !1510, size: 64, align: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !944, file: !44, line: 3129, baseType: !1109, size: 64, align: 64, offset: 7232)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !944, file: !44, line: 3130, baseType: !1109, size: 64, align: 64, offset: 7296)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !944, file: !44, line: 3131, baseType: !1109, size: 64, align: 64, offset: 7360)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !944, file: !44, line: 3132, baseType: !1109, size: 64, align: 64, offset: 7424)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !944, file: !44, line: 3139, baseType: !1105, size: 64, align: 64, offset: 7488)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !944, file: !44, line: 3147, baseType: !941, size: 32, align: 32, offset: 7552)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !944, file: !44, line: 3165, baseType: !941, size: 32, align: 32, offset: 7584)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !944, file: !44, line: 3172, baseType: !941, size: 32, align: 32, offset: 7616)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !944, file: !44, line: 3180, baseType: !941, size: 32, align: 32, offset: 7648)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !944, file: !44, line: 3191, baseType: !1324, size: 64, align: 64, offset: 7680)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !944, file: !44, line: 3199, baseType: !917, size: 64, align: 64, offset: 7744)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !944, file: !44, line: 3207, baseType: !1105, size: 64, align: 64, offset: 7808)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !944, file: !44, line: 3214, baseType: !1073, size: 32, align: 32, offset: 7872)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !944, file: !44, line: 3224, baseType: !1137, size: 64, align: 64, offset: 7936)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !944, file: !44, line: 3225, baseType: !941, size: 32, align: 32, offset: 8000)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !944, file: !44, line: 3249, baseType: !1119, size: 64, align: 64, offset: 8064)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !944, file: !44, line: 3256, baseType: !941, size: 32, align: 32, offset: 8128)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !944, file: !44, line: 3271, baseType: !941, size: 32, align: 32, offset: 8160)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !944, file: !44, line: 3279, baseType: !1109, size: 64, align: 64, offset: 8192)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !944, file: !44, line: 3301, baseType: !1119, size: 64, align: 64, offset: 8256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !944, file: !44, line: 3310, baseType: !941, size: 32, align: 32, offset: 8320)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !944, file: !44, line: 3337, baseType: !941, size: 32, align: 32, offset: 8352)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !944, file: !44, line: 3351, baseType: !941, size: 32, align: 32, offset: 8384)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !944, file: !44, line: 3359, baseType: !941, size: 32, align: 32, offset: 8416)
!1536 = !{}
!1537 = !DILocalVariable(name: "c", arg: 1, scope: !899, file: !900, line: 55, type: !903)
!1538 = !DIExpression()
!1539 = !DILocation(line: 55, column: 66, scope: !899)
!1540 = !DILocalVariable(name: "avctx", arg: 2, scope: !899, file: !900, line: 55, type: !942)
!1541 = !DILocation(line: 55, column: 85, scope: !899)
!1542 = !DILocalVariable(name: "high_bit_depth", arg: 3, scope: !899, file: !900, line: 56, type: !1073)
!1543 = !DILocation(line: 56, column: 45, scope: !899)
!1544 = !DILocation(line: 89, column: 1, scope: !899)
