; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_vmafmotion.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--vf_vmafmotion.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!313 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!314 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!315 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMediaType", file: !4, line: 199, size: 32, align: 32, elements: !316)
!316 = !{!317, !318, !319, !320, !321, !322, !323}
!317 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!318 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!319 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!320 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!321 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!322 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!323 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!324 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !325, line: 221, size: 32, align: 32, elements: !326)
!325 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345}
!327 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!328 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!329 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!330 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!331 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!332 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!333 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!334 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!335 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!336 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!337 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!338 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!339 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!340 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!341 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!342 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!343 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!344 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!345 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !347, line: 29, size: 32, align: 32, elements: !348)
!347 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!349 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!350 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!351 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!352 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!353 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!354 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!355 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!356 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!357 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!358 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!359 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!360 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!361 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!362 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!363 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!364 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!365 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!366 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !369, file: !368, line: 503, size: 32, align: 32, elements: !774)
!368 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !368, line: 439, size: 493504, align: 64, elements: !370)
!370 = !{!371, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !735, !736, !737, !738, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !369, file: !368, line: 440, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !368, line: 67, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !368, line: 338, size: 1344, align: 64, elements: !375)
!375 = !{!376, !463, !635, !636, !638, !640, !642, !643, !644, !645, !646, !686, !687, !693, !702, !703, !704, !706, !707, !708, !709, !710}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !374, file: !368, line: 339, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !347, line: 143, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !347, line: 67, size: 640, align: 64, elements: !381)
!381 = !{!382, !386, !391, !422, !423, !424, !425, !429, !435, !437, !441}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !380, file: !347, line: 72, baseType: !383, size: 64, align: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !380, file: !347, line: 78, baseType: !387, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!383, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !380, file: !347, line: 85, baseType: !392, size: 64, align: 64, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !325, line: 246, size: 512, align: 64, elements: !395)
!395 = !{!396, !397, !398, !400, !401, !418, !419, !420, !421}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !394, file: !325, line: 247, baseType: !383, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !394, file: !325, line: 253, baseType: !383, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !394, file: !325, line: 259, baseType: !399, size: 32, align: 32, offset: 128)
!399 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !394, file: !325, line: 260, baseType: !324, size: 32, align: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !394, file: !325, line: 271, baseType: !402, size: 64, align: 64, offset: 192)
!402 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !325, line: 265, size: 64, align: 64, elements: !403)
!403 = !{!404, !408, !410, !411}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !402, file: !325, line: 266, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !406, line: 40, baseType: !407)
!406 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!407 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !402, file: !325, line: 267, baseType: !409, size: 64, align: 64)
!409 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !402, file: !325, line: 268, baseType: !383, size: 64, align: 64)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !402, file: !325, line: 270, baseType: !412, size: 64, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !413, line: 61, baseType: !414)
!413 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !413, line: 58, size: 64, align: 32, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !414, file: !413, line: 59, baseType: !399, size: 32, align: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !414, file: !413, line: 60, baseType: !399, size: 32, align: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !394, file: !325, line: 272, baseType: !409, size: 64, align: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !394, file: !325, line: 273, baseType: !409, size: 64, align: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !394, file: !325, line: 275, baseType: !399, size: 32, align: 32, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !394, file: !325, line: 300, baseType: !383, size: 64, align: 64, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !380, file: !347, line: 93, baseType: !399, size: 32, align: 32, offset: 192)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !380, file: !347, line: 99, baseType: !399, size: 32, align: 32, offset: 224)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !380, file: !347, line: 108, baseType: !399, size: 32, align: 32, offset: 256)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !380, file: !347, line: 113, baseType: !426, size: 64, align: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DISubroutineType(types: !428)
!428 = !{!390, !390, !390}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !380, file: !347, line: 123, baseType: !430, size: 64, align: 64, offset: 384)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !433}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !380, file: !347, line: 130, baseType: !436, size: 32, align: 32, offset: 448)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !347, line: 48, baseType: !346)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !380, file: !347, line: 136, baseType: !438, size: 64, align: 64, offset: 512)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64, align: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!436, !390}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !380, file: !347, line: 142, baseType: !442, size: 64, align: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64, align: 64)
!443 = !DISubroutineType(types: !444)
!444 = !{!399, !445, !390, !383, !399}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64, align: 64)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !325, line: 329, size: 128, align: 64, elements: !448)
!448 = !{!449, !461, !462}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !447, file: !325, line: 360, baseType: !450, size: 64, align: 64)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !325, line: 324, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !325, line: 306, size: 384, align: 64, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !453, file: !325, line: 307, baseType: !383, size: 64, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !453, file: !325, line: 313, baseType: !409, size: 64, align: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !453, file: !325, line: 313, baseType: !409, size: 64, align: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !453, file: !325, line: 318, baseType: !409, size: 64, align: 64, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !453, file: !325, line: 318, baseType: !409, size: 64, align: 64, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !453, file: !325, line: 323, baseType: !399, size: 32, align: 32, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !447, file: !325, line: 364, baseType: !399, size: 32, align: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !447, file: !325, line: 368, baseType: !399, size: 32, align: 32, offset: 96)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !374, file: !368, line: 341, baseType: !464, size: 64, align: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !368, line: 328, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !368, line: 144, size: 1024, align: 64, elements: !468)
!468 = !{!469, !470, !471, !603, !604, !605, !606, !610, !611, !616, !620, !621, !622, !623, !625, !630, !634}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !467, file: !368, line: 148, baseType: !383, size: 64, align: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !467, file: !368, line: 155, baseType: !383, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !467, file: !368, line: 164, baseType: !472, size: 64, align: 64, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64, align: 64)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !368, line: 69, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !476, line: 54, size: 576, align: 64, elements: !477)
!476 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!477 = !{!478, !479, !480, !587, !591, !595, !599, !600, !601, !602}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !475, file: !476, line: 60, baseType: !383, size: 64, align: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !475, file: !476, line: 65, baseType: !315, size: 32, align: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !475, file: !476, line: 73, baseType: !481, size: 64, align: 64, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!484, !585, !399, !399}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !15, line: 646, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !15, line: 268, size: 4288, align: 64, elements: !487)
!487 = !{!488, !495, !497, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !517, !518, !519, !520, !521, !522, !523, !524, !537, !539, !540, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !573, !574, !575, !576, !577, !578, !581, !582, !583, !584}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !486, file: !15, line: 282, baseType: !489, size: 512, align: 64)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 512, align: 64, elements: !493)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !406, line: 48, baseType: !492)
!492 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!493 = !{!494}
!494 = !DISubrange(count: 8)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !486, file: !15, line: 299, baseType: !496, size: 256, align: 32, offset: 512)
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 256, align: 32, elements: !493)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !486, file: !15, line: 315, baseType: !498, size: 64, align: 64, offset: 768)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !486, file: !15, line: 326, baseType: !399, size: 32, align: 32, offset: 832)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !486, file: !15, line: 326, baseType: !399, size: 32, align: 32, offset: 864)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !486, file: !15, line: 334, baseType: !399, size: 32, align: 32, offset: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !486, file: !15, line: 341, baseType: !399, size: 32, align: 32, offset: 928)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !486, file: !15, line: 346, baseType: !399, size: 32, align: 32, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !486, file: !15, line: 351, baseType: !3, size: 32, align: 32, offset: 992)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !486, file: !15, line: 356, baseType: !412, size: 64, align: 32, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !486, file: !15, line: 361, baseType: !405, size: 64, align: 64, offset: 1088)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !486, file: !15, line: 369, baseType: !405, size: 64, align: 64, offset: 1152)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !486, file: !15, line: 377, baseType: !405, size: 64, align: 64, offset: 1216)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !486, file: !15, line: 382, baseType: !399, size: 32, align: 32, offset: 1280)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !486, file: !15, line: 386, baseType: !399, size: 32, align: 32, offset: 1312)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !486, file: !15, line: 391, baseType: !399, size: 32, align: 32, offset: 1344)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !486, file: !15, line: 396, baseType: !390, size: 64, align: 64, offset: 1408)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !486, file: !15, line: 403, baseType: !514, size: 512, align: 64, offset: 1472)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 512, align: 64, elements: !493)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !406, line: 55, baseType: !516)
!516 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !486, file: !15, line: 410, baseType: !399, size: 32, align: 32, offset: 1984)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !486, file: !15, line: 415, baseType: !399, size: 32, align: 32, offset: 2016)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !486, file: !15, line: 420, baseType: !399, size: 32, align: 32, offset: 2048)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !486, file: !15, line: 425, baseType: !399, size: 32, align: 32, offset: 2080)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !486, file: !15, line: 435, baseType: !405, size: 64, align: 64, offset: 2112)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !486, file: !15, line: 440, baseType: !399, size: 32, align: 32, offset: 2176)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !486, file: !15, line: 445, baseType: !515, size: 64, align: 64, offset: 2240)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !486, file: !15, line: 459, baseType: !525, size: 512, align: 64, offset: 2304)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 512, align: 64, elements: !493)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !528, line: 94, baseType: !529)
!528 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !528, line: 81, size: 192, align: 64, elements: !530)
!530 = !{!531, !535, !536}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !529, file: !528, line: 82, baseType: !532, size: 64, align: 64)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !528, line: 73, baseType: !534)
!534 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !528, line: 73, flags: DIFlagFwdDecl)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !529, file: !528, line: 89, baseType: !490, size: 64, align: 64, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !529, file: !528, line: 93, baseType: !399, size: 32, align: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !486, file: !15, line: 473, baseType: !538, size: 64, align: 64, offset: 2816)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !486, file: !15, line: 477, baseType: !399, size: 32, align: 32, offset: 2880)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !486, file: !15, line: 479, baseType: !541, size: 64, align: 64, offset: 2944)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !15, line: 207, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !15, line: 201, size: 320, align: 64, elements: !545)
!545 = !{!546, !547, !548, !549, !554}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !544, file: !15, line: 202, baseType: !14, size: 32, align: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !544, file: !15, line: 203, baseType: !490, size: 64, align: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !544, file: !15, line: 204, baseType: !399, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !544, file: !15, line: 205, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !552, line: 86, baseType: !553)
!552 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !552, line: 86, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !544, file: !15, line: 206, baseType: !526, size: 64, align: 64, offset: 256)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !486, file: !15, line: 480, baseType: !399, size: 32, align: 32, offset: 3008)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !486, file: !15, line: 505, baseType: !399, size: 32, align: 32, offset: 3040)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !486, file: !15, line: 512, baseType: !38, size: 32, align: 32, offset: 3072)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !486, file: !15, line: 514, baseType: !45, size: 32, align: 32, offset: 3104)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !486, file: !15, line: 516, baseType: !63, size: 32, align: 32, offset: 3136)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !486, file: !15, line: 523, baseType: !87, size: 32, align: 32, offset: 3168)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !486, file: !15, line: 525, baseType: !106, size: 32, align: 32, offset: 3200)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !486, file: !15, line: 532, baseType: !405, size: 64, align: 64, offset: 3264)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !486, file: !15, line: 539, baseType: !405, size: 64, align: 64, offset: 3328)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !486, file: !15, line: 547, baseType: !405, size: 64, align: 64, offset: 3392)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !486, file: !15, line: 554, baseType: !550, size: 64, align: 64, offset: 3456)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !486, file: !15, line: 563, baseType: !399, size: 32, align: 32, offset: 3520)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !486, file: !15, line: 572, baseType: !399, size: 32, align: 32, offset: 3552)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !486, file: !15, line: 581, baseType: !399, size: 32, align: 32, offset: 3584)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !486, file: !15, line: 588, baseType: !570, size: 64, align: 64, offset: 3648)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !406, line: 36, baseType: !572)
!572 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !486, file: !15, line: 593, baseType: !399, size: 32, align: 32, offset: 3712)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !486, file: !15, line: 596, baseType: !399, size: 32, align: 32, offset: 3744)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !486, file: !15, line: 599, baseType: !526, size: 64, align: 64, offset: 3776)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !486, file: !15, line: 605, baseType: !526, size: 64, align: 64, offset: 3840)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !486, file: !15, line: 616, baseType: !526, size: 64, align: 64, offset: 3904)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !486, file: !15, line: 626, baseType: !579, size: 64, align: 64, offset: 3968)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !580, line: 216, baseType: !516)
!580 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!581 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !486, file: !15, line: 627, baseType: !579, size: 64, align: 64, offset: 4032)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !486, file: !15, line: 628, baseType: !579, size: 64, align: 64, offset: 4096)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !486, file: !15, line: 629, baseType: !579, size: 64, align: 64, offset: 4160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !486, file: !15, line: 645, baseType: !526, size: 64, align: 64, offset: 4224)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !368, line: 68, baseType: !369)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !475, file: !476, line: 81, baseType: !588, size: 64, align: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64, align: 64)
!589 = !DISubroutineType(types: !590)
!590 = !{!484, !585, !399}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !475, file: !476, line: 93, baseType: !592, size: 64, align: 64, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DISubroutineType(types: !594)
!594 = !{!399, !585, !484}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !475, file: !476, line: 104, baseType: !596, size: 64, align: 64, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DISubroutineType(types: !598)
!598 = !{!399, !585}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !475, file: !476, line: 113, baseType: !596, size: 64, align: 64, offset: 384)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !475, file: !476, line: 129, baseType: !596, size: 64, align: 64, offset: 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !475, file: !476, line: 137, baseType: !399, size: 32, align: 32, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !475, file: !476, line: 145, baseType: !399, size: 32, align: 32, offset: 544)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !467, file: !368, line: 172, baseType: !472, size: 64, align: 64, offset: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !467, file: !368, line: 182, baseType: !377, size: 64, align: 64, offset: 256)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !467, file: !368, line: 187, baseType: !399, size: 32, align: 32, offset: 320)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !467, file: !368, line: 210, baseType: !607, size: 64, align: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!399, !372}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !467, file: !368, line: 233, baseType: !607, size: 64, align: 64, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !467, file: !368, line: 246, baseType: !612, size: 64, align: 64, offset: 512)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DISubroutineType(types: !614)
!614 = !{!399, !372, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !467, file: !368, line: 258, baseType: !617, size: 64, align: 64, offset: 576)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !372}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !467, file: !368, line: 282, baseType: !607, size: 64, align: 64, offset: 640)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !467, file: !368, line: 284, baseType: !399, size: 32, align: 32, offset: 704)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !467, file: !368, line: 286, baseType: !399, size: 32, align: 32, offset: 736)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !467, file: !368, line: 292, baseType: !624, size: 64, align: 64, offset: 768)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !467, file: !368, line: 306, baseType: !626, size: 64, align: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!399, !372, !383, !383, !629, !399, !399}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !467, file: !368, line: 313, baseType: !631, size: 64, align: 64, offset: 896)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!399, !372, !390}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !467, file: !368, line: 327, baseType: !607, size: 64, align: 64, offset: 960)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !368, line: 343, baseType: !629, size: 64, align: 64, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !374, file: !368, line: 345, baseType: !637, size: 64, align: 64, offset: 192)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !374, file: !368, line: 346, baseType: !639, size: 64, align: 64, offset: 256)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !374, file: !368, line: 347, baseType: !641, size: 32, align: 32, offset: 320)
!641 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !374, file: !368, line: 349, baseType: !637, size: 64, align: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !374, file: !368, line: 350, baseType: !639, size: 64, align: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !374, file: !368, line: 351, baseType: !641, size: 32, align: 32, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !374, file: !368, line: 353, baseType: !390, size: 64, align: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !374, file: !368, line: 355, baseType: !647, size: 64, align: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !368, line: 840, size: 768, align: 64, elements: !649)
!649 = !{!650, !651, !653, !654, !655, !656, !657, !658, !680, !681, !682, !683, !684, !685}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !648, file: !368, line: 841, baseType: !377, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !648, file: !368, line: 842, baseType: !652, size: 64, align: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !648, file: !368, line: 843, baseType: !641, size: 32, align: 32, offset: 128)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !648, file: !368, line: 845, baseType: !629, size: 64, align: 64, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !648, file: !368, line: 847, baseType: !629, size: 64, align: 64, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !648, file: !368, line: 862, baseType: !399, size: 32, align: 32, offset: 320)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !648, file: !368, line: 869, baseType: !399, size: 32, align: 32, offset: 352)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !648, file: !368, line: 874, baseType: !659, size: 64, align: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !368, line: 809, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !476, line: 148, size: 192, align: 64, elements: !662)
!662 = !{!663, !664, !674}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !661, file: !476, line: 149, baseType: !390, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !661, file: !476, line: 150, baseType: !665, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !368, line: 837, baseType: !667)
!667 = !DISubroutineType(types: !668)
!668 = !{!399, !372, !669, !390, !673, !399}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64, align: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !368, line: 823, baseType: !671)
!671 = !DISubroutineType(types: !672)
!672 = !{!399, !372, !390, !399, !399}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !661, file: !476, line: 151, baseType: !675, size: 8, align: 8, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !676, line: 48, baseType: !677)
!676 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !676, line: 46, size: 8, align: 8, elements: !678)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !677, file: !676, line: 47, baseType: !385, size: 8, align: 8)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !648, file: !368, line: 881, baseType: !390, size: 64, align: 64, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !648, file: !368, line: 895, baseType: !665, size: 64, align: 64, offset: 512)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !648, file: !368, line: 897, baseType: !629, size: 64, align: 64, offset: 576)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !648, file: !368, line: 906, baseType: !639, size: 64, align: 64, offset: 640)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !648, file: !368, line: 907, baseType: !399, size: 32, align: 32, offset: 704)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !648, file: !368, line: 909, baseType: !641, size: 32, align: 32, offset: 736)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !374, file: !368, line: 373, baseType: !399, size: 32, align: 32, offset: 704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !374, file: !368, line: 378, baseType: !688, size: 64, align: 64, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !368, line: 335, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !476, line: 154, size: 64, align: 64, elements: !691)
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !690, file: !476, line: 155, baseType: !665, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !374, file: !368, line: 380, baseType: !694, size: 64, align: 64, offset: 832)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !476, line: 38, size: 320, align: 64, elements: !696)
!696 = !{!697, !698, !699, !700, !701}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !695, file: !476, line: 39, baseType: !409, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !695, file: !476, line: 40, baseType: !629, size: 64, align: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !695, file: !476, line: 41, baseType: !629, size: 64, align: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !695, file: !476, line: 42, baseType: !399, size: 32, align: 32, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !695, file: !476, line: 43, baseType: !694, size: 64, align: 64, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !374, file: !368, line: 382, baseType: !629, size: 64, align: 64, offset: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !374, file: !368, line: 383, baseType: !390, size: 64, align: 64, offset: 960)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !374, file: !368, line: 384, baseType: !705, size: 64, align: 64, offset: 1024)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !374, file: !368, line: 385, baseType: !399, size: 32, align: 32, offset: 1088)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !374, file: !368, line: 394, baseType: !526, size: 64, align: 64, offset: 1152)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !374, file: !368, line: 401, baseType: !399, size: 32, align: 32, offset: 1216)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !374, file: !368, line: 408, baseType: !641, size: 32, align: 32, offset: 1248)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !374, file: !368, line: 424, baseType: !399, size: 32, align: 32, offset: 1280)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !369, file: !368, line: 441, baseType: !637, size: 64, align: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !369, file: !368, line: 443, baseType: !372, size: 64, align: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !369, file: !368, line: 444, baseType: !637, size: 64, align: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !369, file: !368, line: 446, baseType: !315, size: 32, align: 32, offset: 256)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !369, file: !368, line: 449, baseType: !399, size: 32, align: 32, offset: 288)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !369, file: !368, line: 450, baseType: !399, size: 32, align: 32, offset: 320)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !369, file: !368, line: 451, baseType: !412, size: 64, align: 32, offset: 352)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !369, file: !368, line: 453, baseType: !515, size: 64, align: 64, offset: 448)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !369, file: !368, line: 454, baseType: !399, size: 32, align: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !369, file: !368, line: 456, baseType: !399, size: 32, align: 32, offset: 544)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !369, file: !368, line: 465, baseType: !412, size: 64, align: 32, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !369, file: !368, line: 481, baseType: !723, size: 64, align: 64, offset: 640)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !368, line: 70, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !726, line: 64, size: 256, align: 64, elements: !727)
!726 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!727 = !{!728, !729, !730, !731}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !725, file: !726, line: 65, baseType: !641, size: 32, align: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !725, file: !726, line: 66, baseType: !673, size: 64, align: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !725, file: !726, line: 68, baseType: !641, size: 32, align: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !725, file: !726, line: 69, baseType: !732, size: 64, align: 64, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64, align: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !369, file: !368, line: 482, baseType: !723, size: 64, align: 64, offset: 704)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !369, file: !368, line: 488, baseType: !723, size: 64, align: 64, offset: 768)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !369, file: !368, line: 489, baseType: !723, size: 64, align: 64, offset: 832)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !369, file: !368, line: 490, baseType: !739, size: 64, align: 64, offset: 896)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64, align: 64)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !726, line: 85, size: 256, align: 64, elements: !741)
!741 = !{!742, !744, !745, !746, !747, !748}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !740, file: !726, line: 86, baseType: !743, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !740, file: !726, line: 87, baseType: !399, size: 32, align: 32, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !740, file: !726, line: 88, baseType: !385, size: 8, align: 8, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !740, file: !726, line: 89, baseType: !385, size: 8, align: 8, offset: 104)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !740, file: !726, line: 91, baseType: !641, size: 32, align: 32, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !740, file: !726, line: 92, baseType: !749, size: 64, align: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64, align: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !369, file: !368, line: 491, baseType: !739, size: 64, align: 64, offset: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !369, file: !368, line: 500, baseType: !399, size: 32, align: 32, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !369, file: !368, line: 507, baseType: !367, size: 32, align: 32, offset: 1056)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !369, file: !368, line: 512, baseType: !647, size: 64, align: 64, offset: 1088)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !369, file: !368, line: 518, baseType: !405, size: 64, align: 64, offset: 1152)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !369, file: !368, line: 524, baseType: !405, size: 64, align: 64, offset: 1216)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !369, file: !368, line: 529, baseType: !399, size: 32, align: 32, offset: 1280)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !369, file: !368, line: 542, baseType: !412, size: 64, align: 32, offset: 1312)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !369, file: !368, line: 547, baseType: !484, size: 64, align: 64, offset: 1408)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !369, file: !368, line: 553, baseType: !399, size: 32, align: 32, offset: 1472)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !369, file: !368, line: 562, baseType: !399, size: 32, align: 32, offset: 1504)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !369, file: !368, line: 568, baseType: !399, size: 32, align: 32, offset: 1536)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !369, file: !368, line: 573, baseType: !399, size: 32, align: 32, offset: 1568)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !368, line: 578, baseType: !641, size: 32, align: 32, offset: 1600)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !369, file: !368, line: 583, baseType: !405, size: 64, align: 64, offset: 1664)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !369, file: !368, line: 583, baseType: !405, size: 64, align: 64, offset: 1728)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !369, file: !368, line: 588, baseType: !390, size: 64, align: 64, offset: 1792)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !369, file: !368, line: 595, baseType: !399, size: 32, align: 32, offset: 1856)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !369, file: !368, line: 601, baseType: !526, size: 64, align: 64, offset: 1920)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !369, file: !368, line: 610, baseType: !771, size: 491520, align: 8, offset: 1984)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 491520, align: 8, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 61440)
!774 = !{!775, !776, !777}
!775 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!776 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!777 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!778 = !{!409, !579, !779, !783}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64, align: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !406, line: 49, baseType: !782)
!782 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64, align: 64)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !491)
!785 = !{!786, !788, !794, !798, !799, !800}
!786 = distinct !DIGlobalVariable(name: "ff_vf_vmafmotion", scope: !0, file: !787, line: 359, type: !466, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_vf_vmafmotion)
!787 = !DIFile(filename: "libavfilter/vf_vmafmotion.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!788 = distinct !DIGlobalVariable(name: "FILTER_5", scope: !0, file: !787, line: 37, type: !789, isLocal: true, isDefinition: true, variable: [5 x float]* @FILTER_5)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !790, size: 160, align: 32, elements: !792)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !791)
!791 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!792 = !{!793}
!793 = !DISubrange(count: 5)
!794 = distinct !DIGlobalVariable(name: "vmafmotion_inputs", scope: !0, file: !787, line: 341, type: !795, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @vmafmotion_inputs)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 1152, align: 64, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 2)
!798 = distinct !DIGlobalVariable(name: "vmafmotion_outputs", scope: !0, file: !787, line: 351, type: !795, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @vmafmotion_outputs)
!799 = distinct !DIGlobalVariable(name: "vmafmotion_class", scope: !0, file: !787, line: 60, type: !378, isLocal: true, isDefinition: true, variable: %struct.AVClass* @vmafmotion_class)
!800 = distinct !DIGlobalVariable(name: "vmafmotion_options", scope: !0, file: !787, line: 55, type: !801, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption }>* @vmafmotion_options)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 1024, align: 64, elements: !796)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !325, line: 301, baseType: !394)
!804 = !{i32 2, !"Dwarf Version", i32 4}
!805 = !{i32 2, !"Debug Info Version", i32 3}
!806 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!807 = distinct !DISubprogram(name: "ff_vmafmotion_process", scope: !787, file: !787, line: 189, type: !808, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !843)
!808 = !DISubroutineType(types: !809)
!809 = !{!409, !810, !484}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMAFMotionData", file: !812, line: 52, baseType: !813)
!812 = !DIFile(filename: "libavfilter/vmaf_motion.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMAFMotionData", file: !812, line: 42, size: 768, align: 64, elements: !814)
!814 = !{!815, !817, !818, !819, !821, !824, !825, !826, !827}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !813, file: !812, line: 43, baseType: !816, size: 80, align: 16)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 80, align: 16, elements: !792)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !813, file: !812, line: 44, baseType: !399, size: 32, align: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !813, file: !812, line: 45, baseType: !399, size: 32, align: 32, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !813, file: !812, line: 46, baseType: !820, size: 64, align: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !580, line: 149, baseType: !407)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "blur_data", scope: !813, file: !812, line: 47, baseType: !822, size: 128, align: 64, offset: 256)
!822 = !DICompositeType(tag: DW_TAG_array_type, baseType: !823, size: 128, align: 64, elements: !796)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "temp_data", scope: !813, file: !812, line: 48, baseType: !823, size: 64, align: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "motion_sum", scope: !813, file: !812, line: 49, baseType: !409, size: 64, align: 64, offset: 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nb_frames", scope: !813, file: !812, line: 50, baseType: !515, size: 64, align: 64, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "vmafdsp", scope: !813, file: !812, line: 51, baseType: !828, size: 192, align: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMAFMotionDSPContext", file: !812, line: 38, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMAFMotionDSPContext", file: !812, line: 29, size: 192, align: 64, elements: !830)
!830 = !{!831, !835, !839}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !829, file: !812, line: 30, baseType: !832, size: 64, align: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64, align: 64)
!833 = !DISubroutineType(types: !834)
!834 = !{!515, !779, !779, !399, !399, !820, !820}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "convolution_x", scope: !829, file: !812, line: 32, baseType: !836, size: 64, align: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64, align: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !779, !399, !779, !823, !399, !399, !820, !820}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "convolution_y", scope: !829, file: !812, line: 35, baseType: !840, size: 64, align: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64, align: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !779, !399, !783, !823, !399, !399, !820, !820}
!843 = !{}
!844 = !DILocalVariable(name: "s", arg: 1, scope: !807, file: !787, line: 189, type: !810)
!845 = !DIExpression()
!846 = !DILocation(line: 189, column: 46, scope: !807)
!847 = !DILocalVariable(name: "ref", arg: 2, scope: !807, file: !787, line: 189, type: !484)
!848 = !DILocation(line: 189, column: 58, scope: !807)
!849 = !DILocalVariable(name: "score", scope: !807, file: !787, line: 191, type: !409)
!850 = !DILocation(line: 191, column: 12, scope: !807)
!851 = !DILocation(line: 193, column: 5, scope: !807)
!852 = !DILocation(line: 193, column: 8, scope: !807)
!853 = !DILocation(line: 193, column: 16, scope: !807)
!854 = !DILocation(line: 193, column: 30, scope: !807)
!855 = !DILocation(line: 193, column: 33, scope: !807)
!856 = !DILocation(line: 193, column: 44, scope: !807)
!857 = !DILocation(line: 193, column: 49, scope: !807)
!858 = !DILocation(line: 193, column: 58, scope: !807)
!859 = !DILocation(line: 193, column: 61, scope: !807)
!860 = !DILocation(line: 194, column: 30, scope: !807)
!861 = !DILocation(line: 194, column: 33, scope: !807)
!862 = !DILocation(line: 194, column: 40, scope: !807)
!863 = !DILocation(line: 194, column: 43, scope: !807)
!864 = !DILocation(line: 194, column: 51, scope: !807)
!865 = !DILocation(line: 194, column: 56, scope: !807)
!866 = !DILocation(line: 194, column: 69, scope: !807)
!867 = !DILocation(line: 194, column: 72, scope: !807)
!868 = !DILocation(line: 195, column: 5, scope: !807)
!869 = !DILocation(line: 195, column: 8, scope: !807)
!870 = !DILocation(line: 195, column: 16, scope: !807)
!871 = !DILocation(line: 195, column: 30, scope: !807)
!872 = !DILocation(line: 195, column: 33, scope: !807)
!873 = !DILocation(line: 195, column: 44, scope: !807)
!874 = !DILocation(line: 195, column: 47, scope: !807)
!875 = !DILocation(line: 195, column: 58, scope: !807)
!876 = !DILocation(line: 195, column: 61, scope: !807)
!877 = !DILocation(line: 196, column: 30, scope: !807)
!878 = !DILocation(line: 196, column: 33, scope: !807)
!879 = !DILocation(line: 196, column: 40, scope: !807)
!880 = !DILocation(line: 196, column: 43, scope: !807)
!881 = !DILocation(line: 196, column: 51, scope: !807)
!882 = !DILocation(line: 196, column: 54, scope: !807)
!883 = !DILocation(line: 196, column: 62, scope: !807)
!884 = !DILocation(line: 196, column: 65, scope: !807)
!885 = !DILocation(line: 198, column: 10, scope: !886)
!886 = distinct !DILexicalBlock(scope: !807, file: !787, line: 198, column: 9)
!887 = !DILocation(line: 198, column: 13, scope: !886)
!888 = !DILocation(line: 198, column: 9, scope: !807)
!889 = !DILocation(line: 199, column: 15, scope: !890)
!890 = distinct !DILexicalBlock(scope: !886, file: !787, line: 198, column: 24)
!891 = !DILocation(line: 200, column: 5, scope: !890)
!892 = !DILocalVariable(name: "sad", scope: !893, file: !787, line: 201, type: !515)
!893 = distinct !DILexicalBlock(scope: !886, file: !787, line: 200, column: 12)
!894 = !DILocation(line: 201, column: 18, scope: !893)
!895 = !DILocation(line: 201, column: 24, scope: !893)
!896 = !DILocation(line: 201, column: 27, scope: !893)
!897 = !DILocation(line: 201, column: 35, scope: !893)
!898 = !DILocation(line: 201, column: 39, scope: !893)
!899 = !DILocation(line: 201, column: 42, scope: !893)
!900 = !DILocation(line: 201, column: 56, scope: !893)
!901 = !DILocation(line: 201, column: 59, scope: !893)
!902 = !DILocation(line: 202, column: 39, scope: !893)
!903 = !DILocation(line: 202, column: 42, scope: !893)
!904 = !DILocation(line: 202, column: 49, scope: !893)
!905 = !DILocation(line: 202, column: 52, scope: !893)
!906 = !DILocation(line: 202, column: 60, scope: !893)
!907 = !DILocation(line: 202, column: 63, scope: !893)
!908 = !DILocation(line: 202, column: 71, scope: !893)
!909 = !DILocation(line: 202, column: 74, scope: !893)
!910 = !DILocation(line: 204, column: 27, scope: !893)
!911 = !DILocation(line: 204, column: 31, scope: !893)
!912 = !DILocation(line: 204, column: 40, scope: !893)
!913 = !DILocation(line: 204, column: 43, scope: !893)
!914 = !DILocation(line: 204, column: 51, scope: !893)
!915 = !DILocation(line: 204, column: 54, scope: !893)
!916 = !DILocation(line: 204, column: 49, scope: !893)
!917 = !DILocation(line: 204, column: 61, scope: !893)
!918 = !DILocation(line: 204, column: 39, scope: !893)
!919 = !DILocation(line: 204, column: 37, scope: !893)
!920 = !DILocation(line: 204, column: 15, scope: !893)
!921 = !DILocation(line: 207, column: 5, scope: !807)
!922 = distinct !{!922, !921}
!923 = !DILocalVariable(name: "SWAP_tmp", scope: !924, file: !787, line: 207, type: !823)
!924 = distinct !DILexicalBlock(scope: !807, file: !787, line: 207, column: 7)
!925 = !DILocation(line: 207, column: 19, scope: !924)
!926 = !DILocation(line: 207, column: 29, scope: !927)
!927 = !DILexicalBlockFile(scope: !924, file: !787, discriminator: 1)
!928 = !DILocation(line: 207, column: 32, scope: !927)
!929 = !DILocation(line: 207, column: 19, scope: !927)
!930 = !DILocation(line: 207, column: 63, scope: !927)
!931 = !DILocation(line: 207, column: 66, scope: !927)
!932 = !DILocation(line: 207, column: 46, scope: !927)
!933 = !DILocation(line: 207, column: 49, scope: !927)
!934 = !DILocation(line: 207, column: 61, scope: !927)
!935 = !DILocation(line: 207, column: 97, scope: !927)
!936 = !DILocation(line: 207, column: 80, scope: !927)
!937 = !DILocation(line: 207, column: 83, scope: !927)
!938 = !DILocation(line: 207, column: 95, scope: !927)
!939 = !DILocation(line: 207, column: 106, scope: !927)
!940 = !DILocation(line: 208, column: 5, scope: !807)
!941 = !DILocation(line: 208, column: 8, scope: !807)
!942 = !DILocation(line: 208, column: 17, scope: !807)
!943 = !DILocation(line: 209, column: 22, scope: !807)
!944 = !DILocation(line: 209, column: 5, scope: !807)
!945 = !DILocation(line: 209, column: 8, scope: !807)
!946 = !DILocation(line: 209, column: 19, scope: !807)
!947 = !DILocation(line: 211, column: 12, scope: !807)
!948 = !DILocation(line: 211, column: 5, scope: !807)
!949 = distinct !DISubprogram(name: "ff_vmafmotion_init", scope: !787, file: !787, line: 235, type: !950, isLocal: false, isDefinition: true, scopeLine: 237, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !843)
!950 = !DISubroutineType(types: !951)
!951 = !{!399, !810, !399, !399, !116}
!952 = !DILocalVariable(name: "s", arg: 1, scope: !949, file: !787, line: 235, type: !810)
!953 = !DILocation(line: 235, column: 40, scope: !949)
!954 = !DILocalVariable(name: "w", arg: 2, scope: !949, file: !787, line: 236, type: !399)
!955 = !DILocation(line: 236, column: 28, scope: !949)
!956 = !DILocalVariable(name: "h", arg: 3, scope: !949, file: !787, line: 236, type: !399)
!957 = !DILocation(line: 236, column: 35, scope: !949)
!958 = !DILocalVariable(name: "fmt", arg: 4, scope: !949, file: !787, line: 236, type: !116)
!959 = !DILocation(line: 236, column: 57, scope: !949)
!960 = !DILocalVariable(name: "data_sz", scope: !949, file: !787, line: 238, type: !579)
!961 = !DILocation(line: 238, column: 12, scope: !949)
!962 = !DILocalVariable(name: "i", scope: !949, file: !787, line: 239, type: !399)
!963 = !DILocation(line: 239, column: 9, scope: !949)
!964 = !DILocalVariable(name: "desc", scope: !949, file: !787, line: 240, type: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !968, line: 123, baseType: !969)
!968 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !968, line: 81, size: 1280, align: 64, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976, !991}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !969, file: !968, line: 82, baseType: !383, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !969, file: !968, line: 83, baseType: !491, size: 8, align: 8, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !969, file: !968, line: 92, baseType: !491, size: 8, align: 8, offset: 72)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !969, file: !968, line: 101, baseType: !491, size: 8, align: 8, offset: 80)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !969, file: !968, line: 106, baseType: !515, size: 64, align: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !969, file: !968, line: 117, baseType: !977, size: 1024, align: 32, offset: 192)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 1024, align: 32, elements: !989)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !968, line: 70, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !968, line: 31, size: 256, align: 32, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !987, !988}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !979, file: !968, line: 35, baseType: !399, size: 32, align: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !979, file: !968, line: 41, baseType: !399, size: 32, align: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !979, file: !968, line: 47, baseType: !399, size: 32, align: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !979, file: !968, line: 53, baseType: !399, size: 32, align: 32, offset: 96)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !979, file: !968, line: 58, baseType: !399, size: 32, align: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !979, file: !968, line: 62, baseType: !399, size: 32, align: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !979, file: !968, line: 65, baseType: !399, size: 32, align: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !979, file: !968, line: 68, baseType: !399, size: 32, align: 32, offset: 224)
!989 = !{!990}
!990 = !DISubrange(count: 4)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !969, file: !968, line: 122, baseType: !383, size: 64, align: 64, offset: 1216)
!992 = !DILocation(line: 240, column: 31, scope: !949)
!993 = !DILocation(line: 240, column: 58, scope: !949)
!994 = !DILocation(line: 240, column: 38, scope: !949)
!995 = !DILocation(line: 242, column: 16, scope: !949)
!996 = !DILocation(line: 242, column: 5, scope: !949)
!997 = !DILocation(line: 242, column: 8, scope: !949)
!998 = !DILocation(line: 242, column: 14, scope: !949)
!999 = !DILocation(line: 243, column: 17, scope: !949)
!1000 = !DILocation(line: 243, column: 5, scope: !949)
!1001 = !DILocation(line: 243, column: 8, scope: !949)
!1002 = !DILocation(line: 243, column: 15, scope: !949)
!1003 = !DILocation(line: 244, column: 20, scope: !949)
!1004 = !DILocation(line: 244, column: 22, scope: !949)
!1005 = !DILocation(line: 244, column: 41, scope: !949)
!1006 = !DILocation(line: 244, column: 46, scope: !949)
!1007 = !DILocation(line: 244, column: 49, scope: !949)
!1008 = !DILocation(line: 244, column: 5, scope: !949)
!1009 = !DILocation(line: 244, column: 8, scope: !949)
!1010 = !DILocation(line: 244, column: 15, scope: !949)
!1011 = !DILocation(line: 246, column: 24, scope: !949)
!1012 = !DILocation(line: 246, column: 27, scope: !949)
!1013 = !DILocation(line: 246, column: 36, scope: !949)
!1014 = !DILocation(line: 246, column: 34, scope: !949)
!1015 = !DILocation(line: 246, column: 13, scope: !949)
!1016 = !DILocation(line: 247, column: 39, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !949, file: !787, line: 247, column: 9)
!1018 = !DILocation(line: 247, column: 29, scope: !1017)
!1019 = !DILocation(line: 247, column: 11, scope: !1017)
!1020 = !DILocation(line: 247, column: 14, scope: !1017)
!1021 = !DILocation(line: 247, column: 27, scope: !1017)
!1022 = !DILocation(line: 247, column: 49, scope: !1017)
!1023 = !DILocation(line: 248, column: 39, scope: !1017)
!1024 = !DILocation(line: 248, column: 29, scope: !1017)
!1025 = !DILocation(line: 248, column: 11, scope: !1017)
!1026 = !DILocation(line: 248, column: 14, scope: !1017)
!1027 = !DILocation(line: 248, column: 27, scope: !1017)
!1028 = !DILocation(line: 248, column: 49, scope: !1017)
!1029 = !DILocation(line: 249, column: 36, scope: !1017)
!1030 = !DILocation(line: 249, column: 26, scope: !1017)
!1031 = !DILocation(line: 249, column: 11, scope: !1017)
!1032 = !DILocation(line: 249, column: 14, scope: !1017)
!1033 = !DILocation(line: 249, column: 24, scope: !1017)
!1034 = !DILocation(line: 247, column: 9, scope: !1035)
!1035 = !DILexicalBlockFile(scope: !949, file: !787, discriminator: 1)
!1036 = !DILocation(line: 250, column: 9, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1017, file: !787, line: 249, column: 47)
!1038 = !DILocation(line: 253, column: 12, scope: !1039)
!1039 = distinct !DILexicalBlock(scope: !949, file: !787, line: 253, column: 5)
!1040 = !DILocation(line: 253, column: 10, scope: !1039)
!1041 = !DILocation(line: 253, column: 17, scope: !1042)
!1042 = !DILexicalBlockFile(scope: !1043, file: !787, discriminator: 1)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !787, line: 253, column: 5)
!1044 = !DILocation(line: 253, column: 19, scope: !1042)
!1045 = !DILocation(line: 253, column: 5, scope: !1042)
!1046 = !DILocation(line: 254, column: 39, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1043, file: !787, line: 253, column: 29)
!1048 = !DILocation(line: 254, column: 30, scope: !1047)
!1049 = !DILocation(line: 254, column: 42, scope: !1047)
!1050 = !DILocation(line: 254, column: 24, scope: !1047)
!1051 = !DILocation(line: 254, column: 19, scope: !1047)
!1052 = !DILocation(line: 254, column: 9, scope: !1047)
!1053 = !DILocation(line: 254, column: 12, scope: !1047)
!1054 = !DILocation(line: 254, column: 22, scope: !1047)
!1055 = !DILocation(line: 255, column: 5, scope: !1047)
!1056 = !DILocation(line: 253, column: 25, scope: !1057)
!1057 = !DILexicalBlockFile(scope: !1043, file: !787, discriminator: 2)
!1058 = !DILocation(line: 253, column: 5, scope: !1057)
!1059 = distinct !{!1059, !1060}
!1060 = !DILocation(line: 253, column: 5, scope: !949)
!1061 = !DILocation(line: 257, column: 25, scope: !949)
!1062 = !DILocation(line: 257, column: 28, scope: !949)
!1063 = !DILocation(line: 257, column: 37, scope: !949)
!1064 = !DILocation(line: 257, column: 43, scope: !949)
!1065 = !DILocation(line: 257, column: 51, scope: !949)
!1066 = !DILocation(line: 257, column: 5, scope: !949)
!1067 = !DILocation(line: 259, column: 5, scope: !949)
!1068 = !DILocation(line: 260, column: 1, scope: !949)
!1069 = distinct !DISubprogram(name: "vmafmotiondsp_init", scope: !787, file: !787, line: 183, type: !1070, isLocal: true, isDefinition: true, scopeLine: 183, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !843)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{null, !1072, !399}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64, align: 64)
!1073 = !DILocalVariable(name: "dsp", arg: 1, scope: !1069, file: !787, line: 183, type: !1072)
!1074 = !DILocation(line: 183, column: 54, scope: !1069)
!1075 = !DILocalVariable(name: "bpp", arg: 2, scope: !1069, file: !787, line: 183, type: !399)
!1076 = !DILocation(line: 183, column: 63, scope: !1069)
!1077 = !DILocation(line: 184, column: 5, scope: !1069)
!1078 = !DILocation(line: 184, column: 10, scope: !1069)
!1079 = !DILocation(line: 184, column: 24, scope: !1069)
!1080 = !DILocation(line: 185, column: 26, scope: !1069)
!1081 = !DILocation(line: 185, column: 30, scope: !1069)
!1082 = !DILocation(line: 185, column: 5, scope: !1069)
!1083 = !DILocation(line: 185, column: 10, scope: !1069)
!1084 = !DILocation(line: 185, column: 24, scope: !1069)
!1085 = !DILocation(line: 186, column: 5, scope: !1069)
!1086 = !DILocation(line: 186, column: 10, scope: !1069)
!1087 = !DILocation(line: 186, column: 14, scope: !1069)
!1088 = !DILocation(line: 187, column: 1, scope: !1069)
!1089 = distinct !DISubprogram(name: "ff_vmafmotion_uninit", scope: !787, file: !787, line: 289, type: !1090, isLocal: false, isDefinition: true, scopeLine: 290, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !843)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!409, !810}
!1092 = !DILocalVariable(name: "s", arg: 1, scope: !1089, file: !787, line: 289, type: !810)
!1093 = !DILocation(line: 289, column: 45, scope: !1089)
!1094 = !DILocation(line: 291, column: 13, scope: !1089)
!1095 = !DILocation(line: 291, column: 16, scope: !1089)
!1096 = !DILocation(line: 291, column: 5, scope: !1089)
!1097 = !DILocation(line: 292, column: 13, scope: !1089)
!1098 = !DILocation(line: 292, column: 16, scope: !1089)
!1099 = !DILocation(line: 292, column: 5, scope: !1089)
!1100 = !DILocation(line: 293, column: 13, scope: !1089)
!1101 = !DILocation(line: 293, column: 16, scope: !1089)
!1102 = !DILocation(line: 293, column: 5, scope: !1089)
!1103 = !DILocation(line: 295, column: 12, scope: !1089)
!1104 = !DILocation(line: 295, column: 15, scope: !1089)
!1105 = !DILocation(line: 295, column: 25, scope: !1089)
!1106 = !DILocation(line: 295, column: 31, scope: !1107)
!1107 = !DILexicalBlockFile(scope: !1089, file: !787, discriminator: 1)
!1108 = !DILocation(line: 295, column: 34, scope: !1107)
!1109 = !DILocation(line: 295, column: 47, scope: !1107)
!1110 = !DILocation(line: 295, column: 50, scope: !1107)
!1111 = !DILocation(line: 295, column: 45, scope: !1107)
!1112 = !DILocation(line: 295, column: 12, scope: !1107)
!1113 = !DILocation(line: 295, column: 12, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1089, file: !787, discriminator: 2)
!1115 = !DILocation(line: 295, column: 12, scope: !1116)
!1116 = !DILexicalBlockFile(scope: !1089, file: !787, discriminator: 3)
!1117 = !DILocation(line: 295, column: 5, scope: !1116)
!1118 = distinct !DISubprogram(name: "init", scope: !787, file: !787, line: 305, type: !608, isLocal: true, isDefinition: true, scopeLine: 306, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !843)
!1119 = !DILocalVariable(name: "ctx", arg: 1, scope: !1118, file: !787, line: 305, type: !372)
!1120 = !DILocation(line: 305, column: 56, scope: !1118)
!1121 = !DILocalVariable(name: "s", scope: !1118, file: !787, line: 307, type: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "VMAFMotionContext", file: !787, line: 50, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VMAFMotionContext", file: !787, line: 45, size: 960, align: 64, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1182}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1124, file: !787, line: 46, baseType: !377, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !787, line: 47, baseType: !811, size: 768, align: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "stats_file", scope: !1124, file: !787, line: 48, baseType: !1129, size: 64, align: 64, offset: 832)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1131, line: 48, baseType: !1132)
!1131 = !DIFile(filename: "/usr/include/stdio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1133, line: 241, size: 1728, align: 64, elements: !1134)
!1133 = !DIFile(filename: "/usr/include/libio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1134 = !{!1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1155, !1156, !1157, !1158, !1161, !1162, !1163, !1167, !1170, !1172, !1173, !1174, !1175, !1176, !1177, !1178}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1132, file: !1133, line: 242, baseType: !399, size: 32, align: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1132, file: !1133, line: 247, baseType: !629, size: 64, align: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1132, file: !1133, line: 248, baseType: !629, size: 64, align: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1132, file: !1133, line: 249, baseType: !629, size: 64, align: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1132, file: !1133, line: 250, baseType: !629, size: 64, align: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1132, file: !1133, line: 251, baseType: !629, size: 64, align: 64, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1132, file: !1133, line: 252, baseType: !629, size: 64, align: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1132, file: !1133, line: 253, baseType: !629, size: 64, align: 64, offset: 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1132, file: !1133, line: 254, baseType: !629, size: 64, align: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1132, file: !1133, line: 256, baseType: !629, size: 64, align: 64, offset: 576)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1132, file: !1133, line: 257, baseType: !629, size: 64, align: 64, offset: 640)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1132, file: !1133, line: 258, baseType: !629, size: 64, align: 64, offset: 704)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1132, file: !1133, line: 260, baseType: !1148, size: 64, align: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1133, line: 156, size: 192, align: 64, elements: !1150)
!1150 = !{!1151, !1152, !1154}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !1149, file: !1133, line: 157, baseType: !1148, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "_sbuf", scope: !1149, file: !1133, line: 158, baseType: !1153, size: 64, align: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "_pos", scope: !1149, file: !1133, line: 162, baseType: !399, size: 32, align: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1132, file: !1133, line: 262, baseType: !1153, size: 64, align: 64, offset: 832)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1132, file: !1133, line: 264, baseType: !399, size: 32, align: 32, offset: 896)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1132, file: !1133, line: 268, baseType: !399, size: 32, align: 32, offset: 928)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1132, file: !1133, line: 270, baseType: !1159, size: 64, align: 64, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1160, line: 131, baseType: !407)
!1160 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1132, file: !1133, line: 274, baseType: !782, size: 16, align: 16, offset: 1024)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1132, file: !1133, line: 275, baseType: !572, size: 8, align: 8, offset: 1040)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1132, file: !1133, line: 276, baseType: !1164, size: 8, align: 8, offset: 1048)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 8, align: 8, elements: !1165)
!1165 = !{!1166}
!1166 = !DISubrange(count: 1)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1132, file: !1133, line: 280, baseType: !1168, size: 64, align: 64, offset: 1088)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1133, line: 150, baseType: null)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1132, file: !1133, line: 289, baseType: !1171, size: 64, align: 64, offset: 1152)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1160, line: 132, baseType: !407)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !1132, file: !1133, line: 297, baseType: !390, size: 64, align: 64, offset: 1216)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !1132, file: !1133, line: 298, baseType: !390, size: 64, align: 64, offset: 1280)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !1132, file: !1133, line: 299, baseType: !390, size: 64, align: 64, offset: 1344)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !1132, file: !1133, line: 300, baseType: !390, size: 64, align: 64, offset: 1408)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !1132, file: !1133, line: 302, baseType: !579, size: 64, align: 64, offset: 1472)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1132, file: !1133, line: 303, baseType: !399, size: 32, align: 32, offset: 1536)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1132, file: !1133, line: 305, baseType: !1179, size: 160, align: 8, offset: 1568)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 160, align: 8, elements: !1180)
!1180 = !{!1181}
!1181 = !DISubrange(count: 20)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "stats_file_str", scope: !1124, file: !787, line: 49, baseType: !629, size: 64, align: 64, offset: 896)
!1183 = !DILocation(line: 307, column: 24, scope: !1118)
!1184 = !DILocation(line: 307, column: 28, scope: !1118)
!1185 = !DILocation(line: 307, column: 33, scope: !1118)
!1186 = !DILocation(line: 309, column: 9, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1118, file: !787, line: 309, column: 9)
!1188 = !DILocation(line: 309, column: 12, scope: !1187)
!1189 = !DILocation(line: 309, column: 9, scope: !1118)
!1190 = !DILocation(line: 310, column: 21, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1192, file: !787, line: 310, column: 13)
!1192 = distinct !DILexicalBlock(scope: !1187, file: !787, line: 309, column: 28)
!1193 = !DILocation(line: 310, column: 24, scope: !1191)
!1194 = !DILocation(line: 310, column: 14, scope: !1191)
!1195 = !DILocation(line: 310, column: 13, scope: !1192)
!1196 = !DILocation(line: 311, column: 28, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1191, file: !787, line: 310, column: 46)
!1198 = !DILocation(line: 311, column: 13, scope: !1197)
!1199 = !DILocation(line: 311, column: 16, scope: !1197)
!1200 = !DILocation(line: 311, column: 27, scope: !1197)
!1201 = !DILocation(line: 312, column: 9, scope: !1197)
!1202 = !DILocation(line: 313, column: 35, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1191, file: !787, line: 312, column: 16)
!1204 = !DILocation(line: 313, column: 38, scope: !1203)
!1205 = !DILocation(line: 313, column: 29, scope: !1203)
!1206 = !DILocation(line: 313, column: 13, scope: !1203)
!1207 = !DILocation(line: 313, column: 16, scope: !1203)
!1208 = !DILocation(line: 313, column: 27, scope: !1203)
!1209 = !DILocation(line: 314, column: 18, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1203, file: !787, line: 314, column: 17)
!1211 = !DILocation(line: 314, column: 21, scope: !1210)
!1212 = !DILocation(line: 314, column: 17, scope: !1203)
!1213 = !DILocalVariable(name: "err", scope: !1214, file: !787, line: 315, type: !399)
!1214 = distinct !DILexicalBlock(scope: !1210, file: !787, line: 314, column: 33)
!1215 = !DILocation(line: 315, column: 21, scope: !1214)
!1216 = !DILocation(line: 315, column: 28, scope: !1214)
!1217 = !DILocation(line: 315, column: 27, scope: !1214)
!1218 = !DILocalVariable(name: "buf", scope: !1214, file: !787, line: 316, type: !1219)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 1024, align: 8, elements: !1220)
!1220 = !{!1221}
!1221 = !DISubrange(count: 128)
!1222 = !DILocation(line: 316, column: 22, scope: !1214)
!1223 = !DILocation(line: 317, column: 29, scope: !1214)
!1224 = !DILocation(line: 317, column: 34, scope: !1214)
!1225 = !DILocation(line: 317, column: 17, scope: !1214)
!1226 = !DILocation(line: 318, column: 24, scope: !1214)
!1227 = !DILocation(line: 319, column: 24, scope: !1214)
!1228 = !DILocation(line: 319, column: 27, scope: !1214)
!1229 = !DILocation(line: 319, column: 43, scope: !1214)
!1230 = !DILocation(line: 318, column: 17, scope: !1214)
!1231 = !DILocation(line: 320, column: 24, scope: !1214)
!1232 = !DILocation(line: 320, column: 17, scope: !1214)
!1233 = !DILocation(line: 323, column: 5, scope: !1192)
!1234 = !DILocation(line: 325, column: 5, scope: !1118)
!1235 = !DILocation(line: 326, column: 1, scope: !1118)
!1236 = distinct !DISubprogram(name: "uninit", scope: !787, file: !787, line: 328, type: !618, isLocal: true, isDefinition: true, scopeLine: 329, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !843)
!1237 = !DILocalVariable(name: "ctx", arg: 1, scope: !1236, file: !787, line: 328, type: !372)
!1238 = !DILocation(line: 328, column: 59, scope: !1236)
!1239 = !DILocalVariable(name: "s", scope: !1236, file: !787, line: 330, type: !1122)
!1240 = !DILocation(line: 330, column: 24, scope: !1236)
!1241 = !DILocation(line: 330, column: 28, scope: !1236)
!1242 = !DILocation(line: 330, column: 33, scope: !1236)
