; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--qtpalette.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--qtpalette.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

@ff_qt_default_palette_2 = internal constant [6 x i8] c"\FF\FF\FF\00\00\00", align 1
@ff_qt_default_palette_4 = internal constant [12 x i8] c"\FF\FF\FF\AC\AC\ACUUU\00\00\00", align 1
@ff_qt_default_palette_16 = internal constant [48 x i8] c"\FF\FF\FF\FC\F3\05\FFd\02\DD\08\06\F2\08\84F\00\A5\00\00\D4\02\AB\EA\1F\B7\14\00d\11V,\05\90q:\C0\C0\C0\80\80\80@@@\00\00\00", align 16

!462 = !DIEnumerator(name: "AV_CODEC_ID_JACOSUB", value: 96258)
!463 = !DIEnumerator(name: "AV_CODEC_ID_SAMI", value: 96259)
!464 = !DIEnumerator(name: "AV_CODEC_ID_REALTEXT", value: 96260)
!465 = !DIEnumerator(name: "AV_CODEC_ID_STL", value: 96261)
!466 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER1", value: 96262)
!467 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER", value: 96263)
!468 = !DIEnumerator(name: "AV_CODEC_ID_SUBRIP", value: 96264)
!469 = !DIEnumerator(name: "AV_CODEC_ID_WEBVTT", value: 96265)
!470 = !DIEnumerator(name: "AV_CODEC_ID_MPL2", value: 96266)
!471 = !DIEnumerator(name: "AV_CODEC_ID_VPLAYER", value: 96267)
!472 = !DIEnumerator(name: "AV_CODEC_ID_PJS", value: 96268)
!473 = !DIEnumerator(name: "AV_CODEC_ID_ASS", value: 96269)
!474 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_TEXT_SUBTITLE", value: 96270)
!475 = !DIEnumerator(name: "AV_CODEC_ID_TTML", value: 96271)
!476 = !DIEnumerator(name: "AV_CODEC_ID_ARIB_CAPTION", value: 96272)
!477 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_UNKNOWN", value: 98304)
!478 = !DIEnumerator(name: "AV_CODEC_ID_TTF", value: 98304)
!479 = !DIEnumerator(name: "AV_CODEC_ID_SCTE_35", value: 98305)
!480 = !DIEnumerator(name: "AV_CODEC_ID_BINTEXT", value: 100352)
!481 = !DIEnumerator(name: "AV_CODEC_ID_XBIN", value: 100353)
!482 = !DIEnumerator(name: "AV_CODEC_ID_IDF", value: 100354)
!483 = !DIEnumerator(name: "AV_CODEC_ID_OTF", value: 100355)
!484 = !DIEnumerator(name: "AV_CODEC_ID_SMPTE_KLV", value: 100356)
!485 = !DIEnumerator(name: "AV_CODEC_ID_DVD_NAV", value: 100357)
!486 = !DIEnumerator(name: "AV_CODEC_ID_TIMED_ID3", value: 100358)
!487 = !DIEnumerator(name: "AV_CODEC_ID_BIN_DATA", value: 100359)
!488 = !DIEnumerator(name: "AV_CODEC_ID_PROBE", value: 102400)
!489 = !DIEnumerator(name: "AV_CODEC_ID_MPEG2TS", value: 131072)
!490 = !DIEnumerator(name: "AV_CODEC_ID_MPEG4SYSTEMS", value: 131073)
!491 = !DIEnumerator(name: "AV_CODEC_ID_FFMETADATA", value: 135168)
!492 = !DIEnumerator(name: "AV_CODEC_ID_WRAPPED_AVFRAME", value: 135169)
!493 = !{!494, !503, !507, !511}
!494 = distinct !DIGlobalVariable(name: "ff_qt_default_palette_2", scope: !0, file: !495, line: 29, type: !496, isLocal: true, isDefinition: true, variable: [6 x i8]* @ff_qt_default_palette_2)
!495 = !DIFile(filename: "libavformat/qtpalette.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!496 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 48, align: 8, elements: !501)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !499, line: 48, baseType: !500)
!499 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!500 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!501 = !{!502}
!502 = !DISubrange(count: 6)
!503 = distinct !DIGlobalVariable(name: "ff_qt_default_palette_4", scope: !0, file: !495, line: 35, type: !504, isLocal: true, isDefinition: true, variable: [12 x i8]* @ff_qt_default_palette_4)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 96, align: 8, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 12)
!507 = distinct !DIGlobalVariable(name: "ff_qt_default_palette_16", scope: !0, file: !495, line: 43, type: !508, isLocal: true, isDefinition: true, variable: [48 x i8]* @ff_qt_default_palette_16)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 384, align: 8, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 48)
!511 = distinct !DIGlobalVariable(name: "ff_qt_default_palette_256", scope: !0, file: !495, line: 62, type: !512, isLocal: true, isDefinition: true, variable: [768 x i8]* @ff_qt_default_palette_256)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !497, size: 6144, align: 8, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 768)
!515 = !{i32 2, !"Dwarf Version", i32 4}
!516 = !{i32 2, !"Debug Info Version", i32 3}
!517 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!518 = distinct !DISubprogram(name: "ff_get_qtpalette", scope: !519, file: !519, line: 31, type: !520, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !638)
!519 = !DIFile(filename: "libavformat/qtpalette.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!520 = !DISubroutineType(types: !521)
!521 = !{!522, !522, !523, !636}
!522 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !526)
!526 = !{!527, !572, !574, !575, !576, !577, !578, !583, !584, !590, !591, !592, !593, !594, !596, !597, !603, !604, !608, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !626, !627, !628, !629, !633, !634, !635}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !525, file: !25, line: 174, baseType: !528, size: 64, align: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64, align: 64)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !532)
!532 = !{!533, !537, !542, !546, !547, !548, !549, !553, !559, !561, !565}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !531, file: !4, line: 72, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !531, file: !4, line: 78, baseType: !538, size: 64, align: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64, align: 64)
!539 = !DISubroutineType(types: !540)
!540 = !{!534, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !531, file: !4, line: 85, baseType: !543, size: 64, align: 64, offset: 128)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !531, file: !4, line: 93, baseType: !522, size: 32, align: 32, offset: 192)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !531, file: !4, line: 99, baseType: !522, size: 32, align: 32, offset: 224)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !531, file: !4, line: 108, baseType: !522, size: 32, align: 32, offset: 256)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !531, file: !4, line: 113, baseType: !550, size: 64, align: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DISubroutineType(types: !552)
!552 = !{!541, !541, !541}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !531, file: !4, line: 123, baseType: !554, size: 64, align: 64, offset: 384)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64, align: 64)
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !531, file: !4, line: 130, baseType: !560, size: 32, align: 32, offset: 448)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !531, file: !4, line: 136, baseType: !562, size: 64, align: 64, offset: 512)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{!560, !541}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !531, file: !4, line: 142, baseType: !566, size: 64, align: 64, offset: 576)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!522, !569, !541, !534, !522}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, align: 64)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !525, file: !25, line: 226, baseType: !573, size: 64, align: 64, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !525, file: !25, line: 227, baseType: !522, size: 32, align: 32, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !525, file: !25, line: 228, baseType: !573, size: 64, align: 64, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !525, file: !25, line: 229, baseType: !573, size: 64, align: 64, offset: 256)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !525, file: !25, line: 233, baseType: !541, size: 64, align: 64, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !525, file: !25, line: 235, baseType: !579, size: 64, align: 64, offset: 384)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64, align: 64)
!580 = !DISubroutineType(types: !581)
!581 = !{!522, !541, !582, !522}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !525, file: !25, line: 236, baseType: !579, size: 64, align: 64, offset: 448)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !525, file: !25, line: 237, baseType: !585, size: 64, align: 64, offset: 512)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{!588, !541, !588, !522}
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !499, line: 40, baseType: !589)
!589 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !525, file: !25, line: 238, baseType: !588, size: 64, align: 64, offset: 576)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !525, file: !25, line: 239, baseType: !522, size: 32, align: 32, offset: 640)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !525, file: !25, line: 240, baseType: !522, size: 32, align: 32, offset: 672)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !525, file: !25, line: 241, baseType: !522, size: 32, align: 32, offset: 704)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !525, file: !25, line: 242, baseType: !595, size: 64, align: 64, offset: 768)
!595 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !525, file: !25, line: 243, baseType: !573, size: 64, align: 64, offset: 832)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !525, file: !25, line: 244, baseType: !598, size: 64, align: 64, offset: 896)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64, align: 64)
!599 = !DISubroutineType(types: !600)
!600 = !{!595, !595, !601, !602}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!602 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !525, file: !25, line: 245, baseType: !522, size: 32, align: 32, offset: 960)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !525, file: !25, line: 249, baseType: !605, size: 64, align: 64, offset: 1024)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64, align: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!522, !541, !522}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !525, file: !25, line: 255, baseType: !609, size: 64, align: 64, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64, align: 64)
!610 = !DISubroutineType(types: !611)
!611 = !{!588, !541, !522, !588, !522}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !525, file: !25, line: 260, baseType: !522, size: 32, align: 32, offset: 1152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !525, file: !25, line: 266, baseType: !588, size: 64, align: 64, offset: 1216)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !525, file: !25, line: 273, baseType: !522, size: 32, align: 32, offset: 1280)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !525, file: !25, line: 279, baseType: !588, size: 64, align: 64, offset: 1344)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !525, file: !25, line: 285, baseType: !522, size: 32, align: 32, offset: 1408)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !525, file: !25, line: 291, baseType: !522, size: 32, align: 32, offset: 1440)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !525, file: !25, line: 298, baseType: !522, size: 32, align: 32, offset: 1472)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !525, file: !25, line: 304, baseType: !522, size: 32, align: 32, offset: 1504)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !525, file: !25, line: 309, baseType: !534, size: 64, align: 64, offset: 1536)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !525, file: !25, line: 314, baseType: !534, size: 64, align: 64, offset: 1600)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !525, file: !25, line: 319, baseType: !623, size: 64, align: 64, offset: 1664)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!522, !541, !582, !522, !24, !588}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !525, file: !25, line: 326, baseType: !522, size: 32, align: 32, offset: 1728)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !525, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !525, file: !25, line: 332, baseType: !588, size: 64, align: 64, offset: 1792)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !525, file: !25, line: 338, baseType: !630, size: 64, align: 64, offset: 1856)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DISubroutineType(types: !632)
!632 = !{!522, !541}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !525, file: !25, line: 340, baseType: !588, size: 64, align: 64, offset: 1920)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !525, file: !25, line: 346, baseType: !573, size: 64, align: 64, offset: 1984)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !525, file: !25, line: 351, baseType: !522, size: 32, align: 32, offset: 2048)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64, align: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !499, line: 51, baseType: !602)
!638 = !{}
!639 = !DILocalVariable(name: "codec_id", arg: 1, scope: !518, file: !519, line: 31, type: !522)
!640 = !DIExpression()
!641 = !DILocation(line: 31, column: 26, scope: !518)
!642 = !DILocalVariable(name: "pb", arg: 2, scope: !518, file: !519, line: 31, type: !523)
!643 = !DILocation(line: 31, column: 49, scope: !518)
!644 = !DILocalVariable(name: "palette", arg: 3, scope: !518, file: !519, line: 31, type: !636)
!645 = !DILocation(line: 31, column: 63, scope: !518)
!646 = !DILocalVariable(name: "tmp", scope: !518, file: !519, line: 33, type: !522)
!647 = !DILocation(line: 33, column: 9, scope: !518)
!648 = !DILocalVariable(name: "bit_depth", scope: !518, file: !519, line: 33, type: !522)
!649 = !DILocation(line: 33, column: 14, scope: !518)
!650 = !DILocalVariable(name: "color_table_id", scope: !518, file: !519, line: 33, type: !522)
!651 = !DILocation(line: 33, column: 25, scope: !518)
!652 = !DILocalVariable(name: "greyscale", scope: !518, file: !519, line: 33, type: !522)
!653 = !DILocation(line: 33, column: 41, scope: !518)
!654 = !DILocalVariable(name: "i", scope: !518, file: !519, line: 33, type: !522)
!655 = !DILocation(line: 33, column: 52, scope: !518)
!656 = !DILocation(line: 35, column: 15, scope: !518)
!657 = !DILocation(line: 35, column: 5, scope: !518)
!658 = !DILocation(line: 38, column: 21, scope: !518)
!659 = !DILocation(line: 38, column: 11, scope: !518)
!660 = !DILocation(line: 38, column: 9, scope: !518)
!661 = !DILocation(line: 39, column: 17, scope: !518)
!662 = !DILocation(line: 39, column: 21, scope: !518)
!663 = !DILocation(line: 39, column: 15, scope: !518)
!664 = !DILocation(line: 40, column: 17, scope: !518)
!665 = !DILocation(line: 40, column: 21, scope: !518)
!666 = !DILocation(line: 40, column: 15, scope: !518)
!667 = !DILocation(line: 43, column: 32, scope: !518)
!668 = !DILocation(line: 43, column: 22, scope: !518)
!669 = !DILocation(line: 43, column: 20, scope: !518)
!670 = !DILocation(line: 46, column: 9, scope: !671)
!671 = distinct !DILexicalBlock(scope: !518, file: !519, line: 46, column: 9)
!672 = !DILocation(line: 46, column: 19, scope: !671)
!673 = !DILocation(line: 46, column: 22, scope: !674)
!674 = !DILexicalBlockFile(scope: !671, file: !519, discriminator: 1)
!675 = !DILocation(line: 46, column: 31, scope: !674)
!676 = !DILocation(line: 46, column: 9, scope: !674)
!677 = !DILocation(line: 47, column: 9, scope: !671)
!678 = !DILocation(line: 50, column: 10, scope: !679)
!679 = distinct !DILexicalBlock(scope: !518, file: !519, line: 50, column: 9)
!680 = !DILocation(line: 50, column: 20, scope: !679)
!681 = !DILocation(line: 50, column: 25, scope: !679)
!682 = !DILocation(line: 50, column: 28, scope: !683)
!683 = !DILexicalBlockFile(scope: !679, file: !519, discriminator: 1)
!684 = !DILocation(line: 50, column: 38, scope: !683)
!685 = !DILocation(line: 50, column: 43, scope: !683)
!686 = !DILocation(line: 50, column: 46, scope: !687)
!687 = !DILexicalBlockFile(scope: !679, file: !519, discriminator: 2)
!688 = !DILocation(line: 50, column: 56, scope: !687)
!689 = !DILocation(line: 50, column: 61, scope: !687)
!690 = !DILocation(line: 50, column: 64, scope: !691)
!691 = !DILexicalBlockFile(scope: !679, file: !519, discriminator: 3)
!692 = !DILocation(line: 50, column: 74, scope: !691)
!693 = !DILocation(line: 50, column: 9, scope: !691)
!694 = !DILocalVariable(name: "color_count", scope: !695, file: !519, line: 51, type: !637)
!695 = distinct !DILexicalBlock(scope: !679, file: !519, line: 50, column: 81)
!696 = !DILocation(line: 51, column: 18, scope: !695)
!697 = !DILocalVariable(name: "color_start", scope: !695, file: !519, line: 51, type: !637)
