; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mss12.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mss12.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.Model = type { [257 x i16], [257 x i16], [257 x i8], i32, i32, i32 }
%struct.SliceContext = type { %struct.MSS12Context*, %struct.Model, %struct.Model, %struct.Model, %struct.Model, %struct.Model, %struct.PixContext, %struct.PixContext }
%struct.MSS12Context = type { %struct.AVCodecContext*, [256 x i32], i8*, i8*, i64, i8*, i64, i8*, i8*, i64, i32, i32, i32, i32, i32, i32, i32 }

!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ContextDirection", file: !888, line: 41, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/mss12.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893}
!890 = !DIEnumerator(name: "TOP_LEFT", value: 0)
!891 = !DIEnumerator(name: "TOP", value: 1)
!892 = !DIEnumerator(name: "TOP_RIGHT", value: 2)
!893 = !DIEnumerator(name: "LEFT", value: 3)
!894 = !{!895, !896, !897, !905, !909}
!895 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!896 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !900, line: 221, size: 32, align: 8, elements: !901)
!900 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!901 = !{!902}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !899, file: !900, line: 221, baseType: !903, size: 32, align: 32)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !904, line: 51, baseType: !896)
!904 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !904, line: 48, baseType: !908)
!908 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!910 = !{!911}
!911 = distinct !DIGlobalVariable(name: "sec_order_sizes", scope: !0, file: !888, line: 39, type: !912, isLocal: true, isDefinition: true, variable: [4 x i32]* @sec_order_sizes)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 128, align: 32, elements: !914)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!914 = !{!915}
!915 = !DISubrange(count: 4)
!916 = !{i32 2, !"Dwarf Version", i32 4}
!917 = !{i32 2, !"Debug Info Version", i32 3}
!918 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!919 = distinct !DISubprogram(name: "ff_mss12_model_update", scope: !888, file: !888, line: 95, type: !920, isLocal: false, isDefinition: true, scopeLine: 96, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !939)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !922, !895}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "Model", file: !924, line: 46, baseType: !925)
!924 = !DIFile(filename: "libavcodec/mss12.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Model", file: !924, line: 40, size: 10400, align: 32, elements: !926)
!926 = !{!927, !933, !934, !936, !937, !938}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "cum_prob", scope: !925, file: !924, line: 41, baseType: !928, size: 4112, align: 16)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 4112, align: 16, elements: !931)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !904, line: 37, baseType: !930)
!930 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!931 = !{!932}
!932 = !DISubrange(count: 257)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "weights", scope: !925, file: !924, line: 42, baseType: !928, size: 4112, align: 16, offset: 4112)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "idx2sym", scope: !925, file: !924, line: 43, baseType: !935, size: 2056, align: 8, offset: 8224)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 2056, align: 8, elements: !931)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !925, file: !924, line: 44, baseType: !895, size: 32, align: 32, offset: 10304)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "thr_weight", scope: !925, file: !924, line: 45, baseType: !895, size: 32, align: 32, offset: 10336)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !925, file: !924, line: 45, baseType: !895, size: 32, align: 32, offset: 10368)
!939 = !{}
!940 = !DILocalVariable(name: "m", arg: 1, scope: !919, file: !888, line: 95, type: !922)
!941 = !DIExpression()
!942 = !DILocation(line: 95, column: 35, scope: !919)
!943 = !DILocalVariable(name: "val", arg: 2, scope: !919, file: !888, line: 95, type: !895)
!944 = !DILocation(line: 95, column: 42, scope: !919)
!945 = !DILocalVariable(name: "i", scope: !919, file: !888, line: 97, type: !895)
!946 = !DILocation(line: 97, column: 9, scope: !919)
!947 = !DILocation(line: 99, column: 20, scope: !948)
!948 = distinct !DILexicalBlock(scope: !919, file: !888, line: 99, column: 9)
!949 = !DILocation(line: 99, column: 9, scope: !948)
!950 = !DILocation(line: 99, column: 12, scope: !948)
!951 = !DILocation(line: 99, column: 39, scope: !948)
!952 = !DILocation(line: 99, column: 43, scope: !948)
!953 = !DILocation(line: 99, column: 28, scope: !948)
!954 = !DILocation(line: 99, column: 31, scope: !948)
!955 = !DILocation(line: 99, column: 25, scope: !948)
!956 = !DILocation(line: 99, column: 9, scope: !919)
!957 = !DILocation(line: 100, column: 18, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !888, line: 100, column: 9)
!959 = distinct !DILexicalBlock(scope: !948, file: !888, line: 99, column: 49)
!960 = !DILocation(line: 100, column: 16, scope: !958)
!961 = !DILocation(line: 100, column: 14, scope: !958)
!962 = !DILocation(line: 100, column: 34, scope: !963)
!963 = !DILexicalBlockFile(scope: !964, file: !888, discriminator: 1)
!964 = distinct !DILexicalBlock(scope: !958, file: !888, line: 100, column: 9)
!965 = !DILocation(line: 100, column: 36, scope: !963)
!966 = !DILocation(line: 100, column: 23, scope: !963)
!967 = !DILocation(line: 100, column: 26, scope: !963)
!968 = !DILocation(line: 100, column: 55, scope: !963)
!969 = !DILocation(line: 100, column: 44, scope: !963)
!970 = !DILocation(line: 100, column: 47, scope: !963)
!971 = !DILocation(line: 100, column: 41, scope: !963)
!972 = !DILocation(line: 100, column: 9, scope: !963)
!973 = !DILocation(line: 100, column: 9, scope: !974)
!974 = !DILexicalBlockFile(scope: !958, file: !888, discriminator: 2)
!975 = !DILocation(line: 100, column: 62, scope: !976)
!976 = !DILexicalBlockFile(scope: !964, file: !888, discriminator: 3)
!977 = !DILocation(line: 100, column: 9, scope: !976)
!978 = distinct !{!978, !979}
!979 = !DILocation(line: 100, column: 9, scope: !959)
!980 = !DILocation(line: 101, column: 13, scope: !981)
!981 = distinct !DILexicalBlock(scope: !959, file: !888, line: 101, column: 13)
!982 = !DILocation(line: 101, column: 18, scope: !981)
!983 = !DILocation(line: 101, column: 15, scope: !981)
!984 = !DILocation(line: 101, column: 13, scope: !959)
!985 = !DILocalVariable(name: "sym1", scope: !986, file: !888, line: 102, type: !895)
!986 = distinct !DILexicalBlock(scope: !981, file: !888, line: 101, column: 23)
!987 = !DILocation(line: 102, column: 17, scope: !986)
!988 = !DILocalVariable(name: "sym2", scope: !986, file: !888, line: 102, type: !895)
!989 = !DILocation(line: 102, column: 23, scope: !986)
!990 = !DILocation(line: 104, column: 31, scope: !986)
!991 = !DILocation(line: 104, column: 20, scope: !986)
!992 = !DILocation(line: 104, column: 23, scope: !986)
!993 = !DILocation(line: 104, column: 18, scope: !986)
!994 = !DILocation(line: 105, column: 31, scope: !986)
!995 = !DILocation(line: 105, column: 20, scope: !986)
!996 = !DILocation(line: 105, column: 23, scope: !986)
!997 = !DILocation(line: 105, column: 18, scope: !986)
!998 = !DILocation(line: 107, column: 31, scope: !986)
!999 = !DILocation(line: 107, column: 24, scope: !986)
!1000 = !DILocation(line: 107, column: 13, scope: !986)
!1001 = !DILocation(line: 107, column: 16, scope: !986)
!1002 = !DILocation(line: 107, column: 29, scope: !986)
!1003 = !DILocation(line: 108, column: 29, scope: !986)
!1004 = !DILocation(line: 108, column: 24, scope: !986)
!1005 = !DILocation(line: 108, column: 13, scope: !986)
!1006 = !DILocation(line: 108, column: 16, scope: !986)
!1007 = !DILocation(line: 108, column: 27, scope: !986)
!1008 = !DILocation(line: 110, column: 19, scope: !986)
!1009 = !DILocation(line: 110, column: 17, scope: !986)
!1010 = !DILocation(line: 111, column: 9, scope: !986)
!1011 = !DILocation(line: 112, column: 5, scope: !959)
!1012 = !DILocation(line: 113, column: 16, scope: !919)
!1013 = !DILocation(line: 113, column: 5, scope: !919)
!1014 = !DILocation(line: 113, column: 8, scope: !919)
!1015 = !DILocation(line: 113, column: 20, scope: !919)
!1016 = !DILocation(line: 114, column: 14, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !919, file: !888, line: 114, column: 5)
!1018 = !DILocation(line: 114, column: 18, scope: !1017)
!1019 = !DILocation(line: 114, column: 12, scope: !1017)
!1020 = !DILocation(line: 114, column: 10, scope: !1017)
!1021 = !DILocation(line: 114, column: 23, scope: !1022)
!1022 = !DILexicalBlockFile(scope: !1023, file: !888, discriminator: 1)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !888, line: 114, column: 5)
!1024 = !DILocation(line: 114, column: 25, scope: !1022)
!1025 = !DILocation(line: 114, column: 5, scope: !1022)
!1026 = !DILocation(line: 115, column: 21, scope: !1023)
!1027 = !DILocation(line: 115, column: 9, scope: !1023)
!1028 = !DILocation(line: 115, column: 12, scope: !1023)
!1029 = !DILocation(line: 115, column: 23, scope: !1023)
!1030 = !DILocation(line: 114, column: 32, scope: !1031)
!1031 = !DILexicalBlockFile(scope: !1023, file: !888, discriminator: 2)
!1032 = !DILocation(line: 114, column: 5, scope: !1031)
!1033 = distinct !{!1033, !1034}
!1034 = !DILocation(line: 114, column: 5, scope: !919)
!1035 = !DILocation(line: 116, column: 27, scope: !919)
!1036 = !DILocation(line: 116, column: 5, scope: !919)
!1037 = !DILocation(line: 117, column: 1, scope: !919)
!1038 = distinct !DISubprogram(name: "model_rescale_weights", scope: !888, file: !888, line: 78, type: !1039, isLocal: true, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !939)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !922}
!1041 = !DILocalVariable(name: "m", arg: 1, scope: !1038, file: !888, line: 78, type: !922)
!1042 = !DILocation(line: 78, column: 42, scope: !1038)
!1043 = !DILocalVariable(name: "i", scope: !1038, file: !888, line: 80, type: !895)
!1044 = !DILocation(line: 80, column: 9, scope: !1038)
!1045 = !DILocalVariable(name: "cum_prob", scope: !1038, file: !888, line: 81, type: !895)
!1046 = !DILocation(line: 81, column: 9, scope: !1038)
!1047 = !DILocation(line: 83, column: 9, scope: !1048)
!1048 = distinct !DILexicalBlock(scope: !1038, file: !888, line: 83, column: 9)
!1049 = !DILocation(line: 83, column: 12, scope: !1048)
!1050 = !DILocation(line: 83, column: 23, scope: !1048)
!1051 = !DILocation(line: 83, column: 9, scope: !1038)
!1052 = !DILocation(line: 84, column: 45, scope: !1048)
!1053 = !DILocation(line: 84, column: 24, scope: !1048)
!1054 = !DILocation(line: 84, column: 9, scope: !1048)
!1055 = !DILocation(line: 84, column: 12, scope: !1048)
!1056 = !DILocation(line: 84, column: 22, scope: !1048)
!1057 = !DILocation(line: 85, column: 5, scope: !1038)
!1058 = !DILocation(line: 85, column: 12, scope: !1059)
!1059 = !DILexicalBlockFile(scope: !1038, file: !888, discriminator: 1)
!1060 = !DILocation(line: 85, column: 15, scope: !1059)
!1061 = !DILocation(line: 85, column: 29, scope: !1059)
!1062 = !DILocation(line: 85, column: 32, scope: !1059)
!1063 = !DILocation(line: 85, column: 27, scope: !1059)
!1064 = !DILocation(line: 85, column: 5, scope: !1059)
!1065 = !DILocation(line: 86, column: 18, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1038, file: !888, line: 85, column: 43)
!1067 = !DILocation(line: 87, column: 18, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1066, file: !888, line: 87, column: 9)
!1069 = !DILocation(line: 87, column: 21, scope: !1068)
!1070 = !DILocation(line: 87, column: 16, scope: !1068)
!1071 = !DILocation(line: 87, column: 14, scope: !1068)
!1072 = !DILocation(line: 87, column: 31, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1074, file: !888, discriminator: 1)
!1074 = distinct !DILexicalBlock(scope: !1068, file: !888, line: 87, column: 9)
!1075 = !DILocation(line: 87, column: 33, scope: !1073)
!1076 = !DILocation(line: 87, column: 9, scope: !1073)
!1077 = !DILocation(line: 88, column: 30, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1074, file: !888, line: 87, column: 44)
!1079 = !DILocation(line: 88, column: 25, scope: !1078)
!1080 = !DILocation(line: 88, column: 13, scope: !1078)
!1081 = !DILocation(line: 88, column: 16, scope: !1078)
!1082 = !DILocation(line: 88, column: 28, scope: !1078)
!1083 = !DILocation(line: 89, column: 41, scope: !1078)
!1084 = !DILocation(line: 89, column: 30, scope: !1078)
!1085 = !DILocation(line: 89, column: 33, scope: !1078)
!1086 = !DILocation(line: 89, column: 44, scope: !1078)
!1087 = !DILocation(line: 89, column: 49, scope: !1078)
!1088 = !DILocation(line: 89, column: 29, scope: !1078)
!1089 = !DILocation(line: 89, column: 24, scope: !1078)
!1090 = !DILocation(line: 89, column: 13, scope: !1078)
!1091 = !DILocation(line: 89, column: 16, scope: !1078)
!1092 = !DILocation(line: 89, column: 27, scope: !1078)
!1093 = !DILocation(line: 90, column: 36, scope: !1078)
!1094 = !DILocation(line: 90, column: 25, scope: !1078)
!1095 = !DILocation(line: 90, column: 28, scope: !1078)
!1096 = !DILocation(line: 90, column: 22, scope: !1078)
!1097 = !DILocation(line: 91, column: 9, scope: !1078)
!1098 = !DILocation(line: 87, column: 40, scope: !1099)
!1099 = !DILexicalBlockFile(scope: !1074, file: !888, discriminator: 2)
!1100 = !DILocation(line: 87, column: 9, scope: !1099)
!1101 = distinct !{!1101, !1102}
!1102 = !DILocation(line: 87, column: 9, scope: !1066)
!1103 = !DILocation(line: 85, column: 5, scope: !1104)
!1104 = !DILexicalBlockFile(scope: !1038, file: !888, discriminator: 2)
!1105 = distinct !{!1105, !1057}
!1106 = !DILocation(line: 93, column: 1, scope: !1038)
!1107 = distinct !DISubprogram(name: "ff_mss12_slicecontext_reset", scope: !888, file: !888, line: 429, type: !1108, isLocal: false, isDefinition: true, scopeLine: 430, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !939)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{null, !1110}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "SliceContext", file: !924, line: 73, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SliceContext", file: !924, line: 68, size: 1342080, align: 64, elements: !1113)
!1113 = !{!1114, !1728, !1729, !1730, !1731, !1732, !1733, !1750}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1112, file: !924, line: 69, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MSS12Context", file: !924, line: 75, size: 9024, align: 64, elements: !1117)
!1117 = !{!1118, !1708, !1712, !1713, !1714, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1116, file: !924, line: 76, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1122)
!1122 = !{!1123, !1168, !1169, !1170, !1433, !1434, !1435, !1436, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1462, !1466, !1467, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1646, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1121, file: !35, line: 1561, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1128)
!1128 = !{!1129, !1133, !1138, !1142, !1143, !1144, !1145, !1149, !1155, !1157, !1161}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1127, file: !4, line: 72, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1132 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1127, file: !4, line: 78, baseType: !1134, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!1130, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1127, file: !4, line: 85, baseType: !1139, size: 64, align: 64, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1141 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1127, file: !4, line: 93, baseType: !895, size: 32, align: 32, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1127, file: !4, line: 99, baseType: !895, size: 32, align: 32, offset: 224)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1127, file: !4, line: 108, baseType: !895, size: 32, align: 32, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1127, file: !4, line: 113, baseType: !1146, size: 64, align: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!1137, !1137, !1137}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1127, file: !4, line: 123, baseType: !1150, size: 64, align: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{!1153, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1127, file: !4, line: 130, baseType: !1156, size: 32, align: 32, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1127, file: !4, line: 136, baseType: !1158, size: 64, align: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!1156, !1137}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1127, file: !4, line: 142, baseType: !1162, size: 64, align: 64, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!895, !1165, !1137, !1130, !895}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1121, file: !35, line: 1562, baseType: !895, size: 32, align: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1121, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1121, file: !35, line: 1565, baseType: !1171, size: 64, align: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1174)
!1174 = !{!1175, !1176, !1177, !1178, !1179, !1180, !1189, !1192, !1194, !1197, !1202, !1203, !1204, !1212, !1213, !1214, !1216, !1220, !1226, !1231, !1235, !1236, !1283, !1404, !1408, !1409, !1413, !1417, !1422, !1426, !1427, !1428}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1173, file: !35, line: 3475, baseType: !1130, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1173, file: !35, line: 3480, baseType: !1130, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1173, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1173, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1173, file: !35, line: 3487, baseType: !895, size: 32, align: 32, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1173, file: !35, line: 3488, baseType: !1181, size: 64, align: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1184, line: 61, baseType: !1185)
!1184 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1184, line: 58, size: 64, align: 32, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1185, file: !1184, line: 59, baseType: !895, size: 32, align: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1185, file: !1184, line: 60, baseType: !895, size: 32, align: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1173, file: !35, line: 3489, baseType: !1190, size: 64, align: 64, offset: 320)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1173, file: !35, line: 3490, baseType: !1193, size: 64, align: 64, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1173, file: !35, line: 3491, baseType: !1195, size: 64, align: 64, offset: 448)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1173, file: !35, line: 3492, baseType: !1198, size: 64, align: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !904, line: 55, baseType: !1201)
!1201 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1173, file: !35, line: 3493, baseType: !907, size: 8, align: 8, offset: 576)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1173, file: !35, line: 3494, baseType: !1124, size: 64, align: 64, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1173, file: !35, line: 3495, baseType: !1205, size: 64, align: 64, offset: 704)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1208, file: !35, line: 3402, baseType: !895, size: 32, align: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1208, file: !35, line: 3403, baseType: !1130, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1173, file: !35, line: 3507, baseType: !1130, size: 64, align: 64, offset: 768)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1173, file: !35, line: 3516, baseType: !895, size: 32, align: 32, offset: 832)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1173, file: !35, line: 3517, baseType: !1215, size: 64, align: 64, offset: 896)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1173, file: !35, line: 3527, baseType: !1217, size: 64, align: 64, offset: 960)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!895, !1119}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1173, file: !35, line: 3535, baseType: !1221, size: 64, align: 64, offset: 1024)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!895, !1119, !1224}
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1173, file: !35, line: 3541, baseType: !1227, size: 64, align: 64, offset: 1088)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1230)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1173, file: !35, line: 3549, baseType: !1232, size: 64, align: 64, offset: 1152)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{null, !1215}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1173, file: !35, line: 3551, baseType: !1217, size: 64, align: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1173, file: !35, line: 3552, baseType: !1237, size: 64, align: 64, offset: 1280)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!895, !1119, !909, !895, !1240}
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1243)
!1243 = !{!1244, !1247, !1248, !1249, !1250, !1280}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1242, file: !35, line: 3921, baseType: !1245, size: 16, align: 16)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !904, line: 49, baseType: !1246)
!1246 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1242, file: !35, line: 3922, baseType: !903, size: 32, align: 32, offset: 32)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1242, file: !35, line: 3923, baseType: !903, size: 32, align: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1242, file: !35, line: 3924, baseType: !896, size: 32, align: 32, offset: 96)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1242, file: !35, line: 3925, baseType: !1251, size: 64, align: 64, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1255)
!1255 = !{!1256, !1257, !1258, !1259, !1260, !1261, !1271, !1273, !1275, !1276, !1278, !1279}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1254, file: !35, line: 3886, baseType: !895, size: 32, align: 32)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1254, file: !35, line: 3887, baseType: !895, size: 32, align: 32, offset: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1254, file: !35, line: 3888, baseType: !895, size: 32, align: 32, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1254, file: !35, line: 3889, baseType: !895, size: 32, align: 32, offset: 96)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1254, file: !35, line: 3890, baseType: !895, size: 32, align: 32, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1254, file: !35, line: 3897, baseType: !1262, size: 768, align: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1264)
!1264 = !{!1265, !1269}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1263, file: !35, line: 3855, baseType: !1266, size: 512, align: 64)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 512, align: 64, elements: !1267)
!1267 = !{!1268}
!1268 = !DISubrange(count: 8)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1263, file: !35, line: 3857, baseType: !1270, size: 256, align: 32, offset: 512)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 256, align: 32, elements: !1267)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1254, file: !35, line: 3903, baseType: !1272, size: 256, align: 64, offset: 960)
!1272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 256, align: 64, elements: !914)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1254, file: !35, line: 3904, baseType: !1274, size: 128, align: 32, offset: 1216)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, align: 32, elements: !914)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1254, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1254, file: !35, line: 3908, baseType: !1277, size: 64, align: 64, offset: 1408)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1254, file: !35, line: 3915, baseType: !1277, size: 64, align: 64, offset: 1472)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1254, file: !35, line: 3917, baseType: !895, size: 32, align: 32, offset: 1536)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1242, file: !35, line: 3926, baseType: !1281, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !904, line: 40, baseType: !1282)
!1282 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1173, file: !35, line: 3564, baseType: !1284, size: 64, align: 64, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!895, !1119, !1287, !1321, !1403}
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1290)
!1290 = !{!1291, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1317, !1318, !1319, !1320}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1289, file: !35, line: 1451, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1294, line: 94, baseType: !1295)
!1294 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1294, line: 81, size: 192, align: 64, elements: !1296)
!1296 = !{!1297, !1301, !1302}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1295, file: !1294, line: 82, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1294, line: 73, baseType: !1300)
!1300 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1294, line: 73, flags: DIFlagFwdDecl)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1295, file: !1294, line: 89, baseType: !909, size: 64, align: 64, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1295, file: !1294, line: 93, baseType: !895, size: 32, align: 32, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1289, file: !35, line: 1461, baseType: !1281, size: 64, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1289, file: !35, line: 1467, baseType: !1281, size: 64, align: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1289, file: !35, line: 1468, baseType: !909, size: 64, align: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1289, file: !35, line: 1469, baseType: !895, size: 32, align: 32, offset: 256)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1289, file: !35, line: 1470, baseType: !895, size: 32, align: 32, offset: 288)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1289, file: !35, line: 1474, baseType: !895, size: 32, align: 32, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1289, file: !35, line: 1479, baseType: !1310, size: 64, align: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1313)
!1313 = !{!1314, !1315, !1316}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1312, file: !35, line: 1412, baseType: !909, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1312, file: !35, line: 1413, baseType: !895, size: 32, align: 32, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1312, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1289, file: !35, line: 1480, baseType: !895, size: 32, align: 32, offset: 448)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1289, file: !35, line: 1486, baseType: !1281, size: 64, align: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1289, file: !35, line: 1488, baseType: !1281, size: 64, align: 64, offset: 576)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1289, file: !35, line: 1497, baseType: !1281, size: 64, align: 64, offset: 640)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1323)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1325)
!1325 = !{!1326, !1327, !1328, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1355, !1357, !1358, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1391, !1392, !1393, !1394, !1395, !1396, !1399, !1400, !1401, !1402}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1324, file: !758, line: 282, baseType: !1266, size: 512, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1324, file: !758, line: 299, baseType: !1270, size: 256, align: 32, offset: 512)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1324, file: !758, line: 315, baseType: !1329, size: 64, align: 64, offset: 768)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1324, file: !758, line: 326, baseType: !895, size: 32, align: 32, offset: 832)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1324, file: !758, line: 326, baseType: !895, size: 32, align: 32, offset: 864)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1324, file: !758, line: 334, baseType: !895, size: 32, align: 32, offset: 896)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1324, file: !758, line: 341, baseType: !895, size: 32, align: 32, offset: 928)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1324, file: !758, line: 346, baseType: !895, size: 32, align: 32, offset: 960)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1324, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1324, file: !758, line: 356, baseType: !1183, size: 64, align: 32, offset: 1024)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1324, file: !758, line: 361, baseType: !1281, size: 64, align: 64, offset: 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1324, file: !758, line: 369, baseType: !1281, size: 64, align: 64, offset: 1152)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1324, file: !758, line: 377, baseType: !1281, size: 64, align: 64, offset: 1216)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1324, file: !758, line: 382, baseType: !895, size: 32, align: 32, offset: 1280)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1324, file: !758, line: 386, baseType: !895, size: 32, align: 32, offset: 1312)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1324, file: !758, line: 391, baseType: !895, size: 32, align: 32, offset: 1344)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1324, file: !758, line: 396, baseType: !1137, size: 64, align: 64, offset: 1408)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1324, file: !758, line: 403, baseType: !1345, size: 512, align: 64, offset: 1472)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 512, align: 64, elements: !1267)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1324, file: !758, line: 410, baseType: !895, size: 32, align: 32, offset: 1984)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1324, file: !758, line: 415, baseType: !895, size: 32, align: 32, offset: 2016)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1324, file: !758, line: 420, baseType: !895, size: 32, align: 32, offset: 2048)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1324, file: !758, line: 425, baseType: !895, size: 32, align: 32, offset: 2080)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1324, file: !758, line: 435, baseType: !1281, size: 64, align: 64, offset: 2112)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1324, file: !758, line: 440, baseType: !895, size: 32, align: 32, offset: 2176)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1324, file: !758, line: 445, baseType: !1200, size: 64, align: 64, offset: 2240)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1324, file: !758, line: 459, baseType: !1354, size: 512, align: 64, offset: 2304)
!1354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1292, size: 512, align: 64, elements: !1267)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1324, file: !758, line: 473, baseType: !1356, size: 64, align: 64, offset: 2816)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1324, file: !758, line: 477, baseType: !895, size: 32, align: 32, offset: 2880)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1324, file: !758, line: 479, baseType: !1359, size: 64, align: 64, offset: 2944)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1372}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1362, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1362, file: !758, line: 203, baseType: !909, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1362, file: !758, line: 204, baseType: !895, size: 32, align: 32, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1362, file: !758, line: 205, baseType: !1368, size: 64, align: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1370, line: 86, baseType: !1371)
!1370 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1370, line: 86, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1362, file: !758, line: 206, baseType: !1292, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1324, file: !758, line: 480, baseType: !895, size: 32, align: 32, offset: 3008)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1324, file: !758, line: 505, baseType: !895, size: 32, align: 32, offset: 3040)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1324, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1324, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1324, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1324, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1324, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1324, file: !758, line: 532, baseType: !1281, size: 64, align: 64, offset: 3264)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1324, file: !758, line: 539, baseType: !1281, size: 64, align: 64, offset: 3328)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1324, file: !758, line: 547, baseType: !1281, size: 64, align: 64, offset: 3392)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1324, file: !758, line: 554, baseType: !1368, size: 64, align: 64, offset: 3456)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1324, file: !758, line: 563, baseType: !895, size: 32, align: 32, offset: 3520)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1324, file: !758, line: 572, baseType: !895, size: 32, align: 32, offset: 3552)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1324, file: !758, line: 581, baseType: !895, size: 32, align: 32, offset: 3584)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1324, file: !758, line: 588, baseType: !1388, size: 64, align: 64, offset: 3648)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !904, line: 36, baseType: !1390)
!1390 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1324, file: !758, line: 593, baseType: !895, size: 32, align: 32, offset: 3712)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1324, file: !758, line: 596, baseType: !895, size: 32, align: 32, offset: 3744)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1324, file: !758, line: 599, baseType: !1292, size: 64, align: 64, offset: 3776)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1324, file: !758, line: 605, baseType: !1292, size: 64, align: 64, offset: 3840)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1324, file: !758, line: 616, baseType: !1292, size: 64, align: 64, offset: 3904)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1324, file: !758, line: 626, baseType: !1397, size: 64, align: 64, offset: 3968)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1398, line: 216, baseType: !1201)
!1398 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1324, file: !758, line: 627, baseType: !1397, size: 64, align: 64, offset: 4032)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1324, file: !758, line: 628, baseType: !1397, size: 64, align: 64, offset: 4096)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1324, file: !758, line: 629, baseType: !1397, size: 64, align: 64, offset: 4160)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1324, file: !758, line: 645, baseType: !1292, size: 64, align: 64, offset: 4224)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1173, file: !35, line: 3566, baseType: !1405, size: 64, align: 64, offset: 1408)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!895, !1119, !1137, !1403, !1287}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1173, file: !35, line: 3567, baseType: !1217, size: 64, align: 64, offset: 1472)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1173, file: !35, line: 3576, baseType: !1410, size: 64, align: 64, offset: 1536)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{!895, !1119, !1321}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1173, file: !35, line: 3577, baseType: !1414, size: 64, align: 64, offset: 1600)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!895, !1119, !1287}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1173, file: !35, line: 3584, baseType: !1418, size: 64, align: 64, offset: 1664)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!895, !1119, !1421}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1173, file: !35, line: 3589, baseType: !1423, size: 64, align: 64, offset: 1728)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{null, !1119}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1173, file: !35, line: 3594, baseType: !895, size: 32, align: 32, offset: 1792)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1173, file: !35, line: 3600, baseType: !1130, size: 64, align: 64, offset: 1856)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1173, file: !35, line: 3609, baseType: !1429, size: 64, align: 64, offset: 1920)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1432)
!1432 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1121, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1121, file: !35, line: 1581, baseType: !896, size: 32, align: 32, offset: 224)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1121, file: !35, line: 1583, baseType: !1137, size: 64, align: 64, offset: 256)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1121, file: !35, line: 1591, baseType: !1437, size: 64, align: 64, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1121, file: !35, line: 1598, baseType: !1137, size: 64, align: 64, offset: 384)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1121, file: !35, line: 1606, baseType: !1281, size: 64, align: 64, offset: 448)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1121, file: !35, line: 1614, baseType: !895, size: 32, align: 32, offset: 512)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1121, file: !35, line: 1622, baseType: !895, size: 32, align: 32, offset: 544)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1121, file: !35, line: 1628, baseType: !895, size: 32, align: 32, offset: 576)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1121, file: !35, line: 1636, baseType: !895, size: 32, align: 32, offset: 608)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1121, file: !35, line: 1643, baseType: !895, size: 32, align: 32, offset: 640)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1121, file: !35, line: 1657, baseType: !909, size: 64, align: 64, offset: 704)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1121, file: !35, line: 1658, baseType: !895, size: 32, align: 32, offset: 768)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1121, file: !35, line: 1679, baseType: !1183, size: 64, align: 32, offset: 800)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1121, file: !35, line: 1688, baseType: !895, size: 32, align: 32, offset: 864)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1121, file: !35, line: 1712, baseType: !895, size: 32, align: 32, offset: 896)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1121, file: !35, line: 1729, baseType: !895, size: 32, align: 32, offset: 928)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1121, file: !35, line: 1729, baseType: !895, size: 32, align: 32, offset: 960)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1121, file: !35, line: 1744, baseType: !895, size: 32, align: 32, offset: 992)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1121, file: !35, line: 1744, baseType: !895, size: 32, align: 32, offset: 1024)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1121, file: !35, line: 1751, baseType: !895, size: 32, align: 32, offset: 1056)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1121, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1121, file: !35, line: 1791, baseType: !1458, size: 64, align: 64, offset: 1152)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{null, !1461, !1321, !1403, !895, !895, !895}
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1121, file: !35, line: 1808, baseType: !1463, size: 64, align: 64, offset: 1216)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DISubroutineType(types: !1465)
!1465 = !{!494, !1461, !1190}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1121, file: !35, line: 1816, baseType: !895, size: 32, align: 32, offset: 1280)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1121, file: !35, line: 1825, baseType: !1468, size: 32, align: 32, offset: 1312)
!1468 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1121, file: !35, line: 1830, baseType: !895, size: 32, align: 32, offset: 1344)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1121, file: !35, line: 1838, baseType: !1468, size: 32, align: 32, offset: 1376)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1121, file: !35, line: 1846, baseType: !895, size: 32, align: 32, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1121, file: !35, line: 1851, baseType: !895, size: 32, align: 32, offset: 1440)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1121, file: !35, line: 1861, baseType: !1468, size: 32, align: 32, offset: 1472)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1121, file: !35, line: 1868, baseType: !1468, size: 32, align: 32, offset: 1504)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1121, file: !35, line: 1875, baseType: !1468, size: 32, align: 32, offset: 1536)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1121, file: !35, line: 1882, baseType: !1468, size: 32, align: 32, offset: 1568)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1121, file: !35, line: 1889, baseType: !1468, size: 32, align: 32, offset: 1600)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1121, file: !35, line: 1896, baseType: !1468, size: 32, align: 32, offset: 1632)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1121, file: !35, line: 1903, baseType: !1468, size: 32, align: 32, offset: 1664)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1121, file: !35, line: 1910, baseType: !895, size: 32, align: 32, offset: 1696)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1121, file: !35, line: 1915, baseType: !895, size: 32, align: 32, offset: 1728)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1121, file: !35, line: 1926, baseType: !1403, size: 64, align: 64, offset: 1792)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1121, file: !35, line: 1935, baseType: !1183, size: 64, align: 32, offset: 1856)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1121, file: !35, line: 1942, baseType: !895, size: 32, align: 32, offset: 1920)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1121, file: !35, line: 1948, baseType: !895, size: 32, align: 32, offset: 1952)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1121, file: !35, line: 1954, baseType: !895, size: 32, align: 32, offset: 1984)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1121, file: !35, line: 1960, baseType: !895, size: 32, align: 32, offset: 2016)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1121, file: !35, line: 1984, baseType: !895, size: 32, align: 32, offset: 2048)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1121, file: !35, line: 1991, baseType: !895, size: 32, align: 32, offset: 2080)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1121, file: !35, line: 1996, baseType: !895, size: 32, align: 32, offset: 2112)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1121, file: !35, line: 2004, baseType: !895, size: 32, align: 32, offset: 2144)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1121, file: !35, line: 2011, baseType: !895, size: 32, align: 32, offset: 2176)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1121, file: !35, line: 2018, baseType: !895, size: 32, align: 32, offset: 2208)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1121, file: !35, line: 2027, baseType: !895, size: 32, align: 32, offset: 2240)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1121, file: !35, line: 2034, baseType: !895, size: 32, align: 32, offset: 2272)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1121, file: !35, line: 2044, baseType: !895, size: 32, align: 32, offset: 2304)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1121, file: !35, line: 2054, baseType: !1498, size: 64, align: 64, offset: 2368)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1121, file: !35, line: 2061, baseType: !1498, size: 64, align: 64, offset: 2432)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1121, file: !35, line: 2066, baseType: !895, size: 32, align: 32, offset: 2496)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1121, file: !35, line: 2070, baseType: !895, size: 32, align: 32, offset: 2528)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1121, file: !35, line: 2078, baseType: !895, size: 32, align: 32, offset: 2560)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1121, file: !35, line: 2085, baseType: !895, size: 32, align: 32, offset: 2592)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1121, file: !35, line: 2092, baseType: !895, size: 32, align: 32, offset: 2624)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1121, file: !35, line: 2099, baseType: !895, size: 32, align: 32, offset: 2656)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1121, file: !35, line: 2106, baseType: !895, size: 32, align: 32, offset: 2688)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1121, file: !35, line: 2113, baseType: !895, size: 32, align: 32, offset: 2720)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1121, file: !35, line: 2120, baseType: !895, size: 32, align: 32, offset: 2752)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1121, file: !35, line: 2125, baseType: !895, size: 32, align: 32, offset: 2784)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1121, file: !35, line: 2133, baseType: !895, size: 32, align: 32, offset: 2816)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1121, file: !35, line: 2140, baseType: !895, size: 32, align: 32, offset: 2848)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1121, file: !35, line: 2145, baseType: !895, size: 32, align: 32, offset: 2880)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1121, file: !35, line: 2153, baseType: !895, size: 32, align: 32, offset: 2912)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1121, file: !35, line: 2158, baseType: !895, size: 32, align: 32, offset: 2944)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1121, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1121, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1121, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1121, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1121, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1121, file: !35, line: 2203, baseType: !895, size: 32, align: 32, offset: 3136)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1121, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1121, file: !35, line: 2212, baseType: !895, size: 32, align: 32, offset: 3200)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1121, file: !35, line: 2213, baseType: !895, size: 32, align: 32, offset: 3232)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1121, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1121, file: !35, line: 2232, baseType: !895, size: 32, align: 32, offset: 3296)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1121, file: !35, line: 2243, baseType: !895, size: 32, align: 32, offset: 3328)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1121, file: !35, line: 2249, baseType: !895, size: 32, align: 32, offset: 3360)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1121, file: !35, line: 2256, baseType: !895, size: 32, align: 32, offset: 3392)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1121, file: !35, line: 2263, baseType: !1200, size: 64, align: 64, offset: 3456)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1121, file: !35, line: 2270, baseType: !1200, size: 64, align: 64, offset: 3520)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1121, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1121, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1121, file: !35, line: 2367, baseType: !1534, size: 64, align: 64, offset: 3648)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!895, !1461, !1421, !895}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1121, file: !35, line: 2383, baseType: !895, size: 32, align: 32, offset: 3712)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1121, file: !35, line: 2386, baseType: !1468, size: 32, align: 32, offset: 3744)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1121, file: !35, line: 2387, baseType: !1468, size: 32, align: 32, offset: 3776)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1121, file: !35, line: 2394, baseType: !895, size: 32, align: 32, offset: 3808)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1121, file: !35, line: 2401, baseType: !895, size: 32, align: 32, offset: 3840)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1121, file: !35, line: 2408, baseType: !895, size: 32, align: 32, offset: 3872)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1121, file: !35, line: 2415, baseType: !895, size: 32, align: 32, offset: 3904)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1121, file: !35, line: 2422, baseType: !895, size: 32, align: 32, offset: 3936)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1121, file: !35, line: 2423, baseType: !1546, size: 64, align: 64, offset: 3968)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1548, file: !35, line: 827, baseType: !895, size: 32, align: 32)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1548, file: !35, line: 828, baseType: !895, size: 32, align: 32, offset: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1548, file: !35, line: 829, baseType: !895, size: 32, align: 32, offset: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1548, file: !35, line: 830, baseType: !1468, size: 32, align: 32, offset: 96)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1121, file: !35, line: 2430, baseType: !1281, size: 64, align: 64, offset: 4032)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1121, file: !35, line: 2437, baseType: !1281, size: 64, align: 64, offset: 4096)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1121, file: !35, line: 2444, baseType: !1468, size: 32, align: 32, offset: 4160)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1121, file: !35, line: 2451, baseType: !1468, size: 32, align: 32, offset: 4192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1121, file: !35, line: 2458, baseType: !895, size: 32, align: 32, offset: 4224)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1121, file: !35, line: 2469, baseType: !895, size: 32, align: 32, offset: 4256)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1121, file: !35, line: 2475, baseType: !895, size: 32, align: 32, offset: 4288)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1121, file: !35, line: 2481, baseType: !895, size: 32, align: 32, offset: 4320)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1121, file: !35, line: 2485, baseType: !895, size: 32, align: 32, offset: 4352)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1121, file: !35, line: 2489, baseType: !895, size: 32, align: 32, offset: 4384)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1121, file: !35, line: 2493, baseType: !895, size: 32, align: 32, offset: 4416)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1121, file: !35, line: 2501, baseType: !895, size: 32, align: 32, offset: 4448)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1121, file: !35, line: 2506, baseType: !895, size: 32, align: 32, offset: 4480)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1121, file: !35, line: 2510, baseType: !895, size: 32, align: 32, offset: 4512)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1121, file: !35, line: 2514, baseType: !1281, size: 64, align: 64, offset: 4544)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1121, file: !35, line: 2528, baseType: !1570, size: 64, align: 64, offset: 4608)
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{null, !1461, !1137, !895, !895}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1121, file: !35, line: 2534, baseType: !895, size: 32, align: 32, offset: 4672)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1121, file: !35, line: 2545, baseType: !895, size: 32, align: 32, offset: 4704)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1121, file: !35, line: 2547, baseType: !895, size: 32, align: 32, offset: 4736)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1121, file: !35, line: 2549, baseType: !895, size: 32, align: 32, offset: 4768)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1121, file: !35, line: 2551, baseType: !895, size: 32, align: 32, offset: 4800)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1121, file: !35, line: 2553, baseType: !895, size: 32, align: 32, offset: 4832)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1121, file: !35, line: 2555, baseType: !895, size: 32, align: 32, offset: 4864)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1121, file: !35, line: 2557, baseType: !895, size: 32, align: 32, offset: 4896)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1121, file: !35, line: 2559, baseType: !895, size: 32, align: 32, offset: 4928)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1121, file: !35, line: 2563, baseType: !895, size: 32, align: 32, offset: 4960)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1121, file: !35, line: 2571, baseType: !1277, size: 64, align: 64, offset: 4992)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1121, file: !35, line: 2579, baseType: !1277, size: 64, align: 64, offset: 5056)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1121, file: !35, line: 2586, baseType: !895, size: 32, align: 32, offset: 5120)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1121, file: !35, line: 2615, baseType: !895, size: 32, align: 32, offset: 5152)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1121, file: !35, line: 2627, baseType: !895, size: 32, align: 32, offset: 5184)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1121, file: !35, line: 2637, baseType: !895, size: 32, align: 32, offset: 5216)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1121, file: !35, line: 2681, baseType: !895, size: 32, align: 32, offset: 5248)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1121, file: !35, line: 2709, baseType: !1281, size: 64, align: 64, offset: 5312)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1121, file: !35, line: 2716, baseType: !1592, size: 64, align: 64, offset: 5376)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1595)
!1595 = !{!1596, !1597, !1598, !1599, !1600, !1601, !1602, !1606, !1610, !1611, !1612, !1613, !1619, !1620, !1621, !1622, !1623}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1594, file: !35, line: 3642, baseType: !1130, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1594, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1594, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1594, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1594, file: !35, line: 3669, baseType: !895, size: 32, align: 32, offset: 160)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1594, file: !35, line: 3682, baseType: !1418, size: 64, align: 64, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1594, file: !35, line: 3698, baseType: !1603, size: 64, align: 64, offset: 256)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!895, !1119, !905, !903}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1594, file: !35, line: 3712, baseType: !1607, size: 64, align: 64, offset: 320)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!895, !1119, !895, !905, !903}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1594, file: !35, line: 3726, baseType: !1603, size: 64, align: 64, offset: 384)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1594, file: !35, line: 3737, baseType: !1217, size: 64, align: 64, offset: 448)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1594, file: !35, line: 3746, baseType: !895, size: 32, align: 32, offset: 512)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1594, file: !35, line: 3757, baseType: !1614, size: 64, align: 64, offset: 576)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{null, !1617}
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1594, file: !35, line: 3766, baseType: !1217, size: 64, align: 64, offset: 640)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1594, file: !35, line: 3774, baseType: !1217, size: 64, align: 64, offset: 704)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1594, file: !35, line: 3780, baseType: !895, size: 32, align: 32, offset: 768)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1594, file: !35, line: 3785, baseType: !895, size: 32, align: 32, offset: 800)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1594, file: !35, line: 3795, baseType: !1624, size: 64, align: 64, offset: 832)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!895, !1119, !1292}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1121, file: !35, line: 2728, baseType: !1137, size: 64, align: 64, offset: 5440)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1121, file: !35, line: 2735, baseType: !1345, size: 512, align: 64, offset: 5504)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1121, file: !35, line: 2742, baseType: !895, size: 32, align: 32, offset: 6016)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1121, file: !35, line: 2755, baseType: !895, size: 32, align: 32, offset: 6048)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1121, file: !35, line: 2776, baseType: !895, size: 32, align: 32, offset: 6080)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1121, file: !35, line: 2783, baseType: !895, size: 32, align: 32, offset: 6112)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1121, file: !35, line: 2791, baseType: !895, size: 32, align: 32, offset: 6144)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1121, file: !35, line: 2802, baseType: !1421, size: 64, align: 64, offset: 6208)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1121, file: !35, line: 2811, baseType: !895, size: 32, align: 32, offset: 6272)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1121, file: !35, line: 2821, baseType: !895, size: 32, align: 32, offset: 6304)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1121, file: !35, line: 2830, baseType: !895, size: 32, align: 32, offset: 6336)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1121, file: !35, line: 2840, baseType: !895, size: 32, align: 32, offset: 6368)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1121, file: !35, line: 2851, baseType: !1640, size: 64, align: 64, offset: 6400)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!895, !1461, !1643, !1137, !1403, !895, !895}
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!895, !1461, !1137}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1121, file: !35, line: 2871, baseType: !1647, size: 64, align: 64, offset: 6464)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!895, !1461, !1650, !1137, !1403, !895}
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!895, !1461, !1137, !895, !895}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1121, file: !35, line: 2878, baseType: !895, size: 32, align: 32, offset: 6528)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1121, file: !35, line: 2885, baseType: !895, size: 32, align: 32, offset: 6560)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1121, file: !35, line: 3005, baseType: !895, size: 32, align: 32, offset: 6592)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1121, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1121, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1121, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1121, file: !35, line: 3037, baseType: !909, size: 64, align: 64, offset: 6720)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1121, file: !35, line: 3038, baseType: !895, size: 32, align: 32, offset: 6784)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1121, file: !35, line: 3050, baseType: !1200, size: 64, align: 64, offset: 6848)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1121, file: !35, line: 3065, baseType: !895, size: 32, align: 32, offset: 6912)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1121, file: !35, line: 3083, baseType: !895, size: 32, align: 32, offset: 6944)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1121, file: !35, line: 3092, baseType: !1183, size: 64, align: 32, offset: 6976)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1121, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1121, file: !35, line: 3106, baseType: !1183, size: 64, align: 32, offset: 7072)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1121, file: !35, line: 3113, baseType: !1668, size: 64, align: 64, offset: 7168)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1670)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1672)
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678, !1681}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1671, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1671, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1671, file: !35, line: 720, baseType: !1130, size: 64, align: 64, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1671, file: !35, line: 724, baseType: !1130, size: 64, align: 64, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1671, file: !35, line: 728, baseType: !895, size: 32, align: 32, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1671, file: !35, line: 734, baseType: !1679, size: 64, align: 64, offset: 256)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1671, file: !35, line: 739, baseType: !1682, size: 64, align: 64, offset: 320)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1208)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1121, file: !35, line: 3129, baseType: !1281, size: 64, align: 64, offset: 7232)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1121, file: !35, line: 3130, baseType: !1281, size: 64, align: 64, offset: 7296)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1121, file: !35, line: 3131, baseType: !1281, size: 64, align: 64, offset: 7360)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1121, file: !35, line: 3132, baseType: !1281, size: 64, align: 64, offset: 7424)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1121, file: !35, line: 3139, baseType: !1277, size: 64, align: 64, offset: 7488)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1121, file: !35, line: 3147, baseType: !895, size: 32, align: 32, offset: 7552)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1121, file: !35, line: 3165, baseType: !895, size: 32, align: 32, offset: 7584)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1121, file: !35, line: 3172, baseType: !895, size: 32, align: 32, offset: 7616)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1121, file: !35, line: 3180, baseType: !895, size: 32, align: 32, offset: 7648)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1121, file: !35, line: 3191, baseType: !1498, size: 64, align: 64, offset: 7680)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1121, file: !35, line: 3199, baseType: !909, size: 64, align: 64, offset: 7744)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1121, file: !35, line: 3207, baseType: !1277, size: 64, align: 64, offset: 7808)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1121, file: !35, line: 3214, baseType: !896, size: 32, align: 32, offset: 7872)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1121, file: !35, line: 3224, baseType: !1310, size: 64, align: 64, offset: 7936)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1121, file: !35, line: 3225, baseType: !895, size: 32, align: 32, offset: 8000)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1121, file: !35, line: 3249, baseType: !1292, size: 64, align: 64, offset: 8064)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1121, file: !35, line: 3256, baseType: !895, size: 32, align: 32, offset: 8128)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1121, file: !35, line: 3271, baseType: !895, size: 32, align: 32, offset: 8160)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1121, file: !35, line: 3279, baseType: !1281, size: 64, align: 64, offset: 8192)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1121, file: !35, line: 3301, baseType: !1292, size: 64, align: 64, offset: 8256)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1121, file: !35, line: 3310, baseType: !895, size: 32, align: 32, offset: 8320)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1121, file: !35, line: 3337, baseType: !895, size: 32, align: 32, offset: 8352)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1121, file: !35, line: 3351, baseType: !895, size: 32, align: 32, offset: 8384)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1121, file: !35, line: 3359, baseType: !895, size: 32, align: 32, offset: 8416)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pal", scope: !1116, file: !924, line: 77, baseType: !1709, size: 8192, align: 32, offset: 64)
!1709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 8192, align: 32, elements: !1710)
!1710 = !{!1711}
!1711 = !DISubrange(count: 256)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "pal_pic", scope: !1116, file: !924, line: 78, baseType: !909, size: 64, align: 64, offset: 8256)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "last_pal_pic", scope: !1116, file: !924, line: 79, baseType: !909, size: 64, align: 64, offset: 8320)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "pal_stride", scope: !1116, file: !924, line: 80, baseType: !1715, size: 64, align: 64, offset: 8384)
!1715 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1398, line: 149, baseType: !1282)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1116, file: !924, line: 81, baseType: !909, size: 64, align: 64, offset: 8448)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "mask_stride", scope: !1116, file: !924, line: 82, baseType: !1715, size: 64, align: 64, offset: 8512)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_pic", scope: !1116, file: !924, line: 83, baseType: !909, size: 64, align: 64, offset: 8576)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "last_rgb_pic", scope: !1116, file: !924, line: 84, baseType: !909, size: 64, align: 64, offset: 8640)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_stride", scope: !1116, file: !924, line: 85, baseType: !1715, size: 64, align: 64, offset: 8704)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "free_colours", scope: !1116, file: !924, line: 86, baseType: !895, size: 32, align: 32, offset: 8768)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "keyframe", scope: !1116, file: !924, line: 87, baseType: !895, size: 32, align: 32, offset: 8800)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "mvX", scope: !1116, file: !924, line: 88, baseType: !895, size: 32, align: 32, offset: 8832)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "mvY", scope: !1116, file: !924, line: 88, baseType: !895, size: 32, align: 32, offset: 8864)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "corrupted", scope: !1116, file: !924, line: 89, baseType: !895, size: 32, align: 32, offset: 8896)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "slice_split", scope: !1116, file: !924, line: 90, baseType: !895, size: 32, align: 32, offset: 8928)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "full_model_syms", scope: !1116, file: !924, line: 91, baseType: !895, size: 32, align: 32, offset: 8960)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "intra_region", scope: !1112, file: !924, line: 70, baseType: !923, size: 10400, align: 32, offset: 64)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "inter_region", scope: !1112, file: !924, line: 70, baseType: !923, size: 10400, align: 32, offset: 10464)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "pivot", scope: !1112, file: !924, line: 71, baseType: !923, size: 10400, align: 32, offset: 20864)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "edge_mode", scope: !1112, file: !924, line: 71, baseType: !923, size: 10400, align: 32, offset: 31264)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "split_mode", scope: !1112, file: !924, line: 71, baseType: !923, size: 10400, align: 32, offset: 41664)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "intra_pix_ctx", scope: !1112, file: !924, line: 72, baseType: !1734, size: 644992, align: 32, offset: 52064)
!1734 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixContext", file: !924, line: 64, baseType: !1735)
!1735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PixContext", file: !924, line: 58, size: 644992, align: 32, elements: !1736)
!1736 = !{!1737, !1738, !1739, !1743, !1744, !1745, !1749}
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "cache_size", scope: !1735, file: !924, line: 59, baseType: !895, size: 32, align: 32)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "num_syms", scope: !1735, file: !924, line: 59, baseType: !895, size: 32, align: 32, offset: 32)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !1735, file: !924, line: 60, baseType: !1740, size: 96, align: 8, offset: 64)
!1740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 96, align: 8, elements: !1741)
!1741 = !{!1742}
!1742 = !DISubrange(count: 12)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "cache_model", scope: !1735, file: !924, line: 61, baseType: !923, size: 10400, align: 32, offset: 160)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "full_model", scope: !1735, file: !924, line: 61, baseType: !923, size: 10400, align: 32, offset: 10560)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "sec_models", scope: !1735, file: !924, line: 62, baseType: !1746, size: 624000, align: 32, offset: 20960)
!1746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 624000, align: 32, elements: !1747)
!1747 = !{!1748, !915}
!1748 = !DISubrange(count: 15)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "special_initial_cache", scope: !1735, file: !924, line: 63, baseType: !895, size: 32, align: 32, offset: 644960)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "inter_pix_ctx", scope: !1112, file: !924, line: 72, baseType: !1734, size: 644992, align: 32, offset: 697056)
!1751 = !DILocalVariable(name: "sc", arg: 1, scope: !1107, file: !888, line: 429, type: !1110)
!1752 = !DILocation(line: 429, column: 48, scope: !1107)
!1753 = !DILocation(line: 431, column: 18, scope: !1107)
!1754 = !DILocation(line: 431, column: 22, scope: !1107)
!1755 = !DILocation(line: 431, column: 5, scope: !1107)
!1756 = !DILocation(line: 432, column: 18, scope: !1107)
!1757 = !DILocation(line: 432, column: 22, scope: !1107)
!1758 = !DILocation(line: 432, column: 5, scope: !1107)
!1759 = !DILocation(line: 433, column: 18, scope: !1107)
!1760 = !DILocation(line: 433, column: 22, scope: !1107)
!1761 = !DILocation(line: 433, column: 5, scope: !1107)
!1762 = !DILocation(line: 434, column: 18, scope: !1107)
!1763 = !DILocation(line: 434, column: 22, scope: !1107)
!1764 = !DILocation(line: 434, column: 5, scope: !1107)
!1765 = !DILocation(line: 435, column: 18, scope: !1107)
!1766 = !DILocation(line: 435, column: 22, scope: !1107)
!1767 = !DILocation(line: 435, column: 5, scope: !1107)
!1768 = !DILocation(line: 436, column: 19, scope: !1107)
!1769 = !DILocation(line: 436, column: 23, scope: !1107)
!1770 = !DILocation(line: 436, column: 5, scope: !1107)
!1771 = !DILocation(line: 437, column: 19, scope: !1107)
!1772 = !DILocation(line: 437, column: 23, scope: !1107)
