; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--me_cmp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--me_cmp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926, !927, !930, !938}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !928, line: 119, baseType: !929)
!928 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !933, line: 220, size: 64, align: 8, elements: !934)
!933 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !932, file: !933, line: 220, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !928, line: 55, baseType: !937)
!937 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!939 = !{!940, !948}
!940 = distinct !DIGlobalVariable(name: "ff_square_tab", scope: !0, file: !941, line: 33, type: !942, isLocal: false, isDefinition: true, variable: [512 x i32]* @ff_square_tab)
!941 = !DIFile(filename: "libavcodec/me_cmp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 16384, align: 32, elements: !946)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !928, line: 51, baseType: !945)
!945 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!946 = !{!947}
!947 = !DISubrange(count: 512)
!948 = distinct !DIGlobalVariable(name: "did_fail", scope: !949, file: !941, line: 1016, type: !952, isLocal: true, isDefinition: true, variable: i32* @ff_check_alignment.did_fail)
!949 = distinct !DISubprogram(name: "ff_check_alignment", scope: !941, file: !941, line: 1014, type: !950, isLocal: false, isDefinition: true, scopeLine: 1015, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !953)
!950 = !DISubroutineType(types: !951)
!951 = !{!952}
!952 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!953 = !{}
!954 = !{i32 2, !"Dwarf Version", i32 4}
!955 = !{i32 2, !"Debug Info Version", i32 3}
!956 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!957 = distinct !DISubprogram(name: "ff_set_cmp", scope: !941, file: !941, line: 474, type: !958, isLocal: false, isDefinition: true, scopeLine: 475, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !953)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !960, !2612, !952}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "MECmpContext", file: !962, line: 80, baseType: !963)
!962 = !DIFile(filename: "libavcodec/me_cmp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MECmpContext", file: !962, line: 53, size: 8640, align: 64, elements: !964)
!964 = !{!965, !972, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606, !2607, !2608, !2611}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "sum_abs_dctelem", scope: !963, file: !962, line: 54, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!952, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !928, line: 37, baseType: !971)
!971 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sad", scope: !963, file: !962, line: 56, baseType: !973, size: 384, align: 64, offset: 64)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 384, align: 64, elements: !2207)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "me_cmp_func", file: !962, line: 48, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!952, !978, !1167, !1167, !1792, !952}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !980, line: 81, size: 86208, align: 64, elements: !981)
!980 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!981 = !{!982, !1064, !1065, !1066, !1067, !1071, !1072, !1086, !1087, !1088, !1089, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1793, !1794, !1847, !1849, !1850, !1851, !1852, !1853, !1864, !1865, !1866, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1882, !1883, !1885, !1886, !1887, !1888, !1889, !1890, !1895, !1897, !1898, !1899, !1900, !1901, !1902, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1929, !1930, !1931, !1932, !1948, !1955, !1967, !1983, !2005, !2006, !2019, !2046, !2061, !2075, !2088, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2109, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2122, !2124, !2125, !2126, !2127, !2128, !2129, !2132, !2134, !2136, !2137, !2140, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2209, !2210, !2212, !2213, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2235, !2236, !2237, !2240, !2241, !2242, !2243, !2245, !2247, !2248, !2249, !2250, !2251, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2333, !2334, !2335, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2464, !2465, !2466, !2467, !2471, !2472, !2476, !2480, !2484, !2485, !2490, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2505, !2506, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2521, !2522, !2524, !2525, !2526, !2576, !2577, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !979, file: !980, line: 82, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !986)
!986 = !{!987, !991, !995, !1023, !1024, !1025, !1026, !1030, !1036, !1038, !1042}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !985, file: !26, line: 72, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !985, file: !26, line: 78, baseType: !992, size: 64, align: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{!988, !926}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !985, file: !26, line: 85, baseType: !996, size: 64, align: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1019, !1020, !1021, !1022}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !4, line: 247, baseType: !988, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !998, file: !4, line: 253, baseType: !988, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !998, file: !4, line: 259, baseType: !952, size: 32, align: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !998, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !998, file: !4, line: 271, baseType: !1005, size: 64, align: 64, offset: 192)
!1005 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !998, file: !4, line: 265, size: 64, align: 64, elements: !1006)
!1006 = !{!1007, !1009, !1011, !1012}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1005, file: !4, line: 266, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !928, line: 40, baseType: !929)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1005, file: !4, line: 267, baseType: !1010, size: 64, align: 64)
!1010 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1005, file: !4, line: 268, baseType: !988, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1005, file: !4, line: 270, baseType: !1013, size: 64, align: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1014, line: 61, baseType: !1015)
!1014 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1014, line: 58, size: 64, align: 32, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1015, file: !1014, line: 59, baseType: !952, size: 32, align: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1015, file: !1014, line: 60, baseType: !952, size: 32, align: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !998, file: !4, line: 272, baseType: !1010, size: 64, align: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !998, file: !4, line: 273, baseType: !1010, size: 64, align: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !998, file: !4, line: 275, baseType: !952, size: 32, align: 32, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !998, file: !4, line: 300, baseType: !988, size: 64, align: 64, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !985, file: !26, line: 93, baseType: !952, size: 32, align: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !985, file: !26, line: 99, baseType: !952, size: 32, align: 32, offset: 224)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !985, file: !26, line: 108, baseType: !952, size: 32, align: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !985, file: !26, line: 113, baseType: !1027, size: 64, align: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!926, !926, !926}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !985, file: !26, line: 123, baseType: !1031, size: 64, align: 64, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1034, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !985, file: !26, line: 130, baseType: !1037, size: 32, align: 32, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !985, file: !26, line: 136, baseType: !1039, size: 64, align: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1037, !926}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !985, file: !26, line: 142, baseType: !1043, size: 64, align: 64, offset: 576)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!952, !1046, !926, !988, !952}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1049)
!1049 = !{!1050, !1062, !1063}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1048, file: !4, line: 360, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1054, file: !4, line: 307, baseType: !988, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1054, file: !4, line: 313, baseType: !1010, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1054, file: !4, line: 313, baseType: !1010, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1054, file: !4, line: 318, baseType: !1010, size: 64, align: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1054, file: !4, line: 318, baseType: !1010, size: 64, align: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1054, file: !4, line: 323, baseType: !952, size: 32, align: 32, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1048, file: !4, line: 364, baseType: !952, size: 32, align: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1048, file: !4, line: 368, baseType: !952, size: 32, align: 32, offset: 96)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !979, file: !980, line: 84, baseType: !952, size: 32, align: 32, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !979, file: !980, line: 84, baseType: !952, size: 32, align: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !979, file: !980, line: 85, baseType: !952, size: 32, align: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !979, file: !980, line: 86, baseType: !1068, size: 384, align: 32, offset: 160)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 384, align: 32, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 12)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !979, file: !980, line: 87, baseType: !952, size: 32, align: 32, offset: 544)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !979, file: !980, line: 90, baseType: !1073, size: 1088, align: 64, offset: 576)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1075)
!1075 = !{!1076, !1081, !1085}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1074, file: !917, line: 32, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !928, line: 48, baseType: !1080)
!1080 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1074, file: !917, line: 33, baseType: !1082, size: 512, align: 8, offset: 64)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 512, align: 8, elements: !1083)
!1083 = !{!1084}
!1084 = !DISubrange(count: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1074, file: !917, line: 34, baseType: !1082, size: 512, align: 8, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !979, file: !980, line: 91, baseType: !1073, size: 1088, align: 64, offset: 1664)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !979, file: !980, line: 92, baseType: !1073, size: 1088, align: 64, offset: 2752)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !979, file: !980, line: 93, baseType: !1073, size: 1088, align: 64, offset: 3840)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !979, file: !980, line: 98, baseType: !1090, size: 64, align: 64, offset: 4928)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1092)
!1092 = !{!1093, !1096, !1097, !1098, !1361, !1362, !1363, !1364, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1516, !1520, !1521, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1698, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1091, file: !57, line: 1561, baseType: !1094, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1091, file: !57, line: 1562, baseType: !952, size: 32, align: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1091, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1091, file: !57, line: 1565, baseType: !1099, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1108, !1111, !1114, !1117, !1120, !1123, !1124, !1125, !1133, !1134, !1135, !1137, !1143, !1149, !1158, !1162, !1163, !1211, !1332, !1336, !1337, !1341, !1345, !1350, !1354, !1355, !1356}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1101, file: !57, line: 3475, baseType: !988, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1101, file: !57, line: 3480, baseType: !988, size: 64, align: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1101, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1101, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1101, file: !57, line: 3487, baseType: !952, size: 32, align: 32, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1101, file: !57, line: 3488, baseType: !1109, size: 64, align: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1101, file: !57, line: 3489, baseType: !1112, size: 64, align: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1101, file: !57, line: 3490, baseType: !1115, size: 64, align: 64, offset: 384)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1101, file: !57, line: 3491, baseType: !1118, size: 64, align: 64, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1101, file: !57, line: 3492, baseType: !1121, size: 64, align: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1101, file: !57, line: 3493, baseType: !1079, size: 8, align: 8, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1101, file: !57, line: 3494, baseType: !1094, size: 64, align: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1101, file: !57, line: 3495, baseType: !1126, size: 64, align: 64, offset: 704)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1130)
!1130 = !{!1131, !1132}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1129, file: !57, line: 3402, baseType: !952, size: 32, align: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1129, file: !57, line: 3403, baseType: !988, size: 64, align: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1101, file: !57, line: 3507, baseType: !988, size: 64, align: 64, offset: 768)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1101, file: !57, line: 3516, baseType: !952, size: 32, align: 32, offset: 832)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1101, file: !57, line: 3517, baseType: !1136, size: 64, align: 64, offset: 896)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1101, file: !57, line: 3527, baseType: !1138, size: 64, align: 64, offset: 960)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!952, !1141}
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1091)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1101, file: !57, line: 3535, baseType: !1144, size: 64, align: 64, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!952, !1141, !1147}
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1142)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1101, file: !57, line: 3541, baseType: !1150, size: 64, align: 64, offset: 1088)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1154, line: 223, size: 128, align: 64, elements: !1155)
!1154 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1153, file: !1154, line: 224, baseType: !1077, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1153, file: !1154, line: 225, baseType: !1077, size: 64, align: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1101, file: !57, line: 3549, baseType: !1159, size: 64, align: 64, offset: 1152)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1136}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1101, file: !57, line: 3551, baseType: !1138, size: 64, align: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1101, file: !57, line: 3552, baseType: !1164, size: 64, align: 64, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!952, !1141, !1167, !952, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1171)
!1171 = !{!1172, !1175, !1176, !1177, !1178, !1210}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1170, file: !57, line: 3921, baseType: !1173, size: 16, align: 16)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !928, line: 49, baseType: !1174)
!1174 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1170, file: !57, line: 3922, baseType: !944, size: 32, align: 32, offset: 32)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1170, file: !57, line: 3923, baseType: !944, size: 32, align: 32, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1170, file: !57, line: 3924, baseType: !945, size: 32, align: 32, offset: 96)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1170, file: !57, line: 3925, baseType: !1179, size: 64, align: 64, offset: 128)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1183)
!1183 = !{!1184, !1185, !1186, !1187, !1188, !1189, !1199, !1203, !1205, !1206, !1208, !1209}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1182, file: !57, line: 3886, baseType: !952, size: 32, align: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1182, file: !57, line: 3887, baseType: !952, size: 32, align: 32, offset: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1182, file: !57, line: 3888, baseType: !952, size: 32, align: 32, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1182, file: !57, line: 3889, baseType: !952, size: 32, align: 32, offset: 96)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1182, file: !57, line: 3890, baseType: !952, size: 32, align: 32, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1182, file: !57, line: 3897, baseType: !1190, size: 768, align: 64, offset: 192)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1192)
!1192 = !{!1193, !1197}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !57, line: 3855, baseType: !1194, size: 512, align: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 512, align: 64, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 8)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1191, file: !57, line: 3857, baseType: !1198, size: 256, align: 32, offset: 512)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 256, align: 32, elements: !1195)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1182, file: !57, line: 3903, baseType: !1200, size: 256, align: 64, offset: 960)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 256, align: 64, elements: !1201)
!1201 = !{!1202}
!1202 = !DISubrange(count: 4)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1182, file: !57, line: 3904, baseType: !1204, size: 128, align: 32, offset: 1216)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 128, align: 32, elements: !1201)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1182, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1182, file: !57, line: 3908, baseType: !1207, size: 64, align: 64, offset: 1408)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1182, file: !57, line: 3915, baseType: !1207, size: 64, align: 64, offset: 1472)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1182, file: !57, line: 3917, baseType: !952, size: 32, align: 32, offset: 1536)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1170, file: !57, line: 3926, baseType: !1008, size: 64, align: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1101, file: !57, line: 3564, baseType: !1212, size: 64, align: 64, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!952, !1141, !1215, !1249, !1331}
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1218)
!1218 = !{!1219, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1245, !1246, !1247, !1248}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !57, line: 1451, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1222, line: 94, baseType: !1223)
!1222 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1222, line: 81, size: 192, align: 64, elements: !1224)
!1224 = !{!1225, !1229, !1230}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1223, file: !1222, line: 82, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1222, line: 73, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1222, line: 73, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !1222, line: 89, baseType: !1167, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !1222, line: 93, baseType: !952, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1217, file: !57, line: 1461, baseType: !1008, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1217, file: !57, line: 1467, baseType: !1008, size: 64, align: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !57, line: 1468, baseType: !1167, size: 64, align: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !57, line: 1469, baseType: !952, size: 32, align: 32, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1217, file: !57, line: 1470, baseType: !952, size: 32, align: 32, offset: 288)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1217, file: !57, line: 1474, baseType: !952, size: 32, align: 32, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1217, file: !57, line: 1479, baseType: !1238, size: 64, align: 64, offset: 384)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !57, line: 1412, baseType: !1167, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !57, line: 1413, baseType: !952, size: 32, align: 32, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1240, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1217, file: !57, line: 1480, baseType: !952, size: 32, align: 32, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1217, file: !57, line: 1486, baseType: !1008, size: 64, align: 64, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1217, file: !57, line: 1488, baseType: !1008, size: 64, align: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1217, file: !57, line: 1497, baseType: !1008, size: 64, align: 64, offset: 640)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1283, !1285, !1286, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1319, !1320, !1321, !1322, !1323, !1324, !1327, !1328, !1329, !1330}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1252, file: !780, line: 282, baseType: !1194, size: 512, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1252, file: !780, line: 299, baseType: !1198, size: 256, align: 32, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1252, file: !780, line: 315, baseType: !1257, size: 64, align: 64, offset: 768)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1252, file: !780, line: 326, baseType: !952, size: 32, align: 32, offset: 832)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1252, file: !780, line: 326, baseType: !952, size: 32, align: 32, offset: 864)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1252, file: !780, line: 334, baseType: !952, size: 32, align: 32, offset: 896)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1252, file: !780, line: 341, baseType: !952, size: 32, align: 32, offset: 928)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1252, file: !780, line: 346, baseType: !952, size: 32, align: 32, offset: 960)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1252, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1252, file: !780, line: 356, baseType: !1013, size: 64, align: 32, offset: 1024)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1252, file: !780, line: 361, baseType: !1008, size: 64, align: 64, offset: 1088)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1252, file: !780, line: 369, baseType: !1008, size: 64, align: 64, offset: 1152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1252, file: !780, line: 377, baseType: !1008, size: 64, align: 64, offset: 1216)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1252, file: !780, line: 382, baseType: !952, size: 32, align: 32, offset: 1280)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1252, file: !780, line: 386, baseType: !952, size: 32, align: 32, offset: 1312)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1252, file: !780, line: 391, baseType: !952, size: 32, align: 32, offset: 1344)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1252, file: !780, line: 396, baseType: !926, size: 64, align: 64, offset: 1408)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1252, file: !780, line: 403, baseType: !1273, size: 512, align: 64, offset: 1472)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, align: 64, elements: !1195)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1252, file: !780, line: 410, baseType: !952, size: 32, align: 32, offset: 1984)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1252, file: !780, line: 415, baseType: !952, size: 32, align: 32, offset: 2016)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1252, file: !780, line: 420, baseType: !952, size: 32, align: 32, offset: 2048)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1252, file: !780, line: 425, baseType: !952, size: 32, align: 32, offset: 2080)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1252, file: !780, line: 435, baseType: !1008, size: 64, align: 64, offset: 2112)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1252, file: !780, line: 440, baseType: !952, size: 32, align: 32, offset: 2176)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1252, file: !780, line: 445, baseType: !936, size: 64, align: 64, offset: 2240)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1252, file: !780, line: 459, baseType: !1282, size: 512, align: 64, offset: 2304)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 512, align: 64, elements: !1195)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1252, file: !780, line: 473, baseType: !1284, size: 64, align: 64, offset: 2816)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1252, file: !780, line: 477, baseType: !952, size: 32, align: 32, offset: 2880)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1252, file: !780, line: 479, baseType: !1287, size: 64, align: 64, offset: 2944)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295, !1300}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1290, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1290, file: !780, line: 203, baseType: !1167, size: 64, align: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1290, file: !780, line: 204, baseType: !952, size: 32, align: 32, offset: 128)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1290, file: !780, line: 205, baseType: !1296, size: 64, align: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1298, line: 86, baseType: !1299)
!1298 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1298, line: 86, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1290, file: !780, line: 206, baseType: !1220, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1252, file: !780, line: 480, baseType: !952, size: 32, align: 32, offset: 3008)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1252, file: !780, line: 505, baseType: !952, size: 32, align: 32, offset: 3040)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1252, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1252, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1252, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1252, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1252, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1252, file: !780, line: 532, baseType: !1008, size: 64, align: 64, offset: 3264)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1252, file: !780, line: 539, baseType: !1008, size: 64, align: 64, offset: 3328)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1252, file: !780, line: 547, baseType: !1008, size: 64, align: 64, offset: 3392)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1252, file: !780, line: 554, baseType: !1296, size: 64, align: 64, offset: 3456)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1252, file: !780, line: 563, baseType: !952, size: 32, align: 32, offset: 3520)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1252, file: !780, line: 572, baseType: !952, size: 32, align: 32, offset: 3552)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1252, file: !780, line: 581, baseType: !952, size: 32, align: 32, offset: 3584)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1252, file: !780, line: 588, baseType: !1316, size: 64, align: 64, offset: 3648)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !928, line: 36, baseType: !1318)
!1318 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1252, file: !780, line: 593, baseType: !952, size: 32, align: 32, offset: 3712)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1252, file: !780, line: 596, baseType: !952, size: 32, align: 32, offset: 3744)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1252, file: !780, line: 599, baseType: !1220, size: 64, align: 64, offset: 3776)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1252, file: !780, line: 605, baseType: !1220, size: 64, align: 64, offset: 3840)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1252, file: !780, line: 616, baseType: !1220, size: 64, align: 64, offset: 3904)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1252, file: !780, line: 626, baseType: !1325, size: 64, align: 64, offset: 3968)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1326, line: 216, baseType: !937)
!1326 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1252, file: !780, line: 627, baseType: !1325, size: 64, align: 64, offset: 4032)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1252, file: !780, line: 628, baseType: !1325, size: 64, align: 64, offset: 4096)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1252, file: !780, line: 629, baseType: !1325, size: 64, align: 64, offset: 4160)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1252, file: !780, line: 645, baseType: !1220, size: 64, align: 64, offset: 4224)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1101, file: !57, line: 3566, baseType: !1333, size: 64, align: 64, offset: 1408)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!952, !1141, !926, !1331, !1215}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1101, file: !57, line: 3567, baseType: !1138, size: 64, align: 64, offset: 1472)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1101, file: !57, line: 3576, baseType: !1338, size: 64, align: 64, offset: 1536)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!952, !1141, !1249}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1101, file: !57, line: 3577, baseType: !1342, size: 64, align: 64, offset: 1600)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!952, !1141, !1215}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1101, file: !57, line: 3584, baseType: !1346, size: 64, align: 64, offset: 1664)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!952, !1141, !1349}
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1101, file: !57, line: 3589, baseType: !1351, size: 64, align: 64, offset: 1728)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{null, !1141}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1101, file: !57, line: 3594, baseType: !952, size: 32, align: 32, offset: 1792)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1101, file: !57, line: 3600, baseType: !988, size: 64, align: 64, offset: 1856)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1101, file: !57, line: 3609, baseType: !1357, size: 64, align: 64, offset: 1920)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1360)
!1360 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1091, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1091, file: !57, line: 1581, baseType: !945, size: 32, align: 32, offset: 224)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1091, file: !57, line: 1583, baseType: !926, size: 64, align: 64, offset: 256)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1091, file: !57, line: 1591, baseType: !1365, size: 64, align: 64, offset: 320)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1154, line: 129, size: 1664, align: 64, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1390, !1391, !1397, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1366, file: !1154, line: 136, baseType: !952, size: 32, align: 32)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1366, file: !1154, line: 151, baseType: !952, size: 32, align: 32, offset: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1366, file: !1154, line: 157, baseType: !952, size: 32, align: 32, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1366, file: !1154, line: 159, baseType: !1349, size: 64, align: 64, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1366, file: !1154, line: 161, baseType: !1373, size: 64, align: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1154, line: 117, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1154, line: 100, size: 832, align: 64, elements: !1376)
!1376 = !{!1377, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1375, file: !1154, line: 105, baseType: !1378, size: 256, align: 64)
!1378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1379, size: 256, align: 64, elements: !1201)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1222, line: 238, baseType: !1381)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1222, line: 238, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1375, file: !1154, line: 110, baseType: !952, size: 32, align: 32, offset: 256)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1375, file: !1154, line: 111, baseType: !952, size: 32, align: 32, offset: 288)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1375, file: !1154, line: 111, baseType: !952, size: 32, align: 32, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1375, file: !1154, line: 112, baseType: !1198, size: 256, align: 32, offset: 352)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1375, file: !1154, line: 113, baseType: !1204, size: 128, align: 32, offset: 608)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1375, file: !1154, line: 114, baseType: !952, size: 32, align: 32, offset: 736)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1375, file: !1154, line: 115, baseType: !952, size: 32, align: 32, offset: 768)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1375, file: !1154, line: 116, baseType: !952, size: 32, align: 32, offset: 800)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1366, file: !1154, line: 163, baseType: !926, size: 64, align: 64, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1366, file: !1154, line: 165, baseType: !1392, size: 128, align: 64, offset: 320)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1154, line: 122, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1154, line: 119, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1396}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1393, file: !1154, line: 120, baseType: !1215, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1393, file: !1154, line: 121, baseType: !1349, size: 64, align: 64, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1366, file: !1154, line: 166, baseType: !1398, size: 128, align: 64, offset: 448)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1154, line: 127, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1154, line: 124, size: 128, align: 64, elements: !1400)
!1400 = !{!1401, !1474}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1399, file: !1154, line: 125, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1406)
!1406 = !{!1407, !1408, !1432, !1436, !1437, !1471, !1472, !1473}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1405, file: !57, line: 5751, baseType: !1094, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1405, file: !57, line: 5756, baseType: !1409, size: 64, align: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1412)
!1412 = !{!1413, !1414, !1417, !1418, !1419, !1423, !1427, !1431}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1411, file: !57, line: 5797, baseType: !988, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1411, file: !57, line: 5804, baseType: !1415, size: 64, align: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1411, file: !57, line: 5815, baseType: !1094, size: 64, align: 64, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1411, file: !57, line: 5825, baseType: !952, size: 32, align: 32, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1411, file: !57, line: 5826, baseType: !1420, size: 64, align: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{!952, !1403}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1411, file: !57, line: 5827, baseType: !1424, size: 64, align: 64, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DISubroutineType(types: !1426)
!1426 = !{!952, !1403, !1215}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1411, file: !57, line: 5828, baseType: !1428, size: 64, align: 64, offset: 384)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1403}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1411, file: !57, line: 5829, baseType: !1428, size: 64, align: 64, offset: 448)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1405, file: !57, line: 5762, baseType: !1433, size: 64, align: 64, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1435)
!1435 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1405, file: !57, line: 5768, baseType: !926, size: 64, align: 64, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1405, file: !57, line: 5775, baseType: !1438, size: 64, align: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1440, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1440, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1440, file: !57, line: 3948, baseType: !944, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1440, file: !57, line: 3958, baseType: !1167, size: 64, align: 64, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1440, file: !57, line: 3962, baseType: !952, size: 32, align: 32, offset: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1440, file: !57, line: 3968, baseType: !952, size: 32, align: 32, offset: 224)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1440, file: !57, line: 3973, baseType: !1008, size: 64, align: 64, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1440, file: !57, line: 3986, baseType: !952, size: 32, align: 32, offset: 320)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1440, file: !57, line: 3999, baseType: !952, size: 32, align: 32, offset: 352)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1440, file: !57, line: 4004, baseType: !952, size: 32, align: 32, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1440, file: !57, line: 4005, baseType: !952, size: 32, align: 32, offset: 416)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1440, file: !57, line: 4010, baseType: !952, size: 32, align: 32, offset: 448)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1440, file: !57, line: 4011, baseType: !952, size: 32, align: 32, offset: 480)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1440, file: !57, line: 4020, baseType: !1013, size: 64, align: 32, offset: 512)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1440, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1440, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1440, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1440, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1440, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1440, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1440, file: !57, line: 4039, baseType: !952, size: 32, align: 32, offset: 768)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1440, file: !57, line: 4046, baseType: !936, size: 64, align: 64, offset: 832)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1440, file: !57, line: 4050, baseType: !952, size: 32, align: 32, offset: 896)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1440, file: !57, line: 4054, baseType: !952, size: 32, align: 32, offset: 928)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1440, file: !57, line: 4061, baseType: !952, size: 32, align: 32, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1440, file: !57, line: 4065, baseType: !952, size: 32, align: 32, offset: 992)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1440, file: !57, line: 4073, baseType: !952, size: 32, align: 32, offset: 1024)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1440, file: !57, line: 4080, baseType: !952, size: 32, align: 32, offset: 1056)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1440, file: !57, line: 4084, baseType: !952, size: 32, align: 32, offset: 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1405, file: !57, line: 5781, baseType: !1438, size: 64, align: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1405, file: !57, line: 5787, baseType: !1013, size: 64, align: 32, offset: 384)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1405, file: !57, line: 5793, baseType: !1013, size: 64, align: 32, offset: 448)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1399, file: !1154, line: 126, baseType: !952, size: 32, align: 32, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1366, file: !1154, line: 172, baseType: !1215, size: 64, align: 64, offset: 576)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1366, file: !1154, line: 177, baseType: !1167, size: 64, align: 64, offset: 640)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1366, file: !1154, line: 178, baseType: !945, size: 32, align: 32, offset: 704)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1366, file: !1154, line: 180, baseType: !926, size: 64, align: 64, offset: 768)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1366, file: !1154, line: 185, baseType: !952, size: 32, align: 32, offset: 832)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1366, file: !1154, line: 190, baseType: !926, size: 64, align: 64, offset: 896)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1366, file: !1154, line: 195, baseType: !952, size: 32, align: 32, offset: 960)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1366, file: !1154, line: 200, baseType: !1215, size: 64, align: 64, offset: 1024)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1366, file: !1154, line: 201, baseType: !952, size: 32, align: 32, offset: 1088)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1366, file: !1154, line: 202, baseType: !1349, size: 64, align: 64, offset: 1152)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1366, file: !1154, line: 203, baseType: !952, size: 32, align: 32, offset: 1216)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1366, file: !1154, line: 205, baseType: !952, size: 32, align: 32, offset: 1248)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1366, file: !1154, line: 206, baseType: !952, size: 32, align: 32, offset: 1280)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1366, file: !1154, line: 209, baseType: !1325, size: 64, align: 64, offset: 1344)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1366, file: !1154, line: 212, baseType: !1325, size: 64, align: 64, offset: 1408)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1366, file: !1154, line: 213, baseType: !1349, size: 64, align: 64, offset: 1472)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1366, file: !1154, line: 215, baseType: !952, size: 32, align: 32, offset: 1536)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1366, file: !1154, line: 217, baseType: !952, size: 32, align: 32, offset: 1568)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1366, file: !1154, line: 220, baseType: !952, size: 32, align: 32, offset: 1600)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1091, file: !57, line: 1598, baseType: !926, size: 64, align: 64, offset: 384)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1091, file: !57, line: 1606, baseType: !1008, size: 64, align: 64, offset: 448)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1091, file: !57, line: 1614, baseType: !952, size: 32, align: 32, offset: 512)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1091, file: !57, line: 1622, baseType: !952, size: 32, align: 32, offset: 544)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1091, file: !57, line: 1628, baseType: !952, size: 32, align: 32, offset: 576)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1091, file: !57, line: 1636, baseType: !952, size: 32, align: 32, offset: 608)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1091, file: !57, line: 1643, baseType: !952, size: 32, align: 32, offset: 640)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1091, file: !57, line: 1657, baseType: !1167, size: 64, align: 64, offset: 704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1091, file: !57, line: 1658, baseType: !952, size: 32, align: 32, offset: 768)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1091, file: !57, line: 1679, baseType: !1013, size: 64, align: 32, offset: 800)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1091, file: !57, line: 1688, baseType: !952, size: 32, align: 32, offset: 864)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1091, file: !57, line: 1712, baseType: !952, size: 32, align: 32, offset: 896)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1091, file: !57, line: 1729, baseType: !952, size: 32, align: 32, offset: 928)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1091, file: !57, line: 1729, baseType: !952, size: 32, align: 32, offset: 960)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1091, file: !57, line: 1744, baseType: !952, size: 32, align: 32, offset: 992)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1091, file: !57, line: 1744, baseType: !952, size: 32, align: 32, offset: 1024)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1091, file: !57, line: 1751, baseType: !952, size: 32, align: 32, offset: 1056)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1091, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1091, file: !57, line: 1791, baseType: !1513, size: 64, align: 64, offset: 1152)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{null, !1090, !1249, !1331, !952, !952, !952}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1091, file: !57, line: 1808, baseType: !1517, size: 64, align: 64, offset: 1216)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!516, !1090, !1112}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1091, file: !57, line: 1816, baseType: !952, size: 32, align: 32, offset: 1280)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1091, file: !57, line: 1825, baseType: !1522, size: 32, align: 32, offset: 1312)
!1522 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1091, file: !57, line: 1830, baseType: !952, size: 32, align: 32, offset: 1344)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1091, file: !57, line: 1838, baseType: !1522, size: 32, align: 32, offset: 1376)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1091, file: !57, line: 1846, baseType: !952, size: 32, align: 32, offset: 1408)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1091, file: !57, line: 1851, baseType: !952, size: 32, align: 32, offset: 1440)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1091, file: !57, line: 1861, baseType: !1522, size: 32, align: 32, offset: 1472)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1091, file: !57, line: 1868, baseType: !1522, size: 32, align: 32, offset: 1504)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1091, file: !57, line: 1875, baseType: !1522, size: 32, align: 32, offset: 1536)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1091, file: !57, line: 1882, baseType: !1522, size: 32, align: 32, offset: 1568)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1091, file: !57, line: 1889, baseType: !1522, size: 32, align: 32, offset: 1600)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1091, file: !57, line: 1896, baseType: !1522, size: 32, align: 32, offset: 1632)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1091, file: !57, line: 1903, baseType: !1522, size: 32, align: 32, offset: 1664)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1091, file: !57, line: 1910, baseType: !952, size: 32, align: 32, offset: 1696)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1091, file: !57, line: 1915, baseType: !952, size: 32, align: 32, offset: 1728)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1091, file: !57, line: 1926, baseType: !1331, size: 64, align: 64, offset: 1792)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1091, file: !57, line: 1935, baseType: !1013, size: 64, align: 32, offset: 1856)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1091, file: !57, line: 1942, baseType: !952, size: 32, align: 32, offset: 1920)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1091, file: !57, line: 1948, baseType: !952, size: 32, align: 32, offset: 1952)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1091, file: !57, line: 1954, baseType: !952, size: 32, align: 32, offset: 1984)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1091, file: !57, line: 1960, baseType: !952, size: 32, align: 32, offset: 2016)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1091, file: !57, line: 1984, baseType: !952, size: 32, align: 32, offset: 2048)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1091, file: !57, line: 1991, baseType: !952, size: 32, align: 32, offset: 2080)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1091, file: !57, line: 1996, baseType: !952, size: 32, align: 32, offset: 2112)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1091, file: !57, line: 2004, baseType: !952, size: 32, align: 32, offset: 2144)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1091, file: !57, line: 2011, baseType: !952, size: 32, align: 32, offset: 2176)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1091, file: !57, line: 2018, baseType: !952, size: 32, align: 32, offset: 2208)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1091, file: !57, line: 2027, baseType: !952, size: 32, align: 32, offset: 2240)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1091, file: !57, line: 2034, baseType: !952, size: 32, align: 32, offset: 2272)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1091, file: !57, line: 2044, baseType: !952, size: 32, align: 32, offset: 2304)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1091, file: !57, line: 2054, baseType: !1552, size: 64, align: 64, offset: 2368)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1091, file: !57, line: 2061, baseType: !1552, size: 64, align: 64, offset: 2432)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1091, file: !57, line: 2066, baseType: !952, size: 32, align: 32, offset: 2496)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1091, file: !57, line: 2070, baseType: !952, size: 32, align: 32, offset: 2528)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1091, file: !57, line: 2078, baseType: !952, size: 32, align: 32, offset: 2560)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1091, file: !57, line: 2085, baseType: !952, size: 32, align: 32, offset: 2592)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1091, file: !57, line: 2092, baseType: !952, size: 32, align: 32, offset: 2624)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1091, file: !57, line: 2099, baseType: !952, size: 32, align: 32, offset: 2656)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1091, file: !57, line: 2106, baseType: !952, size: 32, align: 32, offset: 2688)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1091, file: !57, line: 2113, baseType: !952, size: 32, align: 32, offset: 2720)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1091, file: !57, line: 2120, baseType: !952, size: 32, align: 32, offset: 2752)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1091, file: !57, line: 2125, baseType: !952, size: 32, align: 32, offset: 2784)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1091, file: !57, line: 2133, baseType: !952, size: 32, align: 32, offset: 2816)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1091, file: !57, line: 2140, baseType: !952, size: 32, align: 32, offset: 2848)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1091, file: !57, line: 2145, baseType: !952, size: 32, align: 32, offset: 2880)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1091, file: !57, line: 2153, baseType: !952, size: 32, align: 32, offset: 2912)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1091, file: !57, line: 2158, baseType: !952, size: 32, align: 32, offset: 2944)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1091, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1091, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1091, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1091, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1091, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1091, file: !57, line: 2203, baseType: !952, size: 32, align: 32, offset: 3136)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1091, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1091, file: !57, line: 2212, baseType: !952, size: 32, align: 32, offset: 3200)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1091, file: !57, line: 2213, baseType: !952, size: 32, align: 32, offset: 3232)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1091, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1091, file: !57, line: 2232, baseType: !952, size: 32, align: 32, offset: 3296)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1091, file: !57, line: 2243, baseType: !952, size: 32, align: 32, offset: 3328)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1091, file: !57, line: 2249, baseType: !952, size: 32, align: 32, offset: 3360)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1091, file: !57, line: 2256, baseType: !952, size: 32, align: 32, offset: 3392)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1091, file: !57, line: 2263, baseType: !936, size: 64, align: 64, offset: 3456)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1091, file: !57, line: 2270, baseType: !936, size: 64, align: 64, offset: 3520)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1091, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1091, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1091, file: !57, line: 2367, baseType: !1588, size: 64, align: 64, offset: 3648)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!952, !1090, !1349, !952}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1091, file: !57, line: 2383, baseType: !952, size: 32, align: 32, offset: 3712)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1091, file: !57, line: 2386, baseType: !1522, size: 32, align: 32, offset: 3744)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1091, file: !57, line: 2387, baseType: !1522, size: 32, align: 32, offset: 3776)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1091, file: !57, line: 2394, baseType: !952, size: 32, align: 32, offset: 3808)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1091, file: !57, line: 2401, baseType: !952, size: 32, align: 32, offset: 3840)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1091, file: !57, line: 2408, baseType: !952, size: 32, align: 32, offset: 3872)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1091, file: !57, line: 2415, baseType: !952, size: 32, align: 32, offset: 3904)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1091, file: !57, line: 2422, baseType: !952, size: 32, align: 32, offset: 3936)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1091, file: !57, line: 2423, baseType: !1600, size: 64, align: 64, offset: 3968)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1603)
!1603 = !{!1604, !1605, !1606, !1607}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1602, file: !57, line: 827, baseType: !952, size: 32, align: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1602, file: !57, line: 828, baseType: !952, size: 32, align: 32, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1602, file: !57, line: 829, baseType: !952, size: 32, align: 32, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1602, file: !57, line: 830, baseType: !1522, size: 32, align: 32, offset: 96)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1091, file: !57, line: 2430, baseType: !1008, size: 64, align: 64, offset: 4032)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1091, file: !57, line: 2437, baseType: !1008, size: 64, align: 64, offset: 4096)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1091, file: !57, line: 2444, baseType: !1522, size: 32, align: 32, offset: 4160)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1091, file: !57, line: 2451, baseType: !1522, size: 32, align: 32, offset: 4192)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1091, file: !57, line: 2458, baseType: !952, size: 32, align: 32, offset: 4224)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1091, file: !57, line: 2469, baseType: !952, size: 32, align: 32, offset: 4256)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1091, file: !57, line: 2475, baseType: !952, size: 32, align: 32, offset: 4288)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1091, file: !57, line: 2481, baseType: !952, size: 32, align: 32, offset: 4320)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1091, file: !57, line: 2485, baseType: !952, size: 32, align: 32, offset: 4352)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1091, file: !57, line: 2489, baseType: !952, size: 32, align: 32, offset: 4384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1091, file: !57, line: 2493, baseType: !952, size: 32, align: 32, offset: 4416)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1091, file: !57, line: 2501, baseType: !952, size: 32, align: 32, offset: 4448)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1091, file: !57, line: 2506, baseType: !952, size: 32, align: 32, offset: 4480)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1091, file: !57, line: 2510, baseType: !952, size: 32, align: 32, offset: 4512)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1091, file: !57, line: 2514, baseType: !1008, size: 64, align: 64, offset: 4544)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1091, file: !57, line: 2528, baseType: !1624, size: 64, align: 64, offset: 4608)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{null, !1090, !926, !952, !952}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1091, file: !57, line: 2534, baseType: !952, size: 32, align: 32, offset: 4672)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1091, file: !57, line: 2545, baseType: !952, size: 32, align: 32, offset: 4704)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1091, file: !57, line: 2547, baseType: !952, size: 32, align: 32, offset: 4736)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1091, file: !57, line: 2549, baseType: !952, size: 32, align: 32, offset: 4768)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1091, file: !57, line: 2551, baseType: !952, size: 32, align: 32, offset: 4800)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1091, file: !57, line: 2553, baseType: !952, size: 32, align: 32, offset: 4832)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1091, file: !57, line: 2555, baseType: !952, size: 32, align: 32, offset: 4864)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1091, file: !57, line: 2557, baseType: !952, size: 32, align: 32, offset: 4896)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1091, file: !57, line: 2559, baseType: !952, size: 32, align: 32, offset: 4928)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1091, file: !57, line: 2563, baseType: !952, size: 32, align: 32, offset: 4960)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1091, file: !57, line: 2571, baseType: !1207, size: 64, align: 64, offset: 4992)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1091, file: !57, line: 2579, baseType: !1207, size: 64, align: 64, offset: 5056)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1091, file: !57, line: 2586, baseType: !952, size: 32, align: 32, offset: 5120)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1091, file: !57, line: 2615, baseType: !952, size: 32, align: 32, offset: 5152)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1091, file: !57, line: 2627, baseType: !952, size: 32, align: 32, offset: 5184)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1091, file: !57, line: 2637, baseType: !952, size: 32, align: 32, offset: 5216)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1091, file: !57, line: 2681, baseType: !952, size: 32, align: 32, offset: 5248)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1091, file: !57, line: 2709, baseType: !1008, size: 64, align: 64, offset: 5312)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1091, file: !57, line: 2716, baseType: !1646, size: 64, align: 64, offset: 5376)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1649)
!1649 = !{!1650, !1651, !1652, !1653, !1654, !1655, !1656, !1660, !1664, !1665, !1666, !1667, !1671, !1672, !1673, !1674, !1675}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1648, file: !57, line: 3642, baseType: !988, size: 64, align: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1648, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1648, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1648, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1648, file: !57, line: 3669, baseType: !952, size: 32, align: 32, offset: 160)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1648, file: !57, line: 3682, baseType: !1346, size: 64, align: 64, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1648, file: !57, line: 3698, baseType: !1657, size: 64, align: 64, offset: 256)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DISubroutineType(types: !1659)
!1659 = !{!952, !1141, !1077, !944}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1648, file: !57, line: 3712, baseType: !1661, size: 64, align: 64, offset: 320)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!952, !1141, !952, !1077, !944}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1648, file: !57, line: 3726, baseType: !1657, size: 64, align: 64, offset: 384)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1648, file: !57, line: 3737, baseType: !1138, size: 64, align: 64, offset: 448)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1648, file: !57, line: 3746, baseType: !952, size: 32, align: 32, offset: 512)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1648, file: !57, line: 3757, baseType: !1668, size: 64, align: 64, offset: 576)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{null, !978}
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1648, file: !57, line: 3766, baseType: !1138, size: 64, align: 64, offset: 640)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1648, file: !57, line: 3774, baseType: !1138, size: 64, align: 64, offset: 704)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1648, file: !57, line: 3780, baseType: !952, size: 32, align: 32, offset: 768)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1648, file: !57, line: 3785, baseType: !952, size: 32, align: 32, offset: 800)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1648, file: !57, line: 3795, baseType: !1676, size: 64, align: 64, offset: 832)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!952, !1141, !1220}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1091, file: !57, line: 2728, baseType: !926, size: 64, align: 64, offset: 5440)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1091, file: !57, line: 2735, baseType: !1273, size: 512, align: 64, offset: 5504)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1091, file: !57, line: 2742, baseType: !952, size: 32, align: 32, offset: 6016)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1091, file: !57, line: 2755, baseType: !952, size: 32, align: 32, offset: 6048)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1091, file: !57, line: 2776, baseType: !952, size: 32, align: 32, offset: 6080)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1091, file: !57, line: 2783, baseType: !952, size: 32, align: 32, offset: 6112)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1091, file: !57, line: 2791, baseType: !952, size: 32, align: 32, offset: 6144)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1091, file: !57, line: 2802, baseType: !1349, size: 64, align: 64, offset: 6208)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1091, file: !57, line: 2811, baseType: !952, size: 32, align: 32, offset: 6272)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1091, file: !57, line: 2821, baseType: !952, size: 32, align: 32, offset: 6304)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1091, file: !57, line: 2830, baseType: !952, size: 32, align: 32, offset: 6336)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1091, file: !57, line: 2840, baseType: !952, size: 32, align: 32, offset: 6368)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1091, file: !57, line: 2851, baseType: !1692, size: 64, align: 64, offset: 6400)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{!952, !1090, !1695, !926, !1331, !952, !952}
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!952, !1090, !926}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1091, file: !57, line: 2871, baseType: !1699, size: 64, align: 64, offset: 6464)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!952, !1090, !1702, !926, !1331, !952}
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
