; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--async.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--async.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !{!47, !48, !49, !50, !54}
!47 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !52, line: 48, baseType: !53)
!52 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!53 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !55, line: 197, baseType: !56)
!55 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!56 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!57 = !{!58, !262, !263}
!58 = distinct !DIGlobalVariable(name: "ff_async_protocol", scope: !0, file: !59, line: 482, type: !60, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_async_protocol)
!59 = !DIFile(filename: "libavformat/async.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !62, line: 100, baseType: !63)
!62 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !62, line: 54, size: 1600, align: 64, elements: !64)
!64 = !{!65, !69, !180, !189, !194, !198, !203, !209, !213, !214, !218, !222, !223, !229, !230, !231, !232, !233, !234, !235, !236, !255, !256, !257, !261}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !63, file: !62, line: 55, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !63, file: !62, line: 56, baseType: !70, size: 64, align: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!47, !73, !66, !47}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !62, line: 52, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !62, line: 38, size: 768, align: 64, elements: !76)
!76 = !{!77, !156, !159, !160, !162, !163, !164, !165, !166, !176, !177, !178, !179}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !75, file: !62, line: 39, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !82)
!82 = !{!83, !84, !88, !115, !116, !117, !118, !122, !128, !130, !134}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !81, file: !26, line: 72, baseType: !66, size: 64, align: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !81, file: !26, line: 78, baseType: !85, size: 64, align: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{!66, !49}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !81, file: !26, line: 85, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !92)
!92 = !{!93, !94, !95, !96, !97, !111, !112, !113, !114}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !91, file: !4, line: 247, baseType: !66, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !91, file: !4, line: 253, baseType: !66, size: 64, align: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !91, file: !4, line: 259, baseType: !47, size: 32, align: 32, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !91, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !91, file: !4, line: 271, baseType: !98, size: 64, align: 64, offset: 192)
!98 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !91, file: !4, line: 265, size: 64, align: 64, elements: !99)
!99 = !{!100, !101, !103, !104}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !98, file: !4, line: 266, baseType: !54, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !98, file: !4, line: 267, baseType: !102, size: 64, align: 64)
!102 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !98, file: !4, line: 268, baseType: !66, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !98, file: !4, line: 270, baseType: !105, size: 64, align: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !106, line: 61, baseType: !107)
!106 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !106, line: 58, size: 64, align: 32, elements: !108)
!108 = !{!109, !110}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !107, file: !106, line: 59, baseType: !47, size: 32, align: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !107, file: !106, line: 60, baseType: !47, size: 32, align: 32, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !91, file: !4, line: 272, baseType: !102, size: 64, align: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !91, file: !4, line: 273, baseType: !102, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !91, file: !4, line: 275, baseType: !47, size: 32, align: 32, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !91, file: !4, line: 300, baseType: !66, size: 64, align: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !81, file: !26, line: 93, baseType: !47, size: 32, align: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !81, file: !26, line: 99, baseType: !47, size: 32, align: 32, offset: 224)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !81, file: !26, line: 108, baseType: !47, size: 32, align: 32, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !81, file: !26, line: 113, baseType: !119, size: 64, align: 64, offset: 320)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!49, !49, !49}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !81, file: !26, line: 123, baseType: !123, size: 64, align: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64, align: 64)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !126}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !81, file: !26, line: 130, baseType: !129, size: 32, align: 32, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !81, file: !26, line: 136, baseType: !131, size: 64, align: 64, offset: 512)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!129, !49}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !81, file: !26, line: 142, baseType: !135, size: 64, align: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!47, !138, !49, !66, !47}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !141)
!141 = !{!142, !154, !155}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !140, file: !4, line: 360, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !146, file: !4, line: 307, baseType: !66, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !146, file: !4, line: 313, baseType: !102, size: 64, align: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !146, file: !4, line: 313, baseType: !102, size: 64, align: 64, offset: 128)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !146, file: !4, line: 318, baseType: !102, size: 64, align: 64, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !146, file: !4, line: 318, baseType: !102, size: 64, align: 64, offset: 256)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !146, file: !4, line: 323, baseType: !47, size: 32, align: 32, offset: 320)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !140, file: !4, line: 364, baseType: !47, size: 32, align: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !140, file: !4, line: 368, baseType: !47, size: 32, align: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !75, file: !62, line: 40, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !75, file: !62, line: 41, baseType: !49, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !75, file: !62, line: 42, baseType: !161, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !75, file: !62, line: 43, baseType: !47, size: 32, align: 32, offset: 256)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !75, file: !62, line: 44, baseType: !47, size: 32, align: 32, offset: 288)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !75, file: !62, line: 45, baseType: !47, size: 32, align: 32, offset: 320)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !75, file: !62, line: 46, baseType: !47, size: 32, align: 32, offset: 352)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !75, file: !62, line: 47, baseType: !167, size: 128, align: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !168, line: 61, baseType: !169)
!168 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !168, line: 58, size: 128, align: 64, elements: !170)
!170 = !{!171, !175}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !169, file: !168, line: 59, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!47, !49}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !169, file: !168, line: 60, baseType: !49, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !75, file: !62, line: 48, baseType: !54, size: 64, align: 64, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !75, file: !62, line: 49, baseType: !66, size: 64, align: 64, offset: 576)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !75, file: !62, line: 50, baseType: !66, size: 64, align: 64, offset: 640)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !75, file: !62, line: 51, baseType: !47, size: 32, align: 32, offset: 704)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !63, file: !62, line: 62, baseType: !181, size: 64, align: 64, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DISubroutineType(types: !183)
!183 = !{!47, !73, !66, !47, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !187, line: 86, baseType: !188)
!187 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !187, line: 86, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !63, file: !62, line: 63, baseType: !190, size: 64, align: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64, align: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!47, !73, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !63, file: !62, line: 64, baseType: !195, size: 64, align: 64, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!47, !73}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !63, file: !62, line: 78, baseType: !199, size: 64, align: 64, offset: 320)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!47, !73, !202, !47}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !63, file: !62, line: 79, baseType: !204, size: 64, align: 64, offset: 384)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DISubroutineType(types: !206)
!206 = !{!47, !73, !207, !47}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !63, file: !62, line: 80, baseType: !210, size: 64, align: 64, offset: 448)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!54, !73, !54, !47}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !63, file: !62, line: 81, baseType: !195, size: 64, align: 64, offset: 512)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !63, file: !62, line: 82, baseType: !215, size: 64, align: 64, offset: 576)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64, align: 64)
!216 = !DISubroutineType(types: !217)
!217 = !{!47, !73, !47}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !63, file: !62, line: 83, baseType: !219, size: 64, align: 64, offset: 640)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!54, !73, !47, !54, !47}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !63, file: !62, line: 85, baseType: !195, size: 64, align: 64, offset: 704)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !63, file: !62, line: 86, baseType: !224, size: 64, align: 64, offset: 768)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DISubroutineType(types: !226)
!226 = !{!47, !73, !227, !228}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !63, file: !62, line: 88, baseType: !195, size: 64, align: 64, offset: 832)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !63, file: !62, line: 89, baseType: !215, size: 64, align: 64, offset: 896)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !63, file: !62, line: 90, baseType: !47, size: 32, align: 32, offset: 960)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !63, file: !62, line: 91, baseType: !78, size: 64, align: 64, offset: 1024)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !63, file: !62, line: 92, baseType: !47, size: 32, align: 32, offset: 1088)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !63, file: !62, line: 93, baseType: !215, size: 64, align: 64, offset: 1152)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !63, file: !62, line: 94, baseType: !195, size: 64, align: 64, offset: 1216)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !63, file: !62, line: 95, baseType: !237, size: 64, align: 64, offset: 1280)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DISubroutineType(types: !239)
!239 = !{!47, !73, !240}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !168, line: 101, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !168, line: 86, size: 576, align: 64, elements: !244)
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !243, file: !168, line: 87, baseType: !161, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !243, file: !168, line: 88, baseType: !47, size: 32, align: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !243, file: !168, line: 89, baseType: !47, size: 32, align: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !243, file: !168, line: 91, baseType: !54, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !243, file: !168, line: 92, baseType: !54, size: 64, align: 64, offset: 192)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !243, file: !168, line: 94, baseType: !54, size: 64, align: 64, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !243, file: !168, line: 96, baseType: !54, size: 64, align: 64, offset: 320)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !243, file: !168, line: 98, baseType: !54, size: 64, align: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !243, file: !168, line: 99, baseType: !54, size: 64, align: 64, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !243, file: !168, line: 100, baseType: !54, size: 64, align: 64, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !63, file: !62, line: 96, baseType: !195, size: 64, align: 64, offset: 1344)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !63, file: !62, line: 97, baseType: !195, size: 64, align: 64, offset: 1408)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !63, file: !62, line: 98, baseType: !258, size: 64, align: 64, offset: 1472)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64, align: 64)
!259 = !DISubroutineType(types: !260)
!260 = !{!47, !73, !73}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !63, file: !62, line: 99, baseType: !66, size: 64, align: 64, offset: 1536)
!262 = distinct !DIGlobalVariable(name: "async_context_class", scope: !0, file: !59, line: 475, type: !79, isLocal: true, isDefinition: true, variable: %struct.AVClass* @async_context_class)
!263 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !59, line: 468, type: !264, isLocal: true, isDefinition: true, variable: [1 x %struct.AVOption]* @options)
!264 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 512, align: 64, elements: !267)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !91)
!267 = !{!268}
!268 = !DISubrange(count: 1)
!269 = !{i32 2, !"Dwarf Version", i32 4}
!270 = !{i32 2, !"Debug Info Version", i32 3}
!271 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!272 = distinct !DISubprogram(name: "async_open", scope: !59, file: !59, line: 240, type: !182, isLocal: true, isDefinition: true, scopeLine: 241, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !273)
!273 = !{}
!274 = !DILocalVariable(name: "h", arg: 1, scope: !272, file: !59, line: 240, type: !73)
!275 = !DIExpression()
!276 = !DILocation(line: 240, column: 35, scope: !272)
!277 = !DILocalVariable(name: "arg", arg: 2, scope: !272, file: !59, line: 240, type: !66)
!278 = !DILocation(line: 240, column: 50, scope: !272)
!279 = !DILocalVariable(name: "flags", arg: 3, scope: !272, file: !59, line: 240, type: !47)
!280 = !DILocation(line: 240, column: 59, scope: !272)
!281 = !DILocalVariable(name: "options", arg: 4, scope: !272, file: !59, line: 240, type: !184)
!282 = !DILocation(line: 240, column: 81, scope: !272)
!283 = !DILocalVariable(name: "c", scope: !272, file: !59, line: 242, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "Context", file: !59, line: 81, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !59, line: 56, size: 2112, align: 64, elements: !287)
!287 = !{!288, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !320, !343, !344, !371, !374, !375}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !286, file: !59, line: 57, baseType: !289, size: 64, align: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !286, file: !59, line: 58, baseType: !73, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "seek_request", scope: !286, file: !59, line: 60, baseType: !47, size: 32, align: 32, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "seek_pos", scope: !286, file: !59, line: 61, baseType: !54, size: 64, align: 64, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "seek_whence", scope: !286, file: !59, line: 62, baseType: !47, size: 32, align: 32, offset: 256)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "seek_completed", scope: !286, file: !59, line: 63, baseType: !47, size: 32, align: 32, offset: 288)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "seek_ret", scope: !286, file: !59, line: 64, baseType: !54, size: 64, align: 64, offset: 320)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "inner_io_error", scope: !286, file: !59, line: 66, baseType: !47, size: 32, align: 32, offset: 384)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "io_error", scope: !286, file: !59, line: 67, baseType: !47, size: 32, align: 32, offset: 416)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "io_eof_reached", scope: !286, file: !59, line: 68, baseType: !47, size: 32, align: 32, offset: 448)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "logical_pos", scope: !286, file: !59, line: 70, baseType: !54, size: 64, align: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "logical_size", scope: !286, file: !59, line: 71, baseType: !54, size: 64, align: 64, offset: 576)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "ring", scope: !286, file: !59, line: 72, baseType: !302, size: 128, align: 64, offset: 640)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "RingBuffer", file: !59, line: 54, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RingBuffer", file: !59, line: 48, size: 128, align: 64, elements: !304)
!304 = !{!305, !318, !319}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !303, file: !59, line: 50, baseType: !306, size: 64, align: 64)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 64, align: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFifoBuffer", file: !308, line: 35, baseType: !309)
!308 = !DIFile(filename: "./libavutil/fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFifoBuffer", file: !308, line: 31, size: 320, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !317}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !309, file: !308, line: 32, baseType: !50, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "rptr", scope: !309, file: !308, line: 33, baseType: !50, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "wptr", scope: !309, file: !308, line: 33, baseType: !50, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !309, file: !308, line: 33, baseType: !50, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rndx", scope: !309, file: !308, line: 34, baseType: !316, size: 32, align: 32, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !52, line: 51, baseType: !48)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "wndx", scope: !309, file: !308, line: 34, baseType: !316, size: 32, align: 32, offset: 288)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "read_back_capacity", scope: !303, file: !59, line: 51, baseType: !47, size: 32, align: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "read_pos", scope: !303, file: !59, line: 53, baseType: !47, size: 32, align: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cond_wakeup_main", scope: !286, file: !59, line: 74, baseType: !321, size: 384, align: 64, offset: 768)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !322, line: 154, baseType: !323)
!322 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!323 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !322, line: 139, size: 384, align: 64, elements: !324)
!324 = !{!325, !337, !341}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !323, file: !322, line: 151, baseType: !326, size: 384, align: 64)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !323, file: !322, line: 141, size: 384, align: 64, elements: !327)
!327 = !{!328, !329, !330, !332, !333, !334, !335, !336}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !326, file: !322, line: 143, baseType: !47, size: 32, align: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !326, file: !322, line: 144, baseType: !48, size: 32, align: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !326, file: !322, line: 145, baseType: !331, size: 64, align: 64, offset: 64)
!331 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !326, file: !322, line: 146, baseType: !331, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !326, file: !322, line: 147, baseType: !331, size: 64, align: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !326, file: !322, line: 148, baseType: !49, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !326, file: !322, line: 149, baseType: !48, size: 32, align: 32, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !326, file: !322, line: 150, baseType: !48, size: 32, align: 32, offset: 352)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !323, file: !322, line: 152, baseType: !338, size: 384, align: 8)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 384, align: 8, elements: !339)
!339 = !{!340}
!340 = !DISubrange(count: 48)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !323, file: !322, line: 153, baseType: !342, size: 64, align: 64)
!342 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "cond_wakeup_background", scope: !286, file: !59, line: 75, baseType: !321, size: 384, align: 64, offset: 1152)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !286, file: !59, line: 76, baseType: !345, size: 320, align: 64, offset: 1536)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !322, line: 128, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !322, line: 90, size: 320, align: 64, elements: !347)
!347 = !{!348, !366, !370}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !346, file: !322, line: 125, baseType: !349, size: 320, align: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !322, line: 92, size: 320, align: 64, elements: !350)
!350 = !{!351, !352, !353, !354, !355, !356, !358, !359}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !349, file: !322, line: 94, baseType: !47, size: 32, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !349, file: !322, line: 95, baseType: !48, size: 32, align: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !349, file: !322, line: 96, baseType: !47, size: 32, align: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !349, file: !322, line: 98, baseType: !48, size: 32, align: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !349, file: !322, line: 102, baseType: !47, size: 32, align: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !349, file: !322, line: 104, baseType: !357, size: 16, align: 16, offset: 160)
!357 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !349, file: !322, line: 105, baseType: !357, size: 16, align: 16, offset: 176)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !349, file: !322, line: 106, baseType: !360, size: 128, align: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !322, line: 79, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !322, line: 75, size: 128, align: 64, elements: !362)
!362 = !{!363, !365}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !361, file: !322, line: 77, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !361, file: !322, line: 78, baseType: !364, size: 64, align: 64, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !346, file: !322, line: 126, baseType: !367, size: 320, align: 8)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 320, align: 8, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 40)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !346, file: !322, line: 127, baseType: !56, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "async_buffer_thread", scope: !286, file: !59, line: 77, baseType: !372, size: 64, align: 64, offset: 1856)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !322, line: 60, baseType: !373)
!373 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abort_request", scope: !286, file: !59, line: 79, baseType: !47, size: 32, align: 32, offset: 1920)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !286, file: !59, line: 80, baseType: !167, size: 128, align: 64, offset: 1984)
!376 = !DILocation(line: 242, column: 14, scope: !272)
!377 = !DILocation(line: 242, column: 18, scope: !272)
!378 = !DILocation(line: 242, column: 21, scope: !272)
!379 = !DILocalVariable(name: "ret", scope: !272, file: !59, line: 243, type: !47)
!380 = !DILocation(line: 243, column: 9, scope: !272)
!381 = !DILocalVariable(name: "interrupt_callback", scope: !272, file: !59, line: 244, type: !167)
!382 = !DILocation(line: 244, column: 21, scope: !272)
!383 = !DILocation(line: 244, column: 42, scope: !272)
!384 = !DILocation(line: 244, column: 88, scope: !272)
!385 = !DILocation(line: 246, column: 17, scope: !272)
!386 = !DILocation(line: 246, column: 5, scope: !272)
!387 = !DILocation(line: 248, column: 22, scope: !272)
!388 = !DILocation(line: 248, column: 25, scope: !272)
!389 = !DILocation(line: 248, column: 11, scope: !272)
!390 = !DILocation(line: 248, column: 9, scope: !272)
!391 = !DILocation(line: 249, column: 9, scope: !392)
!392 = distinct !DILexicalBlock(scope: !272, file: !59, line: 249, column: 9)
!393 = !DILocation(line: 249, column: 13, scope: !392)
!394 = !DILocation(line: 249, column: 9, scope: !272)
!395 = !DILocation(line: 250, column: 9, scope: !392)
!396 = !DILocation(line: 253, column: 5, scope: !272)
!397 = !DILocation(line: 253, column: 8, scope: !272)
!398 = !DILocation(line: 253, column: 29, scope: !272)
!399 = !DILocation(line: 253, column: 32, scope: !272)
!400 = !DILocation(line: 254, column: 33, scope: !272)
!401 = !DILocation(line: 254, column: 36, scope: !272)
!402 = !DILocation(line: 254, column: 43, scope: !272)
!403 = !DILocation(line: 254, column: 48, scope: !272)
!404 = !DILocation(line: 254, column: 76, scope: !272)
!405 = !DILocation(line: 254, column: 85, scope: !272)
!406 = !DILocation(line: 254, column: 88, scope: !272)
!407 = !DILocation(line: 254, column: 108, scope: !272)
!408 = !DILocation(line: 254, column: 111, scope: !272)
!409 = !DILocation(line: 254, column: 131, scope: !272)
!410 = !DILocation(line: 254, column: 11, scope: !272)
!411 = !DILocation(line: 254, column: 9, scope: !272)
!412 = !DILocation(line: 255, column: 9, scope: !413)
!413 = distinct !DILexicalBlock(scope: !272, file: !59, line: 255, column: 9)
!414 = !DILocation(line: 255, column: 13, scope: !413)
!415 = !DILocation(line: 255, column: 9, scope: !272)
!416 = !DILocation(line: 256, column: 16, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !59, line: 255, column: 19)
!418 = !DILocation(line: 256, column: 76, scope: !417)
!419 = !DILocation(line: 256, column: 86, scope: !417)
!420 = !DILocation(line: 256, column: 95, scope: !417)
!421 = !DILocation(line: 256, column: 55, scope: !422)
!422 = !DILexicalBlockFile(scope: !417, file: !59, discriminator: 1)
!423 = !DILocation(line: 256, column: 101, scope: !417)
!424 = !DILocation(line: 256, column: 9, scope: !425)
!425 = !DILexicalBlockFile(scope: !417, file: !59, discriminator: 2)
!426 = !DILocation(line: 257, column: 9, scope: !417)
!427 = !DILocation(line: 260, column: 34, scope: !272)
!428 = !DILocation(line: 260, column: 37, scope: !272)
!429 = !DILocation(line: 260, column: 23, scope: !272)
!430 = !DILocation(line: 260, column: 5, scope: !272)
!431 = !DILocation(line: 260, column: 8, scope: !272)
!432 = !DILocation(line: 260, column: 21, scope: !272)
!433 = !DILocation(line: 261, column: 22, scope: !272)
!434 = !DILocation(line: 261, column: 25, scope: !272)
!435 = !DILocation(line: 261, column: 32, scope: !272)
!436 = !DILocation(line: 261, column: 5, scope: !272)
!437 = !DILocation(line: 261, column: 8, scope: !272)
!438 = !DILocation(line: 261, column: 20, scope: !272)
!439 = !DILocation(line: 263, column: 31, scope: !272)
!440 = !DILocation(line: 263, column: 34, scope: !272)
!441 = !DILocation(line: 263, column: 11, scope: !272)
!442 = !DILocation(line: 263, column: 9, scope: !272)
