; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--swfenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--swfenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!925 = !DIEnumerator(name: "TAG_DEFINEBITS", value: 6)
!926 = !DIEnumerator(name: "TAG_DEFINEBUTTON", value: 7)
!927 = !DIEnumerator(name: "TAG_JPEGTABLES", value: 8)
!928 = !DIEnumerator(name: "TAG_SETBACKGROUNDCOLOR", value: 9)
!929 = !DIEnumerator(name: "TAG_DEFINEFONT", value: 10)
!930 = !DIEnumerator(name: "TAG_DEFINETEXT", value: 11)
!931 = !DIEnumerator(name: "TAG_DOACTION", value: 12)
!932 = !DIEnumerator(name: "TAG_DEFINEFONTINFO", value: 13)
!933 = !DIEnumerator(name: "TAG_DEFINESOUND", value: 14)
!934 = !DIEnumerator(name: "TAG_STARTSOUND", value: 15)
!935 = !DIEnumerator(name: "TAG_DEFINEBUTTONSOUND", value: 17)
!936 = !DIEnumerator(name: "TAG_STREAMHEAD", value: 18)
!937 = !DIEnumerator(name: "TAG_STREAMBLOCK", value: 19)
!938 = !DIEnumerator(name: "TAG_DEFINEBITSLOSSLESS", value: 20)
!939 = !DIEnumerator(name: "TAG_JPEG2", value: 21)
!940 = !DIEnumerator(name: "TAG_DEFINESHAPE2", value: 22)
!941 = !DIEnumerator(name: "TAG_DEFINEBUTTONCXFORM", value: 23)
!942 = !DIEnumerator(name: "TAG_PROTECT", value: 24)
!943 = !DIEnumerator(name: "TAG_PLACEOBJECT2", value: 26)
!944 = !DIEnumerator(name: "TAG_REMOVEOBJECT2", value: 28)
!945 = !DIEnumerator(name: "TAG_DEFINESHAPE3", value: 32)
!946 = !DIEnumerator(name: "TAG_DEFINETEXT2", value: 33)
!947 = !DIEnumerator(name: "TAG_DEFINEBUTTON2", value: 34)
!948 = !DIEnumerator(name: "TAG_DEFINEBITSJPEG3", value: 35)
!949 = !DIEnumerator(name: "TAG_DEFINEBITSLOSSLESS2", value: 36)
!950 = !DIEnumerator(name: "TAG_DEFINEEDITTEXT", value: 37)
!951 = !DIEnumerator(name: "TAG_DEFINESPRITE", value: 39)
!952 = !DIEnumerator(name: "TAG_FRAMELABEL", value: 43)
!953 = !DIEnumerator(name: "TAG_STREAMHEAD2", value: 45)
!954 = !DIEnumerator(name: "TAG_DEFINEMORPHSHAPE", value: 46)
!955 = !DIEnumerator(name: "TAG_DEFINEFONT2", value: 48)
!956 = !DIEnumerator(name: "TAG_EXPORTASSETS", value: 56)
!957 = !DIEnumerator(name: "TAG_IMPORTASSETS", value: 57)
!958 = !DIEnumerator(name: "TAG_ENABLEDEBUGGER", value: 58)
!959 = !DIEnumerator(name: "TAG_DOINITACTION", value: 59)
!960 = !DIEnumerator(name: "TAG_VIDEOSTREAM", value: 60)
!961 = !DIEnumerator(name: "TAG_VIDEOFRAME", value: 61)
!962 = !DIEnumerator(name: "TAG_DEFINEFONTINFO2", value: 62)
!963 = !DIEnumerator(name: "TAG_ENABLEDEBUGGER2", value: 64)
!964 = !DIEnumerator(name: "TAG_SCRIPTLIMITS", value: 65)
!965 = !DIEnumerator(name: "TAG_SETTABINDEX", value: 66)
!966 = !DIEnumerator(name: "TAG_FILEATTRIBUTES", value: 69)
!967 = !DIEnumerator(name: "TAG_PLACEOBJECT3", value: 70)
!968 = !DIEnumerator(name: "TAG_IMPORTASSETS2", value: 71)
!969 = !DIEnumerator(name: "TAG_DEFINEFONTALIGNZONES", value: 73)
!970 = !DIEnumerator(name: "TAG_CSMTEXTSETTINGS", value: 74)
!971 = !DIEnumerator(name: "TAG_DEFINEFONT3", value: 75)
!972 = !DIEnumerator(name: "TAG_SYMBOLCLASS", value: 76)
!973 = !DIEnumerator(name: "TAG_METADATA", value: 77)
!974 = !DIEnumerator(name: "TAG_DEFINESCALINGGRID", value: 78)
!975 = !DIEnumerator(name: "TAG_DOABC", value: 82)
!976 = !DIEnumerator(name: "TAG_DEFINESHAPE4", value: 83)
!977 = !DIEnumerator(name: "TAG_DEFINEMORPHSHAPE2", value: 84)
!978 = !DIEnumerator(name: "TAG_DEFINESCENEANDFRAMELABELDATA", value: 86)
!979 = !DIEnumerator(name: "TAG_DEFINEBINARYDATA", value: 87)
!980 = !DIEnumerator(name: "TAG_DEFINEFONTNAME", value: 88)
!981 = !DIEnumerator(name: "TAG_STARTSOUND2", value: 89)
!982 = !DIEnumerator(name: "TAG_DEFINEBITSJPEG4", value: 90)
!983 = !DIEnumerator(name: "TAG_DEFINEFONT4", value: 91)
!984 = !{!985, !986, !987, !990, !992, !993}
!985 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!986 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !988, line: 49, baseType: !989)
!988 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!989 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !988, line: 40, baseType: !991)
!991 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !995, line: 221, size: 32, align: 8, elements: !996)
!995 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !994, file: !995, line: 221, baseType: !998, size: 32, align: 32)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !988, line: 51, baseType: !986)
!999 = !{!1000, !2210}
!1000 = distinct !DIGlobalVariable(name: "ff_swf_muxer", scope: !0, file: !1001, line: 519, type: !1002, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_swf_muxer)
!1001 = !DIFile(filename: "libavformat/swfenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1004)
!1004 = !{!1005, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1026, !1067, !1069, !1070, !2175, !2176, !2177, !2181, !2185, !2189, !2190, !2195, !2196, !2197, !2198, !2199, !2200, !2204}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !897, line: 498, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1003, file: !897, line: 504, baseType: !1006, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1003, file: !897, line: 505, baseType: !1006, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1003, file: !897, line: 506, baseType: !1006, size: 64, align: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1003, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1003, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1003, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1003, file: !897, line: 517, baseType: !985, size: 32, align: 32, offset: 352)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1003, file: !897, line: 523, baseType: !1017, size: 64, align: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1022, line: 44, size: 64, align: 32, elements: !1023)
!1022 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1021, file: !1022, line: 45, baseType: !3, size: 32, align: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1021, file: !1022, line: 46, baseType: !986, size: 32, align: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1003, file: !897, line: 526, baseType: !1027, size: 64, align: 64, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1037, !1041, !1042, !1043, !1044, !1048, !1054, !1056, !1060}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1030, file: !464, line: 72, baseType: !1006, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1030, file: !464, line: 78, baseType: !1034, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1006, !992}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1030, file: !464, line: 85, baseType: !1038, size: 64, align: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1030, file: !464, line: 93, baseType: !985, size: 32, align: 32, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1030, file: !464, line: 99, baseType: !985, size: 32, align: 32, offset: 224)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1030, file: !464, line: 108, baseType: !985, size: 32, align: 32, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1030, file: !464, line: 113, baseType: !1045, size: 64, align: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!992, !992, !992}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1030, file: !464, line: 123, baseType: !1049, size: 64, align: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1052, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1030, file: !464, line: 130, baseType: !1055, size: 32, align: 32, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1030, file: !464, line: 136, baseType: !1057, size: 64, align: 64, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1055, !992}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1030, file: !464, line: 142, baseType: !1061, size: 64, align: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!985, !1064, !992, !1006, !985}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !897, line: 535, baseType: !1068, size: 64, align: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1003, file: !897, line: 539, baseType: !985, size: 32, align: 32, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1003, file: !897, line: 541, baseType: !1071, size: 64, align: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!985, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1176, !1177, !1178, !1244, !1245, !1246, !2029, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2083, !2084, !2085, !2086, !2087, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2138, !2139, !2142, !2143, !2144, !2145, !2146, !2147, !2152, !2153, !2154, !2155, !2163, !2164, !2168, !2172, !2173, !2174}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1075, file: !897, line: 1342, baseType: !1027, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1075, file: !897, line: 1349, baseType: !1079, size: 64, align: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1106, !1107, !1147, !1148, !1152, !1157, !1158, !1159, !1163, !1169, !1175}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1080, file: !897, line: 638, baseType: !1006, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1080, file: !897, line: 645, baseType: !1006, size: 64, align: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !897, line: 652, baseType: !985, size: 32, align: 32, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1080, file: !897, line: 659, baseType: !1006, size: 64, align: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1080, file: !897, line: 661, baseType: !1017, size: 64, align: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1080, file: !897, line: 663, baseType: !1027, size: 64, align: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1080, file: !897, line: 670, baseType: !1006, size: 64, align: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1080, file: !897, line: 679, baseType: !1079, size: 64, align: 64, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1080, file: !897, line: 684, baseType: !985, size: 32, align: 32, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1080, file: !897, line: 689, baseType: !985, size: 32, align: 32, offset: 544)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1080, file: !897, line: 696, baseType: !1093, size: 64, align: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!985, !1096}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1099)
!1099 = !{!1100, !1101, !1104, !1105}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1098, file: !897, line: 449, baseType: !1006, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1098, file: !897, line: 450, baseType: !1102, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1098, file: !897, line: 451, baseType: !985, size: 32, align: 32, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1098, file: !897, line: 452, baseType: !1006, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1080, file: !897, line: 703, baseType: !1071, size: 64, align: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1080, file: !897, line: 714, baseType: !1108, size: 64, align: 64, offset: 704)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!985, !1074, !1111}
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1114)
!1114 = !{!1115, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1143, !1144, !1145, !1146}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1113, file: !4, line: 1451, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1118, line: 94, baseType: !1119)
!1118 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1118, line: 81, size: 192, align: 64, elements: !1120)
!1120 = !{!1121, !1125, !1128}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1119, file: !1118, line: 82, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1118, line: 73, baseType: !1124)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1118, line: 73, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1119, file: !1118, line: 89, baseType: !1126, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !988, line: 48, baseType: !1103)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1119, file: !1118, line: 93, baseType: !985, size: 32, align: 32, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1113, file: !4, line: 1461, baseType: !990, size: 64, align: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1113, file: !4, line: 1467, baseType: !990, size: 64, align: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !4, line: 1468, baseType: !1126, size: 64, align: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1113, file: !4, line: 1469, baseType: !985, size: 32, align: 32, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1113, file: !4, line: 1470, baseType: !985, size: 32, align: 32, offset: 288)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !4, line: 1474, baseType: !985, size: 32, align: 32, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1113, file: !4, line: 1479, baseType: !1136, size: 64, align: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1139)
!1139 = !{!1140, !1141, !1142}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1138, file: !4, line: 1412, baseType: !1126, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !4, line: 1413, baseType: !985, size: 32, align: 32, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1138, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1113, file: !4, line: 1480, baseType: !985, size: 32, align: 32, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1113, file: !4, line: 1486, baseType: !990, size: 64, align: 64, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1113, file: !4, line: 1488, baseType: !990, size: 64, align: 64, offset: 576)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1113, file: !4, line: 1497, baseType: !990, size: 64, align: 64, offset: 640)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1080, file: !897, line: 720, baseType: !1071, size: 64, align: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1080, file: !897, line: 730, baseType: !1149, size: 64, align: 64, offset: 832)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!985, !1074, !985, !990, !985}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1080, file: !897, line: 737, baseType: !1153, size: 64, align: 64, offset: 896)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!990, !1074, !985, !1156, !990}
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1080, file: !897, line: 744, baseType: !1071, size: 64, align: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1080, file: !897, line: 750, baseType: !1071, size: 64, align: 64, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1080, file: !897, line: 758, baseType: !1160, size: 64, align: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!985, !1074, !985, !990, !990, !990, !985}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1080, file: !897, line: 764, baseType: !1164, size: 64, align: 64, offset: 1152)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DISubroutineType(types: !1166)
!1166 = !{!985, !1074, !1167}
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1080, file: !897, line: 770, baseType: !1170, size: 64, align: 64, offset: 1216)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!985, !1074, !1173}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1080, file: !897, line: 776, baseType: !1170, size: 64, align: 64, offset: 1280)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1075, file: !897, line: 1356, baseType: !1068, size: 64, align: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1075, file: !897, line: 1365, baseType: !992, size: 64, align: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1075, file: !897, line: 1379, baseType: !1179, size: 64, align: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187, !1188, !1189, !1193, !1194, !1198, !1199, !1200, !1201, !1202, !1204, !1205, !1211, !1212, !1216, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1234, !1235, !1236, !1237, !1241, !1242, !1243}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1181, file: !515, line: 174, baseType: !1027, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1181, file: !515, line: 226, baseType: !1102, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1181, file: !515, line: 227, baseType: !985, size: 32, align: 32, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1181, file: !515, line: 228, baseType: !1102, size: 64, align: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1181, file: !515, line: 229, baseType: !1102, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1181, file: !515, line: 233, baseType: !992, size: 64, align: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1181, file: !515, line: 235, baseType: !1190, size: 64, align: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!985, !992, !1126, !985}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1181, file: !515, line: 236, baseType: !1190, size: 64, align: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1181, file: !515, line: 237, baseType: !1195, size: 64, align: 64, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{!990, !992, !990, !985}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1181, file: !515, line: 238, baseType: !990, size: 64, align: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1181, file: !515, line: 239, baseType: !985, size: 32, align: 32, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1181, file: !515, line: 240, baseType: !985, size: 32, align: 32, offset: 672)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1181, file: !515, line: 241, baseType: !985, size: 32, align: 32, offset: 704)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1181, file: !515, line: 242, baseType: !1203, size: 64, align: 64, offset: 768)
!1203 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1181, file: !515, line: 243, baseType: !1102, size: 64, align: 64, offset: 832)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1181, file: !515, line: 244, baseType: !1206, size: 64, align: 64, offset: 896)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DISubroutineType(types: !1208)
!1208 = !{!1203, !1203, !1209, !986}
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1127)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1181, file: !515, line: 245, baseType: !985, size: 32, align: 32, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1181, file: !515, line: 249, baseType: !1213, size: 64, align: 64, offset: 1024)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!985, !992, !985}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1181, file: !515, line: 255, baseType: !1217, size: 64, align: 64, offset: 1088)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!990, !992, !985, !990, !985}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1181, file: !515, line: 260, baseType: !985, size: 32, align: 32, offset: 1152)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1181, file: !515, line: 266, baseType: !990, size: 64, align: 64, offset: 1216)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1181, file: !515, line: 273, baseType: !985, size: 32, align: 32, offset: 1280)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1181, file: !515, line: 279, baseType: !990, size: 64, align: 64, offset: 1344)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1181, file: !515, line: 285, baseType: !985, size: 32, align: 32, offset: 1408)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1181, file: !515, line: 291, baseType: !985, size: 32, align: 32, offset: 1440)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1181, file: !515, line: 298, baseType: !985, size: 32, align: 32, offset: 1472)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1181, file: !515, line: 304, baseType: !985, size: 32, align: 32, offset: 1504)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1181, file: !515, line: 309, baseType: !1006, size: 64, align: 64, offset: 1536)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1181, file: !515, line: 314, baseType: !1006, size: 64, align: 64, offset: 1600)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1181, file: !515, line: 319, baseType: !1231, size: 64, align: 64, offset: 1664)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!985, !992, !1126, !985, !514, !990}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1181, file: !515, line: 326, baseType: !985, size: 32, align: 32, offset: 1728)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1181, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1181, file: !515, line: 332, baseType: !990, size: 64, align: 64, offset: 1792)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1181, file: !515, line: 338, baseType: !1238, size: 64, align: 64, offset: 1856)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!985, !992}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1181, file: !515, line: 340, baseType: !990, size: 64, align: 64, offset: 1920)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1181, file: !515, line: 346, baseType: !1102, size: 64, align: 64, offset: 1984)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1181, file: !515, line: 351, baseType: !985, size: 32, align: 32, offset: 2048)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1075, file: !897, line: 1386, baseType: !985, size: 32, align: 32, offset: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1075, file: !897, line: 1393, baseType: !986, size: 32, align: 32, offset: 352)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1075, file: !897, line: 1405, baseType: !1247, size: 64, align: 64, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1251)
!1251 = !{!1252, !1253, !1254, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1814, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1915, !1921, !1922, !1926, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1958, !1959, !1960, !1961, !1962, !1963}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1250, file: !897, line: 866, baseType: !985, size: 32, align: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1250, file: !897, line: 872, baseType: !985, size: 32, align: 32, offset: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1250, file: !897, line: 878, baseType: !1255, size: 64, align: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262, !1489, !1490, !1491, !1492, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1518, !1522, !1523, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1702, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1257, file: !4, line: 1561, baseType: !1027, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1257, file: !4, line: 1562, baseType: !985, size: 32, align: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1257, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1257, file: !4, line: 1565, baseType: !1263, size: 64, align: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1272, !1281, !1284, !1287, !1290, !1294, !1295, !1296, !1304, !1305, !1306, !1308, !1312, !1318, !1323, !1327, !1328, !1373, !1460, !1464, !1465, !1469, !1473, !1478, !1482, !1483, !1484}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1265, file: !4, line: 3475, baseType: !1006, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1265, file: !4, line: 3480, baseType: !1006, size: 64, align: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1265, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1265, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1265, file: !4, line: 3487, baseType: !985, size: 32, align: 32, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1265, file: !4, line: 3488, baseType: !1273, size: 64, align: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1276, line: 61, baseType: !1277)
!1276 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1276, line: 58, size: 64, align: 32, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1277, file: !1276, line: 59, baseType: !985, size: 32, align: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1277, file: !1276, line: 60, baseType: !985, size: 32, align: 32, offset: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1265, file: !4, line: 3489, baseType: !1282, size: 64, align: 64, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1265, file: !4, line: 3490, baseType: !1285, size: 64, align: 64, offset: 384)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1265, file: !4, line: 3491, baseType: !1288, size: 64, align: 64, offset: 448)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1265, file: !4, line: 3492, baseType: !1291, size: 64, align: 64, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !988, line: 55, baseType: !1203)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1265, file: !4, line: 3493, baseType: !1127, size: 8, align: 8, offset: 576)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1265, file: !4, line: 3494, baseType: !1027, size: 64, align: 64, offset: 640)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1265, file: !4, line: 3495, baseType: !1297, size: 64, align: 64, offset: 704)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1301)
!1301 = !{!1302, !1303}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1300, file: !4, line: 3402, baseType: !985, size: 32, align: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1300, file: !4, line: 3403, baseType: !1006, size: 64, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1265, file: !4, line: 3507, baseType: !1006, size: 64, align: 64, offset: 768)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1265, file: !4, line: 3516, baseType: !985, size: 32, align: 32, offset: 832)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1265, file: !4, line: 3517, baseType: !1307, size: 64, align: 64, offset: 896)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1265, file: !4, line: 3527, baseType: !1309, size: 64, align: 64, offset: 960)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!985, !1255}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1265, file: !4, line: 3535, baseType: !1313, size: 64, align: 64, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DISubroutineType(types: !1315)
!1315 = !{!985, !1255, !1316}
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1265, file: !4, line: 3541, baseType: !1319, size: 64, align: 64, offset: 1088)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1321)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1322)
!1322 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1265, file: !4, line: 3549, baseType: !1324, size: 64, align: 64, offset: 1152)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{null, !1307}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1265, file: !4, line: 3551, baseType: !1309, size: 64, align: 64, offset: 1216)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1265, file: !4, line: 3552, baseType: !1329, size: 64, align: 64, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!985, !1255, !1126, !985, !1332}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1340, !1372}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1334, file: !4, line: 3921, baseType: !987, size: 16, align: 16)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1334, file: !4, line: 3922, baseType: !998, size: 32, align: 32, offset: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1334, file: !4, line: 3923, baseType: !998, size: 32, align: 32, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1334, file: !4, line: 3924, baseType: !986, size: 32, align: 32, offset: 96)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1334, file: !4, line: 3925, baseType: !1341, size: 64, align: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1349, !1350, !1351, !1361, !1365, !1367, !1368, !1370, !1371}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1344, file: !4, line: 3886, baseType: !985, size: 32, align: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1344, file: !4, line: 3887, baseType: !985, size: 32, align: 32, offset: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1344, file: !4, line: 3888, baseType: !985, size: 32, align: 32, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1344, file: !4, line: 3889, baseType: !985, size: 32, align: 32, offset: 96)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1344, file: !4, line: 3890, baseType: !985, size: 32, align: 32, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1344, file: !4, line: 3897, baseType: !1352, size: 768, align: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1354)
!1354 = !{!1355, !1359}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1353, file: !4, line: 3855, baseType: !1356, size: 512, align: 64)
!1356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 512, align: 64, elements: !1357)
!1357 = !{!1358}
!1358 = !DISubrange(count: 8)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1353, file: !4, line: 3857, baseType: !1360, size: 256, align: 32, offset: 512)
!1360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 256, align: 32, elements: !1357)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1344, file: !4, line: 3903, baseType: !1362, size: 256, align: 64, offset: 960)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 256, align: 64, elements: !1363)
!1363 = !{!1364}
!1364 = !DISubrange(count: 4)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1344, file: !4, line: 3904, baseType: !1366, size: 128, align: 32, offset: 1216)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 128, align: 32, elements: !1363)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1344, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1344, file: !4, line: 3908, baseType: !1369, size: 64, align: 64, offset: 1408)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1344, file: !4, line: 3915, baseType: !1369, size: 64, align: 64, offset: 1472)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1344, file: !4, line: 3917, baseType: !985, size: 32, align: 32, offset: 1536)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1334, file: !4, line: 3926, baseType: !990, size: 64, align: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1265, file: !4, line: 3564, baseType: !1374, size: 64, align: 64, offset: 1344)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!985, !1255, !1111, !1377, !1459}
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1379)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1381)
!1381 = !{!1382, !1383, !1384, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1411, !1413, !1414, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1447, !1448, !1449, !1450, !1451, !1452, !1455, !1456, !1457, !1458}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1380, file: !767, line: 282, baseType: !1356, size: 512, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1380, file: !767, line: 299, baseType: !1360, size: 256, align: 32, offset: 512)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1380, file: !767, line: 315, baseType: !1385, size: 64, align: 64, offset: 768)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1380, file: !767, line: 326, baseType: !985, size: 32, align: 32, offset: 832)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1380, file: !767, line: 326, baseType: !985, size: 32, align: 32, offset: 864)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1380, file: !767, line: 334, baseType: !985, size: 32, align: 32, offset: 896)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1380, file: !767, line: 341, baseType: !985, size: 32, align: 32, offset: 928)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1380, file: !767, line: 346, baseType: !985, size: 32, align: 32, offset: 960)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1380, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1380, file: !767, line: 356, baseType: !1275, size: 64, align: 32, offset: 1024)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1380, file: !767, line: 361, baseType: !990, size: 64, align: 64, offset: 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1380, file: !767, line: 369, baseType: !990, size: 64, align: 64, offset: 1152)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1380, file: !767, line: 377, baseType: !990, size: 64, align: 64, offset: 1216)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1380, file: !767, line: 382, baseType: !985, size: 32, align: 32, offset: 1280)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1380, file: !767, line: 386, baseType: !985, size: 32, align: 32, offset: 1312)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1380, file: !767, line: 391, baseType: !985, size: 32, align: 32, offset: 1344)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1380, file: !767, line: 396, baseType: !992, size: 64, align: 64, offset: 1408)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1380, file: !767, line: 403, baseType: !1401, size: 512, align: 64, offset: 1472)
!1401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1293, size: 512, align: 64, elements: !1357)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1380, file: !767, line: 410, baseType: !985, size: 32, align: 32, offset: 1984)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1380, file: !767, line: 415, baseType: !985, size: 32, align: 32, offset: 2016)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1380, file: !767, line: 420, baseType: !985, size: 32, align: 32, offset: 2048)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1380, file: !767, line: 425, baseType: !985, size: 32, align: 32, offset: 2080)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1380, file: !767, line: 435, baseType: !990, size: 64, align: 64, offset: 2112)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1380, file: !767, line: 440, baseType: !985, size: 32, align: 32, offset: 2176)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1380, file: !767, line: 445, baseType: !1293, size: 64, align: 64, offset: 2240)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1380, file: !767, line: 459, baseType: !1410, size: 512, align: 64, offset: 2304)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 512, align: 64, elements: !1357)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1380, file: !767, line: 473, baseType: !1412, size: 64, align: 64, offset: 2816)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1380, file: !767, line: 477, baseType: !985, size: 32, align: 32, offset: 2880)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1380, file: !767, line: 479, baseType: !1415, size: 64, align: 64, offset: 2944)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1419)
!1419 = !{!1420, !1421, !1422, !1423, !1428}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1418, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1418, file: !767, line: 203, baseType: !1126, size: 64, align: 64, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1418, file: !767, line: 204, baseType: !985, size: 32, align: 32, offset: 128)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1418, file: !767, line: 205, baseType: !1424, size: 64, align: 64, offset: 192)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1426, line: 86, baseType: !1427)
!1426 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1426, line: 86, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1418, file: !767, line: 206, baseType: !1116, size: 64, align: 64, offset: 256)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1380, file: !767, line: 480, baseType: !985, size: 32, align: 32, offset: 3008)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1380, file: !767, line: 505, baseType: !985, size: 32, align: 32, offset: 3040)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1380, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1380, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1380, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1380, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1380, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1380, file: !767, line: 532, baseType: !990, size: 64, align: 64, offset: 3264)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1380, file: !767, line: 539, baseType: !990, size: 64, align: 64, offset: 3328)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1380, file: !767, line: 547, baseType: !990, size: 64, align: 64, offset: 3392)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1380, file: !767, line: 554, baseType: !1424, size: 64, align: 64, offset: 3456)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1380, file: !767, line: 563, baseType: !985, size: 32, align: 32, offset: 3520)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1380, file: !767, line: 572, baseType: !985, size: 32, align: 32, offset: 3552)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1380, file: !767, line: 581, baseType: !985, size: 32, align: 32, offset: 3584)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1380, file: !767, line: 588, baseType: !1444, size: 64, align: 64, offset: 3648)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !988, line: 36, baseType: !1446)
!1446 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1380, file: !767, line: 593, baseType: !985, size: 32, align: 32, offset: 3712)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1380, file: !767, line: 596, baseType: !985, size: 32, align: 32, offset: 3744)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1380, file: !767, line: 599, baseType: !1116, size: 64, align: 64, offset: 3776)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1380, file: !767, line: 605, baseType: !1116, size: 64, align: 64, offset: 3840)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1380, file: !767, line: 616, baseType: !1116, size: 64, align: 64, offset: 3904)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1380, file: !767, line: 626, baseType: !1453, size: 64, align: 64, offset: 3968)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1454, line: 216, baseType: !1203)
!1454 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1380, file: !767, line: 627, baseType: !1453, size: 64, align: 64, offset: 4032)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1380, file: !767, line: 628, baseType: !1453, size: 64, align: 64, offset: 4096)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1380, file: !767, line: 629, baseType: !1453, size: 64, align: 64, offset: 4160)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1380, file: !767, line: 645, baseType: !1116, size: 64, align: 64, offset: 4224)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1265, file: !4, line: 3566, baseType: !1461, size: 64, align: 64, offset: 1408)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!985, !1255, !992, !1459, !1111}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1265, file: !4, line: 3567, baseType: !1309, size: 64, align: 64, offset: 1472)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1265, file: !4, line: 3576, baseType: !1466, size: 64, align: 64, offset: 1536)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64, align: 64)
!1467 = !DISubroutineType(types: !1468)
!1468 = !{!985, !1255, !1377}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1265, file: !4, line: 3577, baseType: !1470, size: 64, align: 64, offset: 1600)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!985, !1255, !1111}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1265, file: !4, line: 3584, baseType: !1474, size: 64, align: 64, offset: 1664)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64, align: 64)
!1475 = !DISubroutineType(types: !1476)
!1476 = !{!985, !1255, !1477}
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1265, file: !4, line: 3589, baseType: !1479, size: 64, align: 64, offset: 1728)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{null, !1255}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1265, file: !4, line: 3594, baseType: !985, size: 32, align: 32, offset: 1792)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1265, file: !4, line: 3600, baseType: !1006, size: 64, align: 64, offset: 1856)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1265, file: !4, line: 3609, baseType: !1485, size: 64, align: 64, offset: 1920)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1488)
!1488 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1257, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1257, file: !4, line: 1581, baseType: !986, size: 32, align: 32, offset: 224)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1257, file: !4, line: 1583, baseType: !992, size: 64, align: 64, offset: 256)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1257, file: !4, line: 1591, baseType: !1493, size: 64, align: 64, offset: 320)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1257, file: !4, line: 1598, baseType: !992, size: 64, align: 64, offset: 384)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1257, file: !4, line: 1606, baseType: !990, size: 64, align: 64, offset: 448)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1257, file: !4, line: 1614, baseType: !985, size: 32, align: 32, offset: 512)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1257, file: !4, line: 1622, baseType: !985, size: 32, align: 32, offset: 544)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1257, file: !4, line: 1628, baseType: !985, size: 32, align: 32, offset: 576)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1257, file: !4, line: 1636, baseType: !985, size: 32, align: 32, offset: 608)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1257, file: !4, line: 1643, baseType: !985, size: 32, align: 32, offset: 640)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1257, file: !4, line: 1657, baseType: !1126, size: 64, align: 64, offset: 704)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1257, file: !4, line: 1658, baseType: !985, size: 32, align: 32, offset: 768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1257, file: !4, line: 1679, baseType: !1275, size: 64, align: 32, offset: 800)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1257, file: !4, line: 1688, baseType: !985, size: 32, align: 32, offset: 864)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1257, file: !4, line: 1712, baseType: !985, size: 32, align: 32, offset: 896)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1257, file: !4, line: 1729, baseType: !985, size: 32, align: 32, offset: 928)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1257, file: !4, line: 1729, baseType: !985, size: 32, align: 32, offset: 960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1257, file: !4, line: 1744, baseType: !985, size: 32, align: 32, offset: 992)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1257, file: !4, line: 1744, baseType: !985, size: 32, align: 32, offset: 1024)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1257, file: !4, line: 1751, baseType: !985, size: 32, align: 32, offset: 1056)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1257, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1257, file: !4, line: 1791, baseType: !1514, size: 64, align: 64, offset: 1152)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{null, !1517, !1377, !1459, !985, !985, !985}
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1257, file: !4, line: 1808, baseType: !1519, size: 64, align: 64, offset: 1216)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!533, !1517, !1282}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1257, file: !4, line: 1816, baseType: !985, size: 32, align: 32, offset: 1280)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1257, file: !4, line: 1825, baseType: !1524, size: 32, align: 32, offset: 1312)
!1524 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1257, file: !4, line: 1830, baseType: !985, size: 32, align: 32, offset: 1344)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1257, file: !4, line: 1838, baseType: !1524, size: 32, align: 32, offset: 1376)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1257, file: !4, line: 1846, baseType: !985, size: 32, align: 32, offset: 1408)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1257, file: !4, line: 1851, baseType: !985, size: 32, align: 32, offset: 1440)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1257, file: !4, line: 1861, baseType: !1524, size: 32, align: 32, offset: 1472)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1257, file: !4, line: 1868, baseType: !1524, size: 32, align: 32, offset: 1504)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1257, file: !4, line: 1875, baseType: !1524, size: 32, align: 32, offset: 1536)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1257, file: !4, line: 1882, baseType: !1524, size: 32, align: 32, offset: 1568)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1257, file: !4, line: 1889, baseType: !1524, size: 32, align: 32, offset: 1600)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1257, file: !4, line: 1896, baseType: !1524, size: 32, align: 32, offset: 1632)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1257, file: !4, line: 1903, baseType: !1524, size: 32, align: 32, offset: 1664)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1257, file: !4, line: 1910, baseType: !985, size: 32, align: 32, offset: 1696)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1257, file: !4, line: 1915, baseType: !985, size: 32, align: 32, offset: 1728)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1257, file: !4, line: 1926, baseType: !1459, size: 64, align: 64, offset: 1792)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1257, file: !4, line: 1935, baseType: !1275, size: 64, align: 32, offset: 1856)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1257, file: !4, line: 1942, baseType: !985, size: 32, align: 32, offset: 1920)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1257, file: !4, line: 1948, baseType: !985, size: 32, align: 32, offset: 1952)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1257, file: !4, line: 1954, baseType: !985, size: 32, align: 32, offset: 1984)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1257, file: !4, line: 1960, baseType: !985, size: 32, align: 32, offset: 2016)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1257, file: !4, line: 1984, baseType: !985, size: 32, align: 32, offset: 2048)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1257, file: !4, line: 1991, baseType: !985, size: 32, align: 32, offset: 2080)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1257, file: !4, line: 1996, baseType: !985, size: 32, align: 32, offset: 2112)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1257, file: !4, line: 2004, baseType: !985, size: 32, align: 32, offset: 2144)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1257, file: !4, line: 2011, baseType: !985, size: 32, align: 32, offset: 2176)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1257, file: !4, line: 2018, baseType: !985, size: 32, align: 32, offset: 2208)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1257, file: !4, line: 2027, baseType: !985, size: 32, align: 32, offset: 2240)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1257, file: !4, line: 2034, baseType: !985, size: 32, align: 32, offset: 2272)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1257, file: !4, line: 2044, baseType: !985, size: 32, align: 32, offset: 2304)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1257, file: !4, line: 2054, baseType: !1554, size: 64, align: 64, offset: 2368)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1257, file: !4, line: 2061, baseType: !1554, size: 64, align: 64, offset: 2432)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1257, file: !4, line: 2066, baseType: !985, size: 32, align: 32, offset: 2496)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1257, file: !4, line: 2070, baseType: !985, size: 32, align: 32, offset: 2528)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1257, file: !4, line: 2078, baseType: !985, size: 32, align: 32, offset: 2560)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1257, file: !4, line: 2085, baseType: !985, size: 32, align: 32, offset: 2592)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1257, file: !4, line: 2092, baseType: !985, size: 32, align: 32, offset: 2624)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1257, file: !4, line: 2099, baseType: !985, size: 32, align: 32, offset: 2656)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1257, file: !4, line: 2106, baseType: !985, size: 32, align: 32, offset: 2688)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1257, file: !4, line: 2113, baseType: !985, size: 32, align: 32, offset: 2720)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1257, file: !4, line: 2120, baseType: !985, size: 32, align: 32, offset: 2752)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1257, file: !4, line: 2125, baseType: !985, size: 32, align: 32, offset: 2784)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1257, file: !4, line: 2133, baseType: !985, size: 32, align: 32, offset: 2816)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1257, file: !4, line: 2140, baseType: !985, size: 32, align: 32, offset: 2848)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1257, file: !4, line: 2145, baseType: !985, size: 32, align: 32, offset: 2880)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1257, file: !4, line: 2153, baseType: !985, size: 32, align: 32, offset: 2912)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1257, file: !4, line: 2158, baseType: !985, size: 32, align: 32, offset: 2944)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1257, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1257, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1257, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1257, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1257, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1257, file: !4, line: 2203, baseType: !985, size: 32, align: 32, offset: 3136)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1257, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1257, file: !4, line: 2212, baseType: !985, size: 32, align: 32, offset: 3200)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1257, file: !4, line: 2213, baseType: !985, size: 32, align: 32, offset: 3232)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1257, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1257, file: !4, line: 2232, baseType: !985, size: 32, align: 32, offset: 3296)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1257, file: !4, line: 2243, baseType: !985, size: 32, align: 32, offset: 3328)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1257, file: !4, line: 2249, baseType: !985, size: 32, align: 32, offset: 3360)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1257, file: !4, line: 2256, baseType: !985, size: 32, align: 32, offset: 3392)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1257, file: !4, line: 2263, baseType: !1293, size: 64, align: 64, offset: 3456)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1257, file: !4, line: 2270, baseType: !1293, size: 64, align: 64, offset: 3520)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1257, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1257, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1257, file: !4, line: 2367, baseType: !1590, size: 64, align: 64, offset: 3648)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!985, !1517, !1477, !985}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1257, file: !4, line: 2383, baseType: !985, size: 32, align: 32, offset: 3712)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1257, file: !4, line: 2386, baseType: !1524, size: 32, align: 32, offset: 3744)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1257, file: !4, line: 2387, baseType: !1524, size: 32, align: 32, offset: 3776)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1257, file: !4, line: 2394, baseType: !985, size: 32, align: 32, offset: 3808)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1257, file: !4, line: 2401, baseType: !985, size: 32, align: 32, offset: 3840)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1257, file: !4, line: 2408, baseType: !985, size: 32, align: 32, offset: 3872)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1257, file: !4, line: 2415, baseType: !985, size: 32, align: 32, offset: 3904)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1257, file: !4, line: 2422, baseType: !985, size: 32, align: 32, offset: 3936)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1257, file: !4, line: 2423, baseType: !1602, size: 64, align: 64, offset: 3968)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1605)
!1605 = !{!1606, !1607, !1608, !1609}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1604, file: !4, line: 827, baseType: !985, size: 32, align: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1604, file: !4, line: 828, baseType: !985, size: 32, align: 32, offset: 32)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1604, file: !4, line: 829, baseType: !985, size: 32, align: 32, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1604, file: !4, line: 830, baseType: !1524, size: 32, align: 32, offset: 96)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1257, file: !4, line: 2430, baseType: !990, size: 64, align: 64, offset: 4032)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1257, file: !4, line: 2437, baseType: !990, size: 64, align: 64, offset: 4096)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1257, file: !4, line: 2444, baseType: !1524, size: 32, align: 32, offset: 4160)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1257, file: !4, line: 2451, baseType: !1524, size: 32, align: 32, offset: 4192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1257, file: !4, line: 2458, baseType: !985, size: 32, align: 32, offset: 4224)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1257, file: !4, line: 2469, baseType: !985, size: 32, align: 32, offset: 4256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1257, file: !4, line: 2475, baseType: !985, size: 32, align: 32, offset: 4288)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1257, file: !4, line: 2481, baseType: !985, size: 32, align: 32, offset: 4320)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1257, file: !4, line: 2485, baseType: !985, size: 32, align: 32, offset: 4352)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1257, file: !4, line: 2489, baseType: !985, size: 32, align: 32, offset: 4384)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1257, file: !4, line: 2493, baseType: !985, size: 32, align: 32, offset: 4416)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1257, file: !4, line: 2501, baseType: !985, size: 32, align: 32, offset: 4448)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1257, file: !4, line: 2506, baseType: !985, size: 32, align: 32, offset: 4480)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1257, file: !4, line: 2510, baseType: !985, size: 32, align: 32, offset: 4512)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1257, file: !4, line: 2514, baseType: !990, size: 64, align: 64, offset: 4544)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1257, file: !4, line: 2528, baseType: !1626, size: 64, align: 64, offset: 4608)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{null, !1517, !992, !985, !985}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1257, file: !4, line: 2534, baseType: !985, size: 32, align: 32, offset: 4672)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1257, file: !4, line: 2545, baseType: !985, size: 32, align: 32, offset: 4704)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1257, file: !4, line: 2547, baseType: !985, size: 32, align: 32, offset: 4736)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1257, file: !4, line: 2549, baseType: !985, size: 32, align: 32, offset: 4768)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1257, file: !4, line: 2551, baseType: !985, size: 32, align: 32, offset: 4800)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1257, file: !4, line: 2553, baseType: !985, size: 32, align: 32, offset: 4832)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1257, file: !4, line: 2555, baseType: !985, size: 32, align: 32, offset: 4864)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1257, file: !4, line: 2557, baseType: !985, size: 32, align: 32, offset: 4896)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1257, file: !4, line: 2559, baseType: !985, size: 32, align: 32, offset: 4928)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1257, file: !4, line: 2563, baseType: !985, size: 32, align: 32, offset: 4960)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1257, file: !4, line: 2571, baseType: !1369, size: 64, align: 64, offset: 4992)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1257, file: !4, line: 2579, baseType: !1369, size: 64, align: 64, offset: 5056)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1257, file: !4, line: 2586, baseType: !985, size: 32, align: 32, offset: 5120)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1257, file: !4, line: 2615, baseType: !985, size: 32, align: 32, offset: 5152)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1257, file: !4, line: 2627, baseType: !985, size: 32, align: 32, offset: 5184)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1257, file: !4, line: 2637, baseType: !985, size: 32, align: 32, offset: 5216)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1257, file: !4, line: 2681, baseType: !985, size: 32, align: 32, offset: 5248)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1257, file: !4, line: 2709, baseType: !990, size: 64, align: 64, offset: 5312)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1257, file: !4, line: 2716, baseType: !1648, size: 64, align: 64, offset: 5376)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1650)
!1650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1651)
!1651 = !{!1652, !1653, !1654, !1655, !1656, !1657, !1658, !1662, !1666, !1667, !1668, !1669, !1675, !1676, !1677, !1678, !1679}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1650, file: !4, line: 3642, baseType: !1006, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1650, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1650, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1650, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1650, file: !4, line: 3669, baseType: !985, size: 32, align: 32, offset: 160)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1650, file: !4, line: 3682, baseType: !1474, size: 64, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1650, file: !4, line: 3698, baseType: !1659, size: 64, align: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!985, !1255, !1209, !998}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1650, file: !4, line: 3712, baseType: !1663, size: 64, align: 64, offset: 320)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!985, !1255, !985, !1209, !998}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1650, file: !4, line: 3726, baseType: !1659, size: 64, align: 64, offset: 384)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1650, file: !4, line: 3737, baseType: !1309, size: 64, align: 64, offset: 448)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1650, file: !4, line: 3746, baseType: !985, size: 32, align: 32, offset: 512)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1650, file: !4, line: 3757, baseType: !1670, size: 64, align: 64, offset: 576)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1673}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1650, file: !4, line: 3766, baseType: !1309, size: 64, align: 64, offset: 640)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1650, file: !4, line: 3774, baseType: !1309, size: 64, align: 64, offset: 704)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1650, file: !4, line: 3780, baseType: !985, size: 32, align: 32, offset: 768)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1650, file: !4, line: 3785, baseType: !985, size: 32, align: 32, offset: 800)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1650, file: !4, line: 3795, baseType: !1680, size: 64, align: 64, offset: 832)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!985, !1255, !1116}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1257, file: !4, line: 2728, baseType: !992, size: 64, align: 64, offset: 5440)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1257, file: !4, line: 2735, baseType: !1401, size: 512, align: 64, offset: 5504)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1257, file: !4, line: 2742, baseType: !985, size: 32, align: 32, offset: 6016)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1257, file: !4, line: 2755, baseType: !985, size: 32, align: 32, offset: 6048)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1257, file: !4, line: 2776, baseType: !985, size: 32, align: 32, offset: 6080)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1257, file: !4, line: 2783, baseType: !985, size: 32, align: 32, offset: 6112)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1257, file: !4, line: 2791, baseType: !985, size: 32, align: 32, offset: 6144)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1257, file: !4, line: 2802, baseType: !1477, size: 64, align: 64, offset: 6208)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1257, file: !4, line: 2811, baseType: !985, size: 32, align: 32, offset: 6272)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1257, file: !4, line: 2821, baseType: !985, size: 32, align: 32, offset: 6304)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1257, file: !4, line: 2830, baseType: !985, size: 32, align: 32, offset: 6336)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1257, file: !4, line: 2840, baseType: !985, size: 32, align: 32, offset: 6368)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1257, file: !4, line: 2851, baseType: !1696, size: 64, align: 64, offset: 6400)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!985, !1517, !1699, !992, !1459, !985, !985}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{!985, !1517, !992}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1257, file: !4, line: 2871, baseType: !1703, size: 64, align: 64, offset: 6464)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!985, !1517, !1706, !992, !1459, !985}
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!985, !1517, !992, !985, !985}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1257, file: !4, line: 2878, baseType: !985, size: 32, align: 32, offset: 6528)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1257, file: !4, line: 2885, baseType: !985, size: 32, align: 32, offset: 6560)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1257, file: !4, line: 3005, baseType: !985, size: 32, align: 32, offset: 6592)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1257, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1257, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1257, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1257, file: !4, line: 3037, baseType: !1126, size: 64, align: 64, offset: 6720)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1257, file: !4, line: 3038, baseType: !985, size: 32, align: 32, offset: 6784)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1257, file: !4, line: 3050, baseType: !1293, size: 64, align: 64, offset: 6848)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1257, file: !4, line: 3065, baseType: !985, size: 32, align: 32, offset: 6912)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1257, file: !4, line: 3083, baseType: !985, size: 32, align: 32, offset: 6944)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1257, file: !4, line: 3092, baseType: !1275, size: 64, align: 32, offset: 6976)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1257, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1257, file: !4, line: 3106, baseType: !1275, size: 64, align: 32, offset: 7072)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1257, file: !4, line: 3113, baseType: !1724, size: 64, align: 64, offset: 7168)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1726)
!1726 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1727)
!1727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1728)
!1728 = !{!1729, !1730, !1731, !1732, !1733, !1734, !1737}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1727, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1727, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1727, file: !4, line: 720, baseType: !1006, size: 64, align: 64, offset: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1727, file: !4, line: 724, baseType: !1006, size: 64, align: 64, offset: 128)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1727, file: !4, line: 728, baseType: !985, size: 32, align: 32, offset: 192)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1727, file: !4, line: 734, baseType: !1735, size: 64, align: 64, offset: 256)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1727, file: !4, line: 739, baseType: !1738, size: 64, align: 64, offset: 320)
!1738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1739, size: 64, align: 64)
!1739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1300)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1257, file: !4, line: 3129, baseType: !990, size: 64, align: 64, offset: 7232)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1257, file: !4, line: 3130, baseType: !990, size: 64, align: 64, offset: 7296)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1257, file: !4, line: 3131, baseType: !990, size: 64, align: 64, offset: 7360)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1257, file: !4, line: 3132, baseType: !990, size: 64, align: 64, offset: 7424)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1257, file: !4, line: 3139, baseType: !1369, size: 64, align: 64, offset: 7488)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1257, file: !4, line: 3147, baseType: !985, size: 32, align: 32, offset: 7552)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1257, file: !4, line: 3165, baseType: !985, size: 32, align: 32, offset: 7584)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1257, file: !4, line: 3172, baseType: !985, size: 32, align: 32, offset: 7616)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1257, file: !4, line: 3180, baseType: !985, size: 32, align: 32, offset: 7648)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1257, file: !4, line: 3191, baseType: !1554, size: 64, align: 64, offset: 7680)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1257, file: !4, line: 3199, baseType: !1126, size: 64, align: 64, offset: 7744)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1257, file: !4, line: 3207, baseType: !1369, size: 64, align: 64, offset: 7808)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1257, file: !4, line: 3214, baseType: !986, size: 32, align: 32, offset: 7872)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1257, file: !4, line: 3224, baseType: !1136, size: 64, align: 64, offset: 7936)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1257, file: !4, line: 3225, baseType: !985, size: 32, align: 32, offset: 8000)
