; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dcadec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dcadec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }

!987 = !{!988, !989, !990, !991, !992, !993, !994, !995, !996}
!988 = !DIEnumerator(name: "AV_CRC_8_ATM", value: 0)
!989 = !DIEnumerator(name: "AV_CRC_16_ANSI", value: 1)
!990 = !DIEnumerator(name: "AV_CRC_16_CCITT", value: 2)
!991 = !DIEnumerator(name: "AV_CRC_32_IEEE", value: 3)
!992 = !DIEnumerator(name: "AV_CRC_32_IEEE_LE", value: 4)
!993 = !DIEnumerator(name: "AV_CRC_16_ANSI_LE", value: 5)
!994 = !DIEnumerator(name: "AV_CRC_24_IEEE", value: 6)
!995 = !DIEnumerator(name: "AV_CRC_8_EBU", value: 7)
!996 = !DIEnumerator(name: "AV_CRC_MAX", value: 8)
!997 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DCAExtensionMask", file: !910, line: 169, size: 32, align: 32, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012}
!999 = !DIEnumerator(name: "DCA_CSS_CORE", value: 1)
!1000 = !DIEnumerator(name: "DCA_CSS_XXCH", value: 2)
!1001 = !DIEnumerator(name: "DCA_CSS_X96", value: 4)
!1002 = !DIEnumerator(name: "DCA_CSS_XCH", value: 8)
!1003 = !DIEnumerator(name: "DCA_CSS_MASK", value: 15)
!1004 = !DIEnumerator(name: "DCA_EXSS_CORE", value: 16)
!1005 = !DIEnumerator(name: "DCA_EXSS_XBR", value: 32)
!1006 = !DIEnumerator(name: "DCA_EXSS_XXCH", value: 64)
!1007 = !DIEnumerator(name: "DCA_EXSS_X96", value: 128)
!1008 = !DIEnumerator(name: "DCA_EXSS_LBR", value: 256)
!1009 = !DIEnumerator(name: "DCA_EXSS_XLL", value: 512)
!1010 = !DIEnumerator(name: "DCA_EXSS_RSV1", value: 1024)
!1011 = !DIEnumerator(name: "DCA_EXSS_RSV2", value: 2048)
!1012 = !DIEnumerator(name: "DCA_EXSS_MASK", value: 4080)
!1013 = !{!1014, !1015, !1016, !1017}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1015 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1016 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1020, line: 221, size: 32, align: 8, elements: !1021)
!1020 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1019, file: !1020, line: 221, baseType: !1023, size: 32, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1024, line: 51, baseType: !1016)
!1024 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1025 = !{!1026, !1794, !1795, !1797, !1798}
!1026 = distinct !DIGlobalVariable(name: "dca2wav_norm", scope: !1027, file: !1028, line: 34, type: !1791, isLocal: true, isDefinition: true, variable: [28 x i8]* @ff_dca_set_channel_layout.dca2wav_norm)
!1027 = distinct !DISubprogram(name: "ff_dca_set_channel_layout", scope: !1028, file: !1028, line: 32, type: !1029, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1790)
!1028 = !DIFile(filename: "libavcodec/dcadec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1015, !1031, !1358, !1015}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1034)
!1034 = !{!1035, !1119, !1120, !1121, !1388, !1389, !1390, !1391, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1544, !1548, !1549, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1728, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1033, file: !57, line: 1561, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1040)
!1040 = !{!1041, !1045, !1049, !1078, !1079, !1080, !1081, !1085, !1091, !1093, !1097}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1039, file: !26, line: 72, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1039, file: !26, line: 78, baseType: !1046, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!1042, !1014}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1039, file: !26, line: 85, baseType: !1050, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1074, !1075, !1076, !1077}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1052, file: !4, line: 247, baseType: !1042, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1052, file: !4, line: 253, baseType: !1042, size: 64, align: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1052, file: !4, line: 259, baseType: !1015, size: 32, align: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1052, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1052, file: !4, line: 271, baseType: !1059, size: 64, align: 64, offset: 192)
!1059 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1052, file: !4, line: 265, size: 64, align: 64, elements: !1060)
!1060 = !{!1061, !1064, !1066, !1067}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1059, file: !4, line: 266, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1024, line: 40, baseType: !1063)
!1063 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1059, file: !4, line: 267, baseType: !1065, size: 64, align: 64)
!1065 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1059, file: !4, line: 268, baseType: !1042, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1059, file: !4, line: 270, baseType: !1068, size: 64, align: 32)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1069, line: 61, baseType: !1070)
!1069 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1069, line: 58, size: 64, align: 32, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1070, file: !1069, line: 59, baseType: !1015, size: 32, align: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1070, file: !1069, line: 60, baseType: !1015, size: 32, align: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1052, file: !4, line: 272, baseType: !1065, size: 64, align: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1052, file: !4, line: 273, baseType: !1065, size: 64, align: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !4, line: 275, baseType: !1015, size: 32, align: 32, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1052, file: !4, line: 300, baseType: !1042, size: 64, align: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1039, file: !26, line: 93, baseType: !1015, size: 32, align: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1039, file: !26, line: 99, baseType: !1015, size: 32, align: 32, offset: 224)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1039, file: !26, line: 108, baseType: !1015, size: 32, align: 32, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1039, file: !26, line: 113, baseType: !1082, size: 64, align: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!1014, !1014, !1014}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1039, file: !26, line: 123, baseType: !1086, size: 64, align: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DISubroutineType(types: !1088)
!1088 = !{!1089, !1089}
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1039, file: !26, line: 130, baseType: !1092, size: 32, align: 32, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1039, file: !26, line: 136, baseType: !1094, size: 64, align: 64, offset: 512)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!1092, !1014}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1039, file: !26, line: 142, baseType: !1098, size: 64, align: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!1015, !1101, !1014, !1042, !1015}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1104)
!1104 = !{!1105, !1117, !1118}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1103, file: !4, line: 360, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1109, file: !4, line: 307, baseType: !1042, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1109, file: !4, line: 313, baseType: !1065, size: 64, align: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1109, file: !4, line: 313, baseType: !1065, size: 64, align: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1109, file: !4, line: 318, baseType: !1065, size: 64, align: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1109, file: !4, line: 318, baseType: !1065, size: 64, align: 64, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1109, file: !4, line: 323, baseType: !1015, size: 32, align: 32, offset: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1103, file: !4, line: 364, baseType: !1015, size: 32, align: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1103, file: !4, line: 368, baseType: !1015, size: 32, align: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1033, file: !57, line: 1562, baseType: !1015, size: 32, align: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1033, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1033, file: !57, line: 1565, baseType: !1122, size: 64, align: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1129, !1130, !1131, !1134, !1137, !1140, !1143, !1148, !1151, !1152, !1160, !1161, !1162, !1164, !1168, !1174, !1185, !1189, !1190, !1238, !1359, !1363, !1364, !1368, !1372, !1377, !1381, !1382, !1383}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1124, file: !57, line: 3475, baseType: !1042, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1124, file: !57, line: 3480, baseType: !1042, size: 64, align: 64, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1124, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1124, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1124, file: !57, line: 3487, baseType: !1015, size: 32, align: 32, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1124, file: !57, line: 3488, baseType: !1132, size: 64, align: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1124, file: !57, line: 3489, baseType: !1135, size: 64, align: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1124, file: !57, line: 3490, baseType: !1138, size: 64, align: 64, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1124, file: !57, line: 3491, baseType: !1141, size: 64, align: 64, offset: 448)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1124, file: !57, line: 3492, baseType: !1144, size: 64, align: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1024, line: 55, baseType: !1147)
!1147 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1124, file: !57, line: 3493, baseType: !1149, size: 8, align: 8, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1024, line: 48, baseType: !1150)
!1150 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1124, file: !57, line: 3494, baseType: !1036, size: 64, align: 64, offset: 640)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1124, file: !57, line: 3495, baseType: !1153, size: 64, align: 64, offset: 704)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1155)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1156, file: !57, line: 3402, baseType: !1015, size: 32, align: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1156, file: !57, line: 3403, baseType: !1042, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1124, file: !57, line: 3507, baseType: !1042, size: 64, align: 64, offset: 768)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1124, file: !57, line: 3516, baseType: !1015, size: 32, align: 32, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1124, file: !57, line: 3517, baseType: !1163, size: 64, align: 64, offset: 896)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1124, file: !57, line: 3527, baseType: !1165, size: 64, align: 64, offset: 960)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!1015, !1031}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1124, file: !57, line: 3535, baseType: !1169, size: 64, align: 64, offset: 1024)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!1015, !1031, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1124, file: !57, line: 3541, baseType: !1175, size: 64, align: 64, offset: 1088)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1179, line: 223, size: 128, align: 64, elements: !1180)
!1179 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1180 = !{!1181, !1184}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1178, file: !1179, line: 224, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1149)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1178, file: !1179, line: 225, baseType: !1182, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1124, file: !57, line: 3549, baseType: !1186, size: 64, align: 64, offset: 1152)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DISubroutineType(types: !1188)
!1188 = !{null, !1163}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1124, file: !57, line: 3551, baseType: !1165, size: 64, align: 64, offset: 1216)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1124, file: !57, line: 3552, baseType: !1191, size: 64, align: 64, offset: 1280)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DISubroutineType(types: !1193)
!1193 = !{!1015, !1031, !1194, !1015, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1198)
!1198 = !{!1199, !1202, !1203, !1204, !1205, !1237}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1197, file: !57, line: 3921, baseType: !1200, size: 16, align: 16)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1024, line: 49, baseType: !1201)
!1201 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1197, file: !57, line: 3922, baseType: !1023, size: 32, align: 32, offset: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1197, file: !57, line: 3923, baseType: !1023, size: 32, align: 32, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1197, file: !57, line: 3924, baseType: !1016, size: 32, align: 32, offset: 96)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1197, file: !57, line: 3925, baseType: !1206, size: 64, align: 64, offset: 128)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1215, !1216, !1226, !1230, !1232, !1233, !1235, !1236}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1209, file: !57, line: 3886, baseType: !1015, size: 32, align: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1209, file: !57, line: 3887, baseType: !1015, size: 32, align: 32, offset: 32)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1209, file: !57, line: 3888, baseType: !1015, size: 32, align: 32, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1209, file: !57, line: 3889, baseType: !1015, size: 32, align: 32, offset: 96)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1209, file: !57, line: 3890, baseType: !1015, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1209, file: !57, line: 3897, baseType: !1217, size: 768, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1219)
!1219 = !{!1220, !1224}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1218, file: !57, line: 3855, baseType: !1221, size: 512, align: 64)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 512, align: 64, elements: !1222)
!1222 = !{!1223}
!1223 = !DISubrange(count: 8)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1218, file: !57, line: 3857, baseType: !1225, size: 256, align: 32, offset: 512)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 256, align: 32, elements: !1222)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1209, file: !57, line: 3903, baseType: !1227, size: 256, align: 64, offset: 960)
!1227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 256, align: 64, elements: !1228)
!1228 = !{!1229}
!1229 = !DISubrange(count: 4)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1209, file: !57, line: 3904, baseType: !1231, size: 128, align: 32, offset: 1216)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 128, align: 32, elements: !1228)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1209, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1209, file: !57, line: 3908, baseType: !1234, size: 64, align: 64, offset: 1408)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1209, file: !57, line: 3915, baseType: !1234, size: 64, align: 64, offset: 1472)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1209, file: !57, line: 3917, baseType: !1015, size: 32, align: 32, offset: 1536)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1197, file: !57, line: 3926, baseType: !1062, size: 64, align: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1124, file: !57, line: 3564, baseType: !1239, size: 64, align: 64, offset: 1344)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DISubroutineType(types: !1241)
!1241 = !{!1015, !1031, !1242, !1276, !1358}
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1245)
!1245 = !{!1246, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1272, !1273, !1274, !1275}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1244, file: !57, line: 1451, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1249, line: 94, baseType: !1250)
!1249 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1249, line: 81, size: 192, align: 64, elements: !1251)
!1251 = !{!1252, !1256, !1257}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1250, file: !1249, line: 82, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1249, line: 73, baseType: !1255)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1249, line: 73, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1250, file: !1249, line: 89, baseType: !1194, size: 64, align: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1250, file: !1249, line: 93, baseType: !1015, size: 32, align: 32, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1244, file: !57, line: 1461, baseType: !1062, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1244, file: !57, line: 1467, baseType: !1062, size: 64, align: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1244, file: !57, line: 1468, baseType: !1194, size: 64, align: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1244, file: !57, line: 1469, baseType: !1015, size: 32, align: 32, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1244, file: !57, line: 1470, baseType: !1015, size: 32, align: 32, offset: 288)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1244, file: !57, line: 1474, baseType: !1015, size: 32, align: 32, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1244, file: !57, line: 1479, baseType: !1265, size: 64, align: 64, offset: 384)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1267)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1268)
!1268 = !{!1269, !1270, !1271}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1267, file: !57, line: 1412, baseType: !1194, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1267, file: !57, line: 1413, baseType: !1015, size: 32, align: 32, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1267, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1244, file: !57, line: 1480, baseType: !1015, size: 32, align: 32, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1244, file: !57, line: 1486, baseType: !1062, size: 64, align: 64, offset: 512)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1244, file: !57, line: 1488, baseType: !1062, size: 64, align: 64, offset: 576)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1244, file: !57, line: 1497, baseType: !1062, size: 64, align: 64, offset: 640)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1310, !1312, !1313, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1346, !1347, !1348, !1349, !1350, !1351, !1354, !1355, !1356, !1357}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1279, file: !780, line: 282, baseType: !1221, size: 512, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1279, file: !780, line: 299, baseType: !1225, size: 256, align: 32, offset: 512)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1279, file: !780, line: 315, baseType: !1284, size: 64, align: 64, offset: 768)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1279, file: !780, line: 326, baseType: !1015, size: 32, align: 32, offset: 832)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1279, file: !780, line: 326, baseType: !1015, size: 32, align: 32, offset: 864)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1279, file: !780, line: 334, baseType: !1015, size: 32, align: 32, offset: 896)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1279, file: !780, line: 341, baseType: !1015, size: 32, align: 32, offset: 928)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1279, file: !780, line: 346, baseType: !1015, size: 32, align: 32, offset: 960)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1279, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1279, file: !780, line: 356, baseType: !1068, size: 64, align: 32, offset: 1024)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1279, file: !780, line: 361, baseType: !1062, size: 64, align: 64, offset: 1088)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1279, file: !780, line: 369, baseType: !1062, size: 64, align: 64, offset: 1152)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1279, file: !780, line: 377, baseType: !1062, size: 64, align: 64, offset: 1216)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1279, file: !780, line: 382, baseType: !1015, size: 32, align: 32, offset: 1280)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1279, file: !780, line: 386, baseType: !1015, size: 32, align: 32, offset: 1312)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1279, file: !780, line: 391, baseType: !1015, size: 32, align: 32, offset: 1344)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1279, file: !780, line: 396, baseType: !1014, size: 64, align: 64, offset: 1408)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1279, file: !780, line: 403, baseType: !1300, size: 512, align: 64, offset: 1472)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 512, align: 64, elements: !1222)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1279, file: !780, line: 410, baseType: !1015, size: 32, align: 32, offset: 1984)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1279, file: !780, line: 415, baseType: !1015, size: 32, align: 32, offset: 2016)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1279, file: !780, line: 420, baseType: !1015, size: 32, align: 32, offset: 2048)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1279, file: !780, line: 425, baseType: !1015, size: 32, align: 32, offset: 2080)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1279, file: !780, line: 435, baseType: !1062, size: 64, align: 64, offset: 2112)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1279, file: !780, line: 440, baseType: !1015, size: 32, align: 32, offset: 2176)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1279, file: !780, line: 445, baseType: !1146, size: 64, align: 64, offset: 2240)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1279, file: !780, line: 459, baseType: !1309, size: 512, align: 64, offset: 2304)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1247, size: 512, align: 64, elements: !1222)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1279, file: !780, line: 473, baseType: !1311, size: 64, align: 64, offset: 2816)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1279, file: !780, line: 477, baseType: !1015, size: 32, align: 32, offset: 2880)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1279, file: !780, line: 479, baseType: !1314, size: 64, align: 64, offset: 2944)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1327}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1317, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1317, file: !780, line: 203, baseType: !1194, size: 64, align: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1317, file: !780, line: 204, baseType: !1015, size: 32, align: 32, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1317, file: !780, line: 205, baseType: !1323, size: 64, align: 64, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1325, line: 86, baseType: !1326)
!1325 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1326 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1325, line: 86, flags: DIFlagFwdDecl)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1317, file: !780, line: 206, baseType: !1247, size: 64, align: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1279, file: !780, line: 480, baseType: !1015, size: 32, align: 32, offset: 3008)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1279, file: !780, line: 505, baseType: !1015, size: 32, align: 32, offset: 3040)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1279, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1279, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1279, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1279, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1279, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1279, file: !780, line: 532, baseType: !1062, size: 64, align: 64, offset: 3264)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1279, file: !780, line: 539, baseType: !1062, size: 64, align: 64, offset: 3328)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1279, file: !780, line: 547, baseType: !1062, size: 64, align: 64, offset: 3392)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1279, file: !780, line: 554, baseType: !1323, size: 64, align: 64, offset: 3456)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1279, file: !780, line: 563, baseType: !1015, size: 32, align: 32, offset: 3520)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1279, file: !780, line: 572, baseType: !1015, size: 32, align: 32, offset: 3552)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1279, file: !780, line: 581, baseType: !1015, size: 32, align: 32, offset: 3584)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1279, file: !780, line: 588, baseType: !1343, size: 64, align: 64, offset: 3648)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1024, line: 36, baseType: !1345)
!1345 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1279, file: !780, line: 593, baseType: !1015, size: 32, align: 32, offset: 3712)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1279, file: !780, line: 596, baseType: !1015, size: 32, align: 32, offset: 3744)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1279, file: !780, line: 599, baseType: !1247, size: 64, align: 64, offset: 3776)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1279, file: !780, line: 605, baseType: !1247, size: 64, align: 64, offset: 3840)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1279, file: !780, line: 616, baseType: !1247, size: 64, align: 64, offset: 3904)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1279, file: !780, line: 626, baseType: !1352, size: 64, align: 64, offset: 3968)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1353, line: 216, baseType: !1147)
!1353 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1279, file: !780, line: 627, baseType: !1352, size: 64, align: 64, offset: 4032)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1279, file: !780, line: 628, baseType: !1352, size: 64, align: 64, offset: 4096)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1279, file: !780, line: 629, baseType: !1352, size: 64, align: 64, offset: 4160)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1279, file: !780, line: 645, baseType: !1247, size: 64, align: 64, offset: 4224)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1124, file: !57, line: 3566, baseType: !1360, size: 64, align: 64, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!1015, !1031, !1014, !1358, !1242}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1124, file: !57, line: 3567, baseType: !1165, size: 64, align: 64, offset: 1472)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1124, file: !57, line: 3576, baseType: !1365, size: 64, align: 64, offset: 1536)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!1015, !1031, !1276}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1124, file: !57, line: 3577, baseType: !1369, size: 64, align: 64, offset: 1600)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!1015, !1031, !1242}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1124, file: !57, line: 3584, baseType: !1373, size: 64, align: 64, offset: 1664)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!1015, !1031, !1376}
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1124, file: !57, line: 3589, baseType: !1378, size: 64, align: 64, offset: 1728)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{null, !1031}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1124, file: !57, line: 3594, baseType: !1015, size: 32, align: 32, offset: 1792)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1124, file: !57, line: 3600, baseType: !1042, size: 64, align: 64, offset: 1856)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1124, file: !57, line: 3609, baseType: !1384, size: 64, align: 64, offset: 1920)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1387)
!1387 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1033, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1033, file: !57, line: 1581, baseType: !1016, size: 32, align: 32, offset: 224)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1033, file: !57, line: 1583, baseType: !1014, size: 64, align: 64, offset: 256)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1033, file: !57, line: 1591, baseType: !1392, size: 64, align: 64, offset: 320)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1179, line: 129, size: 1664, align: 64, elements: !1394)
!1394 = !{!1395, !1396, !1397, !1398, !1399, !1417, !1418, !1424, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1393, file: !1179, line: 136, baseType: !1015, size: 32, align: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1393, file: !1179, line: 151, baseType: !1015, size: 32, align: 32, offset: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1393, file: !1179, line: 157, baseType: !1015, size: 32, align: 32, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1393, file: !1179, line: 159, baseType: !1376, size: 64, align: 64, offset: 128)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1393, file: !1179, line: 161, baseType: !1400, size: 64, align: 64, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1179, line: 117, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1179, line: 100, size: 832, align: 64, elements: !1403)
!1403 = !{!1404, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1402, file: !1179, line: 105, baseType: !1405, size: 256, align: 64)
!1405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1406, size: 256, align: 64, elements: !1228)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1249, line: 238, baseType: !1408)
!1408 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1249, line: 238, flags: DIFlagFwdDecl)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1402, file: !1179, line: 110, baseType: !1015, size: 32, align: 32, offset: 256)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1402, file: !1179, line: 111, baseType: !1015, size: 32, align: 32, offset: 288)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1402, file: !1179, line: 111, baseType: !1015, size: 32, align: 32, offset: 320)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1402, file: !1179, line: 112, baseType: !1225, size: 256, align: 32, offset: 352)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1402, file: !1179, line: 113, baseType: !1231, size: 128, align: 32, offset: 608)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1402, file: !1179, line: 114, baseType: !1015, size: 32, align: 32, offset: 736)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1402, file: !1179, line: 115, baseType: !1015, size: 32, align: 32, offset: 768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1402, file: !1179, line: 116, baseType: !1015, size: 32, align: 32, offset: 800)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1393, file: !1179, line: 163, baseType: !1014, size: 64, align: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1393, file: !1179, line: 165, baseType: !1419, size: 128, align: 64, offset: 320)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1179, line: 122, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1179, line: 119, size: 128, align: 64, elements: !1421)
!1421 = !{!1422, !1423}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1420, file: !1179, line: 120, baseType: !1242, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1420, file: !1179, line: 121, baseType: !1376, size: 64, align: 64, offset: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1393, file: !1179, line: 166, baseType: !1425, size: 128, align: 64, offset: 448)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1179, line: 127, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1179, line: 124, size: 128, align: 64, elements: !1427)
!1427 = !{!1428, !1501}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1426, file: !1179, line: 125, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1432)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1433)
!1433 = !{!1434, !1435, !1459, !1463, !1464, !1498, !1499, !1500}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1432, file: !57, line: 5751, baseType: !1036, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1432, file: !57, line: 5756, baseType: !1436, size: 64, align: 64, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1439)
!1439 = !{!1440, !1441, !1444, !1445, !1446, !1450, !1454, !1458}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1438, file: !57, line: 5797, baseType: !1042, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1438, file: !57, line: 5804, baseType: !1442, size: 64, align: 64, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1438, file: !57, line: 5815, baseType: !1036, size: 64, align: 64, offset: 128)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1438, file: !57, line: 5825, baseType: !1015, size: 32, align: 32, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1438, file: !57, line: 5826, baseType: !1447, size: 64, align: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!1015, !1430}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1438, file: !57, line: 5827, baseType: !1451, size: 64, align: 64, offset: 320)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!1015, !1430, !1242}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1438, file: !57, line: 5828, baseType: !1455, size: 64, align: 64, offset: 384)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{null, !1430}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1438, file: !57, line: 5829, baseType: !1455, size: 64, align: 64, offset: 448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1432, file: !57, line: 5762, baseType: !1460, size: 64, align: 64, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1462)
!1462 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1432, file: !57, line: 5768, baseType: !1014, size: 64, align: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1432, file: !57, line: 5775, baseType: !1465, size: 64, align: 64, offset: 256)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1467)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1468)
!1468 = !{!1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1467, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1467, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1467, file: !57, line: 3948, baseType: !1023, size: 32, align: 32, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1467, file: !57, line: 3958, baseType: !1194, size: 64, align: 64, offset: 128)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1467, file: !57, line: 3962, baseType: !1015, size: 32, align: 32, offset: 192)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1467, file: !57, line: 3968, baseType: !1015, size: 32, align: 32, offset: 224)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1467, file: !57, line: 3973, baseType: !1062, size: 64, align: 64, offset: 256)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1467, file: !57, line: 3986, baseType: !1015, size: 32, align: 32, offset: 320)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1467, file: !57, line: 3999, baseType: !1015, size: 32, align: 32, offset: 352)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1467, file: !57, line: 4004, baseType: !1015, size: 32, align: 32, offset: 384)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1467, file: !57, line: 4005, baseType: !1015, size: 32, align: 32, offset: 416)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1467, file: !57, line: 4010, baseType: !1015, size: 32, align: 32, offset: 448)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1467, file: !57, line: 4011, baseType: !1015, size: 32, align: 32, offset: 480)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1467, file: !57, line: 4020, baseType: !1068, size: 64, align: 32, offset: 512)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1467, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1467, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1467, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1467, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1467, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1467, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1467, file: !57, line: 4039, baseType: !1015, size: 32, align: 32, offset: 768)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1467, file: !57, line: 4046, baseType: !1146, size: 64, align: 64, offset: 832)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1467, file: !57, line: 4050, baseType: !1015, size: 32, align: 32, offset: 896)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1467, file: !57, line: 4054, baseType: !1015, size: 32, align: 32, offset: 928)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1467, file: !57, line: 4061, baseType: !1015, size: 32, align: 32, offset: 960)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1467, file: !57, line: 4065, baseType: !1015, size: 32, align: 32, offset: 992)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1467, file: !57, line: 4073, baseType: !1015, size: 32, align: 32, offset: 1024)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1467, file: !57, line: 4080, baseType: !1015, size: 32, align: 32, offset: 1056)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1467, file: !57, line: 4084, baseType: !1015, size: 32, align: 32, offset: 1088)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1432, file: !57, line: 5781, baseType: !1465, size: 64, align: 64, offset: 320)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1432, file: !57, line: 5787, baseType: !1068, size: 64, align: 32, offset: 384)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1432, file: !57, line: 5793, baseType: !1068, size: 64, align: 32, offset: 448)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1426, file: !1179, line: 126, baseType: !1015, size: 32, align: 32, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1393, file: !1179, line: 172, baseType: !1242, size: 64, align: 64, offset: 576)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1393, file: !1179, line: 177, baseType: !1194, size: 64, align: 64, offset: 640)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1393, file: !1179, line: 178, baseType: !1016, size: 32, align: 32, offset: 704)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1393, file: !1179, line: 180, baseType: !1014, size: 64, align: 64, offset: 768)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1393, file: !1179, line: 185, baseType: !1015, size: 32, align: 32, offset: 832)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1393, file: !1179, line: 190, baseType: !1014, size: 64, align: 64, offset: 896)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1393, file: !1179, line: 195, baseType: !1015, size: 32, align: 32, offset: 960)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1393, file: !1179, line: 200, baseType: !1242, size: 64, align: 64, offset: 1024)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1393, file: !1179, line: 201, baseType: !1015, size: 32, align: 32, offset: 1088)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1393, file: !1179, line: 202, baseType: !1376, size: 64, align: 64, offset: 1152)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1393, file: !1179, line: 203, baseType: !1015, size: 32, align: 32, offset: 1216)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1393, file: !1179, line: 205, baseType: !1015, size: 32, align: 32, offset: 1248)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1393, file: !1179, line: 206, baseType: !1015, size: 32, align: 32, offset: 1280)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1393, file: !1179, line: 209, baseType: !1352, size: 64, align: 64, offset: 1344)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1393, file: !1179, line: 212, baseType: !1352, size: 64, align: 64, offset: 1408)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1393, file: !1179, line: 213, baseType: !1376, size: 64, align: 64, offset: 1472)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1393, file: !1179, line: 215, baseType: !1015, size: 32, align: 32, offset: 1536)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1393, file: !1179, line: 217, baseType: !1015, size: 32, align: 32, offset: 1568)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1393, file: !1179, line: 220, baseType: !1015, size: 32, align: 32, offset: 1600)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1033, file: !57, line: 1598, baseType: !1014, size: 64, align: 64, offset: 384)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1033, file: !57, line: 1606, baseType: !1062, size: 64, align: 64, offset: 448)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1033, file: !57, line: 1614, baseType: !1015, size: 32, align: 32, offset: 512)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1033, file: !57, line: 1622, baseType: !1015, size: 32, align: 32, offset: 544)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1033, file: !57, line: 1628, baseType: !1015, size: 32, align: 32, offset: 576)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1033, file: !57, line: 1636, baseType: !1015, size: 32, align: 32, offset: 608)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1033, file: !57, line: 1643, baseType: !1015, size: 32, align: 32, offset: 640)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1033, file: !57, line: 1657, baseType: !1194, size: 64, align: 64, offset: 704)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1033, file: !57, line: 1658, baseType: !1015, size: 32, align: 32, offset: 768)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1033, file: !57, line: 1679, baseType: !1068, size: 64, align: 32, offset: 800)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1033, file: !57, line: 1688, baseType: !1015, size: 32, align: 32, offset: 864)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1033, file: !57, line: 1712, baseType: !1015, size: 32, align: 32, offset: 896)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1033, file: !57, line: 1729, baseType: !1015, size: 32, align: 32, offset: 928)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1033, file: !57, line: 1729, baseType: !1015, size: 32, align: 32, offset: 960)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1033, file: !57, line: 1744, baseType: !1015, size: 32, align: 32, offset: 992)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1033, file: !57, line: 1744, baseType: !1015, size: 32, align: 32, offset: 1024)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1033, file: !57, line: 1751, baseType: !1015, size: 32, align: 32, offset: 1056)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1033, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1033, file: !57, line: 1791, baseType: !1540, size: 64, align: 64, offset: 1152)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{null, !1543, !1276, !1358, !1015, !1015, !1015}
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1033, file: !57, line: 1808, baseType: !1545, size: 64, align: 64, offset: 1216)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!516, !1543, !1135}
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1033, file: !57, line: 1816, baseType: !1015, size: 32, align: 32, offset: 1280)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1033, file: !57, line: 1825, baseType: !1550, size: 32, align: 32, offset: 1312)
!1550 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1033, file: !57, line: 1830, baseType: !1015, size: 32, align: 32, offset: 1344)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1033, file: !57, line: 1838, baseType: !1550, size: 32, align: 32, offset: 1376)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1033, file: !57, line: 1846, baseType: !1015, size: 32, align: 32, offset: 1408)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1033, file: !57, line: 1851, baseType: !1015, size: 32, align: 32, offset: 1440)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1033, file: !57, line: 1861, baseType: !1550, size: 32, align: 32, offset: 1472)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1033, file: !57, line: 1868, baseType: !1550, size: 32, align: 32, offset: 1504)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1033, file: !57, line: 1875, baseType: !1550, size: 32, align: 32, offset: 1536)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1033, file: !57, line: 1882, baseType: !1550, size: 32, align: 32, offset: 1568)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1033, file: !57, line: 1889, baseType: !1550, size: 32, align: 32, offset: 1600)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1033, file: !57, line: 1896, baseType: !1550, size: 32, align: 32, offset: 1632)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1033, file: !57, line: 1903, baseType: !1550, size: 32, align: 32, offset: 1664)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1033, file: !57, line: 1910, baseType: !1015, size: 32, align: 32, offset: 1696)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1033, file: !57, line: 1915, baseType: !1015, size: 32, align: 32, offset: 1728)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1033, file: !57, line: 1926, baseType: !1358, size: 64, align: 64, offset: 1792)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1033, file: !57, line: 1935, baseType: !1068, size: 64, align: 32, offset: 1856)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1033, file: !57, line: 1942, baseType: !1015, size: 32, align: 32, offset: 1920)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1033, file: !57, line: 1948, baseType: !1015, size: 32, align: 32, offset: 1952)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1033, file: !57, line: 1954, baseType: !1015, size: 32, align: 32, offset: 1984)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1033, file: !57, line: 1960, baseType: !1015, size: 32, align: 32, offset: 2016)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1033, file: !57, line: 1984, baseType: !1015, size: 32, align: 32, offset: 2048)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1033, file: !57, line: 1991, baseType: !1015, size: 32, align: 32, offset: 2080)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1033, file: !57, line: 1996, baseType: !1015, size: 32, align: 32, offset: 2112)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1033, file: !57, line: 2004, baseType: !1015, size: 32, align: 32, offset: 2144)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1033, file: !57, line: 2011, baseType: !1015, size: 32, align: 32, offset: 2176)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1033, file: !57, line: 2018, baseType: !1015, size: 32, align: 32, offset: 2208)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1033, file: !57, line: 2027, baseType: !1015, size: 32, align: 32, offset: 2240)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1033, file: !57, line: 2034, baseType: !1015, size: 32, align: 32, offset: 2272)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1033, file: !57, line: 2044, baseType: !1015, size: 32, align: 32, offset: 2304)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1033, file: !57, line: 2054, baseType: !1580, size: 64, align: 64, offset: 2368)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1033, file: !57, line: 2061, baseType: !1580, size: 64, align: 64, offset: 2432)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1033, file: !57, line: 2066, baseType: !1015, size: 32, align: 32, offset: 2496)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1033, file: !57, line: 2070, baseType: !1015, size: 32, align: 32, offset: 2528)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1033, file: !57, line: 2078, baseType: !1015, size: 32, align: 32, offset: 2560)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1033, file: !57, line: 2085, baseType: !1015, size: 32, align: 32, offset: 2592)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1033, file: !57, line: 2092, baseType: !1015, size: 32, align: 32, offset: 2624)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1033, file: !57, line: 2099, baseType: !1015, size: 32, align: 32, offset: 2656)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1033, file: !57, line: 2106, baseType: !1015, size: 32, align: 32, offset: 2688)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1033, file: !57, line: 2113, baseType: !1015, size: 32, align: 32, offset: 2720)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1033, file: !57, line: 2120, baseType: !1015, size: 32, align: 32, offset: 2752)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1033, file: !57, line: 2125, baseType: !1015, size: 32, align: 32, offset: 2784)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1033, file: !57, line: 2133, baseType: !1015, size: 32, align: 32, offset: 2816)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1033, file: !57, line: 2140, baseType: !1015, size: 32, align: 32, offset: 2848)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1033, file: !57, line: 2145, baseType: !1015, size: 32, align: 32, offset: 2880)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1033, file: !57, line: 2153, baseType: !1015, size: 32, align: 32, offset: 2912)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1033, file: !57, line: 2158, baseType: !1015, size: 32, align: 32, offset: 2944)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1033, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1033, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1033, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1033, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1033, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1033, file: !57, line: 2203, baseType: !1015, size: 32, align: 32, offset: 3136)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1033, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1033, file: !57, line: 2212, baseType: !1015, size: 32, align: 32, offset: 3200)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1033, file: !57, line: 2213, baseType: !1015, size: 32, align: 32, offset: 3232)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1033, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1033, file: !57, line: 2232, baseType: !1015, size: 32, align: 32, offset: 3296)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1033, file: !57, line: 2243, baseType: !1015, size: 32, align: 32, offset: 3328)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1033, file: !57, line: 2249, baseType: !1015, size: 32, align: 32, offset: 3360)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1033, file: !57, line: 2256, baseType: !1015, size: 32, align: 32, offset: 3392)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1033, file: !57, line: 2263, baseType: !1146, size: 64, align: 64, offset: 3456)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1033, file: !57, line: 2270, baseType: !1146, size: 64, align: 64, offset: 3520)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1033, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1033, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1033, file: !57, line: 2367, baseType: !1616, size: 64, align: 64, offset: 3648)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!1015, !1543, !1376, !1015}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1033, file: !57, line: 2383, baseType: !1015, size: 32, align: 32, offset: 3712)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1033, file: !57, line: 2386, baseType: !1550, size: 32, align: 32, offset: 3744)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1033, file: !57, line: 2387, baseType: !1550, size: 32, align: 32, offset: 3776)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1033, file: !57, line: 2394, baseType: !1015, size: 32, align: 32, offset: 3808)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1033, file: !57, line: 2401, baseType: !1015, size: 32, align: 32, offset: 3840)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1033, file: !57, line: 2408, baseType: !1015, size: 32, align: 32, offset: 3872)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1033, file: !57, line: 2415, baseType: !1015, size: 32, align: 32, offset: 3904)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1033, file: !57, line: 2422, baseType: !1015, size: 32, align: 32, offset: 3936)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1033, file: !57, line: 2423, baseType: !1628, size: 64, align: 64, offset: 3968)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1631)
!1631 = !{!1632, !1633, !1634, !1635}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1630, file: !57, line: 827, baseType: !1015, size: 32, align: 32)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1630, file: !57, line: 828, baseType: !1015, size: 32, align: 32, offset: 32)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1630, file: !57, line: 829, baseType: !1015, size: 32, align: 32, offset: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1630, file: !57, line: 830, baseType: !1550, size: 32, align: 32, offset: 96)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1033, file: !57, line: 2430, baseType: !1062, size: 64, align: 64, offset: 4032)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1033, file: !57, line: 2437, baseType: !1062, size: 64, align: 64, offset: 4096)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1033, file: !57, line: 2444, baseType: !1550, size: 32, align: 32, offset: 4160)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1033, file: !57, line: 2451, baseType: !1550, size: 32, align: 32, offset: 4192)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1033, file: !57, line: 2458, baseType: !1015, size: 32, align: 32, offset: 4224)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1033, file: !57, line: 2469, baseType: !1015, size: 32, align: 32, offset: 4256)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1033, file: !57, line: 2475, baseType: !1015, size: 32, align: 32, offset: 4288)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1033, file: !57, line: 2481, baseType: !1015, size: 32, align: 32, offset: 4320)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1033, file: !57, line: 2485, baseType: !1015, size: 32, align: 32, offset: 4352)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1033, file: !57, line: 2489, baseType: !1015, size: 32, align: 32, offset: 4384)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1033, file: !57, line: 2493, baseType: !1015, size: 32, align: 32, offset: 4416)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1033, file: !57, line: 2501, baseType: !1015, size: 32, align: 32, offset: 4448)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1033, file: !57, line: 2506, baseType: !1015, size: 32, align: 32, offset: 4480)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1033, file: !57, line: 2510, baseType: !1015, size: 32, align: 32, offset: 4512)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1033, file: !57, line: 2514, baseType: !1062, size: 64, align: 64, offset: 4544)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1033, file: !57, line: 2528, baseType: !1652, size: 64, align: 64, offset: 4608)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1543, !1014, !1015, !1015}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1033, file: !57, line: 2534, baseType: !1015, size: 32, align: 32, offset: 4672)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1033, file: !57, line: 2545, baseType: !1015, size: 32, align: 32, offset: 4704)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1033, file: !57, line: 2547, baseType: !1015, size: 32, align: 32, offset: 4736)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1033, file: !57, line: 2549, baseType: !1015, size: 32, align: 32, offset: 4768)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1033, file: !57, line: 2551, baseType: !1015, size: 32, align: 32, offset: 4800)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1033, file: !57, line: 2553, baseType: !1015, size: 32, align: 32, offset: 4832)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1033, file: !57, line: 2555, baseType: !1015, size: 32, align: 32, offset: 4864)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1033, file: !57, line: 2557, baseType: !1015, size: 32, align: 32, offset: 4896)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1033, file: !57, line: 2559, baseType: !1015, size: 32, align: 32, offset: 4928)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1033, file: !57, line: 2563, baseType: !1015, size: 32, align: 32, offset: 4960)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1033, file: !57, line: 2571, baseType: !1234, size: 64, align: 64, offset: 4992)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1033, file: !57, line: 2579, baseType: !1234, size: 64, align: 64, offset: 5056)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1033, file: !57, line: 2586, baseType: !1015, size: 32, align: 32, offset: 5120)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1033, file: !57, line: 2615, baseType: !1015, size: 32, align: 32, offset: 5152)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1033, file: !57, line: 2627, baseType: !1015, size: 32, align: 32, offset: 5184)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1033, file: !57, line: 2637, baseType: !1015, size: 32, align: 32, offset: 5216)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1033, file: !57, line: 2681, baseType: !1015, size: 32, align: 32, offset: 5248)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1033, file: !57, line: 2709, baseType: !1062, size: 64, align: 64, offset: 5312)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1033, file: !57, line: 2716, baseType: !1674, size: 64, align: 64, offset: 5376)
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1677)
!1677 = !{!1678, !1679, !1680, !1681, !1682, !1683, !1684, !1688, !1692, !1693, !1694, !1695, !1701, !1702, !1703, !1704, !1705}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1676, file: !57, line: 3642, baseType: !1042, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1676, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1676, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1676, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1676, file: !57, line: 3669, baseType: !1015, size: 32, align: 32, offset: 160)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1676, file: !57, line: 3682, baseType: !1373, size: 64, align: 64, offset: 192)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1676, file: !57, line: 3698, baseType: !1685, size: 64, align: 64, offset: 256)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!1015, !1031, !1182, !1023}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1676, file: !57, line: 3712, baseType: !1689, size: 64, align: 64, offset: 320)
!1689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64, align: 64)
!1690 = !DISubroutineType(types: !1691)
!1691 = !{!1015, !1031, !1015, !1182, !1023}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1676, file: !57, line: 3726, baseType: !1685, size: 64, align: 64, offset: 384)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1676, file: !57, line: 3737, baseType: !1165, size: 64, align: 64, offset: 448)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1676, file: !57, line: 3746, baseType: !1015, size: 32, align: 32, offset: 512)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1676, file: !57, line: 3757, baseType: !1696, size: 64, align: 64, offset: 576)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{null, !1699}
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1676, file: !57, line: 3766, baseType: !1165, size: 64, align: 64, offset: 640)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1676, file: !57, line: 3774, baseType: !1165, size: 64, align: 64, offset: 704)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1676, file: !57, line: 3780, baseType: !1015, size: 32, align: 32, offset: 768)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1676, file: !57, line: 3785, baseType: !1015, size: 32, align: 32, offset: 800)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1676, file: !57, line: 3795, baseType: !1706, size: 64, align: 64, offset: 832)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!1015, !1031, !1247}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1033, file: !57, line: 2728, baseType: !1014, size: 64, align: 64, offset: 5440)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1033, file: !57, line: 2735, baseType: !1300, size: 512, align: 64, offset: 5504)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1033, file: !57, line: 2742, baseType: !1015, size: 32, align: 32, offset: 6016)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1033, file: !57, line: 2755, baseType: !1015, size: 32, align: 32, offset: 6048)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1033, file: !57, line: 2776, baseType: !1015, size: 32, align: 32, offset: 6080)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1033, file: !57, line: 2783, baseType: !1015, size: 32, align: 32, offset: 6112)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1033, file: !57, line: 2791, baseType: !1015, size: 32, align: 32, offset: 6144)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1033, file: !57, line: 2802, baseType: !1376, size: 64, align: 64, offset: 6208)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1033, file: !57, line: 2811, baseType: !1015, size: 32, align: 32, offset: 6272)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1033, file: !57, line: 2821, baseType: !1015, size: 32, align: 32, offset: 6304)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1033, file: !57, line: 2830, baseType: !1015, size: 32, align: 32, offset: 6336)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1033, file: !57, line: 2840, baseType: !1015, size: 32, align: 32, offset: 6368)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1033, file: !57, line: 2851, baseType: !1722, size: 64, align: 64, offset: 6400)
!1722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1723, size: 64, align: 64)
!1723 = !DISubroutineType(types: !1724)
!1724 = !{!1015, !1543, !1725, !1014, !1358, !1015, !1015}
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!1015, !1543, !1014}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1033, file: !57, line: 2871, baseType: !1729, size: 64, align: 64, offset: 6464)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64, align: 64)
!1730 = !DISubroutineType(types: !1731)
!1731 = !{!1015, !1543, !1732, !1014, !1358, !1015}
!1732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1733, size: 64, align: 64)
!1733 = !DISubroutineType(types: !1734)
!1734 = !{!1015, !1543, !1014, !1015, !1015}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1033, file: !57, line: 2878, baseType: !1015, size: 32, align: 32, offset: 6528)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1033, file: !57, line: 2885, baseType: !1015, size: 32, align: 32, offset: 6560)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1033, file: !57, line: 3005, baseType: !1015, size: 32, align: 32, offset: 6592)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1033, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1033, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1033, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1033, file: !57, line: 3037, baseType: !1194, size: 64, align: 64, offset: 6720)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1033, file: !57, line: 3038, baseType: !1015, size: 32, align: 32, offset: 6784)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1033, file: !57, line: 3050, baseType: !1146, size: 64, align: 64, offset: 6848)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1033, file: !57, line: 3065, baseType: !1015, size: 32, align: 32, offset: 6912)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1033, file: !57, line: 3083, baseType: !1015, size: 32, align: 32, offset: 6944)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1033, file: !57, line: 3092, baseType: !1068, size: 64, align: 32, offset: 6976)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1033, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1033, file: !57, line: 3106, baseType: !1068, size: 64, align: 32, offset: 7072)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1033, file: !57, line: 3113, baseType: !1750, size: 64, align: 64, offset: 7168)
!1750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1751, size: 64, align: 64)
!1751 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1752)
!1752 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1753)
!1753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1754)
!1754 = !{!1755, !1756, !1757, !1758, !1759, !1760, !1763}
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1753, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1753, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1753, file: !57, line: 720, baseType: !1042, size: 64, align: 64, offset: 64)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1753, file: !57, line: 724, baseType: !1042, size: 64, align: 64, offset: 128)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1753, file: !57, line: 728, baseType: !1015, size: 32, align: 32, offset: 192)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1753, file: !57, line: 734, baseType: !1761, size: 64, align: 64, offset: 256)
!1761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1762, size: 64, align: 64)
!1762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1753, file: !57, line: 739, baseType: !1764, size: 64, align: 64, offset: 320)
!1764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1765, size: 64, align: 64)
!1765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1156)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1033, file: !57, line: 3129, baseType: !1062, size: 64, align: 64, offset: 7232)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1033, file: !57, line: 3130, baseType: !1062, size: 64, align: 64, offset: 7296)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1033, file: !57, line: 3131, baseType: !1062, size: 64, align: 64, offset: 7360)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1033, file: !57, line: 3132, baseType: !1062, size: 64, align: 64, offset: 7424)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1033, file: !57, line: 3139, baseType: !1234, size: 64, align: 64, offset: 7488)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1033, file: !57, line: 3147, baseType: !1015, size: 32, align: 32, offset: 7552)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1033, file: !57, line: 3165, baseType: !1015, size: 32, align: 32, offset: 7584)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1033, file: !57, line: 3172, baseType: !1015, size: 32, align: 32, offset: 7616)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1033, file: !57, line: 3180, baseType: !1015, size: 32, align: 32, offset: 7648)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1033, file: !57, line: 3191, baseType: !1580, size: 64, align: 64, offset: 7680)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1033, file: !57, line: 3199, baseType: !1194, size: 64, align: 64, offset: 7744)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1033, file: !57, line: 3207, baseType: !1234, size: 64, align: 64, offset: 7808)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1033, file: !57, line: 3214, baseType: !1016, size: 32, align: 32, offset: 7872)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1033, file: !57, line: 3224, baseType: !1265, size: 64, align: 64, offset: 7936)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1033, file: !57, line: 3225, baseType: !1015, size: 32, align: 32, offset: 8000)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1033, file: !57, line: 3249, baseType: !1247, size: 64, align: 64, offset: 8064)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1033, file: !57, line: 3256, baseType: !1015, size: 32, align: 32, offset: 8128)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1033, file: !57, line: 3271, baseType: !1015, size: 32, align: 32, offset: 8160)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1033, file: !57, line: 3279, baseType: !1062, size: 64, align: 64, offset: 8192)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1033, file: !57, line: 3301, baseType: !1247, size: 64, align: 64, offset: 8256)
