; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rangecoder.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rangecoder.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.RangeCoder = type { i32, i32, i32, i32, [256 x i8], [256 x i8], i8*, i8*, i8*, i32 }
%union.unaligned_16 = type { i16 }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_init_range_encoder(%struct.RangeCoder* %c, i8* %buf, i32 %buf_size) #0 !dbg !21 {
entry:
  %c.addr = alloca %struct.RangeCoder*, align 8
  %buf.addr = alloca i8*, align 8
  %buf_size.addr = alloca i32, align 4
  store %struct.RangeCoder* %c, %struct.RangeCoder** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.RangeCoder** %c.addr, metadata !43, metadata !44), !dbg !45
  store i8* %buf, i8** %buf.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %buf.addr, metadata !46, metadata !44), !dbg !47
  store i32 %buf_size, i32* %buf_size.addr, align 4
  call void @llvm.dbg.declare(metadata i32* %buf_size.addr, metadata !48, metadata !44), !dbg !49
  %0 = load i8*, i8** %buf.addr, align 8, !dbg !50
  %1 = load %struct.RangeCoder*, %struct.RangeCoder** %c.addr, align 8, !dbg !51
  %bytestream = getelementptr inbounds %struct.RangeCoder, %struct.RangeCoder* %1, i32 0, i32 7, !dbg !52
  store i8* %0, i8** %bytestream, align 8, !dbg !53

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rangecoder.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4, !8, !16, !17}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !6, line: 48, baseType: !7)
!6 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!7 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !11, line: 222, size: 16, align: 8, elements: !12)
!11 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!12 = !{!13}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !10, file: !11, line: 222, baseType: !14, size: 16, align: 16)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 49, baseType: !15)
!15 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!18 = !{i32 2, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!21 = distinct !DISubprogram(name: "ff_init_range_encoder", scope: !22, file: !22, line: 42, type: !23, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!22 = !DIFile(filename: "libavcodec/rangecoder.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25, !4, !16}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "RangeCoder", file: !27, line: 47, baseType: !28)
!27 = !DIFile(filename: "libavcodec/rangecoder.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RangeCoder", file: !27, line: 35, size: 4480, align: 64, elements: !29)
!29 = !{!30, !31, !32, !33, !34, !38, !39, !40, !41, !42}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !28, file: !27, line: 36, baseType: !16, size: 32, align: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !28, file: !27, line: 37, baseType: !16, size: 32, align: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "outstanding_count", scope: !28, file: !27, line: 38, baseType: !16, size: 32, align: 32, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "outstanding_byte", scope: !28, file: !27, line: 39, baseType: !16, size: 32, align: 32, offset: 96)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "zero_state", scope: !28, file: !27, line: 40, baseType: !35, size: 2048, align: 8, offset: 128)
!35 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 2048, align: 8, elements: !36)
!36 = !{!37}
!37 = !DISubrange(count: 256)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "one_state", scope: !28, file: !27, line: 41, baseType: !35, size: 2048, align: 8, offset: 2176)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream_start", scope: !28, file: !27, line: 42, baseType: !4, size: 64, align: 64, offset: 4224)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream", scope: !28, file: !27, line: 43, baseType: !4, size: 64, align: 64, offset: 4288)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "bytestream_end", scope: !28, file: !27, line: 44, baseType: !4, size: 64, align: 64, offset: 4352)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "overread", scope: !28, file: !27, line: 45, baseType: !16, size: 32, align: 32, offset: 4416)
!43 = !DILocalVariable(name: "c", arg: 1, scope: !21, file: !22, line: 42, type: !25)
!44 = !DIExpression()
!45 = !DILocation(line: 42, column: 62, scope: !21)
!46 = !DILocalVariable(name: "buf", arg: 2, scope: !21, file: !22, line: 42, type: !4)
!47 = !DILocation(line: 42, column: 74, scope: !21)
!48 = !DILocalVariable(name: "buf_size", arg: 3, scope: !21, file: !22, line: 42, type: !16)
!49 = !DILocation(line: 42, column: 83, scope: !21)
!50 = !DILocation(line: 45, column: 21, scope: !21)
!51 = !DILocation(line: 45, column: 5, scope: !21)
!52 = !DILocation(line: 45, column: 8, scope: !21)
!53 = !DILocation(line: 45, column: 19, scope: !21)
!54 = !DILocation(line: 44, column: 5, scope: !21)
!55 = !DILocation(line: 44, column: 8, scope: !21)
!56 = !DILocation(line: 44, column: 25, scope: !21)
!57 = !DILocation(line: 46, column: 25, scope: !21)
!58 = !DILocation(line: 46, column: 31, scope: !21)
!59 = !DILocation(line: 46, column: 29, scope: !21)
!60 = !DILocation(line: 46, column: 5, scope: !21)
!61 = !DILocation(line: 46, column: 8, scope: !21)
!62 = !DILocation(line: 46, column: 23, scope: !21)
!63 = !DILocation(line: 47, column: 5, scope: !21)
!64 = !DILocation(line: 47, column: 8, scope: !21)
!65 = !DILocation(line: 47, column: 12, scope: !21)
!66 = !DILocation(line: 48, column: 5, scope: !21)
!67 = !DILocation(line: 48, column: 8, scope: !21)
!68 = !DILocation(line: 48, column: 14, scope: !21)
!69 = !DILocation(line: 49, column: 5, scope: !21)
!70 = !DILocation(line: 49, column: 8, scope: !21)
!71 = !DILocation(line: 49, column: 26, scope: !21)
!72 = !DILocation(line: 50, column: 5, scope: !21)
!73 = !DILocation(line: 50, column: 8, scope: !21)
!74 = !DILocation(line: 50, column: 25, scope: !21)
!75 = !DILocation(line: 51, column: 1, scope: !21)
!76 = distinct !DISubprogram(name: "ff_init_range_decoder", scope: !22, file: !22, line: 53, type: !77, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!77 = !DISubroutineType(types: !78)
!78 = !{null, !25, !79, !16}
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!81 = !DILocalVariable(name: "x", arg: 1, scope: !82, file: !83, line: 58, type: !14)
!82 = distinct !DISubprogram(name: "av_bswap16", scope: !83, file: !83, line: 58, type: !84, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!83 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!84 = !DISubroutineType(types: !85)
!85 = !{!14, !14}
!86 = !DILocation(line: 58, column: 98, scope: !82, inlinedAt: !87)
!87 = distinct !DILocation(line: 59, column: 14, scope: !76)
!88 = !DILocalVariable(name: "c", arg: 1, scope: !76, file: !22, line: 53, type: !25)
!89 = !DILocation(line: 53, column: 62, scope: !76)
!90 = !DILocalVariable(name: "buf", arg: 2, scope: !76, file: !22, line: 53, type: !79)
!91 = !DILocation(line: 53, column: 80, scope: !76)
!92 = !DILocalVariable(name: "buf_size", arg: 3, scope: !76, file: !22, line: 54, type: !16)
!93 = !DILocation(line: 54, column: 40, scope: !76)
!94 = !DILocation(line: 57, column: 27, scope: !76)
!95 = !DILocation(line: 57, column: 41, scope: !76)
!96 = !DILocation(line: 57, column: 46, scope: !76)
!97 = !DILocation(line: 57, column: 5, scope: !76)
!98 = !DILocation(line: 59, column: 57, scope: !76)
!99 = !DILocation(line: 59, column: 60, scope: !76)
!100 = !DILocation(line: 59, column: 74, scope: !76)
!101 = !DILocation(line: 59, column: 14, scope: !76)
!102 = !DILocation(line: 60, column: 9, scope: !82, inlinedAt: !87)
!103 = !DILocation(line: 60, column: 10, scope: !82, inlinedAt: !87)
!104 = !DILocation(line: 60, column: 18, scope: !82, inlinedAt: !87)
