; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv30.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--rv30.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !895, line: 123, size: 32, align: 32, elements: !896)
!895 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!896 = !{!897, !898, !899, !900}
!897 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!898 = !DIEnumerator(name: "FMT_H261", value: 1)
!899 = !DIEnumerator(name: "FMT_H263", value: 2)
!900 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !902, line: 37, size: 32, align: 32, elements: !903)
!902 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!905 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!906 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!907 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!908 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!909 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !{!926, !927, !928, !936, !934}
!926 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!927 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !931, line: 221, size: 32, align: 8, elements: !932)
!931 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !930, file: !931, line: 221, baseType: !934, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !935, line: 51, baseType: !927)
!935 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !935, line: 48, baseType: !937)
!937 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!938 = !{!939, !2595, !2600, !2604, !2786, !2787, !2789}
!939 = distinct !DIGlobalVariable(name: "ff_rv30_decoder", scope: !0, file: !940, line: 291, type: !941, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_rv30_decoder)
!940 = !DIFile(filename: "libavcodec/rv30.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !943)
!943 = !{!944, !948, !949, !950, !951, !952, !961, !964, !967, !970, !975, !976, !1052, !1060, !1061, !1062, !1064, !2510, !2516, !2524, !2528, !2529, !2566, !2570, !2574, !2575, !2579, !2583, !2584, !2588, !2589, !2590}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !14, line: 3475, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !942, file: !14, line: 3480, baseType: !945, size: 64, align: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !942, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !942, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !942, file: !14, line: 3487, baseType: !926, size: 32, align: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !942, file: !14, line: 3488, baseType: !953, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !956, line: 61, baseType: !957)
!956 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !956, line: 58, size: 64, align: 32, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !957, file: !956, line: 59, baseType: !926, size: 32, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !957, file: !956, line: 60, baseType: !926, size: 32, align: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !942, file: !14, line: 3489, baseType: !962, size: 64, align: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !942, file: !14, line: 3490, baseType: !965, size: 64, align: 64, offset: 384)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !942, file: !14, line: 3491, baseType: !968, size: 64, align: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !942, file: !14, line: 3492, baseType: !971, size: 64, align: 64, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !935, line: 55, baseType: !974)
!974 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !942, file: !14, line: 3493, baseType: !936, size: 8, align: 8, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !942, file: !14, line: 3494, baseType: !977, size: 64, align: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !981)
!981 = !{!982, !983, !988, !1011, !1012, !1013, !1014, !1018, !1024, !1026, !1030}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !980, file: !713, line: 72, baseType: !945, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !980, file: !713, line: 78, baseType: !984, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!945, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !980, file: !713, line: 85, baseType: !989, size: 64, align: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !992)
!992 = !{!993, !994, !995, !996, !997, !1007, !1008, !1009, !1010}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !991, file: !691, line: 247, baseType: !945, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !991, file: !691, line: 253, baseType: !945, size: 64, align: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !991, file: !691, line: 259, baseType: !926, size: 32, align: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !991, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !991, file: !691, line: 271, baseType: !998, size: 64, align: 64, offset: 192)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !991, file: !691, line: 265, size: 64, align: 64, elements: !999)
!999 = !{!1000, !1003, !1005, !1006}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !998, file: !691, line: 266, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !935, line: 40, baseType: !1002)
!1002 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !998, file: !691, line: 267, baseType: !1004, size: 64, align: 64)
!1004 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !998, file: !691, line: 268, baseType: !945, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !998, file: !691, line: 270, baseType: !955, size: 64, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !991, file: !691, line: 272, baseType: !1004, size: 64, align: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !991, file: !691, line: 273, baseType: !1004, size: 64, align: 64, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !991, file: !691, line: 275, baseType: !926, size: 32, align: 32, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !991, file: !691, line: 300, baseType: !945, size: 64, align: 64, offset: 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !980, file: !713, line: 93, baseType: !926, size: 32, align: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !980, file: !713, line: 99, baseType: !926, size: 32, align: 32, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !980, file: !713, line: 108, baseType: !926, size: 32, align: 32, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !980, file: !713, line: 113, baseType: !1015, size: 64, align: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!987, !987, !987}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !980, file: !713, line: 123, baseType: !1019, size: 64, align: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!1022, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !980, file: !713, line: 130, baseType: !1025, size: 32, align: 32, offset: 448)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !980, file: !713, line: 136, baseType: !1027, size: 64, align: 64, offset: 512)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1025, !987}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !980, file: !713, line: 142, baseType: !1031, size: 64, align: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!926, !1034, !987, !945, !926}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1037)
!1037 = !{!1038, !1050, !1051}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1036, file: !691, line: 360, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1042, file: !691, line: 307, baseType: !945, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1042, file: !691, line: 313, baseType: !1004, size: 64, align: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1042, file: !691, line: 313, baseType: !1004, size: 64, align: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1042, file: !691, line: 318, baseType: !1004, size: 64, align: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1042, file: !691, line: 318, baseType: !1004, size: 64, align: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1042, file: !691, line: 323, baseType: !926, size: 32, align: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1036, file: !691, line: 364, baseType: !926, size: 32, align: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1036, file: !691, line: 368, baseType: !926, size: 32, align: 32, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !942, file: !14, line: 3495, baseType: !1053, size: 64, align: 64, offset: 704)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1056, file: !14, line: 3402, baseType: !926, size: 32, align: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1056, file: !14, line: 3403, baseType: !945, size: 64, align: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !942, file: !14, line: 3507, baseType: !945, size: 64, align: 64, offset: 768)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !942, file: !14, line: 3516, baseType: !926, size: 32, align: 32, offset: 832)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !14, line: 3517, baseType: !1063, size: 64, align: 64, offset: 896)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !942, file: !14, line: 3527, baseType: !1065, size: 64, align: 64, offset: 960)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DISubroutineType(types: !1067)
!1067 = !{!926, !1068}
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1078, !1079, !1080, !1081, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1361, !1365, !1366, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !2429, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2448, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1070, file: !14, line: 1561, baseType: !977, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1070, file: !14, line: 1562, baseType: !926, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1070, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1070, file: !14, line: 1565, baseType: !1076, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1070, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1070, file: !14, line: 1581, baseType: !927, size: 32, align: 32, offset: 224)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1070, file: !14, line: 1583, baseType: !987, size: 64, align: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1070, file: !14, line: 1591, baseType: !1082, size: 64, align: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1084, line: 129, size: 1664, align: 64, elements: !1085)
!1084 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1085 = !{!1086, !1087, !1088, !1089, !1187, !1208, !1209, !1238, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1083, file: !1084, line: 136, baseType: !926, size: 32, align: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1083, file: !1084, line: 151, baseType: !926, size: 32, align: 32, offset: 32)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1083, file: !1084, line: 157, baseType: !926, size: 32, align: 32, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1083, file: !1084, line: 159, baseType: !1090, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1093)
!1093 = !{!1094, !1099, !1101, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1139, !1141, !1142, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1175, !1176, !1177, !1178, !1179, !1180, !1183, !1184, !1185, !1186}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1092, file: !744, line: 282, baseType: !1095, size: 512, align: 64)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 512, align: 64, elements: !1097)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1097 = !{!1098}
!1098 = !DISubrange(count: 8)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1092, file: !744, line: 299, baseType: !1100, size: 256, align: 32, offset: 512)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 32, elements: !1097)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1092, file: !744, line: 315, baseType: !1102, size: 64, align: 64, offset: 768)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1092, file: !744, line: 326, baseType: !926, size: 32, align: 32, offset: 832)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1092, file: !744, line: 326, baseType: !926, size: 32, align: 32, offset: 864)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1092, file: !744, line: 334, baseType: !926, size: 32, align: 32, offset: 896)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1092, file: !744, line: 341, baseType: !926, size: 32, align: 32, offset: 928)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1092, file: !744, line: 346, baseType: !926, size: 32, align: 32, offset: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1092, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1092, file: !744, line: 356, baseType: !955, size: 64, align: 32, offset: 1024)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1092, file: !744, line: 361, baseType: !1001, size: 64, align: 64, offset: 1088)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1092, file: !744, line: 369, baseType: !1001, size: 64, align: 64, offset: 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1092, file: !744, line: 377, baseType: !1001, size: 64, align: 64, offset: 1216)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1092, file: !744, line: 382, baseType: !926, size: 32, align: 32, offset: 1280)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1092, file: !744, line: 386, baseType: !926, size: 32, align: 32, offset: 1312)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1092, file: !744, line: 391, baseType: !926, size: 32, align: 32, offset: 1344)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1092, file: !744, line: 396, baseType: !987, size: 64, align: 64, offset: 1408)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1092, file: !744, line: 403, baseType: !1118, size: 512, align: 64, offset: 1472)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 512, align: 64, elements: !1097)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1092, file: !744, line: 410, baseType: !926, size: 32, align: 32, offset: 1984)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1092, file: !744, line: 415, baseType: !926, size: 32, align: 32, offset: 2016)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1092, file: !744, line: 420, baseType: !926, size: 32, align: 32, offset: 2048)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1092, file: !744, line: 425, baseType: !926, size: 32, align: 32, offset: 2080)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1092, file: !744, line: 435, baseType: !1001, size: 64, align: 64, offset: 2112)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1092, file: !744, line: 440, baseType: !926, size: 32, align: 32, offset: 2176)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1092, file: !744, line: 445, baseType: !973, size: 64, align: 64, offset: 2240)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1092, file: !744, line: 459, baseType: !1127, size: 512, align: 64, offset: 2304)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 512, align: 64, elements: !1097)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1130, line: 94, baseType: !1131)
!1130 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1130, line: 81, size: 192, align: 64, elements: !1132)
!1132 = !{!1133, !1137, !1138}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1131, file: !1130, line: 82, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1130, line: 73, baseType: !1136)
!1136 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1130, line: 73, flags: DIFlagFwdDecl)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !1130, line: 89, baseType: !1096, size: 64, align: 64, offset: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1131, file: !1130, line: 93, baseType: !926, size: 32, align: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1092, file: !744, line: 473, baseType: !1140, size: 64, align: 64, offset: 2816)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1092, file: !744, line: 477, baseType: !926, size: 32, align: 32, offset: 2880)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1092, file: !744, line: 479, baseType: !1143, size: 64, align: 64, offset: 2944)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1156}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1146, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1146, file: !744, line: 203, baseType: !1096, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1146, file: !744, line: 204, baseType: !926, size: 32, align: 32, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1146, file: !744, line: 205, baseType: !1152, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1154, line: 86, baseType: !1155)
!1154 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1154, line: 86, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1146, file: !744, line: 206, baseType: !1128, size: 64, align: 64, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1092, file: !744, line: 480, baseType: !926, size: 32, align: 32, offset: 3008)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1092, file: !744, line: 505, baseType: !926, size: 32, align: 32, offset: 3040)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1092, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1092, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1092, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1092, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1092, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1092, file: !744, line: 532, baseType: !1001, size: 64, align: 64, offset: 3264)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1092, file: !744, line: 539, baseType: !1001, size: 64, align: 64, offset: 3328)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1092, file: !744, line: 547, baseType: !1001, size: 64, align: 64, offset: 3392)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1092, file: !744, line: 554, baseType: !1152, size: 64, align: 64, offset: 3456)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1092, file: !744, line: 563, baseType: !926, size: 32, align: 32, offset: 3520)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1092, file: !744, line: 572, baseType: !926, size: 32, align: 32, offset: 3552)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1092, file: !744, line: 581, baseType: !926, size: 32, align: 32, offset: 3584)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1092, file: !744, line: 588, baseType: !1172, size: 64, align: 64, offset: 3648)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !935, line: 36, baseType: !1174)
!1174 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1092, file: !744, line: 593, baseType: !926, size: 32, align: 32, offset: 3712)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1092, file: !744, line: 596, baseType: !926, size: 32, align: 32, offset: 3744)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1092, file: !744, line: 599, baseType: !1128, size: 64, align: 64, offset: 3776)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1092, file: !744, line: 605, baseType: !1128, size: 64, align: 64, offset: 3840)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1092, file: !744, line: 616, baseType: !1128, size: 64, align: 64, offset: 3904)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1092, file: !744, line: 626, baseType: !1181, size: 64, align: 64, offset: 3968)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1182, line: 216, baseType: !974)
!1182 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1092, file: !744, line: 627, baseType: !1181, size: 64, align: 64, offset: 4032)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1092, file: !744, line: 628, baseType: !1181, size: 64, align: 64, offset: 4096)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1092, file: !744, line: 629, baseType: !1181, size: 64, align: 64, offset: 4160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1092, file: !744, line: 645, baseType: !1128, size: 64, align: 64, offset: 4224)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1083, file: !1084, line: 161, baseType: !1188, size: 64, align: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1084, line: 117, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1084, line: 100, size: 832, align: 64, elements: !1191)
!1191 = !{!1192, !1199, !1200, !1201, !1202, !1203, !1205, !1206, !1207}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1190, file: !1084, line: 105, baseType: !1193, size: 256, align: 64)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 256, align: 64, elements: !1197)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1130, line: 238, baseType: !1196)
!1196 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1130, line: 238, flags: DIFlagFwdDecl)
!1197 = !{!1198}
!1198 = !DISubrange(count: 4)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1190, file: !1084, line: 110, baseType: !926, size: 32, align: 32, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1190, file: !1084, line: 111, baseType: !926, size: 32, align: 32, offset: 288)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1190, file: !1084, line: 111, baseType: !926, size: 32, align: 32, offset: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1190, file: !1084, line: 112, baseType: !1100, size: 256, align: 32, offset: 352)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1190, file: !1084, line: 113, baseType: !1204, size: 128, align: 32, offset: 608)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, align: 32, elements: !1197)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1190, file: !1084, line: 114, baseType: !926, size: 32, align: 32, offset: 736)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1190, file: !1084, line: 115, baseType: !926, size: 32, align: 32, offset: 768)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1190, file: !1084, line: 116, baseType: !926, size: 32, align: 32, offset: 800)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1083, file: !1084, line: 163, baseType: !987, size: 64, align: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1083, file: !1084, line: 165, baseType: !1210, size: 128, align: 64, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1084, line: 122, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1084, line: 119, size: 128, align: 64, elements: !1212)
!1212 = !{!1213, !1237}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1211, file: !1084, line: 120, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1233, !1234, !1235, !1236}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1216, file: !14, line: 1451, baseType: !1128, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1216, file: !14, line: 1461, baseType: !1001, size: 64, align: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1216, file: !14, line: 1467, baseType: !1001, size: 64, align: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1216, file: !14, line: 1468, baseType: !1096, size: 64, align: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1216, file: !14, line: 1469, baseType: !926, size: 32, align: 32, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1216, file: !14, line: 1470, baseType: !926, size: 32, align: 32, offset: 288)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1216, file: !14, line: 1474, baseType: !926, size: 32, align: 32, offset: 320)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1216, file: !14, line: 1479, baseType: !1226, size: 64, align: 64, offset: 384)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1229)
!1229 = !{!1230, !1231, !1232}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1228, file: !14, line: 1412, baseType: !1096, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1228, file: !14, line: 1413, baseType: !926, size: 32, align: 32, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1228, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1216, file: !14, line: 1480, baseType: !926, size: 32, align: 32, offset: 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1216, file: !14, line: 1486, baseType: !1001, size: 64, align: 64, offset: 512)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1216, file: !14, line: 1488, baseType: !1001, size: 64, align: 64, offset: 576)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1216, file: !14, line: 1497, baseType: !1001, size: 64, align: 64, offset: 640)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1211, file: !1084, line: 121, baseType: !1090, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1083, file: !1084, line: 166, baseType: !1239, size: 128, align: 64, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1084, line: 127, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1084, line: 124, size: 128, align: 64, elements: !1241)
!1241 = !{!1242, !1315}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1240, file: !1084, line: 125, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1246)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1247)
!1247 = !{!1248, !1249, !1273, !1277, !1278, !1312, !1313, !1314}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1246, file: !14, line: 5751, baseType: !977, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1246, file: !14, line: 5756, baseType: !1250, size: 64, align: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1253)
!1253 = !{!1254, !1255, !1258, !1259, !1260, !1264, !1268, !1272}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1252, file: !14, line: 5797, baseType: !945, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1252, file: !14, line: 5804, baseType: !1256, size: 64, align: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1252, file: !14, line: 5815, baseType: !977, size: 64, align: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1252, file: !14, line: 5825, baseType: !926, size: 32, align: 32, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1252, file: !14, line: 5826, baseType: !1261, size: 64, align: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{!926, !1244}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1252, file: !14, line: 5827, baseType: !1265, size: 64, align: 64, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!926, !1244, !1214}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1252, file: !14, line: 5828, baseType: !1269, size: 64, align: 64, offset: 384)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{null, !1244}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1252, file: !14, line: 5829, baseType: !1269, size: 64, align: 64, offset: 448)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1246, file: !14, line: 5762, baseType: !1274, size: 64, align: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1276)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1246, file: !14, line: 5768, baseType: !987, size: 64, align: 64, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1246, file: !14, line: 5775, baseType: !1279, size: 64, align: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1281, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1281, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1281, file: !14, line: 3948, baseType: !934, size: 32, align: 32, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1281, file: !14, line: 3958, baseType: !1096, size: 64, align: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1281, file: !14, line: 3962, baseType: !926, size: 32, align: 32, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1281, file: !14, line: 3968, baseType: !926, size: 32, align: 32, offset: 224)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1281, file: !14, line: 3973, baseType: !1001, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1281, file: !14, line: 3986, baseType: !926, size: 32, align: 32, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1281, file: !14, line: 3999, baseType: !926, size: 32, align: 32, offset: 352)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1281, file: !14, line: 4004, baseType: !926, size: 32, align: 32, offset: 384)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1281, file: !14, line: 4005, baseType: !926, size: 32, align: 32, offset: 416)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1281, file: !14, line: 4010, baseType: !926, size: 32, align: 32, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1281, file: !14, line: 4011, baseType: !926, size: 32, align: 32, offset: 480)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1281, file: !14, line: 4020, baseType: !955, size: 64, align: 32, offset: 512)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1281, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1281, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1281, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1281, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1281, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1281, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1281, file: !14, line: 4039, baseType: !926, size: 32, align: 32, offset: 768)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1281, file: !14, line: 4046, baseType: !973, size: 64, align: 64, offset: 832)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1281, file: !14, line: 4050, baseType: !926, size: 32, align: 32, offset: 896)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1281, file: !14, line: 4054, baseType: !926, size: 32, align: 32, offset: 928)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1281, file: !14, line: 4061, baseType: !926, size: 32, align: 32, offset: 960)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1281, file: !14, line: 4065, baseType: !926, size: 32, align: 32, offset: 992)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1281, file: !14, line: 4073, baseType: !926, size: 32, align: 32, offset: 1024)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1281, file: !14, line: 4080, baseType: !926, size: 32, align: 32, offset: 1056)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1281, file: !14, line: 4084, baseType: !926, size: 32, align: 32, offset: 1088)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1246, file: !14, line: 5781, baseType: !1279, size: 64, align: 64, offset: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1246, file: !14, line: 5787, baseType: !955, size: 64, align: 32, offset: 384)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1246, file: !14, line: 5793, baseType: !955, size: 64, align: 32, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1240, file: !1084, line: 126, baseType: !926, size: 32, align: 32, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1083, file: !1084, line: 172, baseType: !1214, size: 64, align: 64, offset: 576)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1083, file: !1084, line: 177, baseType: !1096, size: 64, align: 64, offset: 640)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1083, file: !1084, line: 178, baseType: !927, size: 32, align: 32, offset: 704)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1083, file: !1084, line: 180, baseType: !987, size: 64, align: 64, offset: 768)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1083, file: !1084, line: 185, baseType: !926, size: 32, align: 32, offset: 832)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1083, file: !1084, line: 190, baseType: !987, size: 64, align: 64, offset: 896)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1083, file: !1084, line: 195, baseType: !926, size: 32, align: 32, offset: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1083, file: !1084, line: 200, baseType: !1214, size: 64, align: 64, offset: 1024)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1083, file: !1084, line: 201, baseType: !926, size: 32, align: 32, offset: 1088)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1083, file: !1084, line: 202, baseType: !1090, size: 64, align: 64, offset: 1152)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1083, file: !1084, line: 203, baseType: !926, size: 32, align: 32, offset: 1216)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1083, file: !1084, line: 205, baseType: !926, size: 32, align: 32, offset: 1248)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1083, file: !1084, line: 206, baseType: !926, size: 32, align: 32, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1083, file: !1084, line: 209, baseType: !1181, size: 64, align: 64, offset: 1344)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1083, file: !1084, line: 212, baseType: !1181, size: 64, align: 64, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1083, file: !1084, line: 213, baseType: !1090, size: 64, align: 64, offset: 1472)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1083, file: !1084, line: 215, baseType: !926, size: 32, align: 32, offset: 1536)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1083, file: !1084, line: 217, baseType: !926, size: 32, align: 32, offset: 1568)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1083, file: !1084, line: 220, baseType: !926, size: 32, align: 32, offset: 1600)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1070, file: !14, line: 1598, baseType: !987, size: 64, align: 64, offset: 384)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1070, file: !14, line: 1606, baseType: !1001, size: 64, align: 64, offset: 448)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1070, file: !14, line: 1614, baseType: !926, size: 32, align: 32, offset: 512)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1070, file: !14, line: 1622, baseType: !926, size: 32, align: 32, offset: 544)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1070, file: !14, line: 1628, baseType: !926, size: 32, align: 32, offset: 576)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1070, file: !14, line: 1636, baseType: !926, size: 32, align: 32, offset: 608)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1070, file: !14, line: 1643, baseType: !926, size: 32, align: 32, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1070, file: !14, line: 1657, baseType: !1096, size: 64, align: 64, offset: 704)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1070, file: !14, line: 1658, baseType: !926, size: 32, align: 32, offset: 768)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1070, file: !14, line: 1679, baseType: !955, size: 64, align: 32, offset: 800)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1070, file: !14, line: 1688, baseType: !926, size: 32, align: 32, offset: 864)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1070, file: !14, line: 1712, baseType: !926, size: 32, align: 32, offset: 896)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1070, file: !14, line: 1729, baseType: !926, size: 32, align: 32, offset: 928)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1070, file: !14, line: 1729, baseType: !926, size: 32, align: 32, offset: 960)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1070, file: !14, line: 1744, baseType: !926, size: 32, align: 32, offset: 992)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1070, file: !14, line: 1744, baseType: !926, size: 32, align: 32, offset: 1024)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1070, file: !14, line: 1751, baseType: !926, size: 32, align: 32, offset: 1056)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1070, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1070, file: !14, line: 1791, baseType: !1354, size: 64, align: 64, offset: 1152)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DISubroutineType(types: !1356)
!1356 = !{null, !1357, !1358, !1360, !926, !926, !926}
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1070, file: !14, line: 1808, baseType: !1362, size: 64, align: 64, offset: 1216)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!473, !1357, !962}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1070, file: !14, line: 1816, baseType: !926, size: 32, align: 32, offset: 1280)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1070, file: !14, line: 1825, baseType: !1367, size: 32, align: 32, offset: 1312)
!1367 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1070, file: !14, line: 1830, baseType: !926, size: 32, align: 32, offset: 1344)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1070, file: !14, line: 1838, baseType: !1367, size: 32, align: 32, offset: 1376)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1070, file: !14, line: 1846, baseType: !926, size: 32, align: 32, offset: 1408)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1070, file: !14, line: 1851, baseType: !926, size: 32, align: 32, offset: 1440)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1070, file: !14, line: 1861, baseType: !1367, size: 32, align: 32, offset: 1472)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1070, file: !14, line: 1868, baseType: !1367, size: 32, align: 32, offset: 1504)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1070, file: !14, line: 1875, baseType: !1367, size: 32, align: 32, offset: 1536)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1070, file: !14, line: 1882, baseType: !1367, size: 32, align: 32, offset: 1568)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1070, file: !14, line: 1889, baseType: !1367, size: 32, align: 32, offset: 1600)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1070, file: !14, line: 1896, baseType: !1367, size: 32, align: 32, offset: 1632)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1070, file: !14, line: 1903, baseType: !1367, size: 32, align: 32, offset: 1664)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1070, file: !14, line: 1910, baseType: !926, size: 32, align: 32, offset: 1696)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1070, file: !14, line: 1915, baseType: !926, size: 32, align: 32, offset: 1728)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1070, file: !14, line: 1926, baseType: !1360, size: 64, align: 64, offset: 1792)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1070, file: !14, line: 1935, baseType: !955, size: 64, align: 32, offset: 1856)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1070, file: !14, line: 1942, baseType: !926, size: 32, align: 32, offset: 1920)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1070, file: !14, line: 1948, baseType: !926, size: 32, align: 32, offset: 1952)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1070, file: !14, line: 1954, baseType: !926, size: 32, align: 32, offset: 1984)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1070, file: !14, line: 1960, baseType: !926, size: 32, align: 32, offset: 2016)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1070, file: !14, line: 1984, baseType: !926, size: 32, align: 32, offset: 2048)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1070, file: !14, line: 1991, baseType: !926, size: 32, align: 32, offset: 2080)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1070, file: !14, line: 1996, baseType: !926, size: 32, align: 32, offset: 2112)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1070, file: !14, line: 2004, baseType: !926, size: 32, align: 32, offset: 2144)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1070, file: !14, line: 2011, baseType: !926, size: 32, align: 32, offset: 2176)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1070, file: !14, line: 2018, baseType: !926, size: 32, align: 32, offset: 2208)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1070, file: !14, line: 2027, baseType: !926, size: 32, align: 32, offset: 2240)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1070, file: !14, line: 2034, baseType: !926, size: 32, align: 32, offset: 2272)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1070, file: !14, line: 2044, baseType: !926, size: 32, align: 32, offset: 2304)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1070, file: !14, line: 2054, baseType: !1397, size: 64, align: 64, offset: 2368)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !935, line: 49, baseType: !1399)
!1399 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1070, file: !14, line: 2061, baseType: !1397, size: 64, align: 64, offset: 2432)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1070, file: !14, line: 2066, baseType: !926, size: 32, align: 32, offset: 2496)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1070, file: !14, line: 2070, baseType: !926, size: 32, align: 32, offset: 2528)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1070, file: !14, line: 2078, baseType: !926, size: 32, align: 32, offset: 2560)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1070, file: !14, line: 2085, baseType: !926, size: 32, align: 32, offset: 2592)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1070, file: !14, line: 2092, baseType: !926, size: 32, align: 32, offset: 2624)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1070, file: !14, line: 2099, baseType: !926, size: 32, align: 32, offset: 2656)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1070, file: !14, line: 2106, baseType: !926, size: 32, align: 32, offset: 2688)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1070, file: !14, line: 2113, baseType: !926, size: 32, align: 32, offset: 2720)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1070, file: !14, line: 2120, baseType: !926, size: 32, align: 32, offset: 2752)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1070, file: !14, line: 2125, baseType: !926, size: 32, align: 32, offset: 2784)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1070, file: !14, line: 2133, baseType: !926, size: 32, align: 32, offset: 2816)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1070, file: !14, line: 2140, baseType: !926, size: 32, align: 32, offset: 2848)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1070, file: !14, line: 2145, baseType: !926, size: 32, align: 32, offset: 2880)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1070, file: !14, line: 2153, baseType: !926, size: 32, align: 32, offset: 2912)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1070, file: !14, line: 2158, baseType: !926, size: 32, align: 32, offset: 2944)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1070, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1070, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1070, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1070, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1070, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1070, file: !14, line: 2203, baseType: !926, size: 32, align: 32, offset: 3136)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1070, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1070, file: !14, line: 2212, baseType: !926, size: 32, align: 32, offset: 3200)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1070, file: !14, line: 2213, baseType: !926, size: 32, align: 32, offset: 3232)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1070, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1070, file: !14, line: 2232, baseType: !926, size: 32, align: 32, offset: 3296)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1070, file: !14, line: 2243, baseType: !926, size: 32, align: 32, offset: 3328)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1070, file: !14, line: 2249, baseType: !926, size: 32, align: 32, offset: 3360)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1070, file: !14, line: 2256, baseType: !926, size: 32, align: 32, offset: 3392)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1070, file: !14, line: 2263, baseType: !973, size: 64, align: 64, offset: 3456)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1070, file: !14, line: 2270, baseType: !973, size: 64, align: 64, offset: 3520)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1070, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1070, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1070, file: !14, line: 2367, baseType: !1435, size: 64, align: 64, offset: 3648)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!926, !1357, !1090, !926}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1070, file: !14, line: 2383, baseType: !926, size: 32, align: 32, offset: 3712)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1070, file: !14, line: 2386, baseType: !1367, size: 32, align: 32, offset: 3744)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1070, file: !14, line: 2387, baseType: !1367, size: 32, align: 32, offset: 3776)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1070, file: !14, line: 2394, baseType: !926, size: 32, align: 32, offset: 3808)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1070, file: !14, line: 2401, baseType: !926, size: 32, align: 32, offset: 3840)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1070, file: !14, line: 2408, baseType: !926, size: 32, align: 32, offset: 3872)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1070, file: !14, line: 2415, baseType: !926, size: 32, align: 32, offset: 3904)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1070, file: !14, line: 2422, baseType: !926, size: 32, align: 32, offset: 3936)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1070, file: !14, line: 2423, baseType: !1447, size: 64, align: 64, offset: 3968)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1449, file: !14, line: 827, baseType: !926, size: 32, align: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1449, file: !14, line: 828, baseType: !926, size: 32, align: 32, offset: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1449, file: !14, line: 829, baseType: !926, size: 32, align: 32, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1449, file: !14, line: 830, baseType: !1367, size: 32, align: 32, offset: 96)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1070, file: !14, line: 2430, baseType: !1001, size: 64, align: 64, offset: 4032)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1070, file: !14, line: 2437, baseType: !1001, size: 64, align: 64, offset: 4096)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1070, file: !14, line: 2444, baseType: !1367, size: 32, align: 32, offset: 4160)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1070, file: !14, line: 2451, baseType: !1367, size: 32, align: 32, offset: 4192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1070, file: !14, line: 2458, baseType: !926, size: 32, align: 32, offset: 4224)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1070, file: !14, line: 2469, baseType: !926, size: 32, align: 32, offset: 4256)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1070, file: !14, line: 2475, baseType: !926, size: 32, align: 32, offset: 4288)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1070, file: !14, line: 2481, baseType: !926, size: 32, align: 32, offset: 4320)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1070, file: !14, line: 2485, baseType: !926, size: 32, align: 32, offset: 4352)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1070, file: !14, line: 2489, baseType: !926, size: 32, align: 32, offset: 4384)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1070, file: !14, line: 2493, baseType: !926, size: 32, align: 32, offset: 4416)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1070, file: !14, line: 2501, baseType: !926, size: 32, align: 32, offset: 4448)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1070, file: !14, line: 2506, baseType: !926, size: 32, align: 32, offset: 4480)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1070, file: !14, line: 2510, baseType: !926, size: 32, align: 32, offset: 4512)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1070, file: !14, line: 2514, baseType: !1001, size: 64, align: 64, offset: 4544)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1070, file: !14, line: 2528, baseType: !1471, size: 64, align: 64, offset: 4608)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{null, !1357, !987, !926, !926}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1070, file: !14, line: 2534, baseType: !926, size: 32, align: 32, offset: 4672)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1070, file: !14, line: 2545, baseType: !926, size: 32, align: 32, offset: 4704)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1070, file: !14, line: 2547, baseType: !926, size: 32, align: 32, offset: 4736)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1070, file: !14, line: 2549, baseType: !926, size: 32, align: 32, offset: 4768)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1070, file: !14, line: 2551, baseType: !926, size: 32, align: 32, offset: 4800)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1070, file: !14, line: 2553, baseType: !926, size: 32, align: 32, offset: 4832)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1070, file: !14, line: 2555, baseType: !926, size: 32, align: 32, offset: 4864)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1070, file: !14, line: 2557, baseType: !926, size: 32, align: 32, offset: 4896)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1070, file: !14, line: 2559, baseType: !926, size: 32, align: 32, offset: 4928)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1070, file: !14, line: 2563, baseType: !926, size: 32, align: 32, offset: 4960)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1070, file: !14, line: 2571, baseType: !1485, size: 64, align: 64, offset: 4992)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1070, file: !14, line: 2579, baseType: !1485, size: 64, align: 64, offset: 5056)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1070, file: !14, line: 2586, baseType: !926, size: 32, align: 32, offset: 5120)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1070, file: !14, line: 2615, baseType: !926, size: 32, align: 32, offset: 5152)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1070, file: !14, line: 2627, baseType: !926, size: 32, align: 32, offset: 5184)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1070, file: !14, line: 2637, baseType: !926, size: 32, align: 32, offset: 5216)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1070, file: !14, line: 2681, baseType: !926, size: 32, align: 32, offset: 5248)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1070, file: !14, line: 2709, baseType: !1001, size: 64, align: 64, offset: 5312)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1070, file: !14, line: 2716, baseType: !1494, size: 64, align: 64, offset: 5376)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1496)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1497)
!1497 = !{!1498, !1499, !1500, !1501, !1502, !1503, !1507, !1513, !1517, !1518, !1519, !1520, !2421, !2422, !2423, !2424, !2425}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1496, file: !14, line: 3642, baseType: !945, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1496, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1496, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1496, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1496, file: !14, line: 3669, baseType: !926, size: 32, align: 32, offset: 160)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1496, file: !14, line: 3682, baseType: !1504, size: 64, align: 64, offset: 192)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!926, !1068, !1090}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1496, file: !14, line: 3698, baseType: !1508, size: 64, align: 64, offset: 256)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!926, !1068, !1511, !934}
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1496, file: !14, line: 3712, baseType: !1514, size: 64, align: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!926, !1068, !926, !1511, !934}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1496, file: !14, line: 3726, baseType: !1508, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1496, file: !14, line: 3737, baseType: !1065, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1496, file: !14, line: 3746, baseType: !926, size: 32, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1496, file: !14, line: 3757, baseType: !1521, size: 64, align: 64, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{null, !1524}
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1526, line: 81, size: 86208, align: 64, elements: !1527)
!1526 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1527 = !{!1528, !1530, !1531, !1532, !1533, !1537, !1538, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1585, !1586, !1641, !1643, !1644, !1645, !1646, !1647, !1658, !1659, !1660, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1676, !1678, !1680, !1681, !1682, !1683, !1684, !1685, !1690, !1692, !1693, !1694, !1695, !1696, !1697, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1724, !1725, !1726, !1727, !1743, !1750, !1762, !1778, !1800, !1840, !1853, !1880, !1895, !1909, !1922, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1943, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1956, !1958, !1959, !1960, !1961, !1962, !1963, !1966, !1968, !1970, !1971, !1974, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2041, !2042, !2044, !2045, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2067, !2068, !2069, !2072, !2073, !2074, !2075, !2077, !2079, !2080, !2081, !2082, !2083, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2165, !2166, !2167, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2296, !2297, !2298, !2299, !2303, !2304, !2308, !2312, !2316, !2317, !2322, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2337, !2338, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2356, !2357, !2358, !2408, !2409, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1525, file: !1526, line: 82, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1525, file: !1526, line: 84, baseType: !926, size: 32, align: 32, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1525, file: !1526, line: 84, baseType: !926, size: 32, align: 32, offset: 96)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1525, file: !1526, line: 85, baseType: !926, size: 32, align: 32, offset: 128)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1525, file: !1526, line: 86, baseType: !1534, size: 384, align: 32, offset: 160)
!1534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 384, align: 32, elements: !1535)
!1535 = !{!1536}
!1536 = !DISubrange(count: 12)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1525, file: !1526, line: 87, baseType: !926, size: 32, align: 32, offset: 544)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1525, file: !1526, line: 90, baseType: !1539, size: 1088, align: 64, offset: 576)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1541)
!1541 = !{!1542, !1543, !1547}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1540, file: !902, line: 32, baseType: !1511, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1540, file: !902, line: 33, baseType: !1544, size: 512, align: 8, offset: 64)
!1544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 512, align: 8, elements: !1545)
!1545 = !{!1546}
!1546 = !DISubrange(count: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1540, file: !902, line: 34, baseType: !1544, size: 512, align: 8, offset: 576)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1525, file: !1526, line: 91, baseType: !1539, size: 1088, align: 64, offset: 1664)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1525, file: !1526, line: 92, baseType: !1539, size: 1088, align: 64, offset: 2752)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1525, file: !1526, line: 93, baseType: !1539, size: 1088, align: 64, offset: 3840)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1525, file: !1526, line: 98, baseType: !1357, size: 64, align: 64, offset: 4928)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1525, file: !1526, line: 100, baseType: !926, size: 32, align: 32, offset: 4992)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1525, file: !1526, line: 100, baseType: !926, size: 32, align: 32, offset: 5024)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1525, file: !1526, line: 101, baseType: !926, size: 32, align: 32, offset: 5056)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1525, file: !1526, line: 102, baseType: !926, size: 32, align: 32, offset: 5088)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1525, file: !1526, line: 103, baseType: !1001, size: 64, align: 64, offset: 5120)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1525, file: !1526, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1525, file: !1526, line: 105, baseType: !926, size: 32, align: 32, offset: 5216)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1525, file: !1526, line: 106, baseType: !926, size: 32, align: 32, offset: 5248)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1525, file: !1526, line: 109, baseType: !926, size: 32, align: 32, offset: 5280)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1525, file: !1526, line: 110, baseType: !926, size: 32, align: 32, offset: 5312)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1525, file: !1526, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1525, file: !1526, line: 113, baseType: !926, size: 32, align: 32, offset: 5376)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1525, file: !1526, line: 114, baseType: !926, size: 32, align: 32, offset: 5408)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1525, file: !1526, line: 115, baseType: !926, size: 32, align: 32, offset: 5440)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1525, file: !1526, line: 116, baseType: !926, size: 32, align: 32, offset: 5472)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1525, file: !1526, line: 117, baseType: !926, size: 32, align: 32, offset: 5504)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1525, file: !1526, line: 118, baseType: !926, size: 32, align: 32, offset: 5536)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1525, file: !1526, line: 119, baseType: !926, size: 32, align: 32, offset: 5568)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1525, file: !1526, line: 120, baseType: !926, size: 32, align: 32, offset: 5600)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1525, file: !1526, line: 124, baseType: !926, size: 32, align: 32, offset: 5632)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1525, file: !1526, line: 125, baseType: !926, size: 32, align: 32, offset: 5664)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1525, file: !1526, line: 126, baseType: !926, size: 32, align: 32, offset: 5696)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1525, file: !1526, line: 127, baseType: !926, size: 32, align: 32, offset: 5728)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1525, file: !1526, line: 128, baseType: !926, size: 32, align: 32, offset: 5760)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1525, file: !1526, line: 129, baseType: !926, size: 32, align: 32, offset: 5792)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1525, file: !1526, line: 129, baseType: !926, size: 32, align: 32, offset: 5824)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1525, file: !1526, line: 130, baseType: !926, size: 32, align: 32, offset: 5856)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1525, file: !1526, line: 131, baseType: !926, size: 32, align: 32, offset: 5888)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1525, file: !1526, line: 132, baseType: !926, size: 32, align: 32, offset: 5920)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1525, file: !1526, line: 132, baseType: !926, size: 32, align: 32, offset: 5952)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1525, file: !1526, line: 133, baseType: !926, size: 32, align: 32, offset: 5984)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1525, file: !1526, line: 134, baseType: !1584, size: 64, align: 64, offset: 6016)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1182, line: 149, baseType: !1002)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1525, file: !1526, line: 135, baseType: !1584, size: 64, align: 64, offset: 6080)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1525, file: !1526, line: 136, baseType: !1587, size: 64, align: 64, offset: 6144)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1589, line: 91, baseType: !1590)
!1589 = !DIFile(filename: "libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1589, line: 45, size: 2624, align: 64, elements: !1591)
!1591 = !{!1592, !1594, !1605, !1606, !1607, !1609, !1615, !1616, !1618, !1619, !1620, !1621, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1590, file: !1589, line: 46, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1590, file: !1589, line: 47, baseType: !1595, size: 256, align: 64, offset: 64)
!1595 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1596, line: 40, baseType: !1597)
!1596 = !DIFile(filename: "libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1596, line: 34, size: 256, align: 64, elements: !1598)
!1598 = !{!1599, !1600, !1604}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1597, file: !1596, line: 35, baseType: !1090, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1597, file: !1596, line: 36, baseType: !1601, size: 128, align: 64, offset: 64)
!1601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 128, align: 64, elements: !1602)
!1602 = !{!1603}
!1603 = !DISubrange(count: 2)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1597, file: !1596, line: 39, baseType: !1128, size: 64, align: 64, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1590, file: !1589, line: 49, baseType: !1128, size: 64, align: 64, offset: 320)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1590, file: !1589, line: 50, baseType: !1172, size: 64, align: 64, offset: 384)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1590, file: !1589, line: 52, baseType: !1608, size: 128, align: 64, offset: 448)
!1608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1128, size: 128, align: 64, elements: !1602)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1590, file: !1589, line: 53, baseType: !1610, size: 128, align: 64, offset: 576)
!1610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1611, size: 128, align: 64, elements: !1602)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1613, size: 32, align: 16, elements: !1602)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !935, line: 37, baseType: !1614)
!1614 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1590, file: !1589, line: 55, baseType: !1128, size: 64, align: 64, offset: 704)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type", scope: !1590, file: !1589, line: 56, baseType: !1617, size: 64, align: 64, offset: 768)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table_buf", scope: !1590, file: !1589, line: 58, baseType: !1128, size: 64, align: 64, offset: 832)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "mbskip_table", scope: !1590, file: !1589, line: 59, baseType: !1096, size: 64, align: 64, offset: 896)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index_buf", scope: !1590, file: !1589, line: 61, baseType: !1608, size: 128, align: 64, offset: 960)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "ref_index", scope: !1590, file: !1589, line: 62, baseType: !1622, size: 128, align: 64, offset: 1088)
!1622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1172, size: 128, align: 64, elements: !1602)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_buf", scope: !1590, file: !1589, line: 64, baseType: !1128, size: 64, align: 64, offset: 1216)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var", scope: !1590, file: !1589, line: 65, baseType: !1397, size: 64, align: 64, offset: 1280)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_buf", scope: !1590, file: !1589, line: 67, baseType: !1128, size: 64, align: 64, offset: 1344)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var", scope: !1590, file: !1589, line: 68, baseType: !1397, size: 64, align: 64, offset: 1408)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_width", scope: !1590, file: !1589, line: 70, baseType: !926, size: 32, align: 32, offset: 1472)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_mb_height", scope: !1590, file: !1589, line: 71, baseType: !926, size: 32, align: 32, offset: 1504)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean_buf", scope: !1590, file: !1589, line: 73, baseType: !1128, size: 64, align: 64, offset: 1536)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "mb_mean", scope: !1590, file: !1589, line: 74, baseType: !1096, size: 64, align: 64, offset: 1600)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_buf", scope: !1590, file: !1589, line: 76, baseType: !1128, size: 64, align: 64, offset: 1664)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_picture_private", scope: !1590, file: !1589, line: 77, baseType: !987, size: 64, align: 64, offset: 1728)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "field_picture", scope: !1590, file: !1589, line: 79, baseType: !926, size: 32, align: 32, offset: 1792)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_var_sum", scope: !1590, file: !1589, line: 81, baseType: !1001, size: 64, align: 64, offset: 1856)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "mc_mb_var_sum", scope: !1590, file: !1589, line: 82, baseType: !1001, size: 64, align: 64, offset: 1920)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_score", scope: !1590, file: !1589, line: 84, baseType: !926, size: 32, align: 32, offset: 1984)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "needs_realloc", scope: !1590, file: !1589, line: 85, baseType: !926, size: 32, align: 32, offset: 2016)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !1590, file: !1589, line: 87, baseType: !926, size: 32, align: 32, offset: 2048)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !1590, file: !1589, line: 88, baseType: !926, size: 32, align: 32, offset: 2080)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "encoding_error", scope: !1590, file: !1589, line: 90, baseType: !1118, size: 512, align: 64, offset: 2112)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture", scope: !1525, file: !1526, line: 137, baseType: !1642, size: 64, align: 64, offset: 6208)
