; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vc1_loopfilter.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vc1_loopfilter.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!956 = distinct !DISubprogram(name: "ff_vc1_i_overlap_filter", scope: !957, file: !957, line: 105, type: !958, isLocal: false, isDefinition: true, scopeLine: 106, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2974)
!957 = !DIFile(filename: "libavcodec/vc1_loopfilter.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!958 = !DISubroutineType(types: !959)
!959 = !{null, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "VC1Context", file: !926, line: 403, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VC1Context", file: !926, line: 173, size: 135936, align: 64, elements: !963)
!963 = !{!964, !2625, !2706, !2707, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2809, !2810, !2811, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2855, !2856, !2857, !2858, !2859, !2860, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2957, !2958, !2959, !2960, !2961, !2962, !2963, !2964, !2965, !2966, !2967, !2968, !2969, !2970, !2971, !2972, !2973}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !962, file: !926, line: 174, baseType: !965, size: 86208, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !966, line: 582, baseType: !967)
!966 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !966, line: 81, size: 86208, align: 64, elements: !968)
!968 = !{!969, !1055, !1056, !1057, !1058, !1062, !1063, !1077, !1078, !1079, !1080, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1789, !1790, !1845, !1847, !1848, !1849, !1850, !1851, !1862, !1863, !1864, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1880, !1882, !1884, !1885, !1886, !1887, !1888, !1889, !1894, !1896, !1897, !1898, !1899, !1900, !1901, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1928, !1929, !1930, !1931, !1947, !1954, !1966, !1982, !2004, !2044, !2057, !2084, !2099, !2113, !2126, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2147, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2160, !2162, !2163, !2164, !2165, !2166, !2167, !2170, !2172, !2174, !2175, !2178, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2245, !2246, !2248, !2249, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2271, !2272, !2273, !2276, !2277, !2278, !2279, !2281, !2283, !2284, !2285, !2286, !2287, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2369, !2370, !2371, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2434, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2500, !2501, !2502, !2503, !2507, !2508, !2512, !2516, !2520, !2521, !2526, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2541, !2542, !2546, !2547, !2548, !2549, !2550, !2551, !2552, !2553, !2554, !2555, !2556, !2557, !2558, !2560, !2561, !2562, !2612, !2613, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !967, file: !966, line: 82, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !973)
!973 = !{!974, !978, !983, !1014, !1015, !1016, !1017, !1021, !1027, !1029, !1033}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !972, file: !26, line: 72, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !972, file: !26, line: 78, baseType: !979, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!975, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !972, file: !26, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !987)
!987 = !{!988, !989, !990, !992, !993, !1010, !1011, !1012, !1013}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !4, line: 247, baseType: !975, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !986, file: !4, line: 253, baseType: !975, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !986, file: !4, line: 259, baseType: !991, size: 32, align: 32, offset: 128)
!991 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !986, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !986, file: !4, line: 271, baseType: !994, size: 64, align: 64, offset: 192)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !4, line: 265, size: 64, align: 64, elements: !995)
!995 = !{!996, !1000, !1002, !1003}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !994, file: !4, line: 266, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !998, line: 40, baseType: !999)
!998 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!999 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !994, file: !4, line: 267, baseType: !1001, size: 64, align: 64)
!1001 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !994, file: !4, line: 268, baseType: !975, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !994, file: !4, line: 270, baseType: !1004, size: 64, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1005, line: 61, baseType: !1006)
!1005 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1005, line: 58, size: 64, align: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1006, file: !1005, line: 59, baseType: !991, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1006, file: !1005, line: 60, baseType: !991, size: 32, align: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !986, file: !4, line: 272, baseType: !1001, size: 64, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !986, file: !4, line: 273, baseType: !1001, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !4, line: 275, baseType: !991, size: 32, align: 32, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !986, file: !4, line: 300, baseType: !975, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !972, file: !26, line: 93, baseType: !991, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !972, file: !26, line: 99, baseType: !991, size: 32, align: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !972, file: !26, line: 108, baseType: !991, size: 32, align: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !972, file: !26, line: 113, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!982, !982, !982}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !972, file: !26, line: 123, baseType: !1022, size: 64, align: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !972, file: !26, line: 130, baseType: !1028, size: 32, align: 32, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !972, file: !26, line: 136, baseType: !1030, size: 64, align: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1028, !982}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !972, file: !26, line: 142, baseType: !1034, size: 64, align: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!991, !1037, !982, !975, !991}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1040)
!1040 = !{!1041, !1053, !1054}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1039, file: !4, line: 360, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1045, file: !4, line: 307, baseType: !975, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1045, file: !4, line: 313, baseType: !1001, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1045, file: !4, line: 313, baseType: !1001, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1045, file: !4, line: 318, baseType: !1001, size: 64, align: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1045, file: !4, line: 318, baseType: !1001, size: 64, align: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1045, file: !4, line: 323, baseType: !991, size: 32, align: 32, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1039, file: !4, line: 364, baseType: !991, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1039, file: !4, line: 368, baseType: !991, size: 32, align: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !967, file: !966, line: 84, baseType: !991, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !967, file: !966, line: 84, baseType: !991, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !967, file: !966, line: 85, baseType: !991, size: 32, align: 32, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !967, file: !966, line: 86, baseType: !1059, size: 384, align: 32, offset: 160)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 384, align: 32, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 12)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !967, file: !966, line: 87, baseType: !991, size: 32, align: 32, offset: 544)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !967, file: !966, line: 90, baseType: !1064, size: 1088, align: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1066)
!1066 = !{!1067, !1072, !1076}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1065, file: !917, line: 32, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !998, line: 48, baseType: !1071)
!1071 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1065, file: !917, line: 33, baseType: !1073, size: 512, align: 8, offset: 64)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1070, size: 512, align: 8, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1065, file: !917, line: 34, baseType: !1073, size: 512, align: 8, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !967, file: !966, line: 91, baseType: !1064, size: 1088, align: 64, offset: 1664)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !967, file: !966, line: 92, baseType: !1064, size: 1088, align: 64, offset: 2752)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !967, file: !966, line: 93, baseType: !1064, size: 1088, align: 64, offset: 3840)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !967, file: !966, line: 98, baseType: !1081, size: 64, align: 64, offset: 4928)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1083)
!1083 = !{!1084, !1087, !1088, !1089, !1356, !1357, !1358, !1359, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1511, !1515, !1516, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1694, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1082, file: !57, line: 1561, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1082, file: !57, line: 1562, baseType: !991, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1082, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1082, file: !57, line: 1565, baseType: !1090, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098, !1099, !1102, !1105, !1108, !1111, !1116, !1117, !1118, !1126, !1127, !1128, !1130, !1136, !1142, !1151, !1155, !1156, !1206, !1327, !1331, !1332, !1336, !1340, !1345, !1349, !1350, !1351}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1092, file: !57, line: 3475, baseType: !975, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1092, file: !57, line: 3480, baseType: !975, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1092, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1092, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1092, file: !57, line: 3487, baseType: !991, size: 32, align: 32, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1092, file: !57, line: 3488, baseType: !1100, size: 64, align: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1092, file: !57, line: 3489, baseType: !1103, size: 64, align: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1092, file: !57, line: 3490, baseType: !1106, size: 64, align: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1092, file: !57, line: 3491, baseType: !1109, size: 64, align: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1092, file: !57, line: 3492, baseType: !1112, size: 64, align: 64, offset: 512)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !998, line: 55, baseType: !1115)
!1115 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1092, file: !57, line: 3493, baseType: !1070, size: 8, align: 8, offset: 576)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1092, file: !57, line: 3494, baseType: !1085, size: 64, align: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1092, file: !57, line: 3495, baseType: !1119, size: 64, align: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1122, file: !57, line: 3402, baseType: !991, size: 32, align: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1122, file: !57, line: 3403, baseType: !975, size: 64, align: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1092, file: !57, line: 3507, baseType: !975, size: 64, align: 64, offset: 768)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1092, file: !57, line: 3516, baseType: !991, size: 32, align: 32, offset: 832)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1092, file: !57, line: 3517, baseType: !1129, size: 64, align: 64, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1092, file: !57, line: 3527, baseType: !1131, size: 64, align: 64, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!991, !1134}
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1082)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1092, file: !57, line: 3535, baseType: !1137, size: 64, align: 64, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!991, !1134, !1140}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1135)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1092, file: !57, line: 3541, baseType: !1143, size: 64, align: 64, offset: 1088)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1147, line: 223, size: 128, align: 64, elements: !1148)
!1147 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1146, file: !1147, line: 224, baseType: !1068, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1146, file: !1147, line: 225, baseType: !1068, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1092, file: !57, line: 3549, baseType: !1152, size: 64, align: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{null, !1129}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1092, file: !57, line: 3551, baseType: !1131, size: 64, align: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1092, file: !57, line: 3552, baseType: !1157, size: 64, align: 64, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!991, !1134, !1160, !991, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1164)
!1164 = !{!1165, !1168, !1171, !1172, !1173, !1205}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1163, file: !57, line: 3921, baseType: !1166, size: 16, align: 16)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !998, line: 49, baseType: !1167)
!1167 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1163, file: !57, line: 3922, baseType: !1169, size: 32, align: 32, offset: 32)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !998, line: 51, baseType: !1170)
!1170 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1163, file: !57, line: 3923, baseType: !1169, size: 32, align: 32, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1163, file: !57, line: 3924, baseType: !1170, size: 32, align: 32, offset: 96)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1163, file: !57, line: 3925, baseType: !1174, size: 64, align: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1183, !1184, !1194, !1198, !1200, !1201, !1203, !1204}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1177, file: !57, line: 3886, baseType: !991, size: 32, align: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1177, file: !57, line: 3887, baseType: !991, size: 32, align: 32, offset: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1177, file: !57, line: 3888, baseType: !991, size: 32, align: 32, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1177, file: !57, line: 3889, baseType: !991, size: 32, align: 32, offset: 96)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1177, file: !57, line: 3890, baseType: !991, size: 32, align: 32, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1177, file: !57, line: 3897, baseType: !1185, size: 768, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1187)
!1187 = !{!1188, !1192}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !57, line: 3855, baseType: !1189, size: 512, align: 64)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 512, align: 64, elements: !1190)
!1190 = !{!1191}
!1191 = !DISubrange(count: 8)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1186, file: !57, line: 3857, baseType: !1193, size: 256, align: 32, offset: 512)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 256, align: 32, elements: !1190)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !57, line: 3903, baseType: !1195, size: 256, align: 64, offset: 960)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1160, size: 256, align: 64, elements: !1196)
!1196 = !{!1197}
!1197 = !DISubrange(count: 4)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1177, file: !57, line: 3904, baseType: !1199, size: 128, align: 32, offset: 1216)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 128, align: 32, elements: !1196)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1177, file: !57, line: 3908, baseType: !1202, size: 64, align: 64, offset: 1408)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1177, file: !57, line: 3915, baseType: !1202, size: 64, align: 64, offset: 1472)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1177, file: !57, line: 3917, baseType: !991, size: 32, align: 32, offset: 1536)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1163, file: !57, line: 3926, baseType: !997, size: 64, align: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1092, file: !57, line: 3564, baseType: !1207, size: 64, align: 64, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!991, !1134, !1210, !1244, !1326}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1213)
!1213 = !{!1214, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1240, !1241, !1242, !1243}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1212, file: !57, line: 1451, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1217, line: 94, baseType: !1218)
!1217 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1217, line: 81, size: 192, align: 64, elements: !1219)
!1219 = !{!1220, !1224, !1225}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1218, file: !1217, line: 82, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1217, line: 73, baseType: !1223)
!1223 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1217, line: 73, flags: DIFlagFwdDecl)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1218, file: !1217, line: 89, baseType: !1160, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1218, file: !1217, line: 93, baseType: !991, size: 32, align: 32, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1212, file: !57, line: 1461, baseType: !997, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1212, file: !57, line: 1467, baseType: !997, size: 64, align: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1212, file: !57, line: 1468, baseType: !1160, size: 64, align: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1212, file: !57, line: 1469, baseType: !991, size: 32, align: 32, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1212, file: !57, line: 1470, baseType: !991, size: 32, align: 32, offset: 288)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1212, file: !57, line: 1474, baseType: !991, size: 32, align: 32, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1212, file: !57, line: 1479, baseType: !1233, size: 64, align: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1235, file: !57, line: 1412, baseType: !1160, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1235, file: !57, line: 1413, baseType: !991, size: 32, align: 32, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1235, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1212, file: !57, line: 1480, baseType: !991, size: 32, align: 32, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1212, file: !57, line: 1486, baseType: !997, size: 64, align: 64, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1212, file: !57, line: 1488, baseType: !997, size: 64, align: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1212, file: !57, line: 1497, baseType: !997, size: 64, align: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1278, !1280, !1281, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1314, !1315, !1316, !1317, !1318, !1319, !1322, !1323, !1324, !1325}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1247, file: !780, line: 282, baseType: !1189, size: 512, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1247, file: !780, line: 299, baseType: !1193, size: 256, align: 32, offset: 512)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1247, file: !780, line: 315, baseType: !1252, size: 64, align: 64, offset: 768)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1247, file: !780, line: 326, baseType: !991, size: 32, align: 32, offset: 832)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1247, file: !780, line: 326, baseType: !991, size: 32, align: 32, offset: 864)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1247, file: !780, line: 334, baseType: !991, size: 32, align: 32, offset: 896)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1247, file: !780, line: 341, baseType: !991, size: 32, align: 32, offset: 928)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1247, file: !780, line: 346, baseType: !991, size: 32, align: 32, offset: 960)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1247, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1247, file: !780, line: 356, baseType: !1004, size: 64, align: 32, offset: 1024)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1247, file: !780, line: 361, baseType: !997, size: 64, align: 64, offset: 1088)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1247, file: !780, line: 369, baseType: !997, size: 64, align: 64, offset: 1152)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1247, file: !780, line: 377, baseType: !997, size: 64, align: 64, offset: 1216)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1247, file: !780, line: 382, baseType: !991, size: 32, align: 32, offset: 1280)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1247, file: !780, line: 386, baseType: !991, size: 32, align: 32, offset: 1312)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1247, file: !780, line: 391, baseType: !991, size: 32, align: 32, offset: 1344)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1247, file: !780, line: 396, baseType: !982, size: 64, align: 64, offset: 1408)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1247, file: !780, line: 403, baseType: !1268, size: 512, align: 64, offset: 1472)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1190)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1247, file: !780, line: 410, baseType: !991, size: 32, align: 32, offset: 1984)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1247, file: !780, line: 415, baseType: !991, size: 32, align: 32, offset: 2016)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1247, file: !780, line: 420, baseType: !991, size: 32, align: 32, offset: 2048)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1247, file: !780, line: 425, baseType: !991, size: 32, align: 32, offset: 2080)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1247, file: !780, line: 435, baseType: !997, size: 64, align: 64, offset: 2112)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1247, file: !780, line: 440, baseType: !991, size: 32, align: 32, offset: 2176)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1247, file: !780, line: 445, baseType: !1114, size: 64, align: 64, offset: 2240)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1247, file: !780, line: 459, baseType: !1277, size: 512, align: 64, offset: 2304)
!1277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1215, size: 512, align: 64, elements: !1190)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1247, file: !780, line: 473, baseType: !1279, size: 64, align: 64, offset: 2816)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1247, file: !780, line: 477, baseType: !991, size: 32, align: 32, offset: 2880)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1247, file: !780, line: 479, baseType: !1282, size: 64, align: 64, offset: 2944)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1295}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1285, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1285, file: !780, line: 203, baseType: !1160, size: 64, align: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1285, file: !780, line: 204, baseType: !991, size: 32, align: 32, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1285, file: !780, line: 205, baseType: !1291, size: 64, align: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1293, line: 86, baseType: !1294)
!1293 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1293, line: 86, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1285, file: !780, line: 206, baseType: !1215, size: 64, align: 64, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1247, file: !780, line: 480, baseType: !991, size: 32, align: 32, offset: 3008)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1247, file: !780, line: 505, baseType: !991, size: 32, align: 32, offset: 3040)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1247, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1247, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1247, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1247, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1247, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1247, file: !780, line: 532, baseType: !997, size: 64, align: 64, offset: 3264)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1247, file: !780, line: 539, baseType: !997, size: 64, align: 64, offset: 3328)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1247, file: !780, line: 547, baseType: !997, size: 64, align: 64, offset: 3392)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1247, file: !780, line: 554, baseType: !1291, size: 64, align: 64, offset: 3456)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1247, file: !780, line: 563, baseType: !991, size: 32, align: 32, offset: 3520)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1247, file: !780, line: 572, baseType: !991, size: 32, align: 32, offset: 3552)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1247, file: !780, line: 581, baseType: !991, size: 32, align: 32, offset: 3584)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1247, file: !780, line: 588, baseType: !1311, size: 64, align: 64, offset: 3648)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !998, line: 36, baseType: !1313)
!1313 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1247, file: !780, line: 593, baseType: !991, size: 32, align: 32, offset: 3712)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1247, file: !780, line: 596, baseType: !991, size: 32, align: 32, offset: 3744)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1247, file: !780, line: 599, baseType: !1215, size: 64, align: 64, offset: 3776)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1247, file: !780, line: 605, baseType: !1215, size: 64, align: 64, offset: 3840)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1247, file: !780, line: 616, baseType: !1215, size: 64, align: 64, offset: 3904)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1247, file: !780, line: 626, baseType: !1320, size: 64, align: 64, offset: 3968)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1321, line: 216, baseType: !1115)
!1321 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1247, file: !780, line: 627, baseType: !1320, size: 64, align: 64, offset: 4032)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1247, file: !780, line: 628, baseType: !1320, size: 64, align: 64, offset: 4096)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1247, file: !780, line: 629, baseType: !1320, size: 64, align: 64, offset: 4160)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1247, file: !780, line: 645, baseType: !1215, size: 64, align: 64, offset: 4224)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1092, file: !57, line: 3566, baseType: !1328, size: 64, align: 64, offset: 1408)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!991, !1134, !982, !1326, !1210}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1092, file: !57, line: 3567, baseType: !1131, size: 64, align: 64, offset: 1472)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1092, file: !57, line: 3576, baseType: !1333, size: 64, align: 64, offset: 1536)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!991, !1134, !1244}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1092, file: !57, line: 3577, baseType: !1337, size: 64, align: 64, offset: 1600)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!991, !1134, !1210}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1092, file: !57, line: 3584, baseType: !1341, size: 64, align: 64, offset: 1664)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!991, !1134, !1344}
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1092, file: !57, line: 3589, baseType: !1346, size: 64, align: 64, offset: 1728)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{null, !1134}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1092, file: !57, line: 3594, baseType: !991, size: 32, align: 32, offset: 1792)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1092, file: !57, line: 3600, baseType: !975, size: 64, align: 64, offset: 1856)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1092, file: !57, line: 3609, baseType: !1352, size: 64, align: 64, offset: 1920)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1355)
!1355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1082, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1082, file: !57, line: 1581, baseType: !1170, size: 32, align: 32, offset: 224)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1082, file: !57, line: 1583, baseType: !982, size: 64, align: 64, offset: 256)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1082, file: !57, line: 1591, baseType: !1360, size: 64, align: 64, offset: 320)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1147, line: 129, size: 1664, align: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1366, !1367, !1385, !1386, !1392, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1361, file: !1147, line: 136, baseType: !991, size: 32, align: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1361, file: !1147, line: 151, baseType: !991, size: 32, align: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1361, file: !1147, line: 157, baseType: !991, size: 32, align: 32, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1361, file: !1147, line: 159, baseType: !1344, size: 64, align: 64, offset: 128)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1361, file: !1147, line: 161, baseType: !1368, size: 64, align: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1147, line: 117, baseType: !1370)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1147, line: 100, size: 832, align: 64, elements: !1371)
!1371 = !{!1372, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1370, file: !1147, line: 105, baseType: !1373, size: 256, align: 64)
!1373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1374, size: 256, align: 64, elements: !1196)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1217, line: 238, baseType: !1376)
!1376 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1217, line: 238, flags: DIFlagFwdDecl)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1370, file: !1147, line: 110, baseType: !991, size: 32, align: 32, offset: 256)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1370, file: !1147, line: 111, baseType: !991, size: 32, align: 32, offset: 288)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1370, file: !1147, line: 111, baseType: !991, size: 32, align: 32, offset: 320)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1370, file: !1147, line: 112, baseType: !1193, size: 256, align: 32, offset: 352)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1370, file: !1147, line: 113, baseType: !1199, size: 128, align: 32, offset: 608)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1370, file: !1147, line: 114, baseType: !991, size: 32, align: 32, offset: 736)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1370, file: !1147, line: 115, baseType: !991, size: 32, align: 32, offset: 768)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1370, file: !1147, line: 116, baseType: !991, size: 32, align: 32, offset: 800)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1361, file: !1147, line: 163, baseType: !982, size: 64, align: 64, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1361, file: !1147, line: 165, baseType: !1387, size: 128, align: 64, offset: 320)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1147, line: 122, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1147, line: 119, size: 128, align: 64, elements: !1389)
!1389 = !{!1390, !1391}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1388, file: !1147, line: 120, baseType: !1210, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1388, file: !1147, line: 121, baseType: !1344, size: 64, align: 64, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1361, file: !1147, line: 166, baseType: !1393, size: 128, align: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1147, line: 127, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1147, line: 124, size: 128, align: 64, elements: !1395)
!1395 = !{!1396, !1469}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1394, file: !1147, line: 125, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1427, !1431, !1432, !1466, !1467, !1468}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1400, file: !57, line: 5751, baseType: !1085, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1400, file: !57, line: 5756, baseType: !1404, size: 64, align: 64, offset: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1406)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1407)
!1407 = !{!1408, !1409, !1412, !1413, !1414, !1418, !1422, !1426}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1406, file: !57, line: 5797, baseType: !975, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1406, file: !57, line: 5804, baseType: !1410, size: 64, align: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1406, file: !57, line: 5815, baseType: !1085, size: 64, align: 64, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1406, file: !57, line: 5825, baseType: !991, size: 32, align: 32, offset: 192)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1406, file: !57, line: 5826, baseType: !1415, size: 64, align: 64, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!991, !1398}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1406, file: !57, line: 5827, baseType: !1419, size: 64, align: 64, offset: 320)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!991, !1398, !1210}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1406, file: !57, line: 5828, baseType: !1423, size: 64, align: 64, offset: 384)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{null, !1398}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1406, file: !57, line: 5829, baseType: !1423, size: 64, align: 64, offset: 448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1400, file: !57, line: 5762, baseType: !1428, size: 64, align: 64, offset: 128)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1430)
!1430 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1400, file: !57, line: 5768, baseType: !982, size: 64, align: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1400, file: !57, line: 5775, baseType: !1433, size: 64, align: 64, offset: 256)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1435, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1435, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1435, file: !57, line: 3948, baseType: !1169, size: 32, align: 32, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1435, file: !57, line: 3958, baseType: !1160, size: 64, align: 64, offset: 128)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1435, file: !57, line: 3962, baseType: !991, size: 32, align: 32, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1435, file: !57, line: 3968, baseType: !991, size: 32, align: 32, offset: 224)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1435, file: !57, line: 3973, baseType: !997, size: 64, align: 64, offset: 256)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1435, file: !57, line: 3986, baseType: !991, size: 32, align: 32, offset: 320)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1435, file: !57, line: 3999, baseType: !991, size: 32, align: 32, offset: 352)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1435, file: !57, line: 4004, baseType: !991, size: 32, align: 32, offset: 384)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1435, file: !57, line: 4005, baseType: !991, size: 32, align: 32, offset: 416)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1435, file: !57, line: 4010, baseType: !991, size: 32, align: 32, offset: 448)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1435, file: !57, line: 4011, baseType: !991, size: 32, align: 32, offset: 480)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1435, file: !57, line: 4020, baseType: !1004, size: 64, align: 32, offset: 512)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1435, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1435, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1435, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1435, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1435, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1435, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1435, file: !57, line: 4039, baseType: !991, size: 32, align: 32, offset: 768)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1435, file: !57, line: 4046, baseType: !1114, size: 64, align: 64, offset: 832)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1435, file: !57, line: 4050, baseType: !991, size: 32, align: 32, offset: 896)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1435, file: !57, line: 4054, baseType: !991, size: 32, align: 32, offset: 928)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1435, file: !57, line: 4061, baseType: !991, size: 32, align: 32, offset: 960)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1435, file: !57, line: 4065, baseType: !991, size: 32, align: 32, offset: 992)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1435, file: !57, line: 4073, baseType: !991, size: 32, align: 32, offset: 1024)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1435, file: !57, line: 4080, baseType: !991, size: 32, align: 32, offset: 1056)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1435, file: !57, line: 4084, baseType: !991, size: 32, align: 32, offset: 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1400, file: !57, line: 5781, baseType: !1433, size: 64, align: 64, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1400, file: !57, line: 5787, baseType: !1004, size: 64, align: 32, offset: 384)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1400, file: !57, line: 5793, baseType: !1004, size: 64, align: 32, offset: 448)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1394, file: !1147, line: 126, baseType: !991, size: 32, align: 32, offset: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1361, file: !1147, line: 172, baseType: !1210, size: 64, align: 64, offset: 576)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1361, file: !1147, line: 177, baseType: !1160, size: 64, align: 64, offset: 640)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1361, file: !1147, line: 178, baseType: !1170, size: 32, align: 32, offset: 704)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1361, file: !1147, line: 180, baseType: !982, size: 64, align: 64, offset: 768)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1361, file: !1147, line: 185, baseType: !991, size: 32, align: 32, offset: 832)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1361, file: !1147, line: 190, baseType: !982, size: 64, align: 64, offset: 896)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1361, file: !1147, line: 195, baseType: !991, size: 32, align: 32, offset: 960)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1361, file: !1147, line: 200, baseType: !1210, size: 64, align: 64, offset: 1024)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1361, file: !1147, line: 201, baseType: !991, size: 32, align: 32, offset: 1088)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1361, file: !1147, line: 202, baseType: !1344, size: 64, align: 64, offset: 1152)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1361, file: !1147, line: 203, baseType: !991, size: 32, align: 32, offset: 1216)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1361, file: !1147, line: 205, baseType: !991, size: 32, align: 32, offset: 1248)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1361, file: !1147, line: 206, baseType: !991, size: 32, align: 32, offset: 1280)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1361, file: !1147, line: 209, baseType: !1320, size: 64, align: 64, offset: 1344)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1361, file: !1147, line: 212, baseType: !1320, size: 64, align: 64, offset: 1408)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1361, file: !1147, line: 213, baseType: !1344, size: 64, align: 64, offset: 1472)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1361, file: !1147, line: 215, baseType: !991, size: 32, align: 32, offset: 1536)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1361, file: !1147, line: 217, baseType: !991, size: 32, align: 32, offset: 1568)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1361, file: !1147, line: 220, baseType: !991, size: 32, align: 32, offset: 1600)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1082, file: !57, line: 1598, baseType: !982, size: 64, align: 64, offset: 384)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1082, file: !57, line: 1606, baseType: !997, size: 64, align: 64, offset: 448)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1082, file: !57, line: 1614, baseType: !991, size: 32, align: 32, offset: 512)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1082, file: !57, line: 1622, baseType: !991, size: 32, align: 32, offset: 544)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1082, file: !57, line: 1628, baseType: !991, size: 32, align: 32, offset: 576)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !57, line: 1636, baseType: !991, size: 32, align: 32, offset: 608)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1082, file: !57, line: 1643, baseType: !991, size: 32, align: 32, offset: 640)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1082, file: !57, line: 1657, baseType: !1160, size: 64, align: 64, offset: 704)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1082, file: !57, line: 1658, baseType: !991, size: 32, align: 32, offset: 768)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1082, file: !57, line: 1679, baseType: !1004, size: 64, align: 32, offset: 800)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1082, file: !57, line: 1688, baseType: !991, size: 32, align: 32, offset: 864)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1082, file: !57, line: 1712, baseType: !991, size: 32, align: 32, offset: 896)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1082, file: !57, line: 1729, baseType: !991, size: 32, align: 32, offset: 928)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1082, file: !57, line: 1729, baseType: !991, size: 32, align: 32, offset: 960)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1082, file: !57, line: 1744, baseType: !991, size: 32, align: 32, offset: 992)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1082, file: !57, line: 1744, baseType: !991, size: 32, align: 32, offset: 1024)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1082, file: !57, line: 1751, baseType: !991, size: 32, align: 32, offset: 1056)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1082, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1082, file: !57, line: 1791, baseType: !1508, size: 64, align: 64, offset: 1152)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !1081, !1244, !1326, !991, !991, !991}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1082, file: !57, line: 1808, baseType: !1512, size: 64, align: 64, offset: 1216)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64, align: 64)
!1513 = !DISubroutineType(types: !1514)
!1514 = !{!516, !1081, !1103}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1082, file: !57, line: 1816, baseType: !991, size: 32, align: 32, offset: 1280)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1082, file: !57, line: 1825, baseType: !1517, size: 32, align: 32, offset: 1312)
!1517 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1082, file: !57, line: 1830, baseType: !991, size: 32, align: 32, offset: 1344)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1082, file: !57, line: 1838, baseType: !1517, size: 32, align: 32, offset: 1376)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1082, file: !57, line: 1846, baseType: !991, size: 32, align: 32, offset: 1408)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1082, file: !57, line: 1851, baseType: !991, size: 32, align: 32, offset: 1440)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1082, file: !57, line: 1861, baseType: !1517, size: 32, align: 32, offset: 1472)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1082, file: !57, line: 1868, baseType: !1517, size: 32, align: 32, offset: 1504)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1082, file: !57, line: 1875, baseType: !1517, size: 32, align: 32, offset: 1536)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1082, file: !57, line: 1882, baseType: !1517, size: 32, align: 32, offset: 1568)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1082, file: !57, line: 1889, baseType: !1517, size: 32, align: 32, offset: 1600)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1082, file: !57, line: 1896, baseType: !1517, size: 32, align: 32, offset: 1632)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1082, file: !57, line: 1903, baseType: !1517, size: 32, align: 32, offset: 1664)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1082, file: !57, line: 1910, baseType: !991, size: 32, align: 32, offset: 1696)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1082, file: !57, line: 1915, baseType: !991, size: 32, align: 32, offset: 1728)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1082, file: !57, line: 1926, baseType: !1326, size: 64, align: 64, offset: 1792)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1082, file: !57, line: 1935, baseType: !1004, size: 64, align: 32, offset: 1856)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1082, file: !57, line: 1942, baseType: !991, size: 32, align: 32, offset: 1920)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1082, file: !57, line: 1948, baseType: !991, size: 32, align: 32, offset: 1952)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1082, file: !57, line: 1954, baseType: !991, size: 32, align: 32, offset: 1984)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1082, file: !57, line: 1960, baseType: !991, size: 32, align: 32, offset: 2016)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1082, file: !57, line: 1984, baseType: !991, size: 32, align: 32, offset: 2048)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1082, file: !57, line: 1991, baseType: !991, size: 32, align: 32, offset: 2080)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1082, file: !57, line: 1996, baseType: !991, size: 32, align: 32, offset: 2112)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1082, file: !57, line: 2004, baseType: !991, size: 32, align: 32, offset: 2144)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1082, file: !57, line: 2011, baseType: !991, size: 32, align: 32, offset: 2176)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1082, file: !57, line: 2018, baseType: !991, size: 32, align: 32, offset: 2208)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1082, file: !57, line: 2027, baseType: !991, size: 32, align: 32, offset: 2240)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1082, file: !57, line: 2034, baseType: !991, size: 32, align: 32, offset: 2272)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1082, file: !57, line: 2044, baseType: !991, size: 32, align: 32, offset: 2304)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1082, file: !57, line: 2054, baseType: !1547, size: 64, align: 64, offset: 2368)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1082, file: !57, line: 2061, baseType: !1547, size: 64, align: 64, offset: 2432)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1082, file: !57, line: 2066, baseType: !991, size: 32, align: 32, offset: 2496)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1082, file: !57, line: 2070, baseType: !991, size: 32, align: 32, offset: 2528)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1082, file: !57, line: 2078, baseType: !991, size: 32, align: 32, offset: 2560)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1082, file: !57, line: 2085, baseType: !991, size: 32, align: 32, offset: 2592)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1082, file: !57, line: 2092, baseType: !991, size: 32, align: 32, offset: 2624)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1082, file: !57, line: 2099, baseType: !991, size: 32, align: 32, offset: 2656)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1082, file: !57, line: 2106, baseType: !991, size: 32, align: 32, offset: 2688)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1082, file: !57, line: 2113, baseType: !991, size: 32, align: 32, offset: 2720)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1082, file: !57, line: 2120, baseType: !991, size: 32, align: 32, offset: 2752)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1082, file: !57, line: 2125, baseType: !991, size: 32, align: 32, offset: 2784)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1082, file: !57, line: 2133, baseType: !991, size: 32, align: 32, offset: 2816)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1082, file: !57, line: 2140, baseType: !991, size: 32, align: 32, offset: 2848)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1082, file: !57, line: 2145, baseType: !991, size: 32, align: 32, offset: 2880)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1082, file: !57, line: 2153, baseType: !991, size: 32, align: 32, offset: 2912)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1082, file: !57, line: 2158, baseType: !991, size: 32, align: 32, offset: 2944)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1082, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1082, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1082, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1082, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1082, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1082, file: !57, line: 2203, baseType: !991, size: 32, align: 32, offset: 3136)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1082, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1082, file: !57, line: 2212, baseType: !991, size: 32, align: 32, offset: 3200)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1082, file: !57, line: 2213, baseType: !991, size: 32, align: 32, offset: 3232)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1082, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1082, file: !57, line: 2232, baseType: !991, size: 32, align: 32, offset: 3296)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1082, file: !57, line: 2243, baseType: !991, size: 32, align: 32, offset: 3328)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1082, file: !57, line: 2249, baseType: !991, size: 32, align: 32, offset: 3360)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1082, file: !57, line: 2256, baseType: !991, size: 32, align: 32, offset: 3392)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1082, file: !57, line: 2263, baseType: !1114, size: 64, align: 64, offset: 3456)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1082, file: !57, line: 2270, baseType: !1114, size: 64, align: 64, offset: 3520)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1082, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1082, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1082, file: !57, line: 2367, baseType: !1583, size: 64, align: 64, offset: 3648)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!991, !1081, !1344, !991}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1082, file: !57, line: 2383, baseType: !991, size: 32, align: 32, offset: 3712)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1082, file: !57, line: 2386, baseType: !1517, size: 32, align: 32, offset: 3744)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1082, file: !57, line: 2387, baseType: !1517, size: 32, align: 32, offset: 3776)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1082, file: !57, line: 2394, baseType: !991, size: 32, align: 32, offset: 3808)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1082, file: !57, line: 2401, baseType: !991, size: 32, align: 32, offset: 3840)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1082, file: !57, line: 2408, baseType: !991, size: 32, align: 32, offset: 3872)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1082, file: !57, line: 2415, baseType: !991, size: 32, align: 32, offset: 3904)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1082, file: !57, line: 2422, baseType: !991, size: 32, align: 32, offset: 3936)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1082, file: !57, line: 2423, baseType: !1595, size: 64, align: 64, offset: 3968)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1597)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1598)
!1598 = !{!1599, !1600, !1601, !1602}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1597, file: !57, line: 827, baseType: !991, size: 32, align: 32)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1597, file: !57, line: 828, baseType: !991, size: 32, align: 32, offset: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1597, file: !57, line: 829, baseType: !991, size: 32, align: 32, offset: 64)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1597, file: !57, line: 830, baseType: !1517, size: 32, align: 32, offset: 96)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1082, file: !57, line: 2430, baseType: !997, size: 64, align: 64, offset: 4032)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1082, file: !57, line: 2437, baseType: !997, size: 64, align: 64, offset: 4096)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1082, file: !57, line: 2444, baseType: !1517, size: 32, align: 32, offset: 4160)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1082, file: !57, line: 2451, baseType: !1517, size: 32, align: 32, offset: 4192)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1082, file: !57, line: 2458, baseType: !991, size: 32, align: 32, offset: 4224)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1082, file: !57, line: 2469, baseType: !991, size: 32, align: 32, offset: 4256)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1082, file: !57, line: 2475, baseType: !991, size: 32, align: 32, offset: 4288)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1082, file: !57, line: 2481, baseType: !991, size: 32, align: 32, offset: 4320)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1082, file: !57, line: 2485, baseType: !991, size: 32, align: 32, offset: 4352)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1082, file: !57, line: 2489, baseType: !991, size: 32, align: 32, offset: 4384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1082, file: !57, line: 2493, baseType: !991, size: 32, align: 32, offset: 4416)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1082, file: !57, line: 2501, baseType: !991, size: 32, align: 32, offset: 4448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1082, file: !57, line: 2506, baseType: !991, size: 32, align: 32, offset: 4480)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1082, file: !57, line: 2510, baseType: !991, size: 32, align: 32, offset: 4512)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1082, file: !57, line: 2514, baseType: !997, size: 64, align: 64, offset: 4544)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1082, file: !57, line: 2528, baseType: !1619, size: 64, align: 64, offset: 4608)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1081, !982, !991, !991}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1082, file: !57, line: 2534, baseType: !991, size: 32, align: 32, offset: 4672)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1082, file: !57, line: 2545, baseType: !991, size: 32, align: 32, offset: 4704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1082, file: !57, line: 2547, baseType: !991, size: 32, align: 32, offset: 4736)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1082, file: !57, line: 2549, baseType: !991, size: 32, align: 32, offset: 4768)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1082, file: !57, line: 2551, baseType: !991, size: 32, align: 32, offset: 4800)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1082, file: !57, line: 2553, baseType: !991, size: 32, align: 32, offset: 4832)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1082, file: !57, line: 2555, baseType: !991, size: 32, align: 32, offset: 4864)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1082, file: !57, line: 2557, baseType: !991, size: 32, align: 32, offset: 4896)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1082, file: !57, line: 2559, baseType: !991, size: 32, align: 32, offset: 4928)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1082, file: !57, line: 2563, baseType: !991, size: 32, align: 32, offset: 4960)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1082, file: !57, line: 2571, baseType: !1202, size: 64, align: 64, offset: 4992)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1082, file: !57, line: 2579, baseType: !1202, size: 64, align: 64, offset: 5056)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1082, file: !57, line: 2586, baseType: !991, size: 32, align: 32, offset: 5120)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1082, file: !57, line: 2615, baseType: !991, size: 32, align: 32, offset: 5152)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1082, file: !57, line: 2627, baseType: !991, size: 32, align: 32, offset: 5184)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1082, file: !57, line: 2637, baseType: !991, size: 32, align: 32, offset: 5216)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1082, file: !57, line: 2681, baseType: !991, size: 32, align: 32, offset: 5248)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1082, file: !57, line: 2709, baseType: !997, size: 64, align: 64, offset: 5312)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1082, file: !57, line: 2716, baseType: !1641, size: 64, align: 64, offset: 5376)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1651, !1655, !1659, !1660, !1661, !1662, !1667, !1668, !1669, !1670, !1671}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1643, file: !57, line: 3642, baseType: !975, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1643, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1643, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1643, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1643, file: !57, line: 3669, baseType: !991, size: 32, align: 32, offset: 160)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1643, file: !57, line: 3682, baseType: !1341, size: 64, align: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1643, file: !57, line: 3698, baseType: !1652, size: 64, align: 64, offset: 256)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!991, !1134, !1068, !1169}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1643, file: !57, line: 3712, baseType: !1656, size: 64, align: 64, offset: 320)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!991, !1134, !991, !1068, !1169}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1643, file: !57, line: 3726, baseType: !1652, size: 64, align: 64, offset: 384)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1643, file: !57, line: 3737, baseType: !1131, size: 64, align: 64, offset: 448)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1643, file: !57, line: 3746, baseType: !991, size: 32, align: 32, offset: 512)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1643, file: !57, line: 3757, baseType: !1663, size: 64, align: 64, offset: 576)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{null, !1666}
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1643, file: !57, line: 3766, baseType: !1131, size: 64, align: 64, offset: 640)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1643, file: !57, line: 3774, baseType: !1131, size: 64, align: 64, offset: 704)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1643, file: !57, line: 3780, baseType: !991, size: 32, align: 32, offset: 768)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1643, file: !57, line: 3785, baseType: !991, size: 32, align: 32, offset: 800)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1643, file: !57, line: 3795, baseType: !1672, size: 64, align: 64, offset: 832)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!991, !1134, !1215}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1082, file: !57, line: 2728, baseType: !982, size: 64, align: 64, offset: 5440)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1082, file: !57, line: 2735, baseType: !1268, size: 512, align: 64, offset: 5504)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1082, file: !57, line: 2742, baseType: !991, size: 32, align: 32, offset: 6016)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1082, file: !57, line: 2755, baseType: !991, size: 32, align: 32, offset: 6048)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1082, file: !57, line: 2776, baseType: !991, size: 32, align: 32, offset: 6080)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1082, file: !57, line: 2783, baseType: !991, size: 32, align: 32, offset: 6112)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1082, file: !57, line: 2791, baseType: !991, size: 32, align: 32, offset: 6144)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1082, file: !57, line: 2802, baseType: !1344, size: 64, align: 64, offset: 6208)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1082, file: !57, line: 2811, baseType: !991, size: 32, align: 32, offset: 6272)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1082, file: !57, line: 2821, baseType: !991, size: 32, align: 32, offset: 6304)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1082, file: !57, line: 2830, baseType: !991, size: 32, align: 32, offset: 6336)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1082, file: !57, line: 2840, baseType: !991, size: 32, align: 32, offset: 6368)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1082, file: !57, line: 2851, baseType: !1688, size: 64, align: 64, offset: 6400)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!991, !1081, !1691, !982, !1326, !991, !991}
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!991, !1081, !982}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1082, file: !57, line: 2871, baseType: !1695, size: 64, align: 64, offset: 6464)
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DISubroutineType(types: !1697)
!1697 = !{!991, !1081, !1698, !982, !1326, !991}
!1698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1699, size: 64, align: 64)
!1699 = !DISubroutineType(types: !1700)
!1700 = !{!991, !1081, !982, !991, !991}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1082, file: !57, line: 2878, baseType: !991, size: 32, align: 32, offset: 6528)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1082, file: !57, line: 2885, baseType: !991, size: 32, align: 32, offset: 6560)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1082, file: !57, line: 3005, baseType: !991, size: 32, align: 32, offset: 6592)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1082, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1082, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1082, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1082, file: !57, line: 3037, baseType: !1160, size: 64, align: 64, offset: 6720)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1082, file: !57, line: 3038, baseType: !991, size: 32, align: 32, offset: 6784)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1082, file: !57, line: 3050, baseType: !1114, size: 64, align: 64, offset: 6848)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1082, file: !57, line: 3065, baseType: !991, size: 32, align: 32, offset: 6912)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1082, file: !57, line: 3083, baseType: !991, size: 32, align: 32, offset: 6944)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1082, file: !57, line: 3092, baseType: !1004, size: 64, align: 32, offset: 6976)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1082, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1082, file: !57, line: 3106, baseType: !1004, size: 64, align: 32, offset: 7072)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1082, file: !57, line: 3113, baseType: !1716, size: 64, align: 64, offset: 7168)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1718)
!1718 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1719)
!1719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1720)
!1720 = !{!1721, !1722, !1723, !1724, !1725, !1726, !1729}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1719, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1719, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1719, file: !57, line: 720, baseType: !975, size: 64, align: 64, offset: 64)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1719, file: !57, line: 724, baseType: !975, size: 64, align: 64, offset: 128)
