; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sbrdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sbrdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SBRDSPContext = type { void (float*)*, float ([2 x float]*, i32)*, void (float*)*, void (float*)*, void ([2 x float]*, float*)*, void (float*, float*)*, void (float*, float*, float*)*, void ([2 x float]*, [2 x [2 x float]]*)*, void ([2 x float]*, [2 x float]*, float*, float*, float, i32, i32)*, void ([2 x float]*, [40 x [2 x float]]*, float*, i32, i64)*, [4 x void ([2 x float]*, float*, float*, i32, i32, i32)*] }
%union.av_intfloat32 = type { i32 }

@ff_sbr_noise_table = external constant [0 x [2 x float]], align 4

; Function Attrs: cold nounwind optsize uwtable
define void @ff_sbrdsp_init(%struct.SBRDSPContext* %s) #0 !dbg !21 {
entry:
  %s.addr = alloca %struct.SBRDSPContext*, align 8
  store %struct.SBRDSPContext* %s, %struct.SBRDSPContext** %s.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.SBRDSPContext** %s.addr, metadata !93, metadata !94), !dbg !95
  %0 = load %struct.SBRDSPContext*, %struct.SBRDSPContext** %s.addr, align 8, !dbg !96
  %sum64x5 = getelementptr inbounds %struct.SBRDSPContext, %struct.SBRDSPContext* %0, i32 0, i32 0, !dbg !97
  store void (float*)* @sbr_sum64x5_c, void (float*)** %sum64x5, align 8, !dbg !98

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sbrdsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4, !14, !16}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "av_intfloat32", file: !6, line: 27, size: 32, align: 32, elements: !7)
!6 = !DIFile(filename: "./libavutil/intfloat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!7 = !{!8, !12}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !5, file: !6, line: 28, baseType: !9, size: 32, align: 32)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !10, line: 51, baseType: !11)
!10 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!11 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !5, file: !6, line: 29, baseType: !13, size: 32, align: 32)
!13 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64, align: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !17, line: 86, baseType: !13)
!17 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!18 = !{i32 2, !"Dwarf Version", i32 4}
!19 = !{i32 2, !"Debug Info Version", i32 3}
!20 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!21 = distinct !DISubprogram(name: "ff_sbrdsp_init", scope: !22, file: !22, line: 76, type: !23, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!22 = !DIFile(filename: "libavcodec/sbrdsp_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "SBRDSPContext", file: !27, line: 45, baseType: !28)
!27 = !DIFile(filename: "libavcodec/sbrdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SBRDSPContext", file: !27, line: 28, size: 896, align: 64, elements: !29)
!29 = !{!30, !35, !45, !46, !47, !53, !57, !61, !70, !74, !86}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "sum64x5", scope: !28, file: !27, line: 29, baseType: !31, size: 64, align: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DISubroutineType(types: !33)
!33 = !{null, !34}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "sum_square", scope: !28, file: !27, line: 30, baseType: !36, size: 64, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !40, !44}
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_FLOAT", file: !17, line: 90, baseType: !13)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 64, align: 32, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 2)
!44 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "neg_odd_64", scope: !28, file: !27, line: 31, baseType: !31, size: 64, align: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_pre_shuffle", scope: !28, file: !27, line: 32, baseType: !31, size: 64, align: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_post_shuffle", scope: !28, file: !27, line: 33, baseType: !48, size: 64, align: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !40, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_neg", scope: !28, file: !27, line: 34, baseType: !54, size: 64, align: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !34, !51}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "qmf_deint_bfly", scope: !28, file: !27, line: 35, baseType: !58, size: 64, align: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !34, !51, !51}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "autocorrelate", scope: !28, file: !27, line: 36, baseType: !62, size: 64, align: 64, offset: 448)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !65, !67}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 64, align: 32, elements: !42)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !39, size: 128, align: 32, elements: !69)
!69 = !{!43, !43}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "hf_gen", scope: !28, file: !27, line: 37, baseType: !71, size: 64, align: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !40, !65, !51, !51, !16, !44, !44}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "hf_g_filt", scope: !28, file: !27, line: 40, baseType: !75, size: 64, align: 64, offset: 576)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{null, !40, !78, !82, !44, !84}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64, align: 64)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 2560, align: 32, elements: !80)
!80 = !{!81, !43}
!81 = !DISubrange(count: 40)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !10, line: 119, baseType: !85)
!85 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "hf_apply_noise", scope: !28, file: !27, line: 42, baseType: !87, size: 256, align: 64, offset: 640)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 256, align: 64, elements: !91)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64, align: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{null, !40, !82, !82, !44, !44, !44}
!91 = !{!92}
!92 = !DISubrange(count: 4)
!93 = !DILocalVariable(name: "s", arg: 1, scope: !21, file: !22, line: 76, type: !25)
!94 = !DIExpression()
!95 = !DILocation(line: 76, column: 58, scope: !21)
!96 = !DILocation(line: 78, column: 5, scope: !21)
!97 = !DILocation(line: 78, column: 8, scope: !21)
!98 = !DILocation(line: 78, column: 16, scope: !21)
!99 = !DILocation(line: 79, column: 5, scope: !21)
!100 = !DILocation(line: 79, column: 8, scope: !21)
!101 = !DILocation(line: 79, column: 19, scope: !21)
!102 = !DILocation(line: 80, column: 5, scope: !21)
!103 = !DILocation(line: 80, column: 8, scope: !21)
!104 = !DILocation(line: 80, column: 19, scope: !21)
!105 = !DILocation(line: 81, column: 5, scope: !21)
!106 = !DILocation(line: 81, column: 8, scope: !21)
!107 = !DILocation(line: 81, column: 24, scope: !21)
!108 = !DILocation(line: 82, column: 5, scope: !21)
!109 = !DILocation(line: 82, column: 8, scope: !21)
!110 = !DILocation(line: 82, column: 25, scope: !21)
!111 = !DILocation(line: 83, column: 5, scope: !21)
!112 = !DILocation(line: 83, column: 8, scope: !21)
!113 = !DILocation(line: 83, column: 22, scope: !21)
!114 = !DILocation(line: 84, column: 5, scope: !21)
!115 = !DILocation(line: 84, column: 8, scope: !21)
!116 = !DILocation(line: 84, column: 23, scope: !21)
!117 = !DILocation(line: 85, column: 5, scope: !21)
!118 = !DILocation(line: 85, column: 8, scope: !21)
!119 = !DILocation(line: 85, column: 22, scope: !21)
!120 = !DILocation(line: 86, column: 5, scope: !21)
!121 = !DILocation(line: 86, column: 8, scope: !21)
!122 = !DILocation(line: 86, column: 15, scope: !21)
!123 = !DILocation(line: 87, column: 5, scope: !21)
!124 = !DILocation(line: 87, column: 8, scope: !21)
!125 = !DILocation(line: 87, column: 18, scope: !21)
!126 = !DILocation(line: 89, column: 5, scope: !21)
!127 = !DILocation(line: 89, column: 8, scope: !21)
!128 = !DILocation(line: 89, column: 26, scope: !21)
!129 = !DILocation(line: 90, column: 5, scope: !21)
!130 = !DILocation(line: 90, column: 8, scope: !21)
!131 = !DILocation(line: 90, column: 26, scope: !21)
!132 = !DILocation(line: 91, column: 5, scope: !21)
!133 = !DILocation(line: 91, column: 8, scope: !21)
!134 = !DILocation(line: 91, column: 26, scope: !21)
!135 = !DILocation(line: 92, column: 5, scope: !21)
!136 = !DILocation(line: 92, column: 8, scope: !21)
!137 = !DILocation(line: 92, column: 26, scope: !21)
!138 = !DILocation(line: 100, column: 28, scope: !139)
!139 = distinct !DILexicalBlock(scope: !21, file: !22, line: 99, column: 9)
!140 = !DILocation(line: 100, column: 9, scope: !139)
!141 = !DILocation(line: 104, column: 1, scope: !21)
!142 = distinct !DISubprogram(name: "sbr_sum64x5_c", scope: !22, file: !22, line: 23, type: !32, isLocal: true, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!143 = !DILocalVariable(name: "z", arg: 1, scope: !142, file: !22, line: 23, type: !34)
!144 = !DILocation(line: 23, column: 37, scope: !142)
!145 = !DILocalVariable(name: "k", scope: !142, file: !22, line: 25, type: !44)
!146 = !DILocation(line: 25, column: 9, scope: !142)
!147 = !DILocation(line: 26, column: 12, scope: !148)
!148 = distinct !DILexicalBlock(scope: !142, file: !22, line: 26, column: 5)
!149 = !DILocation(line: 26, column: 10, scope: !148)
!150 = !DILocation(line: 26, column: 17, scope: !151)
!151 = !DILexicalBlockFile(scope: !152, file: !22, discriminator: 1)
!152 = distinct !DILexicalBlock(scope: !148, file: !22, line: 26, column: 5)
!153 = !DILocation(line: 26, column: 19, scope: !151)
