; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--concat.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--concat.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.URLProtocol = type { i8*, {}*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.AVDictionary = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, globals: !28)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--concat.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!26 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!27 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!28 = !{!29}
!29 = distinct !DIGlobalVariable(name: "ff_concat_protocol", scope: !0, file: !30, line: 190, type: !31, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_concat_protocol)
!30 = !DIFile(filename: "libavformat/concat.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !33, line: 100, baseType: !34)
!33 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !33, line: 54, size: 1600, align: 64, elements: !35)
!35 = !{!36, !40, !116, !125, !130, !134, !140, !146, !150, !151, !155, !159, !160, !166, !167, !168, !169, !170, !171, !172, !173, !192, !193, !194, !198}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !33, line: 55, baseType: !37, size: 64, align: 64)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !34, file: !33, line: 56, baseType: !41, size: 64, align: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!42 = !DISubroutineType(types: !43)
!43 = !{!26, !44, !37, !26}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !33, line: 52, baseType: !46)
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !33, line: 38, size: 768, align: 64, elements: !47)
!47 = !{!48, !89, !92, !93, !95, !96, !97, !98, !99, !109, !113, !114, !115}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !46, file: !33, line: 39, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !53)
!53 = !{!54, !55, !59, !63, !64, !65, !66, !70, !76, !78, !82}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !52, file: !4, line: 72, baseType: !37, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !52, file: !4, line: 78, baseType: !56, size: 64, align: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!57 = !DISubroutineType(types: !58)
!58 = !{!37, !25}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !52, file: !4, line: 85, baseType: !60, size: 64, align: 64, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !52, file: !4, line: 93, baseType: !26, size: 32, align: 32, offset: 192)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !52, file: !4, line: 99, baseType: !26, size: 32, align: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !52, file: !4, line: 108, baseType: !26, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !52, file: !4, line: 113, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!25, !25, !25}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !52, file: !4, line: 123, baseType: !71, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !52, file: !4, line: 130, baseType: !77, size: 32, align: 32, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !52, file: !4, line: 136, baseType: !79, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!77, !25}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !52, file: !4, line: 142, baseType: !83, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!26, !86, !25, !37, !26}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !46, file: !33, line: 40, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !46, file: !33, line: 41, baseType: !25, size: 64, align: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !46, file: !33, line: 42, baseType: !94, size: 64, align: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !46, file: !33, line: 43, baseType: !26, size: 32, align: 32, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !46, file: !33, line: 44, baseType: !26, size: 32, align: 32, offset: 288)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !46, file: !33, line: 45, baseType: !26, size: 32, align: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !46, file: !33, line: 46, baseType: !26, size: 32, align: 32, offset: 352)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !46, file: !33, line: 47, baseType: !100, size: 128, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !101, line: 61, baseType: !102)
!101 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !101, line: 58, size: 128, align: 64, elements: !103)
!103 = !{!104, !108}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !102, file: !101, line: 59, baseType: !105, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64, align: 64)
!106 = !DISubroutineType(types: !107)
!107 = !{!26, !25}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !102, file: !101, line: 60, baseType: !25, size: 64, align: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !46, file: !33, line: 48, baseType: !110, size: 64, align: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !111, line: 40, baseType: !112)
!111 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!112 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !46, file: !33, line: 49, baseType: !37, size: 64, align: 64, offset: 576)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !46, file: !33, line: 50, baseType: !37, size: 64, align: 64, offset: 640)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !46, file: !33, line: 51, baseType: !26, size: 32, align: 32, offset: 704)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !34, file: !33, line: 62, baseType: !117, size: 64, align: 64, offset: 128)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!26, !44, !37, !26, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !123, line: 86, baseType: !124)
!123 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !123, line: 86, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !34, file: !33, line: 63, baseType: !126, size: 64, align: 64, offset: 192)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DISubroutineType(types: !128)
!128 = !{!26, !44, !129}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !34, file: !33, line: 64, baseType: !131, size: 64, align: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!26, !44}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !34, file: !33, line: 78, baseType: !135, size: 64, align: 64, offset: 320)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = !DISubroutineType(types: !137)
!137 = !{!26, !44, !138, !26}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !34, file: !33, line: 79, baseType: !141, size: 64, align: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64)
!142 = !DISubroutineType(types: !143)
!143 = !{!26, !44, !144, !26}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !34, file: !33, line: 80, baseType: !147, size: 64, align: 64, offset: 448)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64, align: 64)
!148 = !DISubroutineType(types: !149)
!149 = !{!110, !44, !110, !26}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !34, file: !33, line: 81, baseType: !131, size: 64, align: 64, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !34, file: !33, line: 82, baseType: !152, size: 64, align: 64, offset: 576)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = !DISubroutineType(types: !154)
!154 = !{!26, !44, !26}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !34, file: !33, line: 83, baseType: !156, size: 64, align: 64, offset: 640)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DISubroutineType(types: !158)
!158 = !{!110, !44, !26, !110, !26}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !34, file: !33, line: 85, baseType: !131, size: 64, align: 64, offset: 704)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !34, file: !33, line: 86, baseType: !161, size: 64, align: 64, offset: 768)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64, align: 64)
!162 = !DISubroutineType(types: !163)
!163 = !{!26, !44, !164, !165}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !34, file: !33, line: 88, baseType: !131, size: 64, align: 64, offset: 832)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !34, file: !33, line: 89, baseType: !152, size: 64, align: 64, offset: 896)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !34, file: !33, line: 90, baseType: !26, size: 32, align: 32, offset: 960)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !34, file: !33, line: 91, baseType: !49, size: 64, align: 64, offset: 1024)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !34, file: !33, line: 92, baseType: !26, size: 32, align: 32, offset: 1088)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !34, file: !33, line: 93, baseType: !152, size: 64, align: 64, offset: 1152)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !34, file: !33, line: 94, baseType: !131, size: 64, align: 64, offset: 1216)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !34, file: !33, line: 95, baseType: !174, size: 64, align: 64, offset: 1280)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!175 = !DISubroutineType(types: !176)
!176 = !{!26, !44, !177}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !101, line: 101, baseType: !180)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !101, line: 86, size: 576, align: 64, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !180, file: !101, line: 87, baseType: !94, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !180, file: !101, line: 88, baseType: !26, size: 32, align: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !180, file: !101, line: 89, baseType: !26, size: 32, align: 32, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !180, file: !101, line: 91, baseType: !110, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !180, file: !101, line: 92, baseType: !110, size: 64, align: 64, offset: 192)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !180, file: !101, line: 94, baseType: !110, size: 64, align: 64, offset: 256)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !180, file: !101, line: 96, baseType: !110, size: 64, align: 64, offset: 320)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !180, file: !101, line: 98, baseType: !110, size: 64, align: 64, offset: 384)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !180, file: !101, line: 99, baseType: !110, size: 64, align: 64, offset: 448)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !180, file: !101, line: 100, baseType: !110, size: 64, align: 64, offset: 512)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !34, file: !33, line: 96, baseType: !131, size: 64, align: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !34, file: !33, line: 97, baseType: !131, size: 64, align: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !34, file: !33, line: 98, baseType: !195, size: 64, align: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!26, !44, !44}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !34, file: !33, line: 99, baseType: !37, size: 64, align: 64, offset: 1536)
!199 = !{i32 2, !"Dwarf Version", i32 4}
!200 = !{i32 2, !"Debug Info Version", i32 3}
!201 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!202 = distinct !DISubprogram(name: "concat_open", scope: !30, file: !30, line: 58, type: !42, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !203)
!203 = !{}
!204 = !DILocalVariable(name: "h", arg: 1, scope: !202, file: !30, line: 58, type: !44)
!205 = !DIExpression()
!206 = !DILocation(line: 58, column: 58, scope: !202)
!207 = !DILocalVariable(name: "uri", arg: 2, scope: !202, file: !30, line: 58, type: !37)
!208 = !DILocation(line: 58, column: 73, scope: !202)
!209 = !DILocalVariable(name: "flags", arg: 3, scope: !202, file: !30, line: 58, type: !26)
!210 = !DILocation(line: 58, column: 82, scope: !202)
!211 = !DILocalVariable(name: "node_uri", scope: !202, file: !30, line: 60, type: !94)
!212 = !DILocation(line: 60, column: 11, scope: !202)
!213 = !DILocalVariable(name: "err", scope: !202, file: !30, line: 61, type: !26)
!214 = !DILocation(line: 61, column: 9, scope: !202)
!215 = !DILocalVariable(name: "size", scope: !202, file: !30, line: 62, type: !110)
!216 = !DILocation(line: 62, column: 13, scope: !202)
!217 = !DILocalVariable(name: "len", scope: !202, file: !30, line: 63, type: !218)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !219, line: 216, baseType: !220)
!219 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!220 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!221 = !DILocation(line: 63, column: 12, scope: !202)
!222 = !DILocalVariable(name: "i", scope: !202, file: !30, line: 63, type: !218)
!223 = !DILocation(line: 63, column: 17, scope: !202)
!224 = !DILocalVariable(name: "uc", scope: !202, file: !30, line: 64, type: !44)
!225 = !DILocation(line: 64, column: 17, scope: !202)
!226 = !DILocalVariable(name: "data", scope: !202, file: !30, line: 65, type: !227)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_data", file: !30, line: 37, size: 192, align: 64, elements: !229)
!229 = !{!230, !236, !237}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !228, file: !30, line: 38, baseType: !231, size: 64, align: 64)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "concat_nodes", file: !30, line: 32, size: 128, align: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "uc", scope: !232, file: !30, line: 33, baseType: !44, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !232, file: !30, line: 34, baseType: !110, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !228, file: !30, line: 39, baseType: !218, size: 64, align: 64, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !228, file: !30, line: 40, baseType: !218, size: 64, align: 64, offset: 128)
!238 = !DILocation(line: 65, column: 25, scope: !202)
!239 = !DILocation(line: 65, column: 32, scope: !202)
!240 = !DILocation(line: 65, column: 35, scope: !202)
!241 = !DILocalVariable(name: "nodes", scope: !202, file: !30, line: 66, type: !231)
!242 = !DILocation(line: 66, column: 26, scope: !202)
!243 = !DILocation(line: 68, column: 22, scope: !244)
!244 = distinct !DILexicalBlock(scope: !202, file: !30, line: 68, column: 9)
!245 = !DILocation(line: 68, column: 10, scope: !244)
!246 = !DILocation(line: 68, column: 9, scope: !202)
!247 = !DILocation(line: 69, column: 16, scope: !248)
!248 = distinct !DILexicalBlock(scope: !244, file: !30, line: 68, column: 45)
!249 = !DILocation(line: 69, column: 48, scope: !248)
!250 = !DILocation(line: 69, column: 9, scope: !248)
!251 = !DILocation(line: 70, column: 9, scope: !248)
!252 = !DILocation(line: 73, column: 12, scope: !253)
!253 = distinct !DILexicalBlock(scope: !202, file: !30, line: 73, column: 5)
!254 = !DILocation(line: 73, column: 21, scope: !253)
!255 = !DILocation(line: 73, column: 10, scope: !253)
!256 = !DILocation(line: 73, column: 30, scope: !257)
!257 = !DILexicalBlockFile(scope: !258, file: !30, discriminator: 1)
!258 = distinct !DILexicalBlock(scope: !253, file: !30, line: 73, column: 5)
!259 = !DILocation(line: 73, column: 26, scope: !257)
!260 = !DILocation(line: 73, column: 5, scope: !257)
!261 = !DILocation(line: 74, column: 17, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !30, line: 74, column: 13)
!263 = distinct !DILexicalBlock(scope: !258, file: !30, line: 73, column: 39)
!264 = !DILocation(line: 74, column: 13, scope: !262)
!265 = !DILocation(line: 74, column: 23, scope: !262)
!266 = !DILocation(line: 74, column: 20, scope: !262)
!267 = !DILocation(line: 74, column: 13, scope: !263)
!268 = !DILocation(line: 76, column: 17, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !30, line: 76, column: 17)
!270 = distinct !DILexicalBlock(scope: !262, file: !30, line: 74, column: 29)
!271 = !DILocation(line: 76, column: 23, scope: !269)
!272 = !DILocation(line: 76, column: 17, scope: !270)
!273 = !DILocation(line: 77, column: 27, scope: !274)
!274 = distinct !DILexicalBlock(scope: !269, file: !30, line: 76, column: 52)
!275 = !DILocation(line: 77, column: 30, scope: !274)
!276 = !DILocation(line: 77, column: 26, scope: !274)
!277 = !DILocation(line: 77, column: 17, scope: !274)
!278 = !DILocation(line: 78, column: 17, scope: !274)
!279 = !DILocation(line: 80, column: 9, scope: !270)
!280 = !DILocation(line: 81, column: 5, scope: !263)
!281 = !DILocation(line: 73, column: 35, scope: !282)
!282 = !DILexicalBlockFile(scope: !258, file: !30, discriminator: 2)
!283 = !DILocation(line: 73, column: 5, scope: !282)
!284 = distinct !{!284, !285}
!285 = !DILocation(line: 73, column: 5, scope: !202)
!286 = !DILocation(line: 83, column: 52, scope: !287)
!287 = distinct !DILexicalBlock(scope: !202, file: !30, line: 83, column: 9)
!288 = !DILocation(line: 83, column: 50, scope: !287)
!289 = !DILocation(line: 83, column: 19, scope: !287)
!290 = !DILocation(line: 83, column: 17, scope: !287)
!291 = !DILocation(line: 83, column: 9, scope: !202)
!292 = !DILocation(line: 84, column: 9, scope: !287)
!293 = !DILocation(line: 86, column: 23, scope: !287)
!294 = !DILocation(line: 86, column: 9, scope: !287)
!295 = !DILocation(line: 86, column: 15, scope: !287)
!296 = !DILocation(line: 86, column: 21, scope: !287)
!297 = !DILocation(line: 89, column: 11, scope: !298)
!298 = distinct !DILexicalBlock(scope: !202, file: !30, line: 89, column: 9)
!299 = !DILocation(line: 89, column: 10, scope: !298)
!300 = !DILocation(line: 89, column: 9, scope: !202)
!301 = !DILocation(line: 90, column: 13, scope: !298)
!302 = !DILocation(line: 90, column: 9, scope: !298)
!303 = !DILocation(line: 91, column: 12, scope: !304)
