; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--pthread_slice.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--pthread_slice.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!850 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!851 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!890 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!891 = !{!892}
!892 = distinct !DIGlobalVariable(name: "mainfunc", scope: !893, file: !894, line: 133, type: !1625, isLocal: true, isDefinition: true, variable: void (i8*)** @ff_slice_thread_init.mainfunc)
!893 = distinct !DISubprogram(name: "ff_slice_thread_init", scope: !894, file: !894, line: 129, type: !895, isLocal: false, isDefinition: true, scopeLine: 130, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1624)
!894 = !DIFile(filename: "libavcodec/pthread_slice.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!895 = !DISubroutineType(types: !896)
!896 = !{!897, !898}
!897 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !901)
!901 = !{!902, !945, !946, !947, !1222, !1223, !1224, !1225, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1378, !1382, !1383, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1562, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !900, file: !35, line: 1561, baseType: !903, size: 64, align: 64)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !907)
!907 = !{!908, !911, !915, !919, !920, !921, !922, !926, !932, !934, !938}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !906, file: !4, line: 72, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !906, file: !4, line: 78, baseType: !912, size: 64, align: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64, align: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!909, !888}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !906, file: !4, line: 85, baseType: !916, size: 64, align: 64, offset: 128)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !906, file: !4, line: 93, baseType: !897, size: 32, align: 32, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !906, file: !4, line: 99, baseType: !897, size: 32, align: 32, offset: 224)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !906, file: !4, line: 108, baseType: !897, size: 32, align: 32, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !906, file: !4, line: 113, baseType: !923, size: 64, align: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!888, !888, !888}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !906, file: !4, line: 123, baseType: !927, size: 64, align: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DISubroutineType(types: !929)
!929 = !{!930, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !906, file: !4, line: 130, baseType: !933, size: 32, align: 32, offset: 448)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !906, file: !4, line: 136, baseType: !935, size: 64, align: 64, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!933, !888}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !906, file: !4, line: 142, baseType: !939, size: 64, align: 64, offset: 576)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!897, !942, !888, !909, !897}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !900, file: !35, line: 1562, baseType: !897, size: 32, align: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !900, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !900, file: !35, line: 1565, baseType: !948, size: 64, align: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !957, !966, !969, !972, !975, !981, !984, !985, !993, !994, !995, !997, !999, !1005, !1016, !1020, !1021, !1072, !1193, !1197, !1198, !1202, !1206, !1211, !1215, !1216, !1217}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !950, file: !35, line: 3475, baseType: !909, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !950, file: !35, line: 3480, baseType: !909, size: 64, align: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !950, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !950, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !950, file: !35, line: 3487, baseType: !897, size: 32, align: 32, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !950, file: !35, line: 3488, baseType: !958, size: 64, align: 64, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !961, line: 61, baseType: !962)
!961 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !961, line: 58, size: 64, align: 32, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !962, file: !961, line: 59, baseType: !897, size: 32, align: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !962, file: !961, line: 60, baseType: !897, size: 32, align: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !950, file: !35, line: 3489, baseType: !967, size: 64, align: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !950, file: !35, line: 3490, baseType: !970, size: 64, align: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !950, file: !35, line: 3491, baseType: !973, size: 64, align: 64, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !950, file: !35, line: 3492, baseType: !976, size: 64, align: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !979, line: 55, baseType: !980)
!979 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!980 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !950, file: !35, line: 3493, baseType: !982, size: 8, align: 8, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !979, line: 48, baseType: !983)
!983 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !950, file: !35, line: 3494, baseType: !903, size: 64, align: 64, offset: 640)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !950, file: !35, line: 3495, baseType: !986, size: 64, align: 64, offset: 704)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !989, file: !35, line: 3402, baseType: !897, size: 32, align: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !35, line: 3403, baseType: !909, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !950, file: !35, line: 3507, baseType: !909, size: 64, align: 64, offset: 768)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !950, file: !35, line: 3516, baseType: !897, size: 32, align: 32, offset: 832)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !950, file: !35, line: 3517, baseType: !996, size: 64, align: 64, offset: 896)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !950, file: !35, line: 3527, baseType: !998, size: 64, align: 64, offset: 960)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !950, file: !35, line: 3535, baseType: !1000, size: 64, align: 64, offset: 1024)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!897, !898, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !950, file: !35, line: 3541, baseType: !1006, size: 64, align: 64, offset: 1088)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1010, line: 223, size: 128, align: 64, elements: !1011)
!1010 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1011 = !{!1012, !1015}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1009, file: !1010, line: 224, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1009, file: !1010, line: 225, baseType: !1013, size: 64, align: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !950, file: !35, line: 3549, baseType: !1017, size: 64, align: 64, offset: 1152)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{null, !996}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !950, file: !35, line: 3551, baseType: !998, size: 64, align: 64, offset: 1216)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !950, file: !35, line: 3552, baseType: !1022, size: 64, align: 64, offset: 1280)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!897, !898, !1025, !897, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1029)
!1029 = !{!1030, !1033, !1036, !1037, !1038, !1069}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1028, file: !35, line: 3921, baseType: !1031, size: 16, align: 16)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !979, line: 49, baseType: !1032)
!1032 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1028, file: !35, line: 3922, baseType: !1034, size: 32, align: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !979, line: 51, baseType: !1035)
!1035 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1028, file: !35, line: 3923, baseType: !1034, size: 32, align: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1028, file: !35, line: 3924, baseType: !1035, size: 32, align: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1028, file: !35, line: 3925, baseType: !1039, size: 64, align: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1043)
!1043 = !{!1044, !1045, !1046, !1047, !1048, !1049, !1059, !1063, !1065, !1066, !1067, !1068}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1042, file: !35, line: 3886, baseType: !897, size: 32, align: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1042, file: !35, line: 3887, baseType: !897, size: 32, align: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1042, file: !35, line: 3888, baseType: !897, size: 32, align: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1042, file: !35, line: 3889, baseType: !897, size: 32, align: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1042, file: !35, line: 3890, baseType: !897, size: 32, align: 32, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1042, file: !35, line: 3897, baseType: !1050, size: 768, align: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1052)
!1052 = !{!1053, !1057}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1051, file: !35, line: 3855, baseType: !1054, size: 512, align: 64)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 512, align: 64, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 8)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1051, file: !35, line: 3857, baseType: !1058, size: 256, align: 32, offset: 512)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 256, align: 32, elements: !1055)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1042, file: !35, line: 3903, baseType: !1060, size: 256, align: 64, offset: 960)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 256, align: 64, elements: !1061)
!1061 = !{!1062}
!1062 = !DISubrange(count: 4)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1042, file: !35, line: 3904, baseType: !1064, size: 128, align: 32, offset: 1216)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 128, align: 32, elements: !1061)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1042, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1042, file: !35, line: 3908, baseType: !889, size: 64, align: 64, offset: 1408)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1042, file: !35, line: 3915, baseType: !889, size: 64, align: 64, offset: 1472)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1042, file: !35, line: 3917, baseType: !897, size: 32, align: 32, offset: 1536)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1028, file: !35, line: 3926, baseType: !1070, size: 64, align: 64, offset: 192)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !979, line: 40, baseType: !1071)
!1071 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !950, file: !35, line: 3564, baseType: !1073, size: 64, align: 64, offset: 1344)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!897, !898, !1076, !1110, !1192}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1079)
!1079 = !{!1080, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1106, !1107, !1108, !1109}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1078, file: !35, line: 1451, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1083, line: 94, baseType: !1084)
!1083 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1083, line: 81, size: 192, align: 64, elements: !1085)
!1085 = !{!1086, !1090, !1091}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1084, file: !1083, line: 82, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1083, line: 73, baseType: !1089)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1083, line: 73, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1084, file: !1083, line: 89, baseType: !1025, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1084, file: !1083, line: 93, baseType: !897, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1078, file: !35, line: 1461, baseType: !1070, size: 64, align: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1078, file: !35, line: 1467, baseType: !1070, size: 64, align: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1078, file: !35, line: 1468, baseType: !1025, size: 64, align: 64, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1078, file: !35, line: 1469, baseType: !897, size: 32, align: 32, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1078, file: !35, line: 1470, baseType: !897, size: 32, align: 32, offset: 288)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1078, file: !35, line: 1474, baseType: !897, size: 32, align: 32, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1078, file: !35, line: 1479, baseType: !1099, size: 64, align: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1101, file: !35, line: 1412, baseType: !1025, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1101, file: !35, line: 1413, baseType: !897, size: 32, align: 32, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1101, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1078, file: !35, line: 1480, baseType: !897, size: 32, align: 32, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1078, file: !35, line: 1486, baseType: !1070, size: 64, align: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1078, file: !35, line: 1488, baseType: !1070, size: 64, align: 64, offset: 576)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1078, file: !35, line: 1497, baseType: !1070, size: 64, align: 64, offset: 640)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1144, !1146, !1147, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1189, !1190, !1191}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !758, line: 282, baseType: !1054, size: 512, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1113, file: !758, line: 299, baseType: !1058, size: 256, align: 32, offset: 512)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1113, file: !758, line: 315, baseType: !1118, size: 64, align: 64, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1113, file: !758, line: 326, baseType: !897, size: 32, align: 32, offset: 832)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1113, file: !758, line: 326, baseType: !897, size: 32, align: 32, offset: 864)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1113, file: !758, line: 334, baseType: !897, size: 32, align: 32, offset: 896)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1113, file: !758, line: 341, baseType: !897, size: 32, align: 32, offset: 928)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1113, file: !758, line: 346, baseType: !897, size: 32, align: 32, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1113, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1113, file: !758, line: 356, baseType: !960, size: 64, align: 32, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1113, file: !758, line: 361, baseType: !1070, size: 64, align: 64, offset: 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1113, file: !758, line: 369, baseType: !1070, size: 64, align: 64, offset: 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1113, file: !758, line: 377, baseType: !1070, size: 64, align: 64, offset: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1113, file: !758, line: 382, baseType: !897, size: 32, align: 32, offset: 1280)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1113, file: !758, line: 386, baseType: !897, size: 32, align: 32, offset: 1312)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1113, file: !758, line: 391, baseType: !897, size: 32, align: 32, offset: 1344)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1113, file: !758, line: 396, baseType: !888, size: 64, align: 64, offset: 1408)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1113, file: !758, line: 403, baseType: !1134, size: 512, align: 64, offset: 1472)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 512, align: 64, elements: !1055)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1113, file: !758, line: 410, baseType: !897, size: 32, align: 32, offset: 1984)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1113, file: !758, line: 415, baseType: !897, size: 32, align: 32, offset: 2016)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1113, file: !758, line: 420, baseType: !897, size: 32, align: 32, offset: 2048)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1113, file: !758, line: 425, baseType: !897, size: 32, align: 32, offset: 2080)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1113, file: !758, line: 435, baseType: !1070, size: 64, align: 64, offset: 2112)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1113, file: !758, line: 440, baseType: !897, size: 32, align: 32, offset: 2176)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1113, file: !758, line: 445, baseType: !978, size: 64, align: 64, offset: 2240)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1113, file: !758, line: 459, baseType: !1143, size: 512, align: 64, offset: 2304)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1081, size: 512, align: 64, elements: !1055)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1113, file: !758, line: 473, baseType: !1145, size: 64, align: 64, offset: 2816)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1113, file: !758, line: 477, baseType: !897, size: 32, align: 32, offset: 2880)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1113, file: !758, line: 479, baseType: !1148, size: 64, align: 64, offset: 2944)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1161}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1151, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !758, line: 203, baseType: !1025, size: 64, align: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1151, file: !758, line: 204, baseType: !897, size: 32, align: 32, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1151, file: !758, line: 205, baseType: !1157, size: 64, align: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1159, line: 86, baseType: !1160)
!1159 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1159, line: 86, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1151, file: !758, line: 206, baseType: !1081, size: 64, align: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1113, file: !758, line: 480, baseType: !897, size: 32, align: 32, offset: 3008)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !758, line: 505, baseType: !897, size: 32, align: 32, offset: 3040)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1113, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1113, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1113, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1113, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1113, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1113, file: !758, line: 532, baseType: !1070, size: 64, align: 64, offset: 3264)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1113, file: !758, line: 539, baseType: !1070, size: 64, align: 64, offset: 3328)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1113, file: !758, line: 547, baseType: !1070, size: 64, align: 64, offset: 3392)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1113, file: !758, line: 554, baseType: !1157, size: 64, align: 64, offset: 3456)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1113, file: !758, line: 563, baseType: !897, size: 32, align: 32, offset: 3520)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1113, file: !758, line: 572, baseType: !897, size: 32, align: 32, offset: 3552)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1113, file: !758, line: 581, baseType: !897, size: 32, align: 32, offset: 3584)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1113, file: !758, line: 588, baseType: !1177, size: 64, align: 64, offset: 3648)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !979, line: 36, baseType: !1179)
!1179 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1113, file: !758, line: 593, baseType: !897, size: 32, align: 32, offset: 3712)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1113, file: !758, line: 596, baseType: !897, size: 32, align: 32, offset: 3744)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1113, file: !758, line: 599, baseType: !1081, size: 64, align: 64, offset: 3776)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1113, file: !758, line: 605, baseType: !1081, size: 64, align: 64, offset: 3840)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1113, file: !758, line: 616, baseType: !1081, size: 64, align: 64, offset: 3904)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1113, file: !758, line: 626, baseType: !1186, size: 64, align: 64, offset: 3968)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1187, line: 216, baseType: !980)
!1187 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1113, file: !758, line: 627, baseType: !1186, size: 64, align: 64, offset: 4032)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1113, file: !758, line: 628, baseType: !1186, size: 64, align: 64, offset: 4096)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1113, file: !758, line: 629, baseType: !1186, size: 64, align: 64, offset: 4160)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1113, file: !758, line: 645, baseType: !1081, size: 64, align: 64, offset: 4224)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !950, file: !35, line: 3566, baseType: !1194, size: 64, align: 64, offset: 1408)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!897, !898, !888, !1192, !1076}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !950, file: !35, line: 3567, baseType: !998, size: 64, align: 64, offset: 1472)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !950, file: !35, line: 3576, baseType: !1199, size: 64, align: 64, offset: 1536)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!897, !898, !1110}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !950, file: !35, line: 3577, baseType: !1203, size: 64, align: 64, offset: 1600)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!897, !898, !1076}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !950, file: !35, line: 3584, baseType: !1207, size: 64, align: 64, offset: 1664)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DISubroutineType(types: !1209)
!1209 = !{!897, !898, !1210}
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !950, file: !35, line: 3589, baseType: !1212, size: 64, align: 64, offset: 1728)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{null, !898}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !950, file: !35, line: 3594, baseType: !897, size: 32, align: 32, offset: 1792)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !950, file: !35, line: 3600, baseType: !909, size: 64, align: 64, offset: 1856)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !950, file: !35, line: 3609, baseType: !1218, size: 64, align: 64, offset: 1920)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1221)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !900, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !900, file: !35, line: 1581, baseType: !1035, size: 32, align: 32, offset: 224)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !900, file: !35, line: 1583, baseType: !888, size: 64, align: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !900, file: !35, line: 1591, baseType: !1226, size: 64, align: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1010, line: 129, size: 1664, align: 64, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1251, !1252, !1258, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1227, file: !1010, line: 136, baseType: !897, size: 32, align: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1227, file: !1010, line: 151, baseType: !897, size: 32, align: 32, offset: 32)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1227, file: !1010, line: 157, baseType: !897, size: 32, align: 32, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1227, file: !1010, line: 159, baseType: !1210, size: 64, align: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1227, file: !1010, line: 161, baseType: !1234, size: 64, align: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1010, line: 117, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1010, line: 100, size: 832, align: 64, elements: !1237)
!1237 = !{!1238, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1236, file: !1010, line: 105, baseType: !1239, size: 256, align: 64)
!1239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1240, size: 256, align: 64, elements: !1061)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1083, line: 238, baseType: !1242)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1083, line: 238, flags: DIFlagFwdDecl)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1236, file: !1010, line: 110, baseType: !897, size: 32, align: 32, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1236, file: !1010, line: 111, baseType: !897, size: 32, align: 32, offset: 288)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1236, file: !1010, line: 111, baseType: !897, size: 32, align: 32, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1236, file: !1010, line: 112, baseType: !1058, size: 256, align: 32, offset: 352)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1236, file: !1010, line: 113, baseType: !1064, size: 128, align: 32, offset: 608)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1236, file: !1010, line: 114, baseType: !897, size: 32, align: 32, offset: 736)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1236, file: !1010, line: 115, baseType: !897, size: 32, align: 32, offset: 768)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1236, file: !1010, line: 116, baseType: !897, size: 32, align: 32, offset: 800)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1227, file: !1010, line: 163, baseType: !888, size: 64, align: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1227, file: !1010, line: 165, baseType: !1253, size: 128, align: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1010, line: 122, baseType: !1254)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1010, line: 119, size: 128, align: 64, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1254, file: !1010, line: 120, baseType: !1076, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1254, file: !1010, line: 121, baseType: !1210, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1227, file: !1010, line: 166, baseType: !1259, size: 128, align: 64, offset: 448)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1010, line: 127, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1010, line: 124, size: 128, align: 64, elements: !1261)
!1261 = !{!1262, !1335}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1260, file: !1010, line: 125, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1267)
!1267 = !{!1268, !1269, !1293, !1297, !1298, !1332, !1333, !1334}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1266, file: !35, line: 5751, baseType: !903, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1266, file: !35, line: 5756, baseType: !1270, size: 64, align: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1273)
!1273 = !{!1274, !1275, !1278, !1279, !1280, !1284, !1288, !1292}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1272, file: !35, line: 5797, baseType: !909, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1272, file: !35, line: 5804, baseType: !1276, size: 64, align: 64, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1272, file: !35, line: 5815, baseType: !903, size: 64, align: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1272, file: !35, line: 5825, baseType: !897, size: 32, align: 32, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1272, file: !35, line: 5826, baseType: !1281, size: 64, align: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{!897, !1264}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1272, file: !35, line: 5827, baseType: !1285, size: 64, align: 64, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!897, !1264, !1076}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1272, file: !35, line: 5828, baseType: !1289, size: 64, align: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{null, !1264}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1272, file: !35, line: 5829, baseType: !1289, size: 64, align: 64, offset: 448)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1266, file: !35, line: 5762, baseType: !1294, size: 64, align: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1296)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1266, file: !35, line: 5768, baseType: !888, size: 64, align: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1266, file: !35, line: 5775, baseType: !1299, size: 64, align: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1301, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1301, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1301, file: !35, line: 3948, baseType: !1034, size: 32, align: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1301, file: !35, line: 3958, baseType: !1025, size: 64, align: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1301, file: !35, line: 3962, baseType: !897, size: 32, align: 32, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1301, file: !35, line: 3968, baseType: !897, size: 32, align: 32, offset: 224)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1301, file: !35, line: 3973, baseType: !1070, size: 64, align: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1301, file: !35, line: 3986, baseType: !897, size: 32, align: 32, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1301, file: !35, line: 3999, baseType: !897, size: 32, align: 32, offset: 352)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1301, file: !35, line: 4004, baseType: !897, size: 32, align: 32, offset: 384)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1301, file: !35, line: 4005, baseType: !897, size: 32, align: 32, offset: 416)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1301, file: !35, line: 4010, baseType: !897, size: 32, align: 32, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1301, file: !35, line: 4011, baseType: !897, size: 32, align: 32, offset: 480)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1301, file: !35, line: 4020, baseType: !960, size: 64, align: 32, offset: 512)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1301, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1301, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1301, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1301, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1301, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1301, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1301, file: !35, line: 4039, baseType: !897, size: 32, align: 32, offset: 768)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1301, file: !35, line: 4046, baseType: !978, size: 64, align: 64, offset: 832)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1301, file: !35, line: 4050, baseType: !897, size: 32, align: 32, offset: 896)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1301, file: !35, line: 4054, baseType: !897, size: 32, align: 32, offset: 928)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1301, file: !35, line: 4061, baseType: !897, size: 32, align: 32, offset: 960)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1301, file: !35, line: 4065, baseType: !897, size: 32, align: 32, offset: 992)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1301, file: !35, line: 4073, baseType: !897, size: 32, align: 32, offset: 1024)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1301, file: !35, line: 4080, baseType: !897, size: 32, align: 32, offset: 1056)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1301, file: !35, line: 4084, baseType: !897, size: 32, align: 32, offset: 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1266, file: !35, line: 5781, baseType: !1299, size: 64, align: 64, offset: 320)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1266, file: !35, line: 5787, baseType: !960, size: 64, align: 32, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1266, file: !35, line: 5793, baseType: !960, size: 64, align: 32, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1260, file: !1010, line: 126, baseType: !897, size: 32, align: 32, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1227, file: !1010, line: 172, baseType: !1076, size: 64, align: 64, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1227, file: !1010, line: 177, baseType: !1025, size: 64, align: 64, offset: 640)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1227, file: !1010, line: 178, baseType: !1035, size: 32, align: 32, offset: 704)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1227, file: !1010, line: 180, baseType: !888, size: 64, align: 64, offset: 768)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1227, file: !1010, line: 185, baseType: !897, size: 32, align: 32, offset: 832)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1227, file: !1010, line: 190, baseType: !888, size: 64, align: 64, offset: 896)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1227, file: !1010, line: 195, baseType: !897, size: 32, align: 32, offset: 960)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1227, file: !1010, line: 200, baseType: !1076, size: 64, align: 64, offset: 1024)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1227, file: !1010, line: 201, baseType: !897, size: 32, align: 32, offset: 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1227, file: !1010, line: 202, baseType: !1210, size: 64, align: 64, offset: 1152)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1227, file: !1010, line: 203, baseType: !897, size: 32, align: 32, offset: 1216)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1227, file: !1010, line: 205, baseType: !897, size: 32, align: 32, offset: 1248)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1227, file: !1010, line: 206, baseType: !897, size: 32, align: 32, offset: 1280)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1227, file: !1010, line: 209, baseType: !1186, size: 64, align: 64, offset: 1344)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1227, file: !1010, line: 212, baseType: !1186, size: 64, align: 64, offset: 1408)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1227, file: !1010, line: 213, baseType: !1210, size: 64, align: 64, offset: 1472)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1227, file: !1010, line: 215, baseType: !897, size: 32, align: 32, offset: 1536)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1227, file: !1010, line: 217, baseType: !897, size: 32, align: 32, offset: 1568)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1227, file: !1010, line: 220, baseType: !897, size: 32, align: 32, offset: 1600)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !900, file: !35, line: 1598, baseType: !888, size: 64, align: 64, offset: 384)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !900, file: !35, line: 1606, baseType: !1070, size: 64, align: 64, offset: 448)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !900, file: !35, line: 1614, baseType: !897, size: 32, align: 32, offset: 512)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !900, file: !35, line: 1622, baseType: !897, size: 32, align: 32, offset: 544)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !900, file: !35, line: 1628, baseType: !897, size: 32, align: 32, offset: 576)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !900, file: !35, line: 1636, baseType: !897, size: 32, align: 32, offset: 608)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !900, file: !35, line: 1643, baseType: !897, size: 32, align: 32, offset: 640)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !900, file: !35, line: 1657, baseType: !1025, size: 64, align: 64, offset: 704)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !900, file: !35, line: 1658, baseType: !897, size: 32, align: 32, offset: 768)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !900, file: !35, line: 1679, baseType: !960, size: 64, align: 32, offset: 800)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !900, file: !35, line: 1688, baseType: !897, size: 32, align: 32, offset: 864)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !900, file: !35, line: 1712, baseType: !897, size: 32, align: 32, offset: 896)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !900, file: !35, line: 1729, baseType: !897, size: 32, align: 32, offset: 928)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !900, file: !35, line: 1729, baseType: !897, size: 32, align: 32, offset: 960)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !900, file: !35, line: 1744, baseType: !897, size: 32, align: 32, offset: 992)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !900, file: !35, line: 1744, baseType: !897, size: 32, align: 32, offset: 1024)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !900, file: !35, line: 1751, baseType: !897, size: 32, align: 32, offset: 1056)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !900, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !900, file: !35, line: 1791, baseType: !1374, size: 64, align: 64, offset: 1152)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{null, !1377, !1110, !1192, !897, !897, !897}
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !900, file: !35, line: 1808, baseType: !1379, size: 64, align: 64, offset: 1216)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!494, !1377, !967}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !900, file: !35, line: 1816, baseType: !897, size: 32, align: 32, offset: 1280)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !900, file: !35, line: 1825, baseType: !1384, size: 32, align: 32, offset: 1312)
!1384 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !900, file: !35, line: 1830, baseType: !897, size: 32, align: 32, offset: 1344)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !900, file: !35, line: 1838, baseType: !1384, size: 32, align: 32, offset: 1376)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !900, file: !35, line: 1846, baseType: !897, size: 32, align: 32, offset: 1408)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !900, file: !35, line: 1851, baseType: !897, size: 32, align: 32, offset: 1440)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !900, file: !35, line: 1861, baseType: !1384, size: 32, align: 32, offset: 1472)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !900, file: !35, line: 1868, baseType: !1384, size: 32, align: 32, offset: 1504)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !900, file: !35, line: 1875, baseType: !1384, size: 32, align: 32, offset: 1536)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !900, file: !35, line: 1882, baseType: !1384, size: 32, align: 32, offset: 1568)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !900, file: !35, line: 1889, baseType: !1384, size: 32, align: 32, offset: 1600)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !900, file: !35, line: 1896, baseType: !1384, size: 32, align: 32, offset: 1632)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !900, file: !35, line: 1903, baseType: !1384, size: 32, align: 32, offset: 1664)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !900, file: !35, line: 1910, baseType: !897, size: 32, align: 32, offset: 1696)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !900, file: !35, line: 1915, baseType: !897, size: 32, align: 32, offset: 1728)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !900, file: !35, line: 1926, baseType: !1192, size: 64, align: 64, offset: 1792)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !900, file: !35, line: 1935, baseType: !960, size: 64, align: 32, offset: 1856)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !900, file: !35, line: 1942, baseType: !897, size: 32, align: 32, offset: 1920)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !900, file: !35, line: 1948, baseType: !897, size: 32, align: 32, offset: 1952)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !900, file: !35, line: 1954, baseType: !897, size: 32, align: 32, offset: 1984)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !900, file: !35, line: 1960, baseType: !897, size: 32, align: 32, offset: 2016)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !900, file: !35, line: 1984, baseType: !897, size: 32, align: 32, offset: 2048)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !900, file: !35, line: 1991, baseType: !897, size: 32, align: 32, offset: 2080)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !900, file: !35, line: 1996, baseType: !897, size: 32, align: 32, offset: 2112)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !900, file: !35, line: 2004, baseType: !897, size: 32, align: 32, offset: 2144)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !900, file: !35, line: 2011, baseType: !897, size: 32, align: 32, offset: 2176)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !900, file: !35, line: 2018, baseType: !897, size: 32, align: 32, offset: 2208)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !900, file: !35, line: 2027, baseType: !897, size: 32, align: 32, offset: 2240)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !900, file: !35, line: 2034, baseType: !897, size: 32, align: 32, offset: 2272)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !900, file: !35, line: 2044, baseType: !897, size: 32, align: 32, offset: 2304)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !900, file: !35, line: 2054, baseType: !1414, size: 64, align: 64, offset: 2368)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !900, file: !35, line: 2061, baseType: !1414, size: 64, align: 64, offset: 2432)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !900, file: !35, line: 2066, baseType: !897, size: 32, align: 32, offset: 2496)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !900, file: !35, line: 2070, baseType: !897, size: 32, align: 32, offset: 2528)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !900, file: !35, line: 2078, baseType: !897, size: 32, align: 32, offset: 2560)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !900, file: !35, line: 2085, baseType: !897, size: 32, align: 32, offset: 2592)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !900, file: !35, line: 2092, baseType: !897, size: 32, align: 32, offset: 2624)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !900, file: !35, line: 2099, baseType: !897, size: 32, align: 32, offset: 2656)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !900, file: !35, line: 2106, baseType: !897, size: 32, align: 32, offset: 2688)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !900, file: !35, line: 2113, baseType: !897, size: 32, align: 32, offset: 2720)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !900, file: !35, line: 2120, baseType: !897, size: 32, align: 32, offset: 2752)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !900, file: !35, line: 2125, baseType: !897, size: 32, align: 32, offset: 2784)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !900, file: !35, line: 2133, baseType: !897, size: 32, align: 32, offset: 2816)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !900, file: !35, line: 2140, baseType: !897, size: 32, align: 32, offset: 2848)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !900, file: !35, line: 2145, baseType: !897, size: 32, align: 32, offset: 2880)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !900, file: !35, line: 2153, baseType: !897, size: 32, align: 32, offset: 2912)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !900, file: !35, line: 2158, baseType: !897, size: 32, align: 32, offset: 2944)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !900, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !900, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !900, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !900, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !900, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !900, file: !35, line: 2203, baseType: !897, size: 32, align: 32, offset: 3136)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !900, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !900, file: !35, line: 2212, baseType: !897, size: 32, align: 32, offset: 3200)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !900, file: !35, line: 2213, baseType: !897, size: 32, align: 32, offset: 3232)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !900, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !900, file: !35, line: 2232, baseType: !897, size: 32, align: 32, offset: 3296)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !900, file: !35, line: 2243, baseType: !897, size: 32, align: 32, offset: 3328)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !900, file: !35, line: 2249, baseType: !897, size: 32, align: 32, offset: 3360)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !900, file: !35, line: 2256, baseType: !897, size: 32, align: 32, offset: 3392)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !900, file: !35, line: 2263, baseType: !978, size: 64, align: 64, offset: 3456)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !900, file: !35, line: 2270, baseType: !978, size: 64, align: 64, offset: 3520)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !900, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !900, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !900, file: !35, line: 2367, baseType: !1450, size: 64, align: 64, offset: 3648)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!897, !1377, !1210, !897}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !900, file: !35, line: 2383, baseType: !897, size: 32, align: 32, offset: 3712)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !900, file: !35, line: 2386, baseType: !1384, size: 32, align: 32, offset: 3744)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !900, file: !35, line: 2387, baseType: !1384, size: 32, align: 32, offset: 3776)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !900, file: !35, line: 2394, baseType: !897, size: 32, align: 32, offset: 3808)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !900, file: !35, line: 2401, baseType: !897, size: 32, align: 32, offset: 3840)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !900, file: !35, line: 2408, baseType: !897, size: 32, align: 32, offset: 3872)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !900, file: !35, line: 2415, baseType: !897, size: 32, align: 32, offset: 3904)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !900, file: !35, line: 2422, baseType: !897, size: 32, align: 32, offset: 3936)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !900, file: !35, line: 2423, baseType: !1462, size: 64, align: 64, offset: 3968)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1464)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1465)
!1465 = !{!1466, !1467, !1468, !1469}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1464, file: !35, line: 827, baseType: !897, size: 32, align: 32)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1464, file: !35, line: 828, baseType: !897, size: 32, align: 32, offset: 32)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1464, file: !35, line: 829, baseType: !897, size: 32, align: 32, offset: 64)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1464, file: !35, line: 830, baseType: !1384, size: 32, align: 32, offset: 96)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !900, file: !35, line: 2430, baseType: !1070, size: 64, align: 64, offset: 4032)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !900, file: !35, line: 2437, baseType: !1070, size: 64, align: 64, offset: 4096)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !900, file: !35, line: 2444, baseType: !1384, size: 32, align: 32, offset: 4160)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !900, file: !35, line: 2451, baseType: !1384, size: 32, align: 32, offset: 4192)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !900, file: !35, line: 2458, baseType: !897, size: 32, align: 32, offset: 4224)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !900, file: !35, line: 2469, baseType: !897, size: 32, align: 32, offset: 4256)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !900, file: !35, line: 2475, baseType: !897, size: 32, align: 32, offset: 4288)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !900, file: !35, line: 2481, baseType: !897, size: 32, align: 32, offset: 4320)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !900, file: !35, line: 2485, baseType: !897, size: 32, align: 32, offset: 4352)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !900, file: !35, line: 2489, baseType: !897, size: 32, align: 32, offset: 4384)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !900, file: !35, line: 2493, baseType: !897, size: 32, align: 32, offset: 4416)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !900, file: !35, line: 2501, baseType: !897, size: 32, align: 32, offset: 4448)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !900, file: !35, line: 2506, baseType: !897, size: 32, align: 32, offset: 4480)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !900, file: !35, line: 2510, baseType: !897, size: 32, align: 32, offset: 4512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !900, file: !35, line: 2514, baseType: !1070, size: 64, align: 64, offset: 4544)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !900, file: !35, line: 2528, baseType: !1486, size: 64, align: 64, offset: 4608)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{null, !1377, !888, !897, !897}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !900, file: !35, line: 2534, baseType: !897, size: 32, align: 32, offset: 4672)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !900, file: !35, line: 2545, baseType: !897, size: 32, align: 32, offset: 4704)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !900, file: !35, line: 2547, baseType: !897, size: 32, align: 32, offset: 4736)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !900, file: !35, line: 2549, baseType: !897, size: 32, align: 32, offset: 4768)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !900, file: !35, line: 2551, baseType: !897, size: 32, align: 32, offset: 4800)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !900, file: !35, line: 2553, baseType: !897, size: 32, align: 32, offset: 4832)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !900, file: !35, line: 2555, baseType: !897, size: 32, align: 32, offset: 4864)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !900, file: !35, line: 2557, baseType: !897, size: 32, align: 32, offset: 4896)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !900, file: !35, line: 2559, baseType: !897, size: 32, align: 32, offset: 4928)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !900, file: !35, line: 2563, baseType: !897, size: 32, align: 32, offset: 4960)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !900, file: !35, line: 2571, baseType: !889, size: 64, align: 64, offset: 4992)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !900, file: !35, line: 2579, baseType: !889, size: 64, align: 64, offset: 5056)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !900, file: !35, line: 2586, baseType: !897, size: 32, align: 32, offset: 5120)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !900, file: !35, line: 2615, baseType: !897, size: 32, align: 32, offset: 5152)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !900, file: !35, line: 2627, baseType: !897, size: 32, align: 32, offset: 5184)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !900, file: !35, line: 2637, baseType: !897, size: 32, align: 32, offset: 5216)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !900, file: !35, line: 2681, baseType: !897, size: 32, align: 32, offset: 5248)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !900, file: !35, line: 2709, baseType: !1070, size: 64, align: 64, offset: 5312)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !900, file: !35, line: 2716, baseType: !1508, size: 64, align: 64, offset: 5376)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1511)
!1511 = !{!1512, !1513, !1514, !1515, !1516, !1517, !1518, !1522, !1526, !1527, !1528, !1529, !1535, !1536, !1537, !1538, !1539}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1510, file: !35, line: 3642, baseType: !909, size: 64, align: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1510, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1510, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1510, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1510, file: !35, line: 3669, baseType: !897, size: 32, align: 32, offset: 160)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1510, file: !35, line: 3682, baseType: !1207, size: 64, align: 64, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1510, file: !35, line: 3698, baseType: !1519, size: 64, align: 64, offset: 256)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!897, !898, !1013, !1034}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1510, file: !35, line: 3712, baseType: !1523, size: 64, align: 64, offset: 320)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!897, !898, !897, !1013, !1034}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1510, file: !35, line: 3726, baseType: !1519, size: 64, align: 64, offset: 384)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1510, file: !35, line: 3737, baseType: !998, size: 64, align: 64, offset: 448)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1510, file: !35, line: 3746, baseType: !897, size: 32, align: 32, offset: 512)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1510, file: !35, line: 3757, baseType: !1530, size: 64, align: 64, offset: 576)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{null, !1533}
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1510, file: !35, line: 3766, baseType: !998, size: 64, align: 64, offset: 640)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1510, file: !35, line: 3774, baseType: !998, size: 64, align: 64, offset: 704)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1510, file: !35, line: 3780, baseType: !897, size: 32, align: 32, offset: 768)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1510, file: !35, line: 3785, baseType: !897, size: 32, align: 32, offset: 800)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1510, file: !35, line: 3795, baseType: !1540, size: 64, align: 64, offset: 832)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!897, !898, !1081}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !900, file: !35, line: 2728, baseType: !888, size: 64, align: 64, offset: 5440)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !900, file: !35, line: 2735, baseType: !1134, size: 512, align: 64, offset: 5504)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !900, file: !35, line: 2742, baseType: !897, size: 32, align: 32, offset: 6016)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !900, file: !35, line: 2755, baseType: !897, size: 32, align: 32, offset: 6048)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !900, file: !35, line: 2776, baseType: !897, size: 32, align: 32, offset: 6080)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !900, file: !35, line: 2783, baseType: !897, size: 32, align: 32, offset: 6112)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !900, file: !35, line: 2791, baseType: !897, size: 32, align: 32, offset: 6144)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !900, file: !35, line: 2802, baseType: !1210, size: 64, align: 64, offset: 6208)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !900, file: !35, line: 2811, baseType: !897, size: 32, align: 32, offset: 6272)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !900, file: !35, line: 2821, baseType: !897, size: 32, align: 32, offset: 6304)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !900, file: !35, line: 2830, baseType: !897, size: 32, align: 32, offset: 6336)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !900, file: !35, line: 2840, baseType: !897, size: 32, align: 32, offset: 6368)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !900, file: !35, line: 2851, baseType: !1556, size: 64, align: 64, offset: 6400)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{!897, !1377, !1559, !888, !1192, !897, !897}
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!897, !1377, !888}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !900, file: !35, line: 2871, baseType: !1563, size: 64, align: 64, offset: 6464)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{!897, !1377, !1566, !888, !1192, !897}
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!897, !1377, !888, !897, !897}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !900, file: !35, line: 2878, baseType: !897, size: 32, align: 32, offset: 6528)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !900, file: !35, line: 2885, baseType: !897, size: 32, align: 32, offset: 6560)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !900, file: !35, line: 3005, baseType: !897, size: 32, align: 32, offset: 6592)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !900, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !900, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !900, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !900, file: !35, line: 3037, baseType: !1025, size: 64, align: 64, offset: 6720)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !900, file: !35, line: 3038, baseType: !897, size: 32, align: 32, offset: 6784)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !900, file: !35, line: 3050, baseType: !978, size: 64, align: 64, offset: 6848)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !900, file: !35, line: 3065, baseType: !897, size: 32, align: 32, offset: 6912)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !900, file: !35, line: 3083, baseType: !897, size: 32, align: 32, offset: 6944)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !900, file: !35, line: 3092, baseType: !960, size: 64, align: 32, offset: 6976)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !900, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !900, file: !35, line: 3106, baseType: !960, size: 64, align: 32, offset: 7072)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !900, file: !35, line: 3113, baseType: !1584, size: 64, align: 64, offset: 7168)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1586)
!1586 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1587)
!1587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1588)
!1588 = !{!1589, !1590, !1591, !1592, !1593, !1594, !1597}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1587, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1587, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1587, file: !35, line: 720, baseType: !909, size: 64, align: 64, offset: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1587, file: !35, line: 724, baseType: !909, size: 64, align: 64, offset: 128)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1587, file: !35, line: 728, baseType: !897, size: 32, align: 32, offset: 192)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1587, file: !35, line: 734, baseType: !1595, size: 64, align: 64, offset: 256)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !909)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1587, file: !35, line: 739, baseType: !1598, size: 64, align: 64, offset: 320)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !900, file: !35, line: 3129, baseType: !1070, size: 64, align: 64, offset: 7232)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !900, file: !35, line: 3130, baseType: !1070, size: 64, align: 64, offset: 7296)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !900, file: !35, line: 3131, baseType: !1070, size: 64, align: 64, offset: 7360)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !900, file: !35, line: 3132, baseType: !1070, size: 64, align: 64, offset: 7424)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !900, file: !35, line: 3139, baseType: !889, size: 64, align: 64, offset: 7488)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !900, file: !35, line: 3147, baseType: !897, size: 32, align: 32, offset: 7552)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !900, file: !35, line: 3165, baseType: !897, size: 32, align: 32, offset: 7584)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !900, file: !35, line: 3172, baseType: !897, size: 32, align: 32, offset: 7616)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !900, file: !35, line: 3180, baseType: !897, size: 32, align: 32, offset: 7648)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !900, file: !35, line: 3191, baseType: !1414, size: 64, align: 64, offset: 7680)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !900, file: !35, line: 3199, baseType: !1025, size: 64, align: 64, offset: 7744)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !900, file: !35, line: 3207, baseType: !889, size: 64, align: 64, offset: 7808)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !900, file: !35, line: 3214, baseType: !1035, size: 32, align: 32, offset: 7872)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !900, file: !35, line: 3224, baseType: !1099, size: 64, align: 64, offset: 7936)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !900, file: !35, line: 3225, baseType: !897, size: 32, align: 32, offset: 8000)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !900, file: !35, line: 3249, baseType: !1081, size: 64, align: 64, offset: 8064)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !900, file: !35, line: 3256, baseType: !897, size: 32, align: 32, offset: 8128)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !900, file: !35, line: 3271, baseType: !897, size: 32, align: 32, offset: 8160)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !900, file: !35, line: 3279, baseType: !1070, size: 64, align: 64, offset: 8192)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !900, file: !35, line: 3301, baseType: !1081, size: 64, align: 64, offset: 8256)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !900, file: !35, line: 3310, baseType: !897, size: 32, align: 32, offset: 8320)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !900, file: !35, line: 3337, baseType: !897, size: 32, align: 32, offset: 8352)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !900, file: !35, line: 3351, baseType: !897, size: 32, align: 32, offset: 8384)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !900, file: !35, line: 3359, baseType: !897, size: 32, align: 32, offset: 8416)
!1624 = !{}
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{null, !888}
!1628 = !{i32 2, !"Dwarf Version", i32 4}
!1629 = !{i32 2, !"Debug Info Version", i32 3}
!1630 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1631 = distinct !DISubprogram(name: "ff_slice_thread_free", scope: !894, file: !894, line: 77, type: !1213, isLocal: false, isDefinition: true, scopeLine: 78, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1624)
!1632 = !DILocalVariable(name: "avctx", arg: 1, scope: !1631, file: !894, line: 77, type: !898)
!1633 = !DIExpression()
!1634 = !DILocation(line: 77, column: 43, scope: !1631)
!1635 = !DILocalVariable(name: "c", scope: !1631, file: !894, line: 79, type: !1636)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_typedef, name: "SliceThreadContext", file: !894, line: 57, baseType: !1638)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SliceThreadContext", file: !894, line: 43, size: 704, align: 64, elements: !1639)
!1639 = !{!1640, !1645, !1650, !1655, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1688}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !1638, file: !894, line: 44, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSliceThread", file: !1643, line: 22, baseType: !1644)
!1643 = !DIFile(filename: "./libavutil/slicethread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1644 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVSliceThread", file: !1643, line: 22, flags: DIFlagFwdDecl)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1638, file: !894, line: 45, baseType: !1646, size: 64, align: 64, offset: 64)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func", file: !894, line: 39, baseType: !1648)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!897, !898, !888}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "func2", scope: !1638, file: !894, line: 46, baseType: !1651, size: 64, align: 64, offset: 128)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_typedef, name: "action_func2", file: !894, line: 40, baseType: !1653)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!897, !898, !888, !897, !897}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mainfunc", scope: !1638, file: !894, line: 47, baseType: !1656, size: 64, align: 64, offset: 192)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DIDerivedType(tag: DW_TAG_typedef, name: "main_func", file: !894, line: 41, baseType: !895)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1638, file: !894, line: 48, baseType: !888, size: 64, align: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "rets", scope: !1638, file: !894, line: 49, baseType: !1192, size: 64, align: 64, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "job_size", scope: !1638, file: !894, line: 50, baseType: !897, size: 32, align: 32, offset: 384)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1638, file: !894, line: 52, baseType: !1192, size: 64, align: 64, offset: 448)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "entries_count", scope: !1638, file: !894, line: 53, baseType: !897, size: 32, align: 32, offset: 512)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1638, file: !894, line: 54, baseType: !897, size: 32, align: 32, offset: 544)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "progress_cond", scope: !1638, file: !894, line: 55, baseType: !1665, size: 64, align: 64, offset: 576)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !1667, line: 154, baseType: !1668)
!1667 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1668 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !1667, line: 139, size: 384, align: 64, elements: !1669)
!1669 = !{!1670, !1682, !1686}
