; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dca_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dca_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DCAExtensionMask", file: !894, line: 169, size: 32, align: 32, elements: !895)
!894 = !DIFile(filename: "libavcodec/dca.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!896 = !DIEnumerator(name: "DCA_CSS_CORE", value: 1)
!897 = !DIEnumerator(name: "DCA_CSS_XXCH", value: 2)
!898 = !DIEnumerator(name: "DCA_CSS_X96", value: 4)
!899 = !DIEnumerator(name: "DCA_CSS_XCH", value: 8)
!900 = !DIEnumerator(name: "DCA_CSS_MASK", value: 15)
!901 = !DIEnumerator(name: "DCA_EXSS_CORE", value: 16)
!902 = !DIEnumerator(name: "DCA_EXSS_XBR", value: 32)
!903 = !DIEnumerator(name: "DCA_EXSS_XXCH", value: 64)
!904 = !DIEnumerator(name: "DCA_EXSS_X96", value: 128)
!905 = !DIEnumerator(name: "DCA_EXSS_LBR", value: 256)
!906 = !DIEnumerator(name: "DCA_EXSS_XLL", value: 512)
!907 = !DIEnumerator(name: "DCA_EXSS_RSV1", value: 1024)
!908 = !DIEnumerator(name: "DCA_EXSS_RSV2", value: 2048)
!909 = !DIEnumerator(name: "DCA_EXSS_MASK", value: 4080)
!910 = !{!911, !914, !915, !916, !917, !924}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !912, line: 55, baseType: !913)
!912 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!913 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!915 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!916 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !912, line: 51, baseType: !916)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !912, line: 48, baseType: !925)
!925 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!926 = !{!927}
!927 = distinct !DIGlobalVariable(name: "ff_dca_parser", scope: !0, file: !928, line: 346, type: !929, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_dca_parser)
!928 = !DIFile(filename: "libavcodec/dca_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !931)
!931 = !{!932, !936, !937, !987, !1711, !1715, !1719}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !930, file: !4, line: 5260, baseType: !933, size: 160, align: 32)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 160, align: 32, elements: !934)
!934 = !{!935}
!935 = !DISubrange(count: 5)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !930, file: !4, line: 5261, baseType: !915, size: 32, align: 32, offset: 160)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !930, file: !4, line: 5262, baseType: !938, size: 64, align: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DISubroutineType(types: !940)
!940 = !{!915, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !944)
!944 = !{!945, !946, !948, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !943, file: !4, line: 5093, baseType: !914, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !943, file: !4, line: 5094, baseType: !947, size: 64, align: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !943, file: !4, line: 5095, baseType: !949, size: 64, align: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !912, line: 40, baseType: !950)
!950 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !943, file: !4, line: 5096, baseType: !949, size: 64, align: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !943, file: !4, line: 5098, baseType: !949, size: 64, align: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !943, file: !4, line: 5100, baseType: !915, size: 32, align: 32, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !943, file: !4, line: 5110, baseType: !915, size: 32, align: 32, offset: 352)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !943, file: !4, line: 5111, baseType: !949, size: 64, align: 64, offset: 384)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !943, file: !4, line: 5112, baseType: !949, size: 64, align: 64, offset: 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !943, file: !4, line: 5115, baseType: !949, size: 64, align: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !943, file: !4, line: 5116, baseType: !949, size: 64, align: 64, offset: 576)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !943, file: !4, line: 5117, baseType: !915, size: 32, align: 32, offset: 640)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !943, file: !4, line: 5120, baseType: !915, size: 32, align: 32, offset: 672)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !943, file: !4, line: 5121, baseType: !962, size: 256, align: 64, offset: 704)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 256, align: 64, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 4)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !943, file: !4, line: 5122, baseType: !962, size: 256, align: 64, offset: 960)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !943, file: !4, line: 5123, baseType: !962, size: 256, align: 64, offset: 1216)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !943, file: !4, line: 5125, baseType: !915, size: 32, align: 32, offset: 1472)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !943, file: !4, line: 5132, baseType: !949, size: 64, align: 64, offset: 1536)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !943, file: !4, line: 5133, baseType: !962, size: 256, align: 64, offset: 1600)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !943, file: !4, line: 5141, baseType: !915, size: 32, align: 32, offset: 1856)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !943, file: !4, line: 5148, baseType: !949, size: 64, align: 64, offset: 1920)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !943, file: !4, line: 5161, baseType: !915, size: 32, align: 32, offset: 1984)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !943, file: !4, line: 5176, baseType: !915, size: 32, align: 32, offset: 2016)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !943, file: !4, line: 5190, baseType: !915, size: 32, align: 32, offset: 2048)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !943, file: !4, line: 5197, baseType: !962, size: 256, align: 64, offset: 2112)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !943, file: !4, line: 5202, baseType: !949, size: 64, align: 64, offset: 2368)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !943, file: !4, line: 5207, baseType: !949, size: 64, align: 64, offset: 2432)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !943, file: !4, line: 5214, baseType: !915, size: 32, align: 32, offset: 2496)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !943, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !943, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !943, file: !4, line: 5234, baseType: !915, size: 32, align: 32, offset: 2592)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !943, file: !4, line: 5239, baseType: !915, size: 32, align: 32, offset: 2624)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !943, file: !4, line: 5240, baseType: !915, size: 32, align: 32, offset: 2656)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !943, file: !4, line: 5245, baseType: !915, size: 32, align: 32, offset: 2688)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !943, file: !4, line: 5246, baseType: !915, size: 32, align: 32, offset: 2720)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !943, file: !4, line: 5256, baseType: !915, size: 32, align: 32, offset: 2752)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !930, file: !4, line: 5265, baseType: !988, size: 64, align: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!915, !941, !991, !1710, !1278, !1104, !915}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !994)
!994 = !{!995, !1039, !1040, !1041, !1308, !1309, !1310, !1311, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1464, !1468, !1469, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1648, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !993, file: !4, line: 1561, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !1000)
!1000 = !{!1001, !1005, !1009, !1013, !1014, !1015, !1016, !1020, !1026, !1028, !1032}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !999, file: !19, line: 72, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !999, file: !19, line: 78, baseType: !1006, size: 64, align: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1002, !914}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !999, file: !19, line: 85, baseType: !1010, size: 64, align: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !999, file: !19, line: 93, baseType: !915, size: 32, align: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !999, file: !19, line: 99, baseType: !915, size: 32, align: 32, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !999, file: !19, line: 108, baseType: !915, size: 32, align: 32, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !999, file: !19, line: 113, baseType: !1017, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!914, !914, !914}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !999, file: !19, line: 123, baseType: !1021, size: 64, align: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !999, file: !19, line: 130, baseType: !1027, size: 32, align: 32, offset: 448)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !999, file: !19, line: 136, baseType: !1029, size: 64, align: 64, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!1027, !914}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !999, file: !19, line: 142, baseType: !1033, size: 64, align: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!915, !1036, !914, !1002, !915}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !993, file: !4, line: 1562, baseType: !915, size: 32, align: 32, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !993, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !993, file: !4, line: 1565, baseType: !1042, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1051, !1060, !1063, !1066, !1069, !1072, !1073, !1074, !1082, !1083, !1084, !1086, !1090, !1096, !1107, !1111, !1112, !1158, !1279, !1283, !1284, !1288, !1292, !1297, !1301, !1302, !1303}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1044, file: !4, line: 3475, baseType: !1002, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1044, file: !4, line: 3480, baseType: !1002, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1044, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1044, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1044, file: !4, line: 3487, baseType: !915, size: 32, align: 32, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1044, file: !4, line: 3488, baseType: !1052, size: 64, align: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1055, line: 61, baseType: !1056)
!1055 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1055, line: 58, size: 64, align: 32, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1056, file: !1055, line: 59, baseType: !915, size: 32, align: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1056, file: !1055, line: 60, baseType: !915, size: 32, align: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1044, file: !4, line: 3489, baseType: !1061, size: 64, align: 64, offset: 320)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1044, file: !4, line: 3490, baseType: !1064, size: 64, align: 64, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1044, file: !4, line: 3491, baseType: !1067, size: 64, align: 64, offset: 448)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1044, file: !4, line: 3492, baseType: !1070, size: 64, align: 64, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1044, file: !4, line: 3493, baseType: !924, size: 8, align: 8, offset: 576)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1044, file: !4, line: 3494, baseType: !996, size: 64, align: 64, offset: 640)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1044, file: !4, line: 3495, baseType: !1075, size: 64, align: 64, offset: 704)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1078, file: !4, line: 3402, baseType: !915, size: 32, align: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !4, line: 3403, baseType: !1002, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1044, file: !4, line: 3507, baseType: !1002, size: 64, align: 64, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1044, file: !4, line: 3516, baseType: !915, size: 32, align: 32, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1044, file: !4, line: 3517, baseType: !1085, size: 64, align: 64, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1044, file: !4, line: 3527, baseType: !1087, size: 64, align: 64, offset: 960)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!915, !991}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1044, file: !4, line: 3535, baseType: !1091, size: 64, align: 64, offset: 1024)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!915, !991, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1044, file: !4, line: 3541, baseType: !1097, size: 64, align: 64, offset: 1088)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1101, line: 223, size: 128, align: 64, elements: !1102)
!1101 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1102 = !{!1103, !1106}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1100, file: !1101, line: 224, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1100, file: !1101, line: 225, baseType: !1104, size: 64, align: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1044, file: !4, line: 3549, baseType: !1108, size: 64, align: 64, offset: 1152)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !1085}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1044, file: !4, line: 3551, baseType: !1087, size: 64, align: 64, offset: 1216)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1044, file: !4, line: 3552, baseType: !1113, size: 64, align: 64, offset: 1280)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!915, !991, !1116, !915, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1120)
!1120 = !{!1121, !1124, !1125, !1126, !1127, !1157}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1119, file: !4, line: 3921, baseType: !1122, size: 16, align: 16)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !912, line: 49, baseType: !1123)
!1123 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1119, file: !4, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1119, file: !4, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1119, file: !4, line: 3924, baseType: !916, size: 32, align: 32, offset: 96)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1119, file: !4, line: 3925, baseType: !1128, size: 64, align: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1132)
!1132 = !{!1133, !1134, !1135, !1136, !1137, !1138, !1148, !1150, !1152, !1153, !1155, !1156}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1131, file: !4, line: 3886, baseType: !915, size: 32, align: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1131, file: !4, line: 3887, baseType: !915, size: 32, align: 32, offset: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1131, file: !4, line: 3888, baseType: !915, size: 32, align: 32, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1131, file: !4, line: 3889, baseType: !915, size: 32, align: 32, offset: 96)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1131, file: !4, line: 3890, baseType: !915, size: 32, align: 32, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1131, file: !4, line: 3897, baseType: !1139, size: 768, align: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1141)
!1141 = !{!1142, !1146}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1140, file: !4, line: 3855, baseType: !1143, size: 512, align: 64)
!1143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 512, align: 64, elements: !1144)
!1144 = !{!1145}
!1145 = !DISubrange(count: 8)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1140, file: !4, line: 3857, baseType: !1147, size: 256, align: 32, offset: 512)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 256, align: 32, elements: !1144)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !4, line: 3903, baseType: !1149, size: 256, align: 64, offset: 960)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1116, size: 256, align: 64, elements: !963)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1131, file: !4, line: 3904, baseType: !1151, size: 128, align: 32, offset: 1216)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 128, align: 32, elements: !963)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1131, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1131, file: !4, line: 3908, baseType: !1154, size: 64, align: 64, offset: 1408)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1131, file: !4, line: 3915, baseType: !1154, size: 64, align: 64, offset: 1472)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1131, file: !4, line: 3917, baseType: !915, size: 32, align: 32, offset: 1536)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1119, file: !4, line: 3926, baseType: !949, size: 64, align: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1044, file: !4, line: 3564, baseType: !1159, size: 64, align: 64, offset: 1344)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!915, !991, !1162, !1196, !1278}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1165)
!1165 = !{!1166, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1192, !1193, !1194, !1195}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1164, file: !4, line: 1451, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1169, line: 94, baseType: !1170)
!1169 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1169, line: 81, size: 192, align: 64, elements: !1171)
!1171 = !{!1172, !1176, !1177}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1170, file: !1169, line: 82, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1169, line: 73, baseType: !1175)
!1175 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1169, line: 73, flags: DIFlagFwdDecl)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1170, file: !1169, line: 89, baseType: !1116, size: 64, align: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1170, file: !1169, line: 93, baseType: !915, size: 32, align: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1164, file: !4, line: 1461, baseType: !949, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1164, file: !4, line: 1467, baseType: !949, size: 64, align: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !4, line: 1468, baseType: !1116, size: 64, align: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1164, file: !4, line: 1469, baseType: !915, size: 32, align: 32, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1164, file: !4, line: 1470, baseType: !915, size: 32, align: 32, offset: 288)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1164, file: !4, line: 1474, baseType: !915, size: 32, align: 32, offset: 320)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1164, file: !4, line: 1479, baseType: !1185, size: 64, align: 64, offset: 384)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1188)
!1188 = !{!1189, !1190, !1191}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !4, line: 1412, baseType: !1116, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1187, file: !4, line: 1413, baseType: !915, size: 32, align: 32, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1187, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1164, file: !4, line: 1480, baseType: !915, size: 32, align: 32, offset: 448)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1164, file: !4, line: 1486, baseType: !949, size: 64, align: 64, offset: 512)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1164, file: !4, line: 1488, baseType: !949, size: 64, align: 64, offset: 576)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1164, file: !4, line: 1497, baseType: !949, size: 64, align: 64, offset: 640)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1203, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1230, !1232, !1233, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1266, !1267, !1268, !1269, !1270, !1271, !1274, !1275, !1276, !1277}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !772, line: 282, baseType: !1143, size: 512, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1199, file: !772, line: 299, baseType: !1147, size: 256, align: 32, offset: 512)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1199, file: !772, line: 315, baseType: !1204, size: 64, align: 64, offset: 768)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1199, file: !772, line: 326, baseType: !915, size: 32, align: 32, offset: 832)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1199, file: !772, line: 326, baseType: !915, size: 32, align: 32, offset: 864)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1199, file: !772, line: 334, baseType: !915, size: 32, align: 32, offset: 896)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1199, file: !772, line: 341, baseType: !915, size: 32, align: 32, offset: 928)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1199, file: !772, line: 346, baseType: !915, size: 32, align: 32, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1199, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1199, file: !772, line: 356, baseType: !1054, size: 64, align: 32, offset: 1024)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1199, file: !772, line: 361, baseType: !949, size: 64, align: 64, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1199, file: !772, line: 369, baseType: !949, size: 64, align: 64, offset: 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1199, file: !772, line: 377, baseType: !949, size: 64, align: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1199, file: !772, line: 382, baseType: !915, size: 32, align: 32, offset: 1280)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1199, file: !772, line: 386, baseType: !915, size: 32, align: 32, offset: 1312)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1199, file: !772, line: 391, baseType: !915, size: 32, align: 32, offset: 1344)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1199, file: !772, line: 396, baseType: !914, size: 64, align: 64, offset: 1408)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1199, file: !772, line: 403, baseType: !1220, size: 512, align: 64, offset: 1472)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 512, align: 64, elements: !1144)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1199, file: !772, line: 410, baseType: !915, size: 32, align: 32, offset: 1984)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1199, file: !772, line: 415, baseType: !915, size: 32, align: 32, offset: 2016)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1199, file: !772, line: 420, baseType: !915, size: 32, align: 32, offset: 2048)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1199, file: !772, line: 425, baseType: !915, size: 32, align: 32, offset: 2080)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1199, file: !772, line: 435, baseType: !949, size: 64, align: 64, offset: 2112)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1199, file: !772, line: 440, baseType: !915, size: 32, align: 32, offset: 2176)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1199, file: !772, line: 445, baseType: !911, size: 64, align: 64, offset: 2240)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1199, file: !772, line: 459, baseType: !1229, size: 512, align: 64, offset: 2304)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1167, size: 512, align: 64, elements: !1144)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1199, file: !772, line: 473, baseType: !1231, size: 64, align: 64, offset: 2816)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1199, file: !772, line: 477, baseType: !915, size: 32, align: 32, offset: 2880)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1199, file: !772, line: 479, baseType: !1234, size: 64, align: 64, offset: 2944)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1247}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1237, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !772, line: 203, baseType: !1116, size: 64, align: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1237, file: !772, line: 204, baseType: !915, size: 32, align: 32, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1237, file: !772, line: 205, baseType: !1243, size: 64, align: 64, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1245, line: 86, baseType: !1246)
!1245 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1245, line: 86, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1237, file: !772, line: 206, baseType: !1167, size: 64, align: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1199, file: !772, line: 480, baseType: !915, size: 32, align: 32, offset: 3008)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1199, file: !772, line: 505, baseType: !915, size: 32, align: 32, offset: 3040)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1199, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1199, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1199, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1199, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1199, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1199, file: !772, line: 532, baseType: !949, size: 64, align: 64, offset: 3264)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1199, file: !772, line: 539, baseType: !949, size: 64, align: 64, offset: 3328)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1199, file: !772, line: 547, baseType: !949, size: 64, align: 64, offset: 3392)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1199, file: !772, line: 554, baseType: !1243, size: 64, align: 64, offset: 3456)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1199, file: !772, line: 563, baseType: !915, size: 32, align: 32, offset: 3520)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1199, file: !772, line: 572, baseType: !915, size: 32, align: 32, offset: 3552)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1199, file: !772, line: 581, baseType: !915, size: 32, align: 32, offset: 3584)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1199, file: !772, line: 588, baseType: !1263, size: 64, align: 64, offset: 3648)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !912, line: 36, baseType: !1265)
!1265 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1199, file: !772, line: 593, baseType: !915, size: 32, align: 32, offset: 3712)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1199, file: !772, line: 596, baseType: !915, size: 32, align: 32, offset: 3744)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1199, file: !772, line: 599, baseType: !1167, size: 64, align: 64, offset: 3776)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1199, file: !772, line: 605, baseType: !1167, size: 64, align: 64, offset: 3840)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1199, file: !772, line: 616, baseType: !1167, size: 64, align: 64, offset: 3904)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1199, file: !772, line: 626, baseType: !1272, size: 64, align: 64, offset: 3968)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1273, line: 216, baseType: !913)
!1273 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1199, file: !772, line: 627, baseType: !1272, size: 64, align: 64, offset: 4032)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1199, file: !772, line: 628, baseType: !1272, size: 64, align: 64, offset: 4096)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1199, file: !772, line: 629, baseType: !1272, size: 64, align: 64, offset: 4160)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1199, file: !772, line: 645, baseType: !1167, size: 64, align: 64, offset: 4224)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1044, file: !4, line: 3566, baseType: !1280, size: 64, align: 64, offset: 1408)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!915, !991, !914, !1278, !1162}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1044, file: !4, line: 3567, baseType: !1087, size: 64, align: 64, offset: 1472)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1044, file: !4, line: 3576, baseType: !1285, size: 64, align: 64, offset: 1536)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!915, !991, !1196}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1044, file: !4, line: 3577, baseType: !1289, size: 64, align: 64, offset: 1600)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!915, !991, !1162}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1044, file: !4, line: 3584, baseType: !1293, size: 64, align: 64, offset: 1664)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!915, !991, !1296}
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1044, file: !4, line: 3589, baseType: !1298, size: 64, align: 64, offset: 1728)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !991}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1044, file: !4, line: 3594, baseType: !915, size: 32, align: 32, offset: 1792)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1044, file: !4, line: 3600, baseType: !1002, size: 64, align: 64, offset: 1856)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1044, file: !4, line: 3609, baseType: !1304, size: 64, align: 64, offset: 1920)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1307)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !993, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !993, file: !4, line: 1581, baseType: !916, size: 32, align: 32, offset: 224)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !993, file: !4, line: 1583, baseType: !914, size: 64, align: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !993, file: !4, line: 1591, baseType: !1312, size: 64, align: 64, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1101, line: 129, size: 1664, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1319, !1337, !1338, !1344, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1313, file: !1101, line: 136, baseType: !915, size: 32, align: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1313, file: !1101, line: 151, baseType: !915, size: 32, align: 32, offset: 32)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1313, file: !1101, line: 157, baseType: !915, size: 32, align: 32, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1313, file: !1101, line: 159, baseType: !1296, size: 64, align: 64, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1313, file: !1101, line: 161, baseType: !1320, size: 64, align: 64, offset: 192)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1101, line: 117, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1101, line: 100, size: 832, align: 64, elements: !1323)
!1323 = !{!1324, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1322, file: !1101, line: 105, baseType: !1325, size: 256, align: 64)
!1325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1326, size: 256, align: 64, elements: !963)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1169, line: 238, baseType: !1328)
!1328 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1169, line: 238, flags: DIFlagFwdDecl)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1322, file: !1101, line: 110, baseType: !915, size: 32, align: 32, offset: 256)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1322, file: !1101, line: 111, baseType: !915, size: 32, align: 32, offset: 288)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1322, file: !1101, line: 111, baseType: !915, size: 32, align: 32, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1322, file: !1101, line: 112, baseType: !1147, size: 256, align: 32, offset: 352)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1322, file: !1101, line: 113, baseType: !1151, size: 128, align: 32, offset: 608)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1322, file: !1101, line: 114, baseType: !915, size: 32, align: 32, offset: 736)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1322, file: !1101, line: 115, baseType: !915, size: 32, align: 32, offset: 768)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1322, file: !1101, line: 116, baseType: !915, size: 32, align: 32, offset: 800)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1313, file: !1101, line: 163, baseType: !914, size: 64, align: 64, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1313, file: !1101, line: 165, baseType: !1339, size: 128, align: 64, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1101, line: 122, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1101, line: 119, size: 128, align: 64, elements: !1341)
!1341 = !{!1342, !1343}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1340, file: !1101, line: 120, baseType: !1162, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1340, file: !1101, line: 121, baseType: !1296, size: 64, align: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1313, file: !1101, line: 166, baseType: !1345, size: 128, align: 64, offset: 448)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1101, line: 127, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1101, line: 124, size: 128, align: 64, elements: !1347)
!1347 = !{!1348, !1421}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1346, file: !1101, line: 125, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1379, !1383, !1384, !1418, !1419, !1420}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1352, file: !4, line: 5751, baseType: !996, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1352, file: !4, line: 5756, baseType: !1356, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1359)
!1359 = !{!1360, !1361, !1364, !1365, !1366, !1370, !1374, !1378}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1358, file: !4, line: 5797, baseType: !1002, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1358, file: !4, line: 5804, baseType: !1362, size: 64, align: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1358, file: !4, line: 5815, baseType: !996, size: 64, align: 64, offset: 128)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1358, file: !4, line: 5825, baseType: !915, size: 32, align: 32, offset: 192)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1358, file: !4, line: 5826, baseType: !1367, size: 64, align: 64, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DISubroutineType(types: !1369)
!1369 = !{!915, !1350}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1358, file: !4, line: 5827, baseType: !1371, size: 64, align: 64, offset: 320)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DISubroutineType(types: !1373)
!1373 = !{!915, !1350, !1162}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1358, file: !4, line: 5828, baseType: !1375, size: 64, align: 64, offset: 384)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{null, !1350}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1358, file: !4, line: 5829, baseType: !1375, size: 64, align: 64, offset: 448)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1352, file: !4, line: 5762, baseType: !1380, size: 64, align: 64, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1382)
!1382 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1352, file: !4, line: 5768, baseType: !914, size: 64, align: 64, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1352, file: !4, line: 5775, baseType: !1385, size: 64, align: 64, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1387, file: !4, line: 3940, baseType: !39, size: 32, align: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1387, file: !4, line: 3944, baseType: !49, size: 32, align: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1387, file: !4, line: 3948, baseType: !923, size: 32, align: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1387, file: !4, line: 3958, baseType: !1116, size: 64, align: 64, offset: 128)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1387, file: !4, line: 3962, baseType: !915, size: 32, align: 32, offset: 192)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1387, file: !4, line: 3968, baseType: !915, size: 32, align: 32, offset: 224)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1387, file: !4, line: 3973, baseType: !949, size: 64, align: 64, offset: 256)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1387, file: !4, line: 3986, baseType: !915, size: 32, align: 32, offset: 320)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1387, file: !4, line: 3999, baseType: !915, size: 32, align: 32, offset: 352)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1387, file: !4, line: 4004, baseType: !915, size: 32, align: 32, offset: 384)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1387, file: !4, line: 4005, baseType: !915, size: 32, align: 32, offset: 416)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1387, file: !4, line: 4010, baseType: !915, size: 32, align: 32, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1387, file: !4, line: 4011, baseType: !915, size: 32, align: 32, offset: 480)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1387, file: !4, line: 4020, baseType: !1054, size: 64, align: 32, offset: 512)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1387, file: !4, line: 4025, baseType: !3, size: 32, align: 32, offset: 576)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1387, file: !4, line: 4030, baseType: !795, size: 32, align: 32, offset: 608)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1387, file: !4, line: 4031, baseType: !801, size: 32, align: 32, offset: 640)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1387, file: !4, line: 4032, baseType: !819, size: 32, align: 32, offset: 672)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1387, file: !4, line: 4033, baseType: !843, size: 32, align: 32, offset: 704)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1387, file: !4, line: 4034, baseType: !862, size: 32, align: 32, offset: 736)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1387, file: !4, line: 4039, baseType: !915, size: 32, align: 32, offset: 768)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1387, file: !4, line: 4046, baseType: !911, size: 64, align: 64, offset: 832)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1387, file: !4, line: 4050, baseType: !915, size: 32, align: 32, offset: 896)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1387, file: !4, line: 4054, baseType: !915, size: 32, align: 32, offset: 928)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1387, file: !4, line: 4061, baseType: !915, size: 32, align: 32, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1387, file: !4, line: 4065, baseType: !915, size: 32, align: 32, offset: 992)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1387, file: !4, line: 4073, baseType: !915, size: 32, align: 32, offset: 1024)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1387, file: !4, line: 4080, baseType: !915, size: 32, align: 32, offset: 1056)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1387, file: !4, line: 4084, baseType: !915, size: 32, align: 32, offset: 1088)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1352, file: !4, line: 5781, baseType: !1385, size: 64, align: 64, offset: 320)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1352, file: !4, line: 5787, baseType: !1054, size: 64, align: 32, offset: 384)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1352, file: !4, line: 5793, baseType: !1054, size: 64, align: 32, offset: 448)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1346, file: !1101, line: 126, baseType: !915, size: 32, align: 32, offset: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1313, file: !1101, line: 172, baseType: !1162, size: 64, align: 64, offset: 576)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1313, file: !1101, line: 177, baseType: !1116, size: 64, align: 64, offset: 640)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1313, file: !1101, line: 178, baseType: !916, size: 32, align: 32, offset: 704)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1313, file: !1101, line: 180, baseType: !914, size: 64, align: 64, offset: 768)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1313, file: !1101, line: 185, baseType: !915, size: 32, align: 32, offset: 832)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1313, file: !1101, line: 190, baseType: !914, size: 64, align: 64, offset: 896)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1313, file: !1101, line: 195, baseType: !915, size: 32, align: 32, offset: 960)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1313, file: !1101, line: 200, baseType: !1162, size: 64, align: 64, offset: 1024)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1313, file: !1101, line: 201, baseType: !915, size: 32, align: 32, offset: 1088)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1313, file: !1101, line: 202, baseType: !1296, size: 64, align: 64, offset: 1152)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1313, file: !1101, line: 203, baseType: !915, size: 32, align: 32, offset: 1216)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1313, file: !1101, line: 205, baseType: !915, size: 32, align: 32, offset: 1248)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1313, file: !1101, line: 206, baseType: !915, size: 32, align: 32, offset: 1280)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1313, file: !1101, line: 209, baseType: !1272, size: 64, align: 64, offset: 1344)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1313, file: !1101, line: 212, baseType: !1272, size: 64, align: 64, offset: 1408)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1313, file: !1101, line: 213, baseType: !1296, size: 64, align: 64, offset: 1472)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1313, file: !1101, line: 215, baseType: !915, size: 32, align: 32, offset: 1536)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1313, file: !1101, line: 217, baseType: !915, size: 32, align: 32, offset: 1568)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1313, file: !1101, line: 220, baseType: !915, size: 32, align: 32, offset: 1600)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !993, file: !4, line: 1598, baseType: !914, size: 64, align: 64, offset: 384)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !993, file: !4, line: 1606, baseType: !949, size: 64, align: 64, offset: 448)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !993, file: !4, line: 1614, baseType: !915, size: 32, align: 32, offset: 512)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !993, file: !4, line: 1622, baseType: !915, size: 32, align: 32, offset: 544)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !993, file: !4, line: 1628, baseType: !915, size: 32, align: 32, offset: 576)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !4, line: 1636, baseType: !915, size: 32, align: 32, offset: 608)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !993, file: !4, line: 1643, baseType: !915, size: 32, align: 32, offset: 640)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !993, file: !4, line: 1657, baseType: !1116, size: 64, align: 64, offset: 704)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !993, file: !4, line: 1658, baseType: !915, size: 32, align: 32, offset: 768)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !993, file: !4, line: 1679, baseType: !1054, size: 64, align: 32, offset: 800)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !993, file: !4, line: 1688, baseType: !915, size: 32, align: 32, offset: 864)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !993, file: !4, line: 1712, baseType: !915, size: 32, align: 32, offset: 896)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !993, file: !4, line: 1729, baseType: !915, size: 32, align: 32, offset: 928)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !993, file: !4, line: 1729, baseType: !915, size: 32, align: 32, offset: 960)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !993, file: !4, line: 1744, baseType: !915, size: 32, align: 32, offset: 992)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !993, file: !4, line: 1744, baseType: !915, size: 32, align: 32, offset: 1024)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !993, file: !4, line: 1751, baseType: !915, size: 32, align: 32, offset: 1056)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !993, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !993, file: !4, line: 1791, baseType: !1460, size: 64, align: 64, offset: 1152)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{null, !1463, !1196, !1278, !915, !915, !915}
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !993, file: !4, line: 1808, baseType: !1465, size: 64, align: 64, offset: 1216)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!508, !1463, !1061}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !993, file: !4, line: 1816, baseType: !915, size: 32, align: 32, offset: 1280)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !993, file: !4, line: 1825, baseType: !1470, size: 32, align: 32, offset: 1312)
!1470 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !993, file: !4, line: 1830, baseType: !915, size: 32, align: 32, offset: 1344)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !993, file: !4, line: 1838, baseType: !1470, size: 32, align: 32, offset: 1376)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !993, file: !4, line: 1846, baseType: !915, size: 32, align: 32, offset: 1408)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !993, file: !4, line: 1851, baseType: !915, size: 32, align: 32, offset: 1440)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !993, file: !4, line: 1861, baseType: !1470, size: 32, align: 32, offset: 1472)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !993, file: !4, line: 1868, baseType: !1470, size: 32, align: 32, offset: 1504)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !993, file: !4, line: 1875, baseType: !1470, size: 32, align: 32, offset: 1536)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !993, file: !4, line: 1882, baseType: !1470, size: 32, align: 32, offset: 1568)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !993, file: !4, line: 1889, baseType: !1470, size: 32, align: 32, offset: 1600)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !993, file: !4, line: 1896, baseType: !1470, size: 32, align: 32, offset: 1632)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !993, file: !4, line: 1903, baseType: !1470, size: 32, align: 32, offset: 1664)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !993, file: !4, line: 1910, baseType: !915, size: 32, align: 32, offset: 1696)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !993, file: !4, line: 1915, baseType: !915, size: 32, align: 32, offset: 1728)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !993, file: !4, line: 1926, baseType: !1278, size: 64, align: 64, offset: 1792)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !993, file: !4, line: 1935, baseType: !1054, size: 64, align: 32, offset: 1856)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !993, file: !4, line: 1942, baseType: !915, size: 32, align: 32, offset: 1920)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !993, file: !4, line: 1948, baseType: !915, size: 32, align: 32, offset: 1952)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !993, file: !4, line: 1954, baseType: !915, size: 32, align: 32, offset: 1984)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !993, file: !4, line: 1960, baseType: !915, size: 32, align: 32, offset: 2016)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !993, file: !4, line: 1984, baseType: !915, size: 32, align: 32, offset: 2048)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !993, file: !4, line: 1991, baseType: !915, size: 32, align: 32, offset: 2080)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !993, file: !4, line: 1996, baseType: !915, size: 32, align: 32, offset: 2112)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !993, file: !4, line: 2004, baseType: !915, size: 32, align: 32, offset: 2144)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !993, file: !4, line: 2011, baseType: !915, size: 32, align: 32, offset: 2176)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !993, file: !4, line: 2018, baseType: !915, size: 32, align: 32, offset: 2208)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !993, file: !4, line: 2027, baseType: !915, size: 32, align: 32, offset: 2240)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !993, file: !4, line: 2034, baseType: !915, size: 32, align: 32, offset: 2272)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !993, file: !4, line: 2044, baseType: !915, size: 32, align: 32, offset: 2304)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !993, file: !4, line: 2054, baseType: !1500, size: 64, align: 64, offset: 2368)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !993, file: !4, line: 2061, baseType: !1500, size: 64, align: 64, offset: 2432)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !993, file: !4, line: 2066, baseType: !915, size: 32, align: 32, offset: 2496)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !993, file: !4, line: 2070, baseType: !915, size: 32, align: 32, offset: 2528)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !993, file: !4, line: 2078, baseType: !915, size: 32, align: 32, offset: 2560)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !993, file: !4, line: 2085, baseType: !915, size: 32, align: 32, offset: 2592)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !993, file: !4, line: 2092, baseType: !915, size: 32, align: 32, offset: 2624)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !993, file: !4, line: 2099, baseType: !915, size: 32, align: 32, offset: 2656)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !993, file: !4, line: 2106, baseType: !915, size: 32, align: 32, offset: 2688)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !993, file: !4, line: 2113, baseType: !915, size: 32, align: 32, offset: 2720)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !993, file: !4, line: 2120, baseType: !915, size: 32, align: 32, offset: 2752)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !993, file: !4, line: 2125, baseType: !915, size: 32, align: 32, offset: 2784)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !993, file: !4, line: 2133, baseType: !915, size: 32, align: 32, offset: 2816)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !993, file: !4, line: 2140, baseType: !915, size: 32, align: 32, offset: 2848)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !993, file: !4, line: 2145, baseType: !915, size: 32, align: 32, offset: 2880)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !993, file: !4, line: 2153, baseType: !915, size: 32, align: 32, offset: 2912)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !993, file: !4, line: 2158, baseType: !915, size: 32, align: 32, offset: 2944)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !993, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !993, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !993, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !993, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !993, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !993, file: !4, line: 2203, baseType: !915, size: 32, align: 32, offset: 3136)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !993, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !993, file: !4, line: 2212, baseType: !915, size: 32, align: 32, offset: 3200)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !993, file: !4, line: 2213, baseType: !915, size: 32, align: 32, offset: 3232)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !993, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !993, file: !4, line: 2232, baseType: !915, size: 32, align: 32, offset: 3296)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !993, file: !4, line: 2243, baseType: !915, size: 32, align: 32, offset: 3328)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !993, file: !4, line: 2249, baseType: !915, size: 32, align: 32, offset: 3360)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !993, file: !4, line: 2256, baseType: !915, size: 32, align: 32, offset: 3392)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !993, file: !4, line: 2263, baseType: !911, size: 64, align: 64, offset: 3456)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !993, file: !4, line: 2270, baseType: !911, size: 64, align: 64, offset: 3520)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !993, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !993, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !993, file: !4, line: 2367, baseType: !1536, size: 64, align: 64, offset: 3648)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!915, !1463, !1296, !915}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !993, file: !4, line: 2383, baseType: !915, size: 32, align: 32, offset: 3712)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !993, file: !4, line: 2386, baseType: !1470, size: 32, align: 32, offset: 3744)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !993, file: !4, line: 2387, baseType: !1470, size: 32, align: 32, offset: 3776)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !993, file: !4, line: 2394, baseType: !915, size: 32, align: 32, offset: 3808)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !993, file: !4, line: 2401, baseType: !915, size: 32, align: 32, offset: 3840)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !993, file: !4, line: 2408, baseType: !915, size: 32, align: 32, offset: 3872)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !993, file: !4, line: 2415, baseType: !915, size: 32, align: 32, offset: 3904)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !993, file: !4, line: 2422, baseType: !915, size: 32, align: 32, offset: 3936)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !993, file: !4, line: 2423, baseType: !1548, size: 64, align: 64, offset: 3968)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1551)
!1551 = !{!1552, !1553, !1554, !1555}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1550, file: !4, line: 827, baseType: !915, size: 32, align: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1550, file: !4, line: 828, baseType: !915, size: 32, align: 32, offset: 32)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1550, file: !4, line: 829, baseType: !915, size: 32, align: 32, offset: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1550, file: !4, line: 830, baseType: !1470, size: 32, align: 32, offset: 96)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !993, file: !4, line: 2430, baseType: !949, size: 64, align: 64, offset: 4032)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !993, file: !4, line: 2437, baseType: !949, size: 64, align: 64, offset: 4096)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !993, file: !4, line: 2444, baseType: !1470, size: 32, align: 32, offset: 4160)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !993, file: !4, line: 2451, baseType: !1470, size: 32, align: 32, offset: 4192)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !993, file: !4, line: 2458, baseType: !915, size: 32, align: 32, offset: 4224)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !993, file: !4, line: 2469, baseType: !915, size: 32, align: 32, offset: 4256)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !993, file: !4, line: 2475, baseType: !915, size: 32, align: 32, offset: 4288)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !993, file: !4, line: 2481, baseType: !915, size: 32, align: 32, offset: 4320)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !993, file: !4, line: 2485, baseType: !915, size: 32, align: 32, offset: 4352)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !993, file: !4, line: 2489, baseType: !915, size: 32, align: 32, offset: 4384)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !993, file: !4, line: 2493, baseType: !915, size: 32, align: 32, offset: 4416)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !993, file: !4, line: 2501, baseType: !915, size: 32, align: 32, offset: 4448)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !993, file: !4, line: 2506, baseType: !915, size: 32, align: 32, offset: 4480)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !993, file: !4, line: 2510, baseType: !915, size: 32, align: 32, offset: 4512)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !993, file: !4, line: 2514, baseType: !949, size: 64, align: 64, offset: 4544)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !993, file: !4, line: 2528, baseType: !1572, size: 64, align: 64, offset: 4608)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{null, !1463, !914, !915, !915}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !993, file: !4, line: 2534, baseType: !915, size: 32, align: 32, offset: 4672)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !993, file: !4, line: 2545, baseType: !915, size: 32, align: 32, offset: 4704)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !993, file: !4, line: 2547, baseType: !915, size: 32, align: 32, offset: 4736)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !993, file: !4, line: 2549, baseType: !915, size: 32, align: 32, offset: 4768)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !993, file: !4, line: 2551, baseType: !915, size: 32, align: 32, offset: 4800)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !993, file: !4, line: 2553, baseType: !915, size: 32, align: 32, offset: 4832)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !993, file: !4, line: 2555, baseType: !915, size: 32, align: 32, offset: 4864)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !993, file: !4, line: 2557, baseType: !915, size: 32, align: 32, offset: 4896)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !993, file: !4, line: 2559, baseType: !915, size: 32, align: 32, offset: 4928)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !993, file: !4, line: 2563, baseType: !915, size: 32, align: 32, offset: 4960)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !993, file: !4, line: 2571, baseType: !1154, size: 64, align: 64, offset: 4992)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !993, file: !4, line: 2579, baseType: !1154, size: 64, align: 64, offset: 5056)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !993, file: !4, line: 2586, baseType: !915, size: 32, align: 32, offset: 5120)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !993, file: !4, line: 2615, baseType: !915, size: 32, align: 32, offset: 5152)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !993, file: !4, line: 2627, baseType: !915, size: 32, align: 32, offset: 5184)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !993, file: !4, line: 2637, baseType: !915, size: 32, align: 32, offset: 5216)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !993, file: !4, line: 2681, baseType: !915, size: 32, align: 32, offset: 5248)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !993, file: !4, line: 2709, baseType: !949, size: 64, align: 64, offset: 5312)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !993, file: !4, line: 2716, baseType: !1594, size: 64, align: 64, offset: 5376)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1596)
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1597)
!1597 = !{!1598, !1599, !1600, !1601, !1602, !1603, !1604, !1608, !1612, !1613, !1614, !1615, !1621, !1622, !1623, !1624, !1625}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1596, file: !4, line: 3642, baseType: !1002, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1596, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1596, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1596, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1596, file: !4, line: 3669, baseType: !915, size: 32, align: 32, offset: 160)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1596, file: !4, line: 3682, baseType: !1293, size: 64, align: 64, offset: 192)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1596, file: !4, line: 3698, baseType: !1605, size: 64, align: 64, offset: 256)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!915, !991, !1104, !923}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1596, file: !4, line: 3712, baseType: !1609, size: 64, align: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DISubroutineType(types: !1611)
!1611 = !{!915, !991, !915, !1104, !923}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1596, file: !4, line: 3726, baseType: !1605, size: 64, align: 64, offset: 384)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1596, file: !4, line: 3737, baseType: !1087, size: 64, align: 64, offset: 448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1596, file: !4, line: 3746, baseType: !915, size: 32, align: 32, offset: 512)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1596, file: !4, line: 3757, baseType: !1616, size: 64, align: 64, offset: 576)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{null, !1619}
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1596, file: !4, line: 3766, baseType: !1087, size: 64, align: 64, offset: 640)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1596, file: !4, line: 3774, baseType: !1087, size: 64, align: 64, offset: 704)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1596, file: !4, line: 3780, baseType: !915, size: 32, align: 32, offset: 768)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1596, file: !4, line: 3785, baseType: !915, size: 32, align: 32, offset: 800)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1596, file: !4, line: 3795, baseType: !1626, size: 64, align: 64, offset: 832)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!915, !991, !1167}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !993, file: !4, line: 2728, baseType: !914, size: 64, align: 64, offset: 5440)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !993, file: !4, line: 2735, baseType: !1220, size: 512, align: 64, offset: 5504)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !993, file: !4, line: 2742, baseType: !915, size: 32, align: 32, offset: 6016)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !993, file: !4, line: 2755, baseType: !915, size: 32, align: 32, offset: 6048)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !993, file: !4, line: 2776, baseType: !915, size: 32, align: 32, offset: 6080)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !993, file: !4, line: 2783, baseType: !915, size: 32, align: 32, offset: 6112)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !993, file: !4, line: 2791, baseType: !915, size: 32, align: 32, offset: 6144)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !993, file: !4, line: 2802, baseType: !1296, size: 64, align: 64, offset: 6208)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !993, file: !4, line: 2811, baseType: !915, size: 32, align: 32, offset: 6272)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !993, file: !4, line: 2821, baseType: !915, size: 32, align: 32, offset: 6304)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !993, file: !4, line: 2830, baseType: !915, size: 32, align: 32, offset: 6336)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !993, file: !4, line: 2840, baseType: !915, size: 32, align: 32, offset: 6368)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !993, file: !4, line: 2851, baseType: !1642, size: 64, align: 64, offset: 6400)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!915, !1463, !1645, !914, !1278, !915, !915}
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!915, !1463, !914}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !993, file: !4, line: 2871, baseType: !1649, size: 64, align: 64, offset: 6464)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!915, !1463, !1652, !914, !1278, !915}
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!915, !1463, !914, !915, !915}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !993, file: !4, line: 2878, baseType: !915, size: 32, align: 32, offset: 6528)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !993, file: !4, line: 2885, baseType: !915, size: 32, align: 32, offset: 6560)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !993, file: !4, line: 3005, baseType: !915, size: 32, align: 32, offset: 6592)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !993, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !993, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !993, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !993, file: !4, line: 3037, baseType: !1116, size: 64, align: 64, offset: 6720)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !993, file: !4, line: 3038, baseType: !915, size: 32, align: 32, offset: 6784)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !993, file: !4, line: 3050, baseType: !911, size: 64, align: 64, offset: 6848)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !993, file: !4, line: 3065, baseType: !915, size: 32, align: 32, offset: 6912)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !993, file: !4, line: 3083, baseType: !915, size: 32, align: 32, offset: 6944)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !993, file: !4, line: 3092, baseType: !1054, size: 64, align: 32, offset: 6976)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !993, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !993, file: !4, line: 3106, baseType: !1054, size: 64, align: 32, offset: 7072)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !993, file: !4, line: 3113, baseType: !1670, size: 64, align: 64, offset: 7168)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1672)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1673)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1674)
!1674 = !{!1675, !1676, !1677, !1678, !1679, !1680, !1683}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1673, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1673, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1673, file: !4, line: 720, baseType: !1002, size: 64, align: 64, offset: 64)
