; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--opus_silk.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--opus_silk.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SilkContext = type { %struct.AVCodecContext*, i32, i32, i32, i32, i32, i32, i32, i32, [2 x %struct.SilkFrame], [2 x float], [2 x float], i32 }

!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OpusBandwidth", file: !888, line: 70, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/opus.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895}
!890 = !DIEnumerator(name: "OPUS_BANDWIDTH_NARROWBAND", value: 0)
!891 = !DIEnumerator(name: "OPUS_BANDWIDTH_MEDIUMBAND", value: 1)
!892 = !DIEnumerator(name: "OPUS_BANDWIDTH_WIDEBAND", value: 2)
!893 = !DIEnumerator(name: "OPUS_BANDWIDTH_SUPERWIDEBAND", value: 3)
!894 = !DIEnumerator(name: "OPUS_BANDWIDTH_FULLBAND", value: 4)
!895 = !DIEnumerator(name: "OPUS_BANDWITH_NB", value: 5)
!896 = !{!897, !898, !899, !902}
!897 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!898 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !900, line: 40, baseType: !901)
!900 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!901 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !900, line: 38, baseType: !897)
!903 = !{!904, !1587, !1588}
!904 = distinct !DIGlobalVariable(name: "model", scope: !905, file: !906, line: 611, type: !1581, isLocal: true, isDefinition: true, variable: [3 x i16*]* @silk_decode_frame.model)
!905 = distinct !DISubprogram(name: "silk_decode_frame", scope: !906, file: !906, line: 508, type: !907, isLocal: true, isDefinition: true, scopeLine: 510, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1580)
!906 = !DIFile(filename: "libavcodec/opus_silk.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!907 = !DISubroutineType(types: !908)
!908 = !{null, !909, !1546, !897, !897, !897, !897, !897}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "SilkContext", file: !888, line: 80, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SilkContext", file: !906, line: 45, size: 84736, align: 64, elements: !912)
!912 = !{!913, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1542, !1544, !1545}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !911, file: !906, line: 46, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !917)
!917 = !{!918, !963, !964, !965, !1233, !1234, !1235, !1236, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1262, !1266, !1267, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1448, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !916, file: !35, line: 1561, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !923)
!923 = !{!924, !928, !933, !937, !938, !939, !940, !944, !950, !952, !956}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !922, file: !4, line: 72, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !922, file: !4, line: 78, baseType: !929, size: 64, align: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DISubroutineType(types: !931)
!931 = !{!925, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !922, file: !4, line: 85, baseType: !934, size: 64, align: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !922, file: !4, line: 93, baseType: !897, size: 32, align: 32, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !922, file: !4, line: 99, baseType: !897, size: 32, align: 32, offset: 224)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !922, file: !4, line: 108, baseType: !897, size: 32, align: 32, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !922, file: !4, line: 113, baseType: !941, size: 64, align: 64, offset: 320)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{!932, !932, !932}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !922, file: !4, line: 123, baseType: !945, size: 64, align: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!948, !948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !922, file: !4, line: 130, baseType: !951, size: 32, align: 32, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !922, file: !4, line: 136, baseType: !953, size: 64, align: 64, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!951, !932}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !922, file: !4, line: 142, baseType: !957, size: 64, align: 64, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!897, !960, !932, !925, !897}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !916, file: !35, line: 1562, baseType: !897, size: 32, align: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !916, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !916, file: !35, line: 1565, baseType: !966, size: 64, align: 64, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !969)
!969 = !{!970, !971, !972, !973, !974, !975, !984, !987, !990, !993, !998, !1001, !1002, !1010, !1011, !1012, !1014, !1018, !1024, !1029, !1033, !1034, !1083, !1204, !1208, !1209, !1213, !1217, !1222, !1226, !1227, !1228}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !968, file: !35, line: 3475, baseType: !925, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !968, file: !35, line: 3480, baseType: !925, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !968, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !968, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !968, file: !35, line: 3487, baseType: !897, size: 32, align: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !968, file: !35, line: 3488, baseType: !976, size: 64, align: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !979, line: 61, baseType: !980)
!979 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !979, line: 58, size: 64, align: 32, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !980, file: !979, line: 59, baseType: !897, size: 32, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !980, file: !979, line: 60, baseType: !897, size: 32, align: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !968, file: !35, line: 3489, baseType: !985, size: 64, align: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !968, file: !35, line: 3490, baseType: !988, size: 64, align: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !968, file: !35, line: 3491, baseType: !991, size: 64, align: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !968, file: !35, line: 3492, baseType: !994, size: 64, align: 64, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !900, line: 55, baseType: !997)
!997 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !968, file: !35, line: 3493, baseType: !999, size: 8, align: 8, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !900, line: 48, baseType: !1000)
!1000 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !968, file: !35, line: 3494, baseType: !919, size: 64, align: 64, offset: 640)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !968, file: !35, line: 3495, baseType: !1003, size: 64, align: 64, offset: 704)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1006, file: !35, line: 3402, baseType: !897, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !35, line: 3403, baseType: !925, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !968, file: !35, line: 3507, baseType: !925, size: 64, align: 64, offset: 768)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !968, file: !35, line: 3516, baseType: !897, size: 32, align: 32, offset: 832)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !968, file: !35, line: 3517, baseType: !1013, size: 64, align: 64, offset: 896)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !968, file: !35, line: 3527, baseType: !1015, size: 64, align: 64, offset: 960)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!897, !914}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !968, file: !35, line: 3535, baseType: !1019, size: 64, align: 64, offset: 1024)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!897, !914, !1022}
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !968, file: !35, line: 3541, baseType: !1025, size: 64, align: 64, offset: 1088)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1028)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !968, file: !35, line: 3549, baseType: !1030, size: 64, align: 64, offset: 1152)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{null, !1013}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !968, file: !35, line: 3551, baseType: !1015, size: 64, align: 64, offset: 1216)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !968, file: !35, line: 3552, baseType: !1035, size: 64, align: 64, offset: 1280)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!897, !914, !1038, !897, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1042)
!1042 = !{!1043, !1046, !1048, !1049, !1050, !1082}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1041, file: !35, line: 3921, baseType: !1044, size: 16, align: 16)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !900, line: 49, baseType: !1045)
!1045 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1041, file: !35, line: 3922, baseType: !1047, size: 32, align: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !900, line: 51, baseType: !898)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1041, file: !35, line: 3923, baseType: !1047, size: 32, align: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1041, file: !35, line: 3924, baseType: !898, size: 32, align: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1041, file: !35, line: 3925, baseType: !1051, size: 64, align: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1071, !1075, !1077, !1078, !1080, !1081}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1054, file: !35, line: 3886, baseType: !897, size: 32, align: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1054, file: !35, line: 3887, baseType: !897, size: 32, align: 32, offset: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1054, file: !35, line: 3888, baseType: !897, size: 32, align: 32, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1054, file: !35, line: 3889, baseType: !897, size: 32, align: 32, offset: 96)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1054, file: !35, line: 3890, baseType: !897, size: 32, align: 32, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1054, file: !35, line: 3897, baseType: !1062, size: 768, align: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1064)
!1064 = !{!1065, !1069}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1063, file: !35, line: 3855, baseType: !1066, size: 512, align: 64)
!1066 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 512, align: 64, elements: !1067)
!1067 = !{!1068}
!1068 = !DISubrange(count: 8)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1063, file: !35, line: 3857, baseType: !1070, size: 256, align: 32, offset: 512)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 256, align: 32, elements: !1067)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1054, file: !35, line: 3903, baseType: !1072, size: 256, align: 64, offset: 960)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 256, align: 64, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 4)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1054, file: !35, line: 3904, baseType: !1076, size: 128, align: 32, offset: 1216)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 128, align: 32, elements: !1073)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1054, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1054, file: !35, line: 3908, baseType: !1079, size: 64, align: 64, offset: 1408)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1054, file: !35, line: 3915, baseType: !1079, size: 64, align: 64, offset: 1472)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1054, file: !35, line: 3917, baseType: !897, size: 32, align: 32, offset: 1536)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1041, file: !35, line: 3926, baseType: !899, size: 64, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !968, file: !35, line: 3564, baseType: !1084, size: 64, align: 64, offset: 1344)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!897, !914, !1087, !1121, !1203}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1090)
!1090 = !{!1091, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1117, !1118, !1119, !1120}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1089, file: !35, line: 1451, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1094, line: 94, baseType: !1095)
!1094 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1094, line: 81, size: 192, align: 64, elements: !1096)
!1096 = !{!1097, !1101, !1102}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1095, file: !1094, line: 82, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1094, line: 73, baseType: !1100)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1094, line: 73, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1095, file: !1094, line: 89, baseType: !1038, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1095, file: !1094, line: 93, baseType: !897, size: 32, align: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1089, file: !35, line: 1461, baseType: !899, size: 64, align: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1089, file: !35, line: 1467, baseType: !899, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !35, line: 1468, baseType: !1038, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !35, line: 1469, baseType: !897, size: 32, align: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1089, file: !35, line: 1470, baseType: !897, size: 32, align: 32, offset: 288)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !35, line: 1474, baseType: !897, size: 32, align: 32, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1089, file: !35, line: 1479, baseType: !1110, size: 64, align: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !35, line: 1412, baseType: !1038, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !35, line: 1413, baseType: !897, size: 32, align: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1112, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1089, file: !35, line: 1480, baseType: !897, size: 32, align: 32, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1089, file: !35, line: 1486, baseType: !899, size: 64, align: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1089, file: !35, line: 1488, baseType: !899, size: 64, align: 64, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1089, file: !35, line: 1497, baseType: !899, size: 64, align: 64, offset: 640)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1155, !1157, !1158, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1191, !1192, !1193, !1194, !1195, !1196, !1199, !1200, !1201, !1202}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !758, line: 282, baseType: !1066, size: 512, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1124, file: !758, line: 299, baseType: !1070, size: 256, align: 32, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1124, file: !758, line: 315, baseType: !1129, size: 64, align: 64, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1124, file: !758, line: 326, baseType: !897, size: 32, align: 32, offset: 832)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1124, file: !758, line: 326, baseType: !897, size: 32, align: 32, offset: 864)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1124, file: !758, line: 334, baseType: !897, size: 32, align: 32, offset: 896)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1124, file: !758, line: 341, baseType: !897, size: 32, align: 32, offset: 928)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1124, file: !758, line: 346, baseType: !897, size: 32, align: 32, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1124, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1124, file: !758, line: 356, baseType: !978, size: 64, align: 32, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1124, file: !758, line: 361, baseType: !899, size: 64, align: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1124, file: !758, line: 369, baseType: !899, size: 64, align: 64, offset: 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1124, file: !758, line: 377, baseType: !899, size: 64, align: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1124, file: !758, line: 382, baseType: !897, size: 32, align: 32, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1124, file: !758, line: 386, baseType: !897, size: 32, align: 32, offset: 1312)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1124, file: !758, line: 391, baseType: !897, size: 32, align: 32, offset: 1344)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1124, file: !758, line: 396, baseType: !932, size: 64, align: 64, offset: 1408)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1124, file: !758, line: 403, baseType: !1145, size: 512, align: 64, offset: 1472)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 512, align: 64, elements: !1067)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1124, file: !758, line: 410, baseType: !897, size: 32, align: 32, offset: 1984)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1124, file: !758, line: 415, baseType: !897, size: 32, align: 32, offset: 2016)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1124, file: !758, line: 420, baseType: !897, size: 32, align: 32, offset: 2048)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1124, file: !758, line: 425, baseType: !897, size: 32, align: 32, offset: 2080)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1124, file: !758, line: 435, baseType: !899, size: 64, align: 64, offset: 2112)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1124, file: !758, line: 440, baseType: !897, size: 32, align: 32, offset: 2176)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1124, file: !758, line: 445, baseType: !996, size: 64, align: 64, offset: 2240)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1124, file: !758, line: 459, baseType: !1154, size: 512, align: 64, offset: 2304)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 512, align: 64, elements: !1067)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1124, file: !758, line: 473, baseType: !1156, size: 64, align: 64, offset: 2816)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1124, file: !758, line: 477, baseType: !897, size: 32, align: 32, offset: 2880)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1124, file: !758, line: 479, baseType: !1159, size: 64, align: 64, offset: 2944)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1172}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1162, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !758, line: 203, baseType: !1038, size: 64, align: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !758, line: 204, baseType: !897, size: 32, align: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1162, file: !758, line: 205, baseType: !1168, size: 64, align: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1170, line: 86, baseType: !1171)
!1170 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1170, line: 86, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1162, file: !758, line: 206, baseType: !1092, size: 64, align: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1124, file: !758, line: 480, baseType: !897, size: 32, align: 32, offset: 3008)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1124, file: !758, line: 505, baseType: !897, size: 32, align: 32, offset: 3040)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1124, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1124, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1124, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1124, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1124, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1124, file: !758, line: 532, baseType: !899, size: 64, align: 64, offset: 3264)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1124, file: !758, line: 539, baseType: !899, size: 64, align: 64, offset: 3328)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1124, file: !758, line: 547, baseType: !899, size: 64, align: 64, offset: 3392)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1124, file: !758, line: 554, baseType: !1168, size: 64, align: 64, offset: 3456)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1124, file: !758, line: 563, baseType: !897, size: 32, align: 32, offset: 3520)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1124, file: !758, line: 572, baseType: !897, size: 32, align: 32, offset: 3552)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1124, file: !758, line: 581, baseType: !897, size: 32, align: 32, offset: 3584)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1124, file: !758, line: 588, baseType: !1188, size: 64, align: 64, offset: 3648)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !900, line: 36, baseType: !1190)
!1190 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1124, file: !758, line: 593, baseType: !897, size: 32, align: 32, offset: 3712)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1124, file: !758, line: 596, baseType: !897, size: 32, align: 32, offset: 3744)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1124, file: !758, line: 599, baseType: !1092, size: 64, align: 64, offset: 3776)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1124, file: !758, line: 605, baseType: !1092, size: 64, align: 64, offset: 3840)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1124, file: !758, line: 616, baseType: !1092, size: 64, align: 64, offset: 3904)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1124, file: !758, line: 626, baseType: !1197, size: 64, align: 64, offset: 3968)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1198, line: 216, baseType: !997)
!1198 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1124, file: !758, line: 627, baseType: !1197, size: 64, align: 64, offset: 4032)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1124, file: !758, line: 628, baseType: !1197, size: 64, align: 64, offset: 4096)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1124, file: !758, line: 629, baseType: !1197, size: 64, align: 64, offset: 4160)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1124, file: !758, line: 645, baseType: !1092, size: 64, align: 64, offset: 4224)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !968, file: !35, line: 3566, baseType: !1205, size: 64, align: 64, offset: 1408)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!897, !914, !932, !1203, !1087}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !968, file: !35, line: 3567, baseType: !1015, size: 64, align: 64, offset: 1472)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !968, file: !35, line: 3576, baseType: !1210, size: 64, align: 64, offset: 1536)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!897, !914, !1121}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !968, file: !35, line: 3577, baseType: !1214, size: 64, align: 64, offset: 1600)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!897, !914, !1087}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !968, file: !35, line: 3584, baseType: !1218, size: 64, align: 64, offset: 1664)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!897, !914, !1221}
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !968, file: !35, line: 3589, baseType: !1223, size: 64, align: 64, offset: 1728)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{null, !914}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !968, file: !35, line: 3594, baseType: !897, size: 32, align: 32, offset: 1792)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !968, file: !35, line: 3600, baseType: !925, size: 64, align: 64, offset: 1856)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !968, file: !35, line: 3609, baseType: !1229, size: 64, align: 64, offset: 1920)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1232)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !916, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !916, file: !35, line: 1581, baseType: !898, size: 32, align: 32, offset: 224)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !916, file: !35, line: 1583, baseType: !932, size: 64, align: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !916, file: !35, line: 1591, baseType: !1237, size: 64, align: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !916, file: !35, line: 1598, baseType: !932, size: 64, align: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !916, file: !35, line: 1606, baseType: !899, size: 64, align: 64, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !916, file: !35, line: 1614, baseType: !897, size: 32, align: 32, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !916, file: !35, line: 1622, baseType: !897, size: 32, align: 32, offset: 544)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !916, file: !35, line: 1628, baseType: !897, size: 32, align: 32, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !916, file: !35, line: 1636, baseType: !897, size: 32, align: 32, offset: 608)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !916, file: !35, line: 1643, baseType: !897, size: 32, align: 32, offset: 640)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !916, file: !35, line: 1657, baseType: !1038, size: 64, align: 64, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !916, file: !35, line: 1658, baseType: !897, size: 32, align: 32, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !916, file: !35, line: 1679, baseType: !978, size: 64, align: 32, offset: 800)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !916, file: !35, line: 1688, baseType: !897, size: 32, align: 32, offset: 864)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !916, file: !35, line: 1712, baseType: !897, size: 32, align: 32, offset: 896)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !916, file: !35, line: 1729, baseType: !897, size: 32, align: 32, offset: 928)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !916, file: !35, line: 1729, baseType: !897, size: 32, align: 32, offset: 960)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !916, file: !35, line: 1744, baseType: !897, size: 32, align: 32, offset: 992)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !916, file: !35, line: 1744, baseType: !897, size: 32, align: 32, offset: 1024)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !916, file: !35, line: 1751, baseType: !897, size: 32, align: 32, offset: 1056)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !916, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !916, file: !35, line: 1791, baseType: !1258, size: 64, align: 64, offset: 1152)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !1261, !1121, !1203, !897, !897, !897}
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !916, file: !35, line: 1808, baseType: !1263, size: 64, align: 64, offset: 1216)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!494, !1261, !985}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !916, file: !35, line: 1816, baseType: !897, size: 32, align: 32, offset: 1280)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !916, file: !35, line: 1825, baseType: !1268, size: 32, align: 32, offset: 1312)
!1268 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !916, file: !35, line: 1830, baseType: !897, size: 32, align: 32, offset: 1344)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !916, file: !35, line: 1838, baseType: !1268, size: 32, align: 32, offset: 1376)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !916, file: !35, line: 1846, baseType: !897, size: 32, align: 32, offset: 1408)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !916, file: !35, line: 1851, baseType: !897, size: 32, align: 32, offset: 1440)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !916, file: !35, line: 1861, baseType: !1268, size: 32, align: 32, offset: 1472)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !916, file: !35, line: 1868, baseType: !1268, size: 32, align: 32, offset: 1504)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !916, file: !35, line: 1875, baseType: !1268, size: 32, align: 32, offset: 1536)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !916, file: !35, line: 1882, baseType: !1268, size: 32, align: 32, offset: 1568)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !916, file: !35, line: 1889, baseType: !1268, size: 32, align: 32, offset: 1600)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !916, file: !35, line: 1896, baseType: !1268, size: 32, align: 32, offset: 1632)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !916, file: !35, line: 1903, baseType: !1268, size: 32, align: 32, offset: 1664)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !916, file: !35, line: 1910, baseType: !897, size: 32, align: 32, offset: 1696)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !916, file: !35, line: 1915, baseType: !897, size: 32, align: 32, offset: 1728)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !916, file: !35, line: 1926, baseType: !1203, size: 64, align: 64, offset: 1792)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !916, file: !35, line: 1935, baseType: !978, size: 64, align: 32, offset: 1856)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !916, file: !35, line: 1942, baseType: !897, size: 32, align: 32, offset: 1920)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !916, file: !35, line: 1948, baseType: !897, size: 32, align: 32, offset: 1952)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !916, file: !35, line: 1954, baseType: !897, size: 32, align: 32, offset: 1984)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !916, file: !35, line: 1960, baseType: !897, size: 32, align: 32, offset: 2016)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !916, file: !35, line: 1984, baseType: !897, size: 32, align: 32, offset: 2048)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !916, file: !35, line: 1991, baseType: !897, size: 32, align: 32, offset: 2080)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !916, file: !35, line: 1996, baseType: !897, size: 32, align: 32, offset: 2112)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !916, file: !35, line: 2004, baseType: !897, size: 32, align: 32, offset: 2144)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !916, file: !35, line: 2011, baseType: !897, size: 32, align: 32, offset: 2176)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !916, file: !35, line: 2018, baseType: !897, size: 32, align: 32, offset: 2208)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !916, file: !35, line: 2027, baseType: !897, size: 32, align: 32, offset: 2240)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !916, file: !35, line: 2034, baseType: !897, size: 32, align: 32, offset: 2272)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !916, file: !35, line: 2044, baseType: !897, size: 32, align: 32, offset: 2304)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !916, file: !35, line: 2054, baseType: !1298, size: 64, align: 64, offset: 2368)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !916, file: !35, line: 2061, baseType: !1298, size: 64, align: 64, offset: 2432)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !916, file: !35, line: 2066, baseType: !897, size: 32, align: 32, offset: 2496)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !916, file: !35, line: 2070, baseType: !897, size: 32, align: 32, offset: 2528)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !916, file: !35, line: 2078, baseType: !897, size: 32, align: 32, offset: 2560)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !916, file: !35, line: 2085, baseType: !897, size: 32, align: 32, offset: 2592)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !916, file: !35, line: 2092, baseType: !897, size: 32, align: 32, offset: 2624)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !916, file: !35, line: 2099, baseType: !897, size: 32, align: 32, offset: 2656)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !916, file: !35, line: 2106, baseType: !897, size: 32, align: 32, offset: 2688)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !916, file: !35, line: 2113, baseType: !897, size: 32, align: 32, offset: 2720)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !916, file: !35, line: 2120, baseType: !897, size: 32, align: 32, offset: 2752)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !916, file: !35, line: 2125, baseType: !897, size: 32, align: 32, offset: 2784)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !916, file: !35, line: 2133, baseType: !897, size: 32, align: 32, offset: 2816)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !916, file: !35, line: 2140, baseType: !897, size: 32, align: 32, offset: 2848)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !916, file: !35, line: 2145, baseType: !897, size: 32, align: 32, offset: 2880)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !916, file: !35, line: 2153, baseType: !897, size: 32, align: 32, offset: 2912)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !916, file: !35, line: 2158, baseType: !897, size: 32, align: 32, offset: 2944)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !916, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !916, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !916, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !916, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !916, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !916, file: !35, line: 2203, baseType: !897, size: 32, align: 32, offset: 3136)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !916, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !916, file: !35, line: 2212, baseType: !897, size: 32, align: 32, offset: 3200)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !916, file: !35, line: 2213, baseType: !897, size: 32, align: 32, offset: 3232)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !916, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !916, file: !35, line: 2232, baseType: !897, size: 32, align: 32, offset: 3296)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !916, file: !35, line: 2243, baseType: !897, size: 32, align: 32, offset: 3328)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !916, file: !35, line: 2249, baseType: !897, size: 32, align: 32, offset: 3360)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !916, file: !35, line: 2256, baseType: !897, size: 32, align: 32, offset: 3392)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !916, file: !35, line: 2263, baseType: !996, size: 64, align: 64, offset: 3456)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !916, file: !35, line: 2270, baseType: !996, size: 64, align: 64, offset: 3520)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !916, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !916, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !916, file: !35, line: 2367, baseType: !1334, size: 64, align: 64, offset: 3648)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!897, !1261, !1221, !897}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !916, file: !35, line: 2383, baseType: !897, size: 32, align: 32, offset: 3712)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !916, file: !35, line: 2386, baseType: !1268, size: 32, align: 32, offset: 3744)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !916, file: !35, line: 2387, baseType: !1268, size: 32, align: 32, offset: 3776)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !916, file: !35, line: 2394, baseType: !897, size: 32, align: 32, offset: 3808)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !916, file: !35, line: 2401, baseType: !897, size: 32, align: 32, offset: 3840)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !916, file: !35, line: 2408, baseType: !897, size: 32, align: 32, offset: 3872)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !916, file: !35, line: 2415, baseType: !897, size: 32, align: 32, offset: 3904)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !916, file: !35, line: 2422, baseType: !897, size: 32, align: 32, offset: 3936)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !916, file: !35, line: 2423, baseType: !1346, size: 64, align: 64, offset: 3968)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1349)
!1349 = !{!1350, !1351, !1352, !1353}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1348, file: !35, line: 827, baseType: !897, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1348, file: !35, line: 828, baseType: !897, size: 32, align: 32, offset: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1348, file: !35, line: 829, baseType: !897, size: 32, align: 32, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1348, file: !35, line: 830, baseType: !1268, size: 32, align: 32, offset: 96)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !916, file: !35, line: 2430, baseType: !899, size: 64, align: 64, offset: 4032)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !916, file: !35, line: 2437, baseType: !899, size: 64, align: 64, offset: 4096)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !916, file: !35, line: 2444, baseType: !1268, size: 32, align: 32, offset: 4160)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !916, file: !35, line: 2451, baseType: !1268, size: 32, align: 32, offset: 4192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !916, file: !35, line: 2458, baseType: !897, size: 32, align: 32, offset: 4224)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !916, file: !35, line: 2469, baseType: !897, size: 32, align: 32, offset: 4256)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !916, file: !35, line: 2475, baseType: !897, size: 32, align: 32, offset: 4288)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !916, file: !35, line: 2481, baseType: !897, size: 32, align: 32, offset: 4320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !916, file: !35, line: 2485, baseType: !897, size: 32, align: 32, offset: 4352)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !916, file: !35, line: 2489, baseType: !897, size: 32, align: 32, offset: 4384)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !916, file: !35, line: 2493, baseType: !897, size: 32, align: 32, offset: 4416)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !916, file: !35, line: 2501, baseType: !897, size: 32, align: 32, offset: 4448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !916, file: !35, line: 2506, baseType: !897, size: 32, align: 32, offset: 4480)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !916, file: !35, line: 2510, baseType: !897, size: 32, align: 32, offset: 4512)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !916, file: !35, line: 2514, baseType: !899, size: 64, align: 64, offset: 4544)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !916, file: !35, line: 2528, baseType: !1370, size: 64, align: 64, offset: 4608)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{null, !1261, !932, !897, !897}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !916, file: !35, line: 2534, baseType: !897, size: 32, align: 32, offset: 4672)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !916, file: !35, line: 2545, baseType: !897, size: 32, align: 32, offset: 4704)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !916, file: !35, line: 2547, baseType: !897, size: 32, align: 32, offset: 4736)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !916, file: !35, line: 2549, baseType: !897, size: 32, align: 32, offset: 4768)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !916, file: !35, line: 2551, baseType: !897, size: 32, align: 32, offset: 4800)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !916, file: !35, line: 2553, baseType: !897, size: 32, align: 32, offset: 4832)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !916, file: !35, line: 2555, baseType: !897, size: 32, align: 32, offset: 4864)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !916, file: !35, line: 2557, baseType: !897, size: 32, align: 32, offset: 4896)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !916, file: !35, line: 2559, baseType: !897, size: 32, align: 32, offset: 4928)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !916, file: !35, line: 2563, baseType: !897, size: 32, align: 32, offset: 4960)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !916, file: !35, line: 2571, baseType: !1079, size: 64, align: 64, offset: 4992)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !916, file: !35, line: 2579, baseType: !1079, size: 64, align: 64, offset: 5056)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !916, file: !35, line: 2586, baseType: !897, size: 32, align: 32, offset: 5120)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !916, file: !35, line: 2615, baseType: !897, size: 32, align: 32, offset: 5152)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !916, file: !35, line: 2627, baseType: !897, size: 32, align: 32, offset: 5184)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !916, file: !35, line: 2637, baseType: !897, size: 32, align: 32, offset: 5216)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !916, file: !35, line: 2681, baseType: !897, size: 32, align: 32, offset: 5248)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !916, file: !35, line: 2709, baseType: !899, size: 64, align: 64, offset: 5312)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !916, file: !35, line: 2716, baseType: !1392, size: 64, align: 64, offset: 5376)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399, !1400, !1401, !1402, !1408, !1412, !1413, !1414, !1415, !1421, !1422, !1423, !1424, !1425}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1394, file: !35, line: 3642, baseType: !925, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1394, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1394, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1394, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1394, file: !35, line: 3669, baseType: !897, size: 32, align: 32, offset: 160)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1394, file: !35, line: 3682, baseType: !1218, size: 64, align: 64, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1394, file: !35, line: 3698, baseType: !1403, size: 64, align: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!897, !914, !1406, !1047}
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1394, file: !35, line: 3712, baseType: !1409, size: 64, align: 64, offset: 320)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!897, !914, !897, !1406, !1047}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1394, file: !35, line: 3726, baseType: !1403, size: 64, align: 64, offset: 384)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1394, file: !35, line: 3737, baseType: !1015, size: 64, align: 64, offset: 448)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1394, file: !35, line: 3746, baseType: !897, size: 32, align: 32, offset: 512)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1394, file: !35, line: 3757, baseType: !1416, size: 64, align: 64, offset: 576)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{null, !1419}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1394, file: !35, line: 3766, baseType: !1015, size: 64, align: 64, offset: 640)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1394, file: !35, line: 3774, baseType: !1015, size: 64, align: 64, offset: 704)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1394, file: !35, line: 3780, baseType: !897, size: 32, align: 32, offset: 768)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1394, file: !35, line: 3785, baseType: !897, size: 32, align: 32, offset: 800)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1394, file: !35, line: 3795, baseType: !1426, size: 64, align: 64, offset: 832)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!897, !914, !1092}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !916, file: !35, line: 2728, baseType: !932, size: 64, align: 64, offset: 5440)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !916, file: !35, line: 2735, baseType: !1145, size: 512, align: 64, offset: 5504)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !916, file: !35, line: 2742, baseType: !897, size: 32, align: 32, offset: 6016)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !916, file: !35, line: 2755, baseType: !897, size: 32, align: 32, offset: 6048)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !916, file: !35, line: 2776, baseType: !897, size: 32, align: 32, offset: 6080)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !916, file: !35, line: 2783, baseType: !897, size: 32, align: 32, offset: 6112)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !916, file: !35, line: 2791, baseType: !897, size: 32, align: 32, offset: 6144)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !916, file: !35, line: 2802, baseType: !1221, size: 64, align: 64, offset: 6208)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !916, file: !35, line: 2811, baseType: !897, size: 32, align: 32, offset: 6272)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !916, file: !35, line: 2821, baseType: !897, size: 32, align: 32, offset: 6304)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !916, file: !35, line: 2830, baseType: !897, size: 32, align: 32, offset: 6336)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !916, file: !35, line: 2840, baseType: !897, size: 32, align: 32, offset: 6368)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !916, file: !35, line: 2851, baseType: !1442, size: 64, align: 64, offset: 6400)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!897, !1261, !1445, !932, !1203, !897, !897}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!897, !1261, !932}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !916, file: !35, line: 2871, baseType: !1449, size: 64, align: 64, offset: 6464)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!897, !1261, !1452, !932, !1203, !897}
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!897, !1261, !932, !897, !897}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !916, file: !35, line: 2878, baseType: !897, size: 32, align: 32, offset: 6528)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !916, file: !35, line: 2885, baseType: !897, size: 32, align: 32, offset: 6560)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !916, file: !35, line: 3005, baseType: !897, size: 32, align: 32, offset: 6592)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !916, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !916, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !916, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !916, file: !35, line: 3037, baseType: !1038, size: 64, align: 64, offset: 6720)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !916, file: !35, line: 3038, baseType: !897, size: 32, align: 32, offset: 6784)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !916, file: !35, line: 3050, baseType: !996, size: 64, align: 64, offset: 6848)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !916, file: !35, line: 3065, baseType: !897, size: 32, align: 32, offset: 6912)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !916, file: !35, line: 3083, baseType: !897, size: 32, align: 32, offset: 6944)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !916, file: !35, line: 3092, baseType: !978, size: 64, align: 32, offset: 6976)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !916, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !916, file: !35, line: 3106, baseType: !978, size: 64, align: 32, offset: 7072)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !916, file: !35, line: 3113, baseType: !1470, size: 64, align: 64, offset: 7168)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1472)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1478, !1479, !1480, !1483}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1473, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1473, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1473, file: !35, line: 720, baseType: !925, size: 64, align: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1473, file: !35, line: 724, baseType: !925, size: 64, align: 64, offset: 128)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1473, file: !35, line: 728, baseType: !897, size: 32, align: 32, offset: 192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1473, file: !35, line: 734, baseType: !1481, size: 64, align: 64, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1473, file: !35, line: 739, baseType: !1484, size: 64, align: 64, offset: 320)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !916, file: !35, line: 3129, baseType: !899, size: 64, align: 64, offset: 7232)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !916, file: !35, line: 3130, baseType: !899, size: 64, align: 64, offset: 7296)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !916, file: !35, line: 3131, baseType: !899, size: 64, align: 64, offset: 7360)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !916, file: !35, line: 3132, baseType: !899, size: 64, align: 64, offset: 7424)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !916, file: !35, line: 3139, baseType: !1079, size: 64, align: 64, offset: 7488)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !916, file: !35, line: 3147, baseType: !897, size: 32, align: 32, offset: 7552)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !916, file: !35, line: 3165, baseType: !897, size: 32, align: 32, offset: 7584)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !916, file: !35, line: 3172, baseType: !897, size: 32, align: 32, offset: 7616)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !916, file: !35, line: 3180, baseType: !897, size: 32, align: 32, offset: 7648)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !916, file: !35, line: 3191, baseType: !1298, size: 64, align: 64, offset: 7680)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !916, file: !35, line: 3199, baseType: !1038, size: 64, align: 64, offset: 7744)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !916, file: !35, line: 3207, baseType: !1079, size: 64, align: 64, offset: 7808)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !916, file: !35, line: 3214, baseType: !898, size: 32, align: 32, offset: 7872)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !916, file: !35, line: 3224, baseType: !1110, size: 64, align: 64, offset: 7936)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !916, file: !35, line: 3225, baseType: !897, size: 32, align: 32, offset: 8000)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !916, file: !35, line: 3249, baseType: !1092, size: 64, align: 64, offset: 8064)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !916, file: !35, line: 3256, baseType: !897, size: 32, align: 32, offset: 8128)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !916, file: !35, line: 3271, baseType: !897, size: 32, align: 32, offset: 8160)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !916, file: !35, line: 3279, baseType: !899, size: 64, align: 64, offset: 8192)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !916, file: !35, line: 3301, baseType: !1092, size: 64, align: 64, offset: 8256)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !916, file: !35, line: 3310, baseType: !897, size: 32, align: 32, offset: 8320)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !916, file: !35, line: 3337, baseType: !897, size: 32, align: 32, offset: 8352)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !916, file: !35, line: 3351, baseType: !897, size: 32, align: 32, offset: 8384)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !916, file: !35, line: 3359, baseType: !897, size: 32, align: 32, offset: 8416)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "output_channels", scope: !911, file: !906, line: 47, baseType: !897, size: 32, align: 32, offset: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "midonly", scope: !911, file: !906, line: 49, baseType: !897, size: 32, align: 32, offset: 96)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "subframes", scope: !911, file: !906, line: 50, baseType: !897, size: 32, align: 32, offset: 128)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sflength", scope: !911, file: !906, line: 51, baseType: !897, size: 32, align: 32, offset: 160)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "flength", scope: !911, file: !906, line: 52, baseType: !897, size: 32, align: 32, offset: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "nlsf_interp_factor", scope: !911, file: !906, line: 53, baseType: !897, size: 32, align: 32, offset: 224)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "bandwidth", scope: !911, file: !906, line: 55, baseType: !887, size: 32, align: 32, offset: 256)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "wb", scope: !911, file: !906, line: 56, baseType: !897, size: 32, align: 32, offset: 288)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !911, file: !906, line: 58, baseType: !1519, size: 84224, align: 32, offset: 320)
!1519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1520, size: 84224, align: 32, elements: !1540)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "SilkFrame", file: !906, line: 43, baseType: !1521)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SilkFrame", file: !906, line: 32, size: 42112, align: 32, elements: !1522)
!1522 = !{!1523, !1524, !1525, !1531, !1533, !1537, !1538, !1539}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "coded", scope: !1521, file: !906, line: 33, baseType: !897, size: 32, align: 32)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "log_gain", scope: !1521, file: !906, line: 34, baseType: !897, size: 32, align: 32, offset: 32)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "nlsf", scope: !1521, file: !906, line: 35, baseType: !1526, size: 256, align: 16, offset: 64)
!1526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1527, size: 256, align: 16, elements: !1529)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !900, line: 37, baseType: !1528)
!1528 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1529 = !{!1530}
!1530 = !DISubrange(count: 16)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "lpc", scope: !1521, file: !906, line: 36, baseType: !1532, size: 512, align: 32, offset: 320)
!1532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1268, size: 512, align: 32, elements: !1529)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !1521, file: !906, line: 38, baseType: !1534, size: 20608, align: 32, offset: 832)
!1534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1268, size: 20608, align: 32, elements: !1535)
!1535 = !{!1536}
!1536 = !DISubrange(count: 644)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "lpc_history", scope: !1521, file: !906, line: 39, baseType: !1534, size: 20608, align: 32, offset: 21440)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "primarylag", scope: !1521, file: !906, line: 40, baseType: !897, size: 32, align: 32, offset: 42048)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "prev_voiced", scope: !1521, file: !906, line: 42, baseType: !897, size: 32, align: 32, offset: 42080)
!1540 = !{!1541}
!1541 = !DISubrange(count: 2)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "prev_stereo_weights", scope: !911, file: !906, line: 59, baseType: !1543, size: 64, align: 32, offset: 84544)
!1543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1268, size: 64, align: 32, elements: !1540)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "stereo_weights", scope: !911, file: !906, line: 60, baseType: !1543, size: 64, align: 32, offset: 84608)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "prev_coded_channels", scope: !911, file: !906, line: 62, baseType: !897, size: 32, align: 32, offset: 84672)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpusRangeCoder", file: !1548, line: 55, baseType: !1549)
!1548 = !DIFile(filename: "libavcodec/opus_rc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpusRangeCoder", file: !1548, line: 40, size: 11072, align: 64, elements: !1550)
!1550 = !{!1551, !1561, !1569, !1570, !1571, !1572, !1576, !1577, !1578, !1579}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1549, file: !1548, line: 41, baseType: !1552, size: 256, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1553, line: 70, baseType: !1554)
!1553 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1553, line: 61, size: 256, align: 64, elements: !1555)
!1555 = !{!1556, !1557, !1558, !1559, !1560}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1554, file: !1553, line: 62, baseType: !1406, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1554, file: !1553, line: 62, baseType: !1406, size: 64, align: 64, offset: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1554, file: !1553, line: 67, baseType: !897, size: 32, align: 32, offset: 128)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1554, file: !1553, line: 68, baseType: !897, size: 32, align: 32, offset: 160)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1554, file: !1553, line: 69, baseType: !897, size: 32, align: 32, offset: 192)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !1549, file: !1548, line: 42, baseType: !1562, size: 192, align: 64, offset: 256)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "RawBitsContext", file: !1548, line: 38, baseType: !1563)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawBitsContext", file: !1548, line: 33, size: 192, align: 64, elements: !1564)
!1564 = !{!1565, !1566, !1567, !1568}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !1563, file: !1548, line: 34, baseType: !1406, size: 64, align: 64)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !1563, file: !1548, line: 35, baseType: !1047, size: 32, align: 32, offset: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "cachelen", scope: !1563, file: !1548, line: 36, baseType: !1047, size: 32, align: 32, offset: 96)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "cacheval", scope: !1563, file: !1548, line: 37, baseType: !1047, size: 32, align: 32, offset: 128)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1549, file: !1548, line: 43, baseType: !1047, size: 32, align: 32, offset: 448)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1549, file: !1548, line: 44, baseType: !1047, size: 32, align: 32, offset: 480)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "total_bits", scope: !1549, file: !1548, line: 45, baseType: !1047, size: 32, align: 32, offset: 512)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1549, file: !1548, line: 48, baseType: !1573, size: 10296, align: 8, offset: 544)
!1573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 10296, align: 8, elements: !1574)
!1574 = !{!1575}
!1575 = !DISubrange(count: 1287)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "rng_cur", scope: !1549, file: !1548, line: 49, baseType: !1038, size: 64, align: 64, offset: 10880)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "ext", scope: !1549, file: !1548, line: 50, baseType: !897, size: 32, align: 32, offset: 10944)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !1549, file: !1548, line: 51, baseType: !897, size: 32, align: 32, offset: 10976)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "waste", scope: !1549, file: !1548, line: 54, baseType: !897, size: 32, align: 32, offset: 11008)
!1580 = !{}
!1581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1582, size: 192, align: 64, elements: !1585)
!1582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1583)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1585 = !{!1586}
!1586 = !DISubrange(count: 3)
!1587 = distinct !DIGlobalVariable(name: "filter_sel", scope: !905, file: !906, line: 645, type: !1581, isLocal: true, isDefinition: true, variable: [3 x i16*]* @silk_decode_frame.filter_sel)
!1588 = distinct !DIGlobalVariable(name: "filter_taps", scope: !905, file: !906, line: 649, type: !1589, isLocal: true, isDefinition: true, variable: [3 x [5 x i8]*]* @silk_decode_frame.filter_taps)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1590, size: 192, align: 64, elements: !1585)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1591)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1593, size: 40, align: 8, elements: !1594)
!1593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1189)
!1594 = !{!1595}
!1595 = !DISubrange(count: 5)
!1596 = !{i32 2, !"Dwarf Version", i32 4}
!1597 = !{i32 2, !"Debug Info Version", i32 3}
!1598 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1599 = distinct !DISubprogram(name: "ff_silk_decode_superframe", scope: !906, file: !906, line: 783, type: !1600, isLocal: false, isDefinition: true, scopeLine: 788, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1580)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!897, !909, !1546, !1602, !887, !897, !897}
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1604 = !DILocalVariable(name: "s", arg: 1, scope: !1599, file: !906, line: 783, type: !909)
!1605 = !DIExpression()
!1606 = !DILocation(line: 783, column: 44, scope: !1599)
!1607 = !DILocalVariable(name: "rc", arg: 2, scope: !1599, file: !906, line: 783, type: !1546)
!1608 = !DILocation(line: 783, column: 63, scope: !1599)
!1609 = !DILocalVariable(name: "output", arg: 3, scope: !1599, file: !906, line: 784, type: !1602)
!1610 = !DILocation(line: 784, column: 38, scope: !1599)
!1611 = !DILocalVariable(name: "bandwidth", arg: 4, scope: !1599, file: !906, line: 785, type: !887)
!1612 = !DILocation(line: 785, column: 50, scope: !1599)
!1613 = !DILocalVariable(name: "coded_channels", arg: 5, scope: !1599, file: !906, line: 786, type: !897)
!1614 = !DILocation(line: 786, column: 35, scope: !1599)
!1615 = !DILocalVariable(name: "duration_ms", arg: 6, scope: !1599, file: !906, line: 787, type: !897)
!1616 = !DILocation(line: 787, column: 35, scope: !1599)
!1617 = !DILocalVariable(name: "active", scope: !1599, file: !906, line: 789, type: !1618)
!1618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 384, align: 32, elements: !1619)
!1619 = !{!1541, !1620}
!1620 = !DISubrange(count: 6)
!1621 = !DILocation(line: 789, column: 9, scope: !1599)
!1622 = !DILocalVariable(name: "redundancy", scope: !1599, file: !906, line: 789, type: !1623)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 64, align: 32, elements: !1540)
!1624 = !DILocation(line: 789, column: 23, scope: !1599)
!1625 = !DILocalVariable(name: "nb_frames", scope: !1599, file: !906, line: 790, type: !897)
!1626 = !DILocation(line: 790, column: 9, scope: !1599)
!1627 = !DILocalVariable(name: "i", scope: !1599, file: !906, line: 790, type: !897)
!1628 = !DILocation(line: 790, column: 20, scope: !1599)
!1629 = !DILocalVariable(name: "j", scope: !1599, file: !906, line: 790, type: !897)
!1630 = !DILocation(line: 790, column: 23, scope: !1599)
!1631 = !DILocation(line: 792, column: 9, scope: !1632)
!1632 = distinct !DILexicalBlock(scope: !1599, file: !906, line: 792, column: 9)
!1633 = !DILocation(line: 792, column: 19, scope: !1632)
!1634 = !DILocation(line: 792, column: 45, scope: !1632)
!1635 = !DILocation(line: 793, column: 9, scope: !1632)
!1636 = !DILocation(line: 793, column: 24, scope: !1632)
!1637 = !DILocation(line: 793, column: 28, scope: !1632)
!1638 = !DILocation(line: 793, column: 31, scope: !1639)
!1639 = !DILexicalBlockFile(scope: !1632, file: !906, discriminator: 1)
!1640 = !DILocation(line: 793, column: 43, scope: !1639)
!1641 = !DILocation(line: 792, column: 9, scope: !1642)
!1642 = !DILexicalBlockFile(scope: !1599, file: !906, discriminator: 1)
!1643 = !DILocation(line: 794, column: 16, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1632, file: !906, line: 793, column: 49)
!1645 = !DILocation(line: 794, column: 19, scope: !1644)
!1646 = !DILocation(line: 794, column: 9, scope: !1644)
!1647 = !DILocation(line: 796, column: 9, scope: !1644)
!1648 = !DILocation(line: 799, column: 22, scope: !1599)
!1649 = !DILocation(line: 799, column: 34, scope: !1599)
!1650 = !DILocation(line: 799, column: 19, scope: !1599)
!1651 = !DILocation(line: 799, column: 43, scope: !1599)
!1652 = !DILocation(line: 799, column: 55, scope: !1599)
!1653 = !DILocation(line: 799, column: 40, scope: !1599)
!1654 = !DILocation(line: 799, column: 15, scope: !1599)
!1655 = !DILocation(line: 800, column: 20, scope: !1599)
!1656 = !DILocation(line: 800, column: 34, scope: !1599)
!1657 = !DILocation(line: 800, column: 32, scope: !1599)
!1658 = !DILocation(line: 800, column: 44, scope: !1599)
!1659 = !DILocation(line: 800, column: 5, scope: !1599)
!1660 = !DILocation(line: 800, column: 8, scope: !1599)
!1661 = !DILocation(line: 800, column: 18, scope: !1599)
!1662 = !DILocation(line: 801, column: 25, scope: !1599)
!1663 = !DILocation(line: 801, column: 35, scope: !1599)
!1664 = !DILocation(line: 801, column: 22, scope: !1599)
!1665 = !DILocation(line: 801, column: 5, scope: !1599)
!1666 = !DILocation(line: 801, column: 8, scope: !1599)
!1667 = !DILocation(line: 801, column: 17, scope: !1599)
!1668 = !DILocation(line: 802, column: 18, scope: !1599)
!1669 = !DILocation(line: 802, column: 21, scope: !1599)
!1670 = !DILocation(line: 802, column: 32, scope: !1599)
!1671 = !DILocation(line: 802, column: 35, scope: !1599)
!1672 = !DILocation(line: 802, column: 30, scope: !1599)
!1673 = !DILocation(line: 802, column: 5, scope: !1599)
!1674 = !DILocation(line: 802, column: 8, scope: !1599)
!1675 = !DILocation(line: 802, column: 16, scope: !1599)
!1676 = !DILocation(line: 803, column: 20, scope: !1599)
!1677 = !DILocation(line: 803, column: 5, scope: !1599)
!1678 = !DILocation(line: 803, column: 8, scope: !1599)
!1679 = !DILocation(line: 803, column: 18, scope: !1599)
!1680 = !DILocation(line: 804, column: 13, scope: !1599)
!1681 = !DILocation(line: 804, column: 23, scope: !1599)
!1682 = !DILocation(line: 804, column: 5, scope: !1599)
!1683 = !DILocation(line: 804, column: 8, scope: !1599)
!1684 = !DILocation(line: 804, column: 11, scope: !1599)
!1685 = !DILocation(line: 807, column: 9, scope: !1686)
!1686 = distinct !DILexicalBlock(scope: !1599, file: !906, line: 807, column: 9)
!1687 = !DILocation(line: 807, column: 26, scope: !1686)
!1688 = !DILocation(line: 807, column: 29, scope: !1686)
!1689 = !DILocation(line: 807, column: 24, scope: !1686)
!1690 = !DILocation(line: 807, column: 9, scope: !1599)
!1691 = !DILocation(line: 808, column: 27, scope: !1686)
!1692 = !DILocation(line: 808, column: 30, scope: !1686)
!1693 = !DILocation(line: 808, column: 9, scope: !1686)
!1694 = !DILocation(line: 809, column: 30, scope: !1599)
!1695 = !DILocation(line: 809, column: 5, scope: !1599)
!1696 = !DILocation(line: 809, column: 8, scope: !1599)
!1697 = !DILocation(line: 809, column: 28, scope: !1599)
!1698 = !DILocation(line: 812, column: 12, scope: !1699)
!1699 = distinct !DILexicalBlock(scope: !1599, file: !906, line: 812, column: 5)
!1700 = !DILocation(line: 812, column: 10, scope: !1699)
!1701 = !DILocation(line: 812, column: 17, scope: !1702)
!1702 = !DILexicalBlockFile(scope: !1703, file: !906, discriminator: 1)
!1703 = distinct !DILexicalBlock(scope: !1699, file: !906, line: 812, column: 5)
!1704 = !DILocation(line: 812, column: 21, scope: !1702)
!1705 = !DILocation(line: 812, column: 19, scope: !1702)
!1706 = !DILocation(line: 812, column: 5, scope: !1702)
!1707 = !DILocation(line: 813, column: 16, scope: !1708)
!1708 = distinct !DILexicalBlock(scope: !1709, file: !906, line: 813, column: 9)
!1709 = distinct !DILexicalBlock(scope: !1703, file: !906, line: 812, column: 42)
!1710 = !DILocation(line: 813, column: 14, scope: !1708)
!1711 = !DILocation(line: 813, column: 21, scope: !1712)
!1712 = !DILexicalBlockFile(scope: !1713, file: !906, discriminator: 1)
!1713 = distinct !DILexicalBlock(scope: !1708, file: !906, line: 813, column: 9)
!1714 = !DILocation(line: 813, column: 25, scope: !1712)
!1715 = !DILocation(line: 813, column: 23, scope: !1712)
!1716 = !DILocation(line: 813, column: 9, scope: !1712)
!1717 = !DILocation(line: 814, column: 47, scope: !1713)
!1718 = !DILocation(line: 814, column: 28, scope: !1713)
!1719 = !DILocation(line: 814, column: 23, scope: !1713)
!1720 = !DILocation(line: 814, column: 13, scope: !1713)
!1721 = !DILocation(line: 814, column: 20, scope: !1713)
!1722 = !DILocation(line: 814, column: 26, scope: !1713)
!1723 = !DILocation(line: 813, column: 37, scope: !1724)
!1724 = !DILexicalBlockFile(scope: !1713, file: !906, discriminator: 2)
!1725 = !DILocation(line: 813, column: 9, scope: !1724)
!1726 = distinct !{!1726, !1727}
!1727 = !DILocation(line: 813, column: 9, scope: !1709)
!1728 = !DILocation(line: 816, column: 44, scope: !1709)
!1729 = !DILocation(line: 816, column: 25, scope: !1709)
!1730 = !DILocation(line: 816, column: 20, scope: !1709)
!1731 = !DILocation(line: 816, column: 9, scope: !1709)
!1732 = !DILocation(line: 816, column: 23, scope: !1709)
!1733 = !DILocation(line: 817, column: 24, scope: !1734)
!1734 = distinct !DILexicalBlock(scope: !1709, file: !906, line: 817, column: 13)
!1735 = !DILocation(line: 817, column: 13, scope: !1734)
!1736 = !DILocation(line: 817, column: 13, scope: !1709)
!1737 = !DILocation(line: 818, column: 43, scope: !1738)
!1738 = distinct !DILexicalBlock(scope: !1734, file: !906, line: 817, column: 28)
!1739 = !DILocation(line: 818, column: 46, scope: !1738)
!1740 = !DILocation(line: 818, column: 13, scope: !1738)
!1741 = !DILocation(line: 819, column: 13, scope: !1738)
!1742 = !DILocation(line: 821, column: 5, scope: !1709)
!1743 = !DILocation(line: 812, column: 38, scope: !1744)
!1744 = !DILexicalBlockFile(scope: !1703, file: !906, discriminator: 2)
!1745 = !DILocation(line: 812, column: 5, scope: !1744)
!1746 = distinct !{!1746, !1747}
!1747 = !DILocation(line: 812, column: 5, scope: !1599)
!1748 = !DILocation(line: 823, column: 12, scope: !1749)
!1749 = distinct !DILexicalBlock(scope: !1599, file: !906, line: 823, column: 5)
!1750 = !DILocation(line: 823, column: 10, scope: !1749)
!1751 = !DILocation(line: 823, column: 17, scope: !1752)
!1752 = !DILexicalBlockFile(scope: !1753, file: !906, discriminator: 1)
!1753 = distinct !DILexicalBlock(scope: !1749, file: !906, line: 823, column: 5)
!1754 = !DILocation(line: 823, column: 21, scope: !1752)
!1755 = !DILocation(line: 823, column: 19, scope: !1752)
!1756 = !DILocation(line: 823, column: 5, scope: !1752)
!1757 = !DILocation(line: 824, column: 16, scope: !1758)
!1758 = distinct !DILexicalBlock(scope: !1759, file: !906, line: 824, column: 9)
!1759 = distinct !DILexicalBlock(scope: !1753, file: !906, line: 823, column: 37)
!1760 = !DILocation(line: 824, column: 14, scope: !1758)
!1761 = !DILocation(line: 824, column: 21, scope: !1762)
!1762 = !DILexicalBlockFile(scope: !1763, file: !906, discriminator: 1)
!1763 = distinct !DILexicalBlock(scope: !1758, file: !906, line: 824, column: 9)
!1764 = !DILocation(line: 824, column: 25, scope: !1762)
!1765 = !DILocation(line: 824, column: 23, scope: !1762)
!1766 = !DILocation(line: 824, column: 40, scope: !1762)
!1767 = !DILocation(line: 824, column: 44, scope: !1768)
!1768 = !DILexicalBlockFile(scope: !1763, file: !906, discriminator: 2)
!1769 = !DILocation(line: 824, column: 47, scope: !1768)
!1770 = !DILocation(line: 824, column: 43, scope: !1768)
!1771 = !DILocation(line: 824, column: 9, scope: !1772)
!1772 = !DILexicalBlockFile(scope: !1758, file: !906, discriminator: 3)
!1773 = !DILocation(line: 825, column: 31, scope: !1763)
!1774 = !DILocation(line: 825, column: 34, scope: !1763)
!1775 = !DILocation(line: 825, column: 38, scope: !1763)
!1776 = !DILocation(line: 825, column: 41, scope: !1763)
!1777 = !DILocation(line: 825, column: 44, scope: !1763)
!1778 = !DILocation(line: 825, column: 70, scope: !1763)
!1779 = !DILocation(line: 825, column: 60, scope: !1763)
!1780 = !DILocation(line: 825, column: 67, scope: !1763)
!1781 = !DILocation(line: 825, column: 84, scope: !1763)
!1782 = !DILocation(line: 825, column: 74, scope: !1763)
!1783 = !DILocation(line: 825, column: 13, scope: !1763)
!1784 = !DILocation(line: 824, column: 57, scope: !1785)
!1785 = !DILexicalBlockFile(scope: !1763, file: !906, discriminator: 4)
!1786 = !DILocation(line: 824, column: 9, scope: !1785)
!1787 = distinct !{!1787, !1788}
!1788 = !DILocation(line: 824, column: 9, scope: !1759)
!1789 = !DILocation(line: 828, column: 13, scope: !1790)
!1790 = distinct !DILexicalBlock(scope: !1759, file: !906, line: 828, column: 13)
