; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--x86--hscale_fast_bilinear_simd.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--x86--hscale_fast_bilinear_simd.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!528 = !DILocation(line: 171, column: 21, scope: !529)
!529 = distinct !DILexicalBlock(scope: !410, file: !244, line: 171, column: 21)
!530 = !DILocation(line: 171, column: 27, scope: !529)
!531 = !DILocation(line: 171, column: 30, scope: !532)
!532 = !DILexicalBlockFile(scope: !529, file: !244, discriminator: 1)
!533 = !DILocation(line: 171, column: 35, scope: !532)
!534 = !DILocation(line: 171, column: 32, scope: !532)
!535 = !DILocation(line: 171, column: 21, scope: !532)
!536 = !DILocation(line: 172, column: 71, scope: !537)
!537 = distinct !DILexicalBlock(scope: !529, file: !244, line: 171, column: 42)
!538 = !DILocation(line: 172, column: 69, scope: !537)
!539 = !DILocation(line: 172, column: 32, scope: !537)
!540 = !DILocation(line: 172, column: 46, scope: !537)
!541 = !DILocation(line: 172, column: 44, scope: !537)
!542 = !DILocation(line: 172, column: 21, scope: !537)
!543 = !DILocation(line: 172, column: 61, scope: !537)
!544 = !DILocation(line: 173, column: 71, scope: !537)
!545 = !DILocation(line: 173, column: 69, scope: !537)
!546 = !DILocation(line: 173, column: 32, scope: !537)
!547 = !DILocation(line: 173, column: 46, scope: !537)
!548 = !DILocation(line: 173, column: 44, scope: !537)
!549 = !DILocation(line: 173, column: 21, scope: !537)
!550 = !DILocation(line: 173, column: 61, scope: !537)
!551 = !DILocation(line: 174, column: 41, scope: !537)
!552 = !DILocation(line: 174, column: 31, scope: !537)
!553 = !DILocation(line: 174, column: 33, scope: !537)
!554 = !DILocation(line: 174, column: 21, scope: !537)
!555 = !DILocation(line: 174, column: 38, scope: !537)
!556 = !DILocation(line: 175, column: 17, scope: !537)
!557 = !DILocation(line: 176, column: 13, scope: !410)
!558 = !DILocation(line: 178, column: 28, scope: !326)
!559 = !DILocation(line: 178, column: 25, scope: !326)
!560 = !DILocation(line: 180, column: 17, scope: !561)
!561 = distinct !DILexicalBlock(scope: !326, file: !244, line: 180, column: 17)
!562 = !DILocation(line: 180, column: 17, scope: !326)
!563 = !DILocation(line: 181, column: 28, scope: !561)
!564 = !DILocation(line: 181, column: 17, scope: !561)
!565 = !DILocation(line: 181, column: 41, scope: !561)
!566 = !DILocation(line: 182, column: 9, scope: !326)
!567 = !DILocation(line: 183, column: 17, scope: !316)
!568 = !DILocation(line: 183, column: 14, scope: !316)
!569 = !DILocation(line: 184, column: 5, scope: !316)
!570 = !DILocation(line: 133, column: 40, scope: !571)
!571 = !DILexicalBlockFile(scope: !309, file: !244, discriminator: 2)
!572 = !DILocation(line: 133, column: 5, scope: !571)
!573 = distinct !{!573, !574}
!574 = !DILocation(line: 133, column: 5, scope: !243)
!575 = !DILocation(line: 185, column: 9, scope: !576)
!576 = distinct !DILexicalBlock(scope: !243, file: !244, line: 185, column: 9)
!577 = !DILocation(line: 185, column: 9, scope: !243)
!578 = !DILocation(line: 186, column: 43, scope: !576)
!579 = !DILocation(line: 186, column: 48, scope: !576)
!580 = !DILocation(line: 186, column: 21, scope: !576)
!581 = !DILocation(line: 186, column: 23, scope: !576)
!582 = !DILocation(line: 186, column: 28, scope: !576)
!583 = !DILocation(line: 186, column: 33, scope: !576)
!584 = !DILocation(line: 186, column: 9, scope: !576)
!585 = !DILocation(line: 186, column: 41, scope: !576)
!586 = !DILocation(line: 188, column: 12, scope: !243)
!587 = !DILocation(line: 188, column: 24, scope: !243)
!588 = !DILocation(line: 188, column: 5, scope: !243)
!589 = distinct !DISubprogram(name: "ff_hyscale_fast_mmxext", scope: !244, file: !244, line: 191, type: !590, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !258)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !592, !252, !247, !648, !247, !247}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64, align: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !595)
!595 = !{!596, !641, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !680, !684, !688, !690, !691, !692, !693, !694, !695, !696, !700, !701, !702, !704, !705, !725, !739, !745, !746, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !780, !782, !783, !784, !788, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !828, !829, !830, !831, !832, !833, !834, !835, !836, !839, !840, !844, !846, !847, !848, !849, !850, !851, !852, !853, !856, !857, !864, !870, !875, !880, !885, !890, !895, !900, !901, !905, !909, !913, !914, !918, !922, !928, !929, !933, !937, !938, !940}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !594, file: !225, line: 284, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !601)
!601 = !{!602, !606, !611, !615, !616, !617, !618, !622, !628, !630, !634}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !600, file: !4, line: 72, baseType: !603, size: 64, align: 64)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !600, file: !4, line: 78, baseType: !607, size: 64, align: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64, align: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!603, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !600, file: !4, line: 85, baseType: !612, size: 64, align: 64, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !600, file: !4, line: 93, baseType: !247, size: 32, align: 32, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !600, file: !4, line: 99, baseType: !247, size: 32, align: 32, offset: 224)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !600, file: !4, line: 108, baseType: !247, size: 32, align: 32, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !600, file: !4, line: 113, baseType: !619, size: 64, align: 64, offset: 320)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64, align: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!610, !610, !610}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !600, file: !4, line: 123, baseType: !623, size: 64, align: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64, align: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!626, !626}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !600)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !600, file: !4, line: 130, baseType: !629, size: 32, align: 32, offset: 448)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !600, file: !4, line: 136, baseType: !631, size: 64, align: 64, offset: 512)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DISubroutineType(types: !633)
!633 = !{!629, !610}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !600, file: !4, line: 142, baseType: !635, size: 64, align: 64, offset: 576)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64, align: 64)
!636 = !DISubroutineType(types: !637)
!637 = !{!247, !638, !610, !603, !247}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !594, file: !225, line: 290, baseType: !642, size: 64, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64, align: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{!247, !646, !647, !650, !247, !247, !651, !650}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !594, file: !225, line: 291, baseType: !247, size: 32, align: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !594, file: !225, line: 292, baseType: !247, size: 32, align: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !594, file: !225, line: 293, baseType: !247, size: 32, align: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !594, file: !225, line: 294, baseType: !247, size: 32, align: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !594, file: !225, line: 295, baseType: !247, size: 32, align: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !594, file: !225, line: 296, baseType: !247, size: 32, align: 32, offset: 288)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !594, file: !225, line: 297, baseType: !247, size: 32, align: 32, offset: 320)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !594, file: !225, line: 298, baseType: !247, size: 32, align: 32, offset: 352)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !594, file: !225, line: 298, baseType: !247, size: 32, align: 32, offset: 384)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !594, file: !225, line: 299, baseType: !247, size: 32, align: 32, offset: 416)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !594, file: !225, line: 299, baseType: !247, size: 32, align: 32, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !594, file: !225, line: 300, baseType: !24, size: 32, align: 32, offset: 480)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !594, file: !225, line: 301, baseType: !24, size: 32, align: 32, offset: 512)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !594, file: !225, line: 302, baseType: !247, size: 32, align: 32, offset: 544)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !594, file: !225, line: 303, baseType: !247, size: 32, align: 32, offset: 576)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !594, file: !225, line: 304, baseType: !247, size: 32, align: 32, offset: 608)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !594, file: !225, line: 304, baseType: !247, size: 32, align: 32, offset: 640)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !594, file: !225, line: 305, baseType: !247, size: 32, align: 32, offset: 672)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !594, file: !225, line: 306, baseType: !247, size: 32, align: 32, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !594, file: !225, line: 307, baseType: !247, size: 32, align: 32, offset: 736)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !594, file: !225, line: 308, baseType: !247, size: 32, align: 32, offset: 768)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !594, file: !225, line: 309, baseType: !247, size: 32, align: 32, offset: 800)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !594, file: !225, line: 310, baseType: !247, size: 32, align: 32, offset: 832)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !594, file: !225, line: 311, baseType: !676, size: 128, align: 64, offset: 896)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 128, align: 64, elements: !678)
!677 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!678 = !{!679}
!679 = !DISubrange(count: 2)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !594, file: !225, line: 317, baseType: !681, size: 192, align: 64, offset: 1024)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 192, align: 64, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 3)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !594, file: !225, line: 318, baseType: !685, size: 128, align: 32, offset: 1216)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 128, align: 32, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 4)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !594, file: !225, line: 319, baseType: !689, size: 256, align: 64, offset: 1344)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 256, align: 64, elements: !686)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !594, file: !225, line: 320, baseType: !685, size: 128, align: 32, offset: 1600)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !594, file: !225, line: 321, baseType: !689, size: 256, align: 64, offset: 1728)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !594, file: !225, line: 322, baseType: !247, size: 32, align: 32, offset: 1984)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !594, file: !225, line: 324, baseType: !677, size: 64, align: 64, offset: 2048)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !594, file: !225, line: 325, baseType: !247, size: 32, align: 32, offset: 2112)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !594, file: !225, line: 326, baseType: !247, size: 32, align: 32, offset: 2144)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !594, file: !225, line: 327, baseType: !697, size: 64, align: 64, offset: 2176)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !250, line: 49, baseType: !699)
!699 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !594, file: !225, line: 328, baseType: !697, size: 64, align: 64, offset: 2240)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !594, file: !225, line: 330, baseType: !247, size: 32, align: 32, offset: 2304)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !594, file: !225, line: 331, baseType: !703, size: 64, align: 32, offset: 2336)
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 64, align: 32, elements: !678)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !594, file: !225, line: 332, baseType: !247, size: 32, align: 32, offset: 2400)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !594, file: !225, line: 333, baseType: !706, size: 64, align: 64, offset: 2432)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !707, file: !225, line: 945, baseType: !247, size: 32, align: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !707, file: !225, line: 946, baseType: !247, size: 32, align: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !707, file: !225, line: 947, baseType: !247, size: 32, align: 32, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !707, file: !225, line: 948, baseType: !247, size: 32, align: 32, offset: 96)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !707, file: !225, line: 949, baseType: !247, size: 32, align: 32, offset: 128)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !707, file: !225, line: 950, baseType: !24, size: 32, align: 32, offset: 160)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !707, file: !225, line: 951, baseType: !716, size: 1024, align: 64, offset: 192)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 1024, align: 64, elements: !686)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !719)
!719 = !{!720, !721, !722, !723, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !718, file: !225, line: 931, baseType: !247, size: 32, align: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !718, file: !225, line: 932, baseType: !247, size: 32, align: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !718, file: !225, line: 933, baseType: !247, size: 32, align: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !718, file: !225, line: 934, baseType: !651, size: 64, align: 64, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !718, file: !225, line: 935, baseType: !651, size: 64, align: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !594, file: !225, line: 334, baseType: !726, size: 64, align: 64, offset: 2496)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !728)
!728 = !{!729, !732, !733, !734, !735}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !727, file: !225, line: 960, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !707)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !727, file: !225, line: 961, baseType: !730, size: 64, align: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !727, file: !225, line: 963, baseType: !247, size: 32, align: 32, offset: 128)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !727, file: !225, line: 964, baseType: !610, size: 64, align: 64, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !727, file: !225, line: 967, baseType: !736, size: 64, align: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64, align: 64)
!737 = !DISubroutineType(types: !738)
!738 = !{!247, !592, !726, !247, !247}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !594, file: !225, line: 336, baseType: !740, size: 8192, align: 32, offset: 2560)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 8192, align: 32, elements: !743)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !250, line: 51, baseType: !742)
!742 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!743 = !{!744}
!744 = !DISubrange(count: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !594, file: !225, line: 337, baseType: !740, size: 8192, align: 32, offset: 10752)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !594, file: !225, line: 339, baseType: !747, size: 8192, align: 32, offset: 18944)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 8192, align: 32, elements: !743)
!748 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !594, file: !225, line: 351, baseType: !247, size: 32, align: 32, offset: 27136)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !594, file: !225, line: 352, baseType: !247, size: 32, align: 32, offset: 27168)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !594, file: !225, line: 353, baseType: !247, size: 32, align: 32, offset: 27200)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !594, file: !225, line: 354, baseType: !247, size: 32, align: 32, offset: 27232)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !594, file: !225, line: 357, baseType: !248, size: 64, align: 64, offset: 27264)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !594, file: !225, line: 358, baseType: !247, size: 32, align: 32, offset: 27328)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !594, file: !225, line: 374, baseType: !252, size: 64, align: 64, offset: 27392)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !594, file: !225, line: 375, baseType: !252, size: 64, align: 64, offset: 27456)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !594, file: !225, line: 376, baseType: !252, size: 64, align: 64, offset: 27520)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !594, file: !225, line: 377, baseType: !252, size: 64, align: 64, offset: 27584)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !594, file: !225, line: 378, baseType: !256, size: 64, align: 64, offset: 27648)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !594, file: !225, line: 379, baseType: !256, size: 64, align: 64, offset: 27712)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !594, file: !225, line: 380, baseType: !256, size: 64, align: 64, offset: 27776)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !594, file: !225, line: 381, baseType: !256, size: 64, align: 64, offset: 27840)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !594, file: !225, line: 382, baseType: !247, size: 32, align: 32, offset: 27904)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !594, file: !225, line: 383, baseType: !247, size: 32, align: 32, offset: 27936)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !594, file: !225, line: 384, baseType: !247, size: 32, align: 32, offset: 27968)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !594, file: !225, line: 385, baseType: !247, size: 32, align: 32, offset: 28000)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !594, file: !225, line: 388, baseType: !247, size: 32, align: 32, offset: 28032)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !594, file: !225, line: 389, baseType: !247, size: 32, align: 32, offset: 28064)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !594, file: !225, line: 390, baseType: !248, size: 64, align: 64, offset: 28096)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !594, file: !225, line: 391, baseType: !248, size: 64, align: 64, offset: 28160)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !594, file: !225, line: 393, baseType: !247, size: 32, align: 32, offset: 28224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !594, file: !225, line: 394, baseType: !247, size: 32, align: 32, offset: 28256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !594, file: !225, line: 396, baseType: !247, size: 32, align: 32, offset: 28288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !594, file: !225, line: 397, baseType: !247, size: 32, align: 32, offset: 28320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !594, file: !225, line: 398, baseType: !610, size: 64, align: 64, offset: 28352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !594, file: !225, line: 401, baseType: !777, size: 40960, align: 32, offset: 28416)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !247, size: 40960, align: 32, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 1280)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !594, file: !225, line: 402, baseType: !781, size: 81920, align: 64, offset: 69376)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 81920, align: 64, elements: !778)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !594, file: !225, line: 403, baseType: !781, size: 81920, align: 64, offset: 151296)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !594, file: !225, line: 404, baseType: !781, size: 81920, align: 64, offset: 233216)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !594, file: !225, line: 405, baseType: !785, size: 5632, align: 32, offset: 315136)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 5632, align: 32, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 176)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !594, file: !225, line: 417, baseType: !789, size: 256, align: 64, offset: 320768)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 256, align: 64, elements: !686)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !594, file: !225, line: 420, baseType: !247, size: 32, align: 32, offset: 321024)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !594, file: !225, line: 420, baseType: !247, size: 32, align: 32, offset: 321056)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !594, file: !225, line: 420, baseType: !247, size: 32, align: 32, offset: 321088)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !594, file: !225, line: 421, baseType: !685, size: 128, align: 32, offset: 321120)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !594, file: !225, line: 422, baseType: !685, size: 128, align: 32, offset: 321248)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !594, file: !225, line: 423, baseType: !247, size: 32, align: 32, offset: 321376)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !594, file: !225, line: 424, baseType: !247, size: 32, align: 32, offset: 321408)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !594, file: !225, line: 425, baseType: !247, size: 32, align: 32, offset: 321440)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !594, file: !225, line: 426, baseType: !247, size: 32, align: 32, offset: 321472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !594, file: !225, line: 427, baseType: !247, size: 32, align: 32, offset: 321504)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !594, file: !225, line: 428, baseType: !247, size: 32, align: 32, offset: 321536)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !594, file: !225, line: 429, baseType: !247, size: 32, align: 32, offset: 321568)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !594, file: !225, line: 430, baseType: !247, size: 32, align: 32, offset: 321600)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !594, file: !225, line: 431, baseType: !247, size: 32, align: 32, offset: 321632)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !594, file: !225, line: 432, baseType: !247, size: 32, align: 32, offset: 321664)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !594, file: !225, line: 433, baseType: !247, size: 32, align: 32, offset: 321696)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !594, file: !225, line: 434, baseType: !247, size: 32, align: 32, offset: 321728)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !594, file: !225, line: 435, baseType: !247, size: 32, align: 32, offset: 321760)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !594, file: !225, line: 436, baseType: !247, size: 32, align: 32, offset: 321792)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !594, file: !225, line: 437, baseType: !247, size: 32, align: 32, offset: 321824)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !594, file: !225, line: 438, baseType: !247, size: 32, align: 32, offset: 321856)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !594, file: !225, line: 466, baseType: !812, size: 64, align: 64, offset: 321920)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !250, line: 55, baseType: !813)
!813 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !594, file: !225, line: 467, baseType: !812, size: 64, align: 64, offset: 321984)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !594, file: !225, line: 468, baseType: !812, size: 64, align: 64, offset: 322048)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !594, file: !225, line: 470, baseType: !812, size: 64, align: 64, offset: 322112)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !594, file: !225, line: 471, baseType: !812, size: 64, align: 64, offset: 322176)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !594, file: !225, line: 472, baseType: !812, size: 64, align: 64, offset: 322240)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !594, file: !225, line: 473, baseType: !812, size: 64, align: 64, offset: 322304)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !594, file: !225, line: 474, baseType: !812, size: 64, align: 64, offset: 322368)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !594, file: !225, line: 475, baseType: !812, size: 64, align: 64, offset: 322432)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !594, file: !225, line: 476, baseType: !812, size: 64, align: 64, offset: 322496)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !594, file: !225, line: 477, baseType: !812, size: 64, align: 64, offset: 322560)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !594, file: !225, line: 478, baseType: !825, size: 32768, align: 32, offset: 322624)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 32768, align: 32, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 1024)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !594, file: !225, line: 479, baseType: !825, size: 32768, align: 32, offset: 355392)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !594, file: !225, line: 480, baseType: !247, size: 32, align: 32, offset: 388160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !594, file: !225, line: 481, baseType: !812, size: 64, align: 64, offset: 388224)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !594, file: !225, line: 482, baseType: !812, size: 64, align: 64, offset: 388288)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !594, file: !225, line: 483, baseType: !812, size: 64, align: 64, offset: 388352)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !594, file: !225, line: 484, baseType: !812, size: 64, align: 64, offset: 388416)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !594, file: !225, line: 485, baseType: !812, size: 64, align: 64, offset: 388480)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !594, file: !225, line: 486, baseType: !825, size: 32768, align: 32, offset: 388544)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !594, file: !225, line: 490, baseType: !837, size: 64, align: 64, offset: 421312)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !838, line: 149, baseType: !278)
!838 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!839 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !594, file: !225, line: 491, baseType: !837, size: 64, align: 64, offset: 421376)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !594, file: !225, line: 492, baseType: !841, size: 128, align: 16, offset: 421440)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !698, size: 128, align: 16, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !594, file: !225, line: 493, baseType: !845, size: 256, align: 32, offset: 421568)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 256, align: 32, elements: !842)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !594, file: !225, line: 495, baseType: !648, size: 64, align: 64, offset: 421824)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !594, file: !225, line: 495, baseType: !648, size: 64, align: 64, offset: 421888)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !594, file: !225, line: 508, baseType: !247, size: 32, align: 32, offset: 421952)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !594, file: !225, line: 513, baseType: !252, size: 64, align: 64, offset: 422016)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !594, file: !225, line: 514, baseType: !252, size: 64, align: 64, offset: 422080)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !594, file: !225, line: 515, baseType: !252, size: 64, align: 64, offset: 422144)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !594, file: !225, line: 516, baseType: !252, size: 64, align: 64, offset: 422208)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !594, file: !225, line: 517, baseType: !854, size: 192, align: 16, offset: 422272)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 192, align: 16, elements: !855)
!855 = !{!683, !687}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !594, file: !225, line: 518, baseType: !854, size: 192, align: 16, offset: 422464)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !594, file: !225, line: 521, baseType: !858, size: 64, align: 64, offset: 422656)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64, align: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !862, !248, !247, !648, !247}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64, align: 64)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !594, file: !225, line: 522, baseType: !865, size: 64, align: 64, offset: 422720)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, align: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{null, !862, !247, !869, !248, !247, !648, !247}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64, align: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !594, file: !225, line: 523, baseType: !871, size: 64, align: 64, offset: 422784)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64, align: 64)
!873 = !DISubroutineType(types: !874)
!874 = !{null, !646, !862, !247, !869, !869, !248, !247}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !594, file: !225, line: 524, baseType: !876, size: 64, align: 64, offset: 422848)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64, align: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !646, !862, !869, !869, !862, !248, !247, !247, !247}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !594, file: !225, line: 525, baseType: !881, size: 64, align: 64, offset: 422912)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64, align: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !646, !869, !869, !869, !869, !248, !247, !247, !247, !247}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !594, file: !225, line: 526, baseType: !886, size: 64, align: 64, offset: 422976)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !646, !862, !869, !247, !862, !869, !869, !247, !869, !248, !247, !247}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !594, file: !225, line: 527, baseType: !891, size: 64, align: 64, offset: 423040)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !892)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64, align: 64)
!893 = !DISubroutineType(types: !894)
!894 = !{null, !646, !862, !869, !247, !862, !869, !869, !247, !869, !651, !247, !247}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !594, file: !225, line: 530, baseType: !896, size: 64, align: 64, offset: 423104)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64, align: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{null, !248, !648, !648, !648, !247, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 64, align: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !594, file: !225, line: 533, baseType: !896, size: 64, align: 64, offset: 423168)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !594, file: !225, line: 536, baseType: !902, size: 64, align: 64, offset: 423232)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !248, !248, !648, !648, !648, !247, !899}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !594, file: !225, line: 545, baseType: !906, size: 64, align: 64, offset: 423296)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 64, align: 64)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !248, !647, !247, !256}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !594, file: !225, line: 546, baseType: !910, size: 64, align: 64, offset: 423360)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !248, !248, !647, !247, !256}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !594, file: !225, line: 548, baseType: !906, size: 64, align: 64, offset: 423424)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !594, file: !225, line: 570, baseType: !915, size: 64, align: 64, offset: 423488)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !646, !252, !247, !648, !247, !247}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !594, file: !225, line: 573, baseType: !919, size: 64, align: 64, offset: 423552)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DISubroutineType(types: !921)
!921 = !{null, !646, !252, !252, !247, !648, !648, !247, !247}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !594, file: !225, line: 610, baseType: !923, size: 64, align: 64, offset: 423616)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !646, !252, !247, !648, !862, !926, !247}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !257)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !594, file: !225, line: 613, baseType: !923, size: 64, align: 64, offset: 423680)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !594, file: !225, line: 619, baseType: !930, size: 64, align: 64, offset: 423744)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !252, !247}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !594, file: !225, line: 621, baseType: !934, size: 64, align: 64, offset: 423808)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !252, !252, !247}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !594, file: !225, line: 623, baseType: !247, size: 32, align: 32, offset: 423872)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !594, file: !225, line: 625, baseType: !939, size: 32, align: 32, offset: 423904)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !594, file: !225, line: 627, baseType: !941, size: 32, align: 32, offset: 423936)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!942 = !DILocalVariable(name: "c", arg: 1, scope: !589, file: !244, line: 191, type: !592)
!943 = !DILocation(line: 191, column: 41, scope: !589)
!944 = !DILocalVariable(name: "dst", arg: 2, scope: !589, file: !244, line: 191, type: !252)
!945 = !DILocation(line: 191, column: 53, scope: !589)
!946 = !DILocalVariable(name: "dstWidth", arg: 3, scope: !589, file: !244, line: 192, type: !247)
!947 = !DILocation(line: 192, column: 38, scope: !589)
!948 = !DILocalVariable(name: "src", arg: 4, scope: !589, file: !244, line: 192, type: !648)
!949 = !DILocation(line: 192, column: 63, scope: !589)
!950 = !DILocalVariable(name: "srcW", arg: 5, scope: !589, file: !244, line: 193, type: !247)
!951 = !DILocation(line: 193, column: 38, scope: !589)
!952 = !DILocalVariable(name: "xInc", arg: 6, scope: !589, file: !244, line: 193, type: !247)
!953 = !DILocation(line: 193, column: 48, scope: !589)
!954 = !DILocalVariable(name: "filterPos", scope: !589, file: !244, line: 195, type: !256)
!955 = !DILocation(line: 195, column: 14, scope: !589)
!956 = !DILocation(line: 195, column: 26, scope: !589)
!957 = !DILocation(line: 195, column: 29, scope: !589)
!958 = !DILocalVariable(name: "filter", scope: !589, file: !244, line: 196, type: !252)
!959 = !DILocation(line: 196, column: 14, scope: !589)
!960 = !DILocation(line: 196, column: 23, scope: !589)
!961 = !DILocation(line: 196, column: 26, scope: !589)
!962 = !DILocalVariable(name: "mmxextFilterCode", scope: !589, file: !244, line: 197, type: !610)
!963 = !DILocation(line: 197, column: 11, scope: !589)
!964 = !DILocation(line: 197, column: 30, scope: !589)
!965 = !DILocation(line: 197, column: 33, scope: !589)
!966 = !DILocalVariable(name: "i", scope: !589, file: !244, line: 198, type: !247)
!967 = !DILocation(line: 198, column: 9, scope: !589)
!968 = !DILocalVariable(name: "retsave", scope: !589, file: !244, line: 200, type: !812)
!969 = !DILocation(line: 200, column: 14, scope: !589)
!970 = !DILocation(line: 207, column: 5, scope: !589)
!971 = !{i32 147435, i32 147480, i32 147537, i32 147602, i32 147659, i32 147716, i32 147773, i32 147830, i32 147884, i32 147946, i32 148008, i32 148070, i32 148181, i32 148236, i32 148285, i32 148334, i32 148383, i32 148432, i32 148492, i32 148547, i32 148596, i32 148645, i32 148694, i32 148743, i32 148803, i32 148858, i32 148907, i32 148956, i32 149005, i32 149054, i32 149114, i32 149169, i32 149218, i32 149267, i32 149316, i32 149365, i32 149425, i32 149480, i32 149529, i32 149578, i32 149627, i32 149676, i32 149736, i32 149791, i32 149840, i32 149889, i32 149938, i32 149987, i32 150047, i32 150102, i32 150151, i32 150200, i32 150249, i32 150298, i32 150358, i32 150413, i32 150462, i32 150511, i32 150560, i32 150609, i32 150665, i32 150719}
!972 = !DILocation(line: 277, column: 12, scope: !973)
!973 = distinct !DILexicalBlock(scope: !589, file: !244, line: 277, column: 5)
!974 = !DILocation(line: 277, column: 20, scope: !973)
!975 = !DILocation(line: 277, column: 11, scope: !973)
!976 = !DILocation(line: 277, column: 10, scope: !973)
!977 = !DILocation(line: 277, column: 25, scope: !978)
!978 = !DILexicalBlockFile(scope: !979, file: !244, discriminator: 1)
!979 = distinct !DILexicalBlock(scope: !973, file: !244, line: 277, column: 5)
!980 = !DILocation(line: 277, column: 27, scope: !978)
!981 = !DILocation(line: 277, column: 26, scope: !978)
!982 = !DILocation(line: 277, column: 32, scope: !978)
!983 = !DILocation(line: 277, column: 39, scope: !978)
!984 = !DILocation(line: 277, column: 43, scope: !978)
!985 = !DILocation(line: 277, column: 37, scope: !978)
!986 = !DILocation(line: 277, column: 5, scope: !978)
!987 = !DILocation(line: 278, column: 22, scope: !979)
!988 = !DILocation(line: 278, column: 26, scope: !979)
