; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--roqvideoenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--roqvideoenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!865 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!866 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!868 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!869 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!870 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!871 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!872 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!873 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!877 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!878 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!879 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!880 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!881 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !{!910, !913, !920, !926, !925, !927}
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !911, line: 55, baseType: !912)
!911 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!912 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !915, line: 222, size: 16, align: 8, elements: !916)
!915 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !914, file: !915, line: 222, baseType: !918, size: 16, align: 16)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !911, line: 49, baseType: !919)
!919 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !915, line: 221, size: 32, align: 8, elements: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !921, file: !915, line: 221, baseType: !924, size: 32, align: 32)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !911, line: 51, baseType: !925)
!925 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !911, line: 48, baseType: !928)
!928 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!929 = !{!930, !1687, !1688, !1694, !1706, !1825}
!930 = distinct !DIGlobalVariable(name: "ff_roq_encoder", scope: !0, file: !931, line: 1126, type: !932, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_roq_encoder)
!931 = !DIFile(filename: "libavcodec/roqvideoenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !934)
!934 = !{!935, !939, !940, !941, !942, !944, !953, !956, !959, !962, !965, !966, !1042, !1050, !1051, !1052, !1054, !1602, !1608, !1616, !1620, !1621, !1658, !1662, !1666, !1667, !1671, !1675, !1676, !1680, !1681, !1682}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !933, file: !14, line: 3475, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !933, file: !14, line: 3480, baseType: !936, size: 64, align: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !933, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !933, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !933, file: !14, line: 3487, baseType: !943, size: 32, align: 32, offset: 192)
!943 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !933, file: !14, line: 3488, baseType: !945, size: 64, align: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !948, line: 61, baseType: !949)
!948 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !948, line: 58, size: 64, align: 32, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !949, file: !948, line: 59, baseType: !943, size: 32, align: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !949, file: !948, line: 60, baseType: !943, size: 32, align: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !933, file: !14, line: 3489, baseType: !954, size: 64, align: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !933, file: !14, line: 3490, baseType: !957, size: 64, align: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !933, file: !14, line: 3491, baseType: !960, size: 64, align: 64, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !933, file: !14, line: 3492, baseType: !963, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !933, file: !14, line: 3493, baseType: !927, size: 8, align: 8, offset: 576)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !933, file: !14, line: 3494, baseType: !967, size: 64, align: 64, offset: 640)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !971)
!971 = !{!972, !973, !978, !1001, !1002, !1003, !1004, !1008, !1014, !1016, !1020}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !970, file: !713, line: 72, baseType: !936, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !970, file: !713, line: 78, baseType: !974, size: 64, align: 64, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!936, !977}
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !970, file: !713, line: 85, baseType: !979, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !982)
!982 = !{!983, !984, !985, !986, !987, !997, !998, !999, !1000}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !981, file: !691, line: 247, baseType: !936, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !981, file: !691, line: 253, baseType: !936, size: 64, align: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !981, file: !691, line: 259, baseType: !943, size: 32, align: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !981, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !981, file: !691, line: 271, baseType: !988, size: 64, align: 64, offset: 192)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !981, file: !691, line: 265, size: 64, align: 64, elements: !989)
!989 = !{!990, !993, !995, !996}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !988, file: !691, line: 266, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !911, line: 40, baseType: !992)
!992 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !988, file: !691, line: 267, baseType: !994, size: 64, align: 64)
!994 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !988, file: !691, line: 268, baseType: !936, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !988, file: !691, line: 270, baseType: !947, size: 64, align: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !981, file: !691, line: 272, baseType: !994, size: 64, align: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !981, file: !691, line: 273, baseType: !994, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !691, line: 275, baseType: !943, size: 32, align: 32, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !981, file: !691, line: 300, baseType: !936, size: 64, align: 64, offset: 448)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !970, file: !713, line: 93, baseType: !943, size: 32, align: 32, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !970, file: !713, line: 99, baseType: !943, size: 32, align: 32, offset: 224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !970, file: !713, line: 108, baseType: !943, size: 32, align: 32, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !970, file: !713, line: 113, baseType: !1005, size: 64, align: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!977, !977, !977}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !970, file: !713, line: 123, baseType: !1009, size: 64, align: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1012, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !970, file: !713, line: 130, baseType: !1015, size: 32, align: 32, offset: 448)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !970, file: !713, line: 136, baseType: !1017, size: 64, align: 64, offset: 512)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!1015, !977}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !970, file: !713, line: 142, baseType: !1021, size: 64, align: 64, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!943, !1024, !977, !936, !943}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1027)
!1027 = !{!1028, !1040, !1041}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1026, file: !691, line: 360, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1032, file: !691, line: 307, baseType: !936, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1032, file: !691, line: 313, baseType: !994, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1032, file: !691, line: 313, baseType: !994, size: 64, align: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1032, file: !691, line: 318, baseType: !994, size: 64, align: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1032, file: !691, line: 318, baseType: !994, size: 64, align: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1032, file: !691, line: 323, baseType: !943, size: 32, align: 32, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1026, file: !691, line: 364, baseType: !943, size: 32, align: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1026, file: !691, line: 368, baseType: !943, size: 32, align: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !933, file: !14, line: 3495, baseType: !1043, size: 64, align: 64, offset: 704)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1046, file: !14, line: 3402, baseType: !943, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1046, file: !14, line: 3403, baseType: !936, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !933, file: !14, line: 3507, baseType: !936, size: 64, align: 64, offset: 768)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !933, file: !14, line: 3516, baseType: !943, size: 32, align: 32, offset: 832)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !933, file: !14, line: 3517, baseType: !1053, size: 64, align: 64, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !933, file: !14, line: 3527, baseType: !1055, size: 64, align: 64, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!943, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065, !1068, !1069, !1070, !1071, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1350, !1354, !1355, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1540, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1060, file: !14, line: 1561, baseType: !967, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1060, file: !14, line: 1562, baseType: !943, size: 32, align: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1060, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1060, file: !14, line: 1565, baseType: !1066, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1060, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1060, file: !14, line: 1581, baseType: !925, size: 32, align: 32, offset: 224)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1060, file: !14, line: 1583, baseType: !977, size: 64, align: 64, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1060, file: !14, line: 1591, baseType: !1072, size: 64, align: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1074, line: 129, size: 1664, align: 64, elements: !1075)
!1074 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1075 = !{!1076, !1077, !1078, !1079, !1176, !1197, !1198, !1227, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1073, file: !1074, line: 136, baseType: !943, size: 32, align: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1073, file: !1074, line: 151, baseType: !943, size: 32, align: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1073, file: !1074, line: 157, baseType: !943, size: 32, align: 32, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1073, file: !1074, line: 159, baseType: !1080, size: 64, align: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1083)
!1083 = !{!1084, !1088, !1090, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1128, !1130, !1131, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1164, !1165, !1166, !1167, !1168, !1169, !1172, !1173, !1174, !1175}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1082, file: !744, line: 282, baseType: !1085, size: 512, align: 64)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 512, align: 64, elements: !1086)
!1086 = !{!1087}
!1087 = !DISubrange(count: 8)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1082, file: !744, line: 299, baseType: !1089, size: 256, align: 32, offset: 512)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 32, elements: !1086)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1082, file: !744, line: 315, baseType: !1091, size: 64, align: 64, offset: 768)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1082, file: !744, line: 326, baseType: !943, size: 32, align: 32, offset: 832)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1082, file: !744, line: 326, baseType: !943, size: 32, align: 32, offset: 864)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1082, file: !744, line: 334, baseType: !943, size: 32, align: 32, offset: 896)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1082, file: !744, line: 341, baseType: !943, size: 32, align: 32, offset: 928)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1082, file: !744, line: 346, baseType: !943, size: 32, align: 32, offset: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1082, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1082, file: !744, line: 356, baseType: !947, size: 64, align: 32, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1082, file: !744, line: 361, baseType: !991, size: 64, align: 64, offset: 1088)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1082, file: !744, line: 369, baseType: !991, size: 64, align: 64, offset: 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1082, file: !744, line: 377, baseType: !991, size: 64, align: 64, offset: 1216)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1082, file: !744, line: 382, baseType: !943, size: 32, align: 32, offset: 1280)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1082, file: !744, line: 386, baseType: !943, size: 32, align: 32, offset: 1312)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1082, file: !744, line: 391, baseType: !943, size: 32, align: 32, offset: 1344)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1082, file: !744, line: 396, baseType: !977, size: 64, align: 64, offset: 1408)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1082, file: !744, line: 403, baseType: !1107, size: 512, align: 64, offset: 1472)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 512, align: 64, elements: !1086)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1082, file: !744, line: 410, baseType: !943, size: 32, align: 32, offset: 1984)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1082, file: !744, line: 415, baseType: !943, size: 32, align: 32, offset: 2016)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1082, file: !744, line: 420, baseType: !943, size: 32, align: 32, offset: 2048)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1082, file: !744, line: 425, baseType: !943, size: 32, align: 32, offset: 2080)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1082, file: !744, line: 435, baseType: !991, size: 64, align: 64, offset: 2112)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1082, file: !744, line: 440, baseType: !943, size: 32, align: 32, offset: 2176)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1082, file: !744, line: 445, baseType: !910, size: 64, align: 64, offset: 2240)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1082, file: !744, line: 459, baseType: !1116, size: 512, align: 64, offset: 2304)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 512, align: 64, elements: !1086)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1119, line: 94, baseType: !1120)
!1119 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1119, line: 81, size: 192, align: 64, elements: !1121)
!1121 = !{!1122, !1126, !1127}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1120, file: !1119, line: 82, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1119, line: 73, baseType: !1125)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1119, line: 73, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !1119, line: 89, baseType: !926, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1120, file: !1119, line: 93, baseType: !943, size: 32, align: 32, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1082, file: !744, line: 473, baseType: !1129, size: 64, align: 64, offset: 2816)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1082, file: !744, line: 477, baseType: !943, size: 32, align: 32, offset: 2880)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1082, file: !744, line: 479, baseType: !1132, size: 64, align: 64, offset: 2944)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1145}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1135, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1135, file: !744, line: 203, baseType: !926, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !744, line: 204, baseType: !943, size: 32, align: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1135, file: !744, line: 205, baseType: !1141, size: 64, align: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1143, line: 86, baseType: !1144)
!1143 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1143, line: 86, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1135, file: !744, line: 206, baseType: !1117, size: 64, align: 64, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1082, file: !744, line: 480, baseType: !943, size: 32, align: 32, offset: 3008)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !744, line: 505, baseType: !943, size: 32, align: 32, offset: 3040)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1082, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1082, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1082, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1082, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1082, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1082, file: !744, line: 532, baseType: !991, size: 64, align: 64, offset: 3264)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1082, file: !744, line: 539, baseType: !991, size: 64, align: 64, offset: 3328)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1082, file: !744, line: 547, baseType: !991, size: 64, align: 64, offset: 3392)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1082, file: !744, line: 554, baseType: !1141, size: 64, align: 64, offset: 3456)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1082, file: !744, line: 563, baseType: !943, size: 32, align: 32, offset: 3520)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1082, file: !744, line: 572, baseType: !943, size: 32, align: 32, offset: 3552)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1082, file: !744, line: 581, baseType: !943, size: 32, align: 32, offset: 3584)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1082, file: !744, line: 588, baseType: !1161, size: 64, align: 64, offset: 3648)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !911, line: 36, baseType: !1163)
!1163 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1082, file: !744, line: 593, baseType: !943, size: 32, align: 32, offset: 3712)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1082, file: !744, line: 596, baseType: !943, size: 32, align: 32, offset: 3744)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1082, file: !744, line: 599, baseType: !1117, size: 64, align: 64, offset: 3776)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1082, file: !744, line: 605, baseType: !1117, size: 64, align: 64, offset: 3840)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1082, file: !744, line: 616, baseType: !1117, size: 64, align: 64, offset: 3904)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1082, file: !744, line: 626, baseType: !1170, size: 64, align: 64, offset: 3968)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1171, line: 216, baseType: !912)
!1171 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1082, file: !744, line: 627, baseType: !1170, size: 64, align: 64, offset: 4032)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1082, file: !744, line: 628, baseType: !1170, size: 64, align: 64, offset: 4096)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1082, file: !744, line: 629, baseType: !1170, size: 64, align: 64, offset: 4160)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1082, file: !744, line: 645, baseType: !1117, size: 64, align: 64, offset: 4224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1073, file: !1074, line: 161, baseType: !1177, size: 64, align: 64, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1074, line: 117, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1074, line: 100, size: 832, align: 64, elements: !1180)
!1180 = !{!1181, !1188, !1189, !1190, !1191, !1192, !1194, !1195, !1196}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1179, file: !1074, line: 105, baseType: !1182, size: 256, align: 64)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1183, size: 256, align: 64, elements: !1186)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1119, line: 238, baseType: !1185)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1119, line: 238, flags: DIFlagFwdDecl)
!1186 = !{!1187}
!1187 = !DISubrange(count: 4)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1179, file: !1074, line: 110, baseType: !943, size: 32, align: 32, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1179, file: !1074, line: 111, baseType: !943, size: 32, align: 32, offset: 288)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1179, file: !1074, line: 111, baseType: !943, size: 32, align: 32, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1179, file: !1074, line: 112, baseType: !1089, size: 256, align: 32, offset: 352)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1179, file: !1074, line: 113, baseType: !1193, size: 128, align: 32, offset: 608)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, align: 32, elements: !1186)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1179, file: !1074, line: 114, baseType: !943, size: 32, align: 32, offset: 736)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1179, file: !1074, line: 115, baseType: !943, size: 32, align: 32, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1179, file: !1074, line: 116, baseType: !943, size: 32, align: 32, offset: 800)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1073, file: !1074, line: 163, baseType: !977, size: 64, align: 64, offset: 256)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1073, file: !1074, line: 165, baseType: !1199, size: 128, align: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1074, line: 122, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1074, line: 119, size: 128, align: 64, elements: !1201)
!1201 = !{!1202, !1226}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1200, file: !1074, line: 120, baseType: !1203, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1222, !1223, !1224, !1225}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1205, file: !14, line: 1451, baseType: !1117, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1205, file: !14, line: 1461, baseType: !991, size: 64, align: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1205, file: !14, line: 1467, baseType: !991, size: 64, align: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1205, file: !14, line: 1468, baseType: !926, size: 64, align: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !14, line: 1469, baseType: !943, size: 32, align: 32, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1205, file: !14, line: 1470, baseType: !943, size: 32, align: 32, offset: 288)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1205, file: !14, line: 1474, baseType: !943, size: 32, align: 32, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1205, file: !14, line: 1479, baseType: !1215, size: 64, align: 64, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1218)
!1218 = !{!1219, !1220, !1221}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !14, line: 1412, baseType: !926, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !14, line: 1413, baseType: !943, size: 32, align: 32, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1217, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1205, file: !14, line: 1480, baseType: !943, size: 32, align: 32, offset: 448)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1205, file: !14, line: 1486, baseType: !991, size: 64, align: 64, offset: 512)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1205, file: !14, line: 1488, baseType: !991, size: 64, align: 64, offset: 576)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1205, file: !14, line: 1497, baseType: !991, size: 64, align: 64, offset: 640)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1200, file: !1074, line: 121, baseType: !1080, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1073, file: !1074, line: 166, baseType: !1228, size: 128, align: 64, offset: 448)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1074, line: 127, baseType: !1229)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1074, line: 124, size: 128, align: 64, elements: !1230)
!1230 = !{!1231, !1304}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1229, file: !1074, line: 125, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1262, !1266, !1267, !1301, !1302, !1303}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1235, file: !14, line: 5751, baseType: !967, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1235, file: !14, line: 5756, baseType: !1239, size: 64, align: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1242)
!1242 = !{!1243, !1244, !1247, !1248, !1249, !1253, !1257, !1261}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1241, file: !14, line: 5797, baseType: !936, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1241, file: !14, line: 5804, baseType: !1245, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1241, file: !14, line: 5815, baseType: !967, size: 64, align: 64, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1241, file: !14, line: 5825, baseType: !943, size: 32, align: 32, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1241, file: !14, line: 5826, baseType: !1250, size: 64, align: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!943, !1233}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1241, file: !14, line: 5827, baseType: !1254, size: 64, align: 64, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!943, !1233, !1203}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1241, file: !14, line: 5828, baseType: !1258, size: 64, align: 64, offset: 384)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !1233}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1241, file: !14, line: 5829, baseType: !1258, size: 64, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1235, file: !14, line: 5762, baseType: !1263, size: 64, align: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1265)
!1265 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1235, file: !14, line: 5768, baseType: !977, size: 64, align: 64, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1235, file: !14, line: 5775, baseType: !1268, size: 64, align: 64, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1271)
!1271 = !{!1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1270, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1270, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1270, file: !14, line: 3948, baseType: !924, size: 32, align: 32, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1270, file: !14, line: 3958, baseType: !926, size: 64, align: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1270, file: !14, line: 3962, baseType: !943, size: 32, align: 32, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1270, file: !14, line: 3968, baseType: !943, size: 32, align: 32, offset: 224)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1270, file: !14, line: 3973, baseType: !991, size: 64, align: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1270, file: !14, line: 3986, baseType: !943, size: 32, align: 32, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1270, file: !14, line: 3999, baseType: !943, size: 32, align: 32, offset: 352)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1270, file: !14, line: 4004, baseType: !943, size: 32, align: 32, offset: 384)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1270, file: !14, line: 4005, baseType: !943, size: 32, align: 32, offset: 416)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1270, file: !14, line: 4010, baseType: !943, size: 32, align: 32, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1270, file: !14, line: 4011, baseType: !943, size: 32, align: 32, offset: 480)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1270, file: !14, line: 4020, baseType: !947, size: 64, align: 32, offset: 512)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1270, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1270, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1270, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1270, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1270, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1270, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1270, file: !14, line: 4039, baseType: !943, size: 32, align: 32, offset: 768)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1270, file: !14, line: 4046, baseType: !910, size: 64, align: 64, offset: 832)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1270, file: !14, line: 4050, baseType: !943, size: 32, align: 32, offset: 896)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1270, file: !14, line: 4054, baseType: !943, size: 32, align: 32, offset: 928)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1270, file: !14, line: 4061, baseType: !943, size: 32, align: 32, offset: 960)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1270, file: !14, line: 4065, baseType: !943, size: 32, align: 32, offset: 992)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1270, file: !14, line: 4073, baseType: !943, size: 32, align: 32, offset: 1024)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1270, file: !14, line: 4080, baseType: !943, size: 32, align: 32, offset: 1056)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1270, file: !14, line: 4084, baseType: !943, size: 32, align: 32, offset: 1088)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1235, file: !14, line: 5781, baseType: !1268, size: 64, align: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1235, file: !14, line: 5787, baseType: !947, size: 64, align: 32, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1235, file: !14, line: 5793, baseType: !947, size: 64, align: 32, offset: 448)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1229, file: !1074, line: 126, baseType: !943, size: 32, align: 32, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1073, file: !1074, line: 172, baseType: !1203, size: 64, align: 64, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1073, file: !1074, line: 177, baseType: !926, size: 64, align: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1073, file: !1074, line: 178, baseType: !925, size: 32, align: 32, offset: 704)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1073, file: !1074, line: 180, baseType: !977, size: 64, align: 64, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1073, file: !1074, line: 185, baseType: !943, size: 32, align: 32, offset: 832)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1073, file: !1074, line: 190, baseType: !977, size: 64, align: 64, offset: 896)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1073, file: !1074, line: 195, baseType: !943, size: 32, align: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1073, file: !1074, line: 200, baseType: !1203, size: 64, align: 64, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1073, file: !1074, line: 201, baseType: !943, size: 32, align: 32, offset: 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1073, file: !1074, line: 202, baseType: !1080, size: 64, align: 64, offset: 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1073, file: !1074, line: 203, baseType: !943, size: 32, align: 32, offset: 1216)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1073, file: !1074, line: 205, baseType: !943, size: 32, align: 32, offset: 1248)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1073, file: !1074, line: 206, baseType: !943, size: 32, align: 32, offset: 1280)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1073, file: !1074, line: 209, baseType: !1170, size: 64, align: 64, offset: 1344)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1073, file: !1074, line: 212, baseType: !1170, size: 64, align: 64, offset: 1408)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1073, file: !1074, line: 213, baseType: !1080, size: 64, align: 64, offset: 1472)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1073, file: !1074, line: 215, baseType: !943, size: 32, align: 32, offset: 1536)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1073, file: !1074, line: 217, baseType: !943, size: 32, align: 32, offset: 1568)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1073, file: !1074, line: 220, baseType: !943, size: 32, align: 32, offset: 1600)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1060, file: !14, line: 1598, baseType: !977, size: 64, align: 64, offset: 384)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1060, file: !14, line: 1606, baseType: !991, size: 64, align: 64, offset: 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1060, file: !14, line: 1614, baseType: !943, size: 32, align: 32, offset: 512)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1060, file: !14, line: 1622, baseType: !943, size: 32, align: 32, offset: 544)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1060, file: !14, line: 1628, baseType: !943, size: 32, align: 32, offset: 576)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1060, file: !14, line: 1636, baseType: !943, size: 32, align: 32, offset: 608)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1060, file: !14, line: 1643, baseType: !943, size: 32, align: 32, offset: 640)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1060, file: !14, line: 1657, baseType: !926, size: 64, align: 64, offset: 704)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1060, file: !14, line: 1658, baseType: !943, size: 32, align: 32, offset: 768)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1060, file: !14, line: 1679, baseType: !947, size: 64, align: 32, offset: 800)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1060, file: !14, line: 1688, baseType: !943, size: 32, align: 32, offset: 864)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1060, file: !14, line: 1712, baseType: !943, size: 32, align: 32, offset: 896)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1060, file: !14, line: 1729, baseType: !943, size: 32, align: 32, offset: 928)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1060, file: !14, line: 1729, baseType: !943, size: 32, align: 32, offset: 960)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1060, file: !14, line: 1744, baseType: !943, size: 32, align: 32, offset: 992)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1060, file: !14, line: 1744, baseType: !943, size: 32, align: 32, offset: 1024)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1060, file: !14, line: 1751, baseType: !943, size: 32, align: 32, offset: 1056)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1060, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1060, file: !14, line: 1791, baseType: !1343, size: 64, align: 64, offset: 1152)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{null, !1346, !1347, !1349, !943, !943, !943}
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1060, file: !14, line: 1808, baseType: !1351, size: 64, align: 64, offset: 1216)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!473, !1346, !954}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1060, file: !14, line: 1816, baseType: !943, size: 32, align: 32, offset: 1280)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1060, file: !14, line: 1825, baseType: !1356, size: 32, align: 32, offset: 1312)
!1356 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1060, file: !14, line: 1830, baseType: !943, size: 32, align: 32, offset: 1344)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1060, file: !14, line: 1838, baseType: !1356, size: 32, align: 32, offset: 1376)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1060, file: !14, line: 1846, baseType: !943, size: 32, align: 32, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1060, file: !14, line: 1851, baseType: !943, size: 32, align: 32, offset: 1440)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1060, file: !14, line: 1861, baseType: !1356, size: 32, align: 32, offset: 1472)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1060, file: !14, line: 1868, baseType: !1356, size: 32, align: 32, offset: 1504)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1060, file: !14, line: 1875, baseType: !1356, size: 32, align: 32, offset: 1536)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1060, file: !14, line: 1882, baseType: !1356, size: 32, align: 32, offset: 1568)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1060, file: !14, line: 1889, baseType: !1356, size: 32, align: 32, offset: 1600)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1060, file: !14, line: 1896, baseType: !1356, size: 32, align: 32, offset: 1632)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1060, file: !14, line: 1903, baseType: !1356, size: 32, align: 32, offset: 1664)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1060, file: !14, line: 1910, baseType: !943, size: 32, align: 32, offset: 1696)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1060, file: !14, line: 1915, baseType: !943, size: 32, align: 32, offset: 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1060, file: !14, line: 1926, baseType: !1349, size: 64, align: 64, offset: 1792)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1060, file: !14, line: 1935, baseType: !947, size: 64, align: 32, offset: 1856)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1060, file: !14, line: 1942, baseType: !943, size: 32, align: 32, offset: 1920)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1060, file: !14, line: 1948, baseType: !943, size: 32, align: 32, offset: 1952)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1060, file: !14, line: 1954, baseType: !943, size: 32, align: 32, offset: 1984)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1060, file: !14, line: 1960, baseType: !943, size: 32, align: 32, offset: 2016)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1060, file: !14, line: 1984, baseType: !943, size: 32, align: 32, offset: 2048)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1060, file: !14, line: 1991, baseType: !943, size: 32, align: 32, offset: 2080)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1060, file: !14, line: 1996, baseType: !943, size: 32, align: 32, offset: 2112)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1060, file: !14, line: 2004, baseType: !943, size: 32, align: 32, offset: 2144)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1060, file: !14, line: 2011, baseType: !943, size: 32, align: 32, offset: 2176)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1060, file: !14, line: 2018, baseType: !943, size: 32, align: 32, offset: 2208)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1060, file: !14, line: 2027, baseType: !943, size: 32, align: 32, offset: 2240)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1060, file: !14, line: 2034, baseType: !943, size: 32, align: 32, offset: 2272)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1060, file: !14, line: 2044, baseType: !943, size: 32, align: 32, offset: 2304)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1060, file: !14, line: 2054, baseType: !1386, size: 64, align: 64, offset: 2368)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1060, file: !14, line: 2061, baseType: !1386, size: 64, align: 64, offset: 2432)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1060, file: !14, line: 2066, baseType: !943, size: 32, align: 32, offset: 2496)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1060, file: !14, line: 2070, baseType: !943, size: 32, align: 32, offset: 2528)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1060, file: !14, line: 2078, baseType: !943, size: 32, align: 32, offset: 2560)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1060, file: !14, line: 2085, baseType: !943, size: 32, align: 32, offset: 2592)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1060, file: !14, line: 2092, baseType: !943, size: 32, align: 32, offset: 2624)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1060, file: !14, line: 2099, baseType: !943, size: 32, align: 32, offset: 2656)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1060, file: !14, line: 2106, baseType: !943, size: 32, align: 32, offset: 2688)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1060, file: !14, line: 2113, baseType: !943, size: 32, align: 32, offset: 2720)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1060, file: !14, line: 2120, baseType: !943, size: 32, align: 32, offset: 2752)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1060, file: !14, line: 2125, baseType: !943, size: 32, align: 32, offset: 2784)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1060, file: !14, line: 2133, baseType: !943, size: 32, align: 32, offset: 2816)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1060, file: !14, line: 2140, baseType: !943, size: 32, align: 32, offset: 2848)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1060, file: !14, line: 2145, baseType: !943, size: 32, align: 32, offset: 2880)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1060, file: !14, line: 2153, baseType: !943, size: 32, align: 32, offset: 2912)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1060, file: !14, line: 2158, baseType: !943, size: 32, align: 32, offset: 2944)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1060, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1060, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1060, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1060, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1060, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1060, file: !14, line: 2203, baseType: !943, size: 32, align: 32, offset: 3136)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1060, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1060, file: !14, line: 2212, baseType: !943, size: 32, align: 32, offset: 3200)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1060, file: !14, line: 2213, baseType: !943, size: 32, align: 32, offset: 3232)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1060, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1060, file: !14, line: 2232, baseType: !943, size: 32, align: 32, offset: 3296)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1060, file: !14, line: 2243, baseType: !943, size: 32, align: 32, offset: 3328)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1060, file: !14, line: 2249, baseType: !943, size: 32, align: 32, offset: 3360)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1060, file: !14, line: 2256, baseType: !943, size: 32, align: 32, offset: 3392)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1060, file: !14, line: 2263, baseType: !910, size: 64, align: 64, offset: 3456)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1060, file: !14, line: 2270, baseType: !910, size: 64, align: 64, offset: 3520)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1060, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1060, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1060, file: !14, line: 2367, baseType: !1422, size: 64, align: 64, offset: 3648)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!943, !1346, !1080, !943}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1060, file: !14, line: 2383, baseType: !943, size: 32, align: 32, offset: 3712)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1060, file: !14, line: 2386, baseType: !1356, size: 32, align: 32, offset: 3744)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1060, file: !14, line: 2387, baseType: !1356, size: 32, align: 32, offset: 3776)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1060, file: !14, line: 2394, baseType: !943, size: 32, align: 32, offset: 3808)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1060, file: !14, line: 2401, baseType: !943, size: 32, align: 32, offset: 3840)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1060, file: !14, line: 2408, baseType: !943, size: 32, align: 32, offset: 3872)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1060, file: !14, line: 2415, baseType: !943, size: 32, align: 32, offset: 3904)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1060, file: !14, line: 2422, baseType: !943, size: 32, align: 32, offset: 3936)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1060, file: !14, line: 2423, baseType: !1434, size: 64, align: 64, offset: 3968)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1436)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1437)
!1437 = !{!1438, !1439, !1440, !1441}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1436, file: !14, line: 827, baseType: !943, size: 32, align: 32)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1436, file: !14, line: 828, baseType: !943, size: 32, align: 32, offset: 32)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1436, file: !14, line: 829, baseType: !943, size: 32, align: 32, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1436, file: !14, line: 830, baseType: !1356, size: 32, align: 32, offset: 96)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1060, file: !14, line: 2430, baseType: !991, size: 64, align: 64, offset: 4032)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1060, file: !14, line: 2437, baseType: !991, size: 64, align: 64, offset: 4096)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1060, file: !14, line: 2444, baseType: !1356, size: 32, align: 32, offset: 4160)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1060, file: !14, line: 2451, baseType: !1356, size: 32, align: 32, offset: 4192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1060, file: !14, line: 2458, baseType: !943, size: 32, align: 32, offset: 4224)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1060, file: !14, line: 2469, baseType: !943, size: 32, align: 32, offset: 4256)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1060, file: !14, line: 2475, baseType: !943, size: 32, align: 32, offset: 4288)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1060, file: !14, line: 2481, baseType: !943, size: 32, align: 32, offset: 4320)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1060, file: !14, line: 2485, baseType: !943, size: 32, align: 32, offset: 4352)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1060, file: !14, line: 2489, baseType: !943, size: 32, align: 32, offset: 4384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1060, file: !14, line: 2493, baseType: !943, size: 32, align: 32, offset: 4416)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1060, file: !14, line: 2501, baseType: !943, size: 32, align: 32, offset: 4448)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1060, file: !14, line: 2506, baseType: !943, size: 32, align: 32, offset: 4480)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1060, file: !14, line: 2510, baseType: !943, size: 32, align: 32, offset: 4512)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1060, file: !14, line: 2514, baseType: !991, size: 64, align: 64, offset: 4544)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1060, file: !14, line: 2528, baseType: !1458, size: 64, align: 64, offset: 4608)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{null, !1346, !977, !943, !943}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1060, file: !14, line: 2534, baseType: !943, size: 32, align: 32, offset: 4672)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1060, file: !14, line: 2545, baseType: !943, size: 32, align: 32, offset: 4704)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1060, file: !14, line: 2547, baseType: !943, size: 32, align: 32, offset: 4736)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1060, file: !14, line: 2549, baseType: !943, size: 32, align: 32, offset: 4768)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1060, file: !14, line: 2551, baseType: !943, size: 32, align: 32, offset: 4800)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1060, file: !14, line: 2553, baseType: !943, size: 32, align: 32, offset: 4832)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1060, file: !14, line: 2555, baseType: !943, size: 32, align: 32, offset: 4864)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1060, file: !14, line: 2557, baseType: !943, size: 32, align: 32, offset: 4896)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1060, file: !14, line: 2559, baseType: !943, size: 32, align: 32, offset: 4928)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1060, file: !14, line: 2563, baseType: !943, size: 32, align: 32, offset: 4960)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1060, file: !14, line: 2571, baseType: !1472, size: 64, align: 64, offset: 4992)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1060, file: !14, line: 2579, baseType: !1472, size: 64, align: 64, offset: 5056)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1060, file: !14, line: 2586, baseType: !943, size: 32, align: 32, offset: 5120)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1060, file: !14, line: 2615, baseType: !943, size: 32, align: 32, offset: 5152)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1060, file: !14, line: 2627, baseType: !943, size: 32, align: 32, offset: 5184)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1060, file: !14, line: 2637, baseType: !943, size: 32, align: 32, offset: 5216)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1060, file: !14, line: 2681, baseType: !943, size: 32, align: 32, offset: 5248)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1060, file: !14, line: 2709, baseType: !991, size: 64, align: 64, offset: 5312)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1060, file: !14, line: 2716, baseType: !1481, size: 64, align: 64, offset: 5376)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1483)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1488, !1489, !1490, !1494, !1500, !1504, !1505, !1506, !1507, !1513, !1514, !1515, !1516, !1517}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1483, file: !14, line: 3642, baseType: !936, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1483, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1483, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1483, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1483, file: !14, line: 3669, baseType: !943, size: 32, align: 32, offset: 160)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1483, file: !14, line: 3682, baseType: !1491, size: 64, align: 64, offset: 192)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!943, !1058, !1080}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1483, file: !14, line: 3698, baseType: !1495, size: 64, align: 64, offset: 256)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!943, !1058, !1498, !924}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1483, file: !14, line: 3712, baseType: !1501, size: 64, align: 64, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!943, !1058, !943, !1498, !924}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1483, file: !14, line: 3726, baseType: !1495, size: 64, align: 64, offset: 384)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1483, file: !14, line: 3737, baseType: !1055, size: 64, align: 64, offset: 448)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1483, file: !14, line: 3746, baseType: !943, size: 32, align: 32, offset: 512)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1483, file: !14, line: 3757, baseType: !1508, size: 64, align: 64, offset: 576)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{null, !1511}
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1483, file: !14, line: 3766, baseType: !1055, size: 64, align: 64, offset: 640)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1483, file: !14, line: 3774, baseType: !1055, size: 64, align: 64, offset: 704)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1483, file: !14, line: 3780, baseType: !943, size: 32, align: 32, offset: 768)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1483, file: !14, line: 3785, baseType: !943, size: 32, align: 32, offset: 800)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1483, file: !14, line: 3795, baseType: !1518, size: 64, align: 64, offset: 832)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!943, !1058, !1117}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1060, file: !14, line: 2728, baseType: !977, size: 64, align: 64, offset: 5440)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1060, file: !14, line: 2735, baseType: !1107, size: 512, align: 64, offset: 5504)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1060, file: !14, line: 2742, baseType: !943, size: 32, align: 32, offset: 6016)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1060, file: !14, line: 2755, baseType: !943, size: 32, align: 32, offset: 6048)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1060, file: !14, line: 2776, baseType: !943, size: 32, align: 32, offset: 6080)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1060, file: !14, line: 2783, baseType: !943, size: 32, align: 32, offset: 6112)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1060, file: !14, line: 2791, baseType: !943, size: 32, align: 32, offset: 6144)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1060, file: !14, line: 2802, baseType: !1080, size: 64, align: 64, offset: 6208)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1060, file: !14, line: 2811, baseType: !943, size: 32, align: 32, offset: 6272)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1060, file: !14, line: 2821, baseType: !943, size: 32, align: 32, offset: 6304)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1060, file: !14, line: 2830, baseType: !943, size: 32, align: 32, offset: 6336)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1060, file: !14, line: 2840, baseType: !943, size: 32, align: 32, offset: 6368)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1060, file: !14, line: 2851, baseType: !1534, size: 64, align: 64, offset: 6400)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!943, !1346, !1537, !977, !1349, !943, !943}
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DISubroutineType(types: !1539)
!1539 = !{!943, !1346, !977}
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1060, file: !14, line: 2871, baseType: !1541, size: 64, align: 64, offset: 6464)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!943, !1346, !1544, !977, !1349, !943}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!943, !1346, !977, !943, !943}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1060, file: !14, line: 2878, baseType: !943, size: 32, align: 32, offset: 6528)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1060, file: !14, line: 2885, baseType: !943, size: 32, align: 32, offset: 6560)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1060, file: !14, line: 3005, baseType: !943, size: 32, align: 32, offset: 6592)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1060, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1060, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1060, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1060, file: !14, line: 3037, baseType: !926, size: 64, align: 64, offset: 6720)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1060, file: !14, line: 3038, baseType: !943, size: 32, align: 32, offset: 6784)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1060, file: !14, line: 3050, baseType: !910, size: 64, align: 64, offset: 6848)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1060, file: !14, line: 3065, baseType: !943, size: 32, align: 32, offset: 6912)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1060, file: !14, line: 3083, baseType: !943, size: 32, align: 32, offset: 6944)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1060, file: !14, line: 3092, baseType: !947, size: 64, align: 32, offset: 6976)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1060, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1060, file: !14, line: 3106, baseType: !947, size: 64, align: 32, offset: 7072)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1060, file: !14, line: 3113, baseType: !1562, size: 64, align: 64, offset: 7168)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1564)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570, !1571, !1572, !1575}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1565, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1565, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1565, file: !14, line: 720, baseType: !936, size: 64, align: 64, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1565, file: !14, line: 724, baseType: !936, size: 64, align: 64, offset: 128)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1565, file: !14, line: 728, baseType: !943, size: 32, align: 32, offset: 192)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1565, file: !14, line: 734, baseType: !1573, size: 64, align: 64, offset: 256)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1565, file: !14, line: 739, baseType: !1576, size: 64, align: 64, offset: 320)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1060, file: !14, line: 3129, baseType: !991, size: 64, align: 64, offset: 7232)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1060, file: !14, line: 3130, baseType: !991, size: 64, align: 64, offset: 7296)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1060, file: !14, line: 3131, baseType: !991, size: 64, align: 64, offset: 7360)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1060, file: !14, line: 3132, baseType: !991, size: 64, align: 64, offset: 7424)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1060, file: !14, line: 3139, baseType: !1472, size: 64, align: 64, offset: 7488)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1060, file: !14, line: 3147, baseType: !943, size: 32, align: 32, offset: 7552)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1060, file: !14, line: 3165, baseType: !943, size: 32, align: 32, offset: 7584)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1060, file: !14, line: 3172, baseType: !943, size: 32, align: 32, offset: 7616)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1060, file: !14, line: 3180, baseType: !943, size: 32, align: 32, offset: 7648)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1060, file: !14, line: 3191, baseType: !1386, size: 64, align: 64, offset: 7680)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1060, file: !14, line: 3199, baseType: !926, size: 64, align: 64, offset: 7744)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1060, file: !14, line: 3207, baseType: !1472, size: 64, align: 64, offset: 7808)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1060, file: !14, line: 3214, baseType: !925, size: 32, align: 32, offset: 7872)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1060, file: !14, line: 3224, baseType: !1215, size: 64, align: 64, offset: 7936)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1060, file: !14, line: 3225, baseType: !943, size: 32, align: 32, offset: 8000)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1060, file: !14, line: 3249, baseType: !1117, size: 64, align: 64, offset: 8064)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1060, file: !14, line: 3256, baseType: !943, size: 32, align: 32, offset: 8128)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1060, file: !14, line: 3271, baseType: !943, size: 32, align: 32, offset: 8160)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1060, file: !14, line: 3279, baseType: !991, size: 64, align: 64, offset: 8192)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1060, file: !14, line: 3301, baseType: !1117, size: 64, align: 64, offset: 8256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1060, file: !14, line: 3310, baseType: !943, size: 32, align: 32, offset: 8320)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1060, file: !14, line: 3337, baseType: !943, size: 32, align: 32, offset: 8352)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1060, file: !14, line: 3351, baseType: !943, size: 32, align: 32, offset: 8384)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1060, file: !14, line: 3359, baseType: !943, size: 32, align: 32, offset: 8416)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !933, file: !14, line: 3535, baseType: !1603, size: 64, align: 64, offset: 1024)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!943, !1058, !1606}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !933, file: !14, line: 3541, baseType: !1609, size: 64, align: 64, offset: 1088)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1611)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1612)
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1074, line: 223, size: 128, align: 64, elements: !1613)
!1613 = !{!1614, !1615}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1612, file: !1074, line: 224, baseType: !1498, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1612, file: !1074, line: 225, baseType: !1498, size: 64, align: 64, offset: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !933, file: !14, line: 3549, baseType: !1617, size: 64, align: 64, offset: 1152)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{null, !1053}
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !933, file: !14, line: 3551, baseType: !1055, size: 64, align: 64, offset: 1216)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !933, file: !14, line: 3552, baseType: !1622, size: 64, align: 64, offset: 1280)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!943, !1058, !926, !943, !1625}
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1627)
!1627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1628)
!1628 = !{!1629, !1630, !1631, !1632, !1633, !1657}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1627, file: !14, line: 3921, baseType: !918, size: 16, align: 16)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1627, file: !14, line: 3922, baseType: !924, size: 32, align: 32, offset: 32)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1627, file: !14, line: 3923, baseType: !924, size: 32, align: 32, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1627, file: !14, line: 3924, baseType: !925, size: 32, align: 32, offset: 96)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1627, file: !14, line: 3925, baseType: !1634, size: 64, align: 64, offset: 128)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1637)
!1637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1638)
!1638 = !{!1639, !1640, !1641, !1642, !1643, !1644, !1650, !1652, !1653, !1654, !1655, !1656}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1637, file: !14, line: 3886, baseType: !943, size: 32, align: 32)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1637, file: !14, line: 3887, baseType: !943, size: 32, align: 32, offset: 32)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1637, file: !14, line: 3888, baseType: !943, size: 32, align: 32, offset: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1637, file: !14, line: 3889, baseType: !943, size: 32, align: 32, offset: 96)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1637, file: !14, line: 3890, baseType: !943, size: 32, align: 32, offset: 128)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1637, file: !14, line: 3897, baseType: !1645, size: 768, align: 64, offset: 192)
!1645 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1646)
!1646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1647)
!1647 = !{!1648, !1649}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1646, file: !14, line: 3855, baseType: !1085, size: 512, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1646, file: !14, line: 3857, baseType: !1089, size: 256, align: 32, offset: 512)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1637, file: !14, line: 3903, baseType: !1651, size: 256, align: 64, offset: 960)
!1651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 256, align: 64, elements: !1186)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1637, file: !14, line: 3904, baseType: !1193, size: 128, align: 32, offset: 1216)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1637, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1637, file: !14, line: 3908, baseType: !1472, size: 64, align: 64, offset: 1408)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1637, file: !14, line: 3915, baseType: !1472, size: 64, align: 64, offset: 1472)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1637, file: !14, line: 3917, baseType: !943, size: 32, align: 32, offset: 1536)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1627, file: !14, line: 3926, baseType: !991, size: 64, align: 64, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !933, file: !14, line: 3564, baseType: !1659, size: 64, align: 64, offset: 1344)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!943, !1058, !1203, !1347, !1349}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !933, file: !14, line: 3566, baseType: !1663, size: 64, align: 64, offset: 1408)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!943, !1058, !977, !1349, !1203}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !933, file: !14, line: 3567, baseType: !1055, size: 64, align: 64, offset: 1472)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !933, file: !14, line: 3576, baseType: !1668, size: 64, align: 64, offset: 1536)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!943, !1058, !1347}
