; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--proresenc_kostya.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--proresenc_kostya.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }

!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 43, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/proresenc_kostya.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "PRORES_PROFILE_AUTO", value: -1)
!913 = !DIEnumerator(name: "PRORES_PROFILE_PROXY", value: 0)
!914 = !DIEnumerator(name: "PRORES_PROFILE_LT", value: 1)
!915 = !DIEnumerator(name: "PRORES_PROFILE_STANDARD", value: 2)
!916 = !DIEnumerator(name: "PRORES_PROFILE_HQ", value: 3)
!917 = !DIEnumerator(name: "PRORES_PROFILE_4444", value: 4)
!918 = !DIEnumerator(name: "PRORES_PROFILE_4444XQ", value: 5)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 53, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927}
!921 = !DIEnumerator(name: "QUANT_MAT_PROXY", value: 0)
!922 = !DIEnumerator(name: "QUANT_MAT_PROXY_CHROMA", value: 1)
!923 = !DIEnumerator(name: "QUANT_MAT_LT", value: 2)
!924 = !DIEnumerator(name: "QUANT_MAT_STANDARD", value: 3)
!925 = !DIEnumerator(name: "QUANT_MAT_HQ", value: 4)
!926 = !DIEnumerator(name: "QUANT_MAT_XQ_LUMA", value: 5)
!927 = !DIEnumerator(name: "QUANT_MAT_DEFAULT", value: 6)
!928 = !{!929, !930, !931, !932, !939, !945, !948, !950}
!929 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!930 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !934, line: 221, size: 32, align: 8, elements: !935)
!934 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = !{!936}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !933, file: !934, line: 221, baseType: !937, size: 32, align: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !938, line: 51, baseType: !930)
!938 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !934, line: 222, size: 16, align: 8, elements: !941)
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !940, file: !934, line: 222, baseType: !943, size: 16, align: 16)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !938, line: 49, baseType: !944)
!944 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !938, line: 48, baseType: !947)
!947 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!952 = !{!953, !1707, !1708, !1714, !1728, !1733}
!953 = distinct !DIGlobalVariable(name: "ff_prores_ks_encoder", scope: !0, file: !910, line: 1422, type: !954, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_prores_ks_encoder)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !956)
!956 = !{!957, !961, !962, !963, !964, !965, !974, !977, !980, !983, !988, !989, !1064, !1072, !1073, !1074, !1076, !1622, !1628, !1636, !1640, !1641, !1678, !1682, !1686, !1687, !1691, !1695, !1696, !1700, !1701, !1702}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !955, file: !14, line: 3475, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !955, file: !14, line: 3480, baseType: !958, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !955, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !955, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !955, file: !14, line: 3487, baseType: !929, size: 32, align: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !955, file: !14, line: 3488, baseType: !966, size: 64, align: 64, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !969, line: 61, baseType: !970)
!969 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !969, line: 58, size: 64, align: 32, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !970, file: !969, line: 59, baseType: !929, size: 32, align: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !970, file: !969, line: 60, baseType: !929, size: 32, align: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !955, file: !14, line: 3489, baseType: !975, size: 64, align: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !955, file: !14, line: 3490, baseType: !978, size: 64, align: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !955, file: !14, line: 3491, baseType: !981, size: 64, align: 64, offset: 448)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !955, file: !14, line: 3492, baseType: !984, size: 64, align: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !938, line: 55, baseType: !987)
!987 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !955, file: !14, line: 3493, baseType: !946, size: 8, align: 8, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !955, file: !14, line: 3494, baseType: !990, size: 64, align: 64, offset: 640)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !994)
!994 = !{!995, !996, !1000, !1023, !1024, !1025, !1026, !1030, !1036, !1038, !1042}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !993, file: !713, line: 72, baseType: !958, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !993, file: !713, line: 78, baseType: !997, size: 64, align: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!958, !931}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !993, file: !713, line: 85, baseType: !1001, size: 64, align: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1019, !1020, !1021, !1022}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1003, file: !691, line: 247, baseType: !958, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1003, file: !691, line: 253, baseType: !958, size: 64, align: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1003, file: !691, line: 259, baseType: !929, size: 32, align: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1003, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1003, file: !691, line: 271, baseType: !1010, size: 64, align: 64, offset: 192)
!1010 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1003, file: !691, line: 265, size: 64, align: 64, elements: !1011)
!1011 = !{!1012, !1015, !1017, !1018}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1010, file: !691, line: 266, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !938, line: 40, baseType: !1014)
!1014 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1010, file: !691, line: 267, baseType: !1016, size: 64, align: 64)
!1016 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1010, file: !691, line: 268, baseType: !958, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1010, file: !691, line: 270, baseType: !968, size: 64, align: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1003, file: !691, line: 272, baseType: !1016, size: 64, align: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1003, file: !691, line: 273, baseType: !1016, size: 64, align: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1003, file: !691, line: 275, baseType: !929, size: 32, align: 32, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1003, file: !691, line: 300, baseType: !958, size: 64, align: 64, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !993, file: !713, line: 93, baseType: !929, size: 32, align: 32, offset: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !993, file: !713, line: 99, baseType: !929, size: 32, align: 32, offset: 224)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !993, file: !713, line: 108, baseType: !929, size: 32, align: 32, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !993, file: !713, line: 113, baseType: !1027, size: 64, align: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!931, !931, !931}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !993, file: !713, line: 123, baseType: !1031, size: 64, align: 64, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!1034, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !993)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !993, file: !713, line: 130, baseType: !1037, size: 32, align: 32, offset: 448)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !993, file: !713, line: 136, baseType: !1039, size: 64, align: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1037, !931}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !993, file: !713, line: 142, baseType: !1043, size: 64, align: 64, offset: 576)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!929, !1046, !931, !958, !929}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1049)
!1049 = !{!1050, !1062, !1063}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1048, file: !691, line: 360, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1054, file: !691, line: 307, baseType: !958, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1054, file: !691, line: 313, baseType: !1016, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1054, file: !691, line: 313, baseType: !1016, size: 64, align: 64, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1054, file: !691, line: 318, baseType: !1016, size: 64, align: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1054, file: !691, line: 318, baseType: !1016, size: 64, align: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1054, file: !691, line: 323, baseType: !929, size: 32, align: 32, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1048, file: !691, line: 364, baseType: !929, size: 32, align: 32, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1048, file: !691, line: 368, baseType: !929, size: 32, align: 32, offset: 96)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !955, file: !14, line: 3495, baseType: !1065, size: 64, align: 64, offset: 704)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1069)
!1069 = !{!1070, !1071}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1068, file: !14, line: 3402, baseType: !929, size: 32, align: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1068, file: !14, line: 3403, baseType: !958, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !955, file: !14, line: 3507, baseType: !958, size: 64, align: 64, offset: 768)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !955, file: !14, line: 3516, baseType: !929, size: 32, align: 32, offset: 832)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !14, line: 3517, baseType: !1075, size: 64, align: 64, offset: 896)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !955, file: !14, line: 3527, baseType: !1077, size: 64, align: 64, offset: 960)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!929, !1080}
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087, !1090, !1091, !1092, !1093, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1372, !1376, !1377, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1560, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1082, file: !14, line: 1561, baseType: !990, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1082, file: !14, line: 1562, baseType: !929, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1082, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1082, file: !14, line: 1565, baseType: !1088, size: 64, align: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1082, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1082, file: !14, line: 1581, baseType: !930, size: 32, align: 32, offset: 224)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1082, file: !14, line: 1583, baseType: !931, size: 64, align: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1082, file: !14, line: 1591, baseType: !1094, size: 64, align: 64, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1096, line: 129, size: 1664, align: 64, elements: !1097)
!1096 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1097 = !{!1098, !1099, !1100, !1101, !1198, !1219, !1220, !1249, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1095, file: !1096, line: 136, baseType: !929, size: 32, align: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1095, file: !1096, line: 151, baseType: !929, size: 32, align: 32, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1095, file: !1096, line: 157, baseType: !929, size: 32, align: 32, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1095, file: !1096, line: 159, baseType: !1102, size: 64, align: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1105)
!1105 = !{!1106, !1110, !1112, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1150, !1152, !1153, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1186, !1187, !1188, !1189, !1190, !1191, !1194, !1195, !1196, !1197}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !744, line: 282, baseType: !1107, size: 512, align: 64)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 512, align: 64, elements: !1108)
!1108 = !{!1109}
!1109 = !DISubrange(count: 8)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1104, file: !744, line: 299, baseType: !1111, size: 256, align: 32, offset: 512)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 256, align: 32, elements: !1108)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1104, file: !744, line: 315, baseType: !1113, size: 64, align: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1104, file: !744, line: 326, baseType: !929, size: 32, align: 32, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1104, file: !744, line: 326, baseType: !929, size: 32, align: 32, offset: 864)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1104, file: !744, line: 334, baseType: !929, size: 32, align: 32, offset: 896)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1104, file: !744, line: 341, baseType: !929, size: 32, align: 32, offset: 928)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1104, file: !744, line: 346, baseType: !929, size: 32, align: 32, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1104, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1104, file: !744, line: 356, baseType: !968, size: 64, align: 32, offset: 1024)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1104, file: !744, line: 361, baseType: !1013, size: 64, align: 64, offset: 1088)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1104, file: !744, line: 369, baseType: !1013, size: 64, align: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1104, file: !744, line: 377, baseType: !1013, size: 64, align: 64, offset: 1216)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1104, file: !744, line: 382, baseType: !929, size: 32, align: 32, offset: 1280)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1104, file: !744, line: 386, baseType: !929, size: 32, align: 32, offset: 1312)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1104, file: !744, line: 391, baseType: !929, size: 32, align: 32, offset: 1344)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1104, file: !744, line: 396, baseType: !931, size: 64, align: 64, offset: 1408)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1104, file: !744, line: 403, baseType: !1129, size: 512, align: 64, offset: 1472)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 512, align: 64, elements: !1108)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1104, file: !744, line: 410, baseType: !929, size: 32, align: 32, offset: 1984)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1104, file: !744, line: 415, baseType: !929, size: 32, align: 32, offset: 2016)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1104, file: !744, line: 420, baseType: !929, size: 32, align: 32, offset: 2048)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1104, file: !744, line: 425, baseType: !929, size: 32, align: 32, offset: 2080)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1104, file: !744, line: 435, baseType: !1013, size: 64, align: 64, offset: 2112)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1104, file: !744, line: 440, baseType: !929, size: 32, align: 32, offset: 2176)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1104, file: !744, line: 445, baseType: !986, size: 64, align: 64, offset: 2240)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1104, file: !744, line: 459, baseType: !1138, size: 512, align: 64, offset: 2304)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, align: 64, elements: !1108)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1141, line: 94, baseType: !1142)
!1141 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1141, line: 81, size: 192, align: 64, elements: !1143)
!1143 = !{!1144, !1148, !1149}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1142, file: !1141, line: 82, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1141, line: 73, baseType: !1147)
!1147 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1141, line: 73, flags: DIFlagFwdDecl)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1142, file: !1141, line: 89, baseType: !945, size: 64, align: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1142, file: !1141, line: 93, baseType: !929, size: 32, align: 32, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1104, file: !744, line: 473, baseType: !1151, size: 64, align: 64, offset: 2816)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1104, file: !744, line: 477, baseType: !929, size: 32, align: 32, offset: 2880)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1104, file: !744, line: 479, baseType: !1154, size: 64, align: 64, offset: 2944)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1158)
!1158 = !{!1159, !1160, !1161, !1162, !1167}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1157, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1157, file: !744, line: 203, baseType: !945, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !744, line: 204, baseType: !929, size: 32, align: 32, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1157, file: !744, line: 205, baseType: !1163, size: 64, align: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1165, line: 86, baseType: !1166)
!1165 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1165, line: 86, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1157, file: !744, line: 206, baseType: !1139, size: 64, align: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1104, file: !744, line: 480, baseType: !929, size: 32, align: 32, offset: 3008)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !744, line: 505, baseType: !929, size: 32, align: 32, offset: 3040)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1104, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1104, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1104, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1104, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1104, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1104, file: !744, line: 532, baseType: !1013, size: 64, align: 64, offset: 3264)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1104, file: !744, line: 539, baseType: !1013, size: 64, align: 64, offset: 3328)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1104, file: !744, line: 547, baseType: !1013, size: 64, align: 64, offset: 3392)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1104, file: !744, line: 554, baseType: !1163, size: 64, align: 64, offset: 3456)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1104, file: !744, line: 563, baseType: !929, size: 32, align: 32, offset: 3520)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1104, file: !744, line: 572, baseType: !929, size: 32, align: 32, offset: 3552)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1104, file: !744, line: 581, baseType: !929, size: 32, align: 32, offset: 3584)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1104, file: !744, line: 588, baseType: !1183, size: 64, align: 64, offset: 3648)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !938, line: 36, baseType: !1185)
!1185 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1104, file: !744, line: 593, baseType: !929, size: 32, align: 32, offset: 3712)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1104, file: !744, line: 596, baseType: !929, size: 32, align: 32, offset: 3744)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1104, file: !744, line: 599, baseType: !1139, size: 64, align: 64, offset: 3776)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1104, file: !744, line: 605, baseType: !1139, size: 64, align: 64, offset: 3840)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1104, file: !744, line: 616, baseType: !1139, size: 64, align: 64, offset: 3904)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1104, file: !744, line: 626, baseType: !1192, size: 64, align: 64, offset: 3968)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1193, line: 216, baseType: !987)
!1193 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1104, file: !744, line: 627, baseType: !1192, size: 64, align: 64, offset: 4032)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1104, file: !744, line: 628, baseType: !1192, size: 64, align: 64, offset: 4096)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1104, file: !744, line: 629, baseType: !1192, size: 64, align: 64, offset: 4160)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1104, file: !744, line: 645, baseType: !1139, size: 64, align: 64, offset: 4224)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1095, file: !1096, line: 161, baseType: !1199, size: 64, align: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1096, line: 117, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1096, line: 100, size: 832, align: 64, elements: !1202)
!1202 = !{!1203, !1210, !1211, !1212, !1213, !1214, !1216, !1217, !1218}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1201, file: !1096, line: 105, baseType: !1204, size: 256, align: 64)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 256, align: 64, elements: !1208)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1141, line: 238, baseType: !1207)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1141, line: 238, flags: DIFlagFwdDecl)
!1208 = !{!1209}
!1209 = !DISubrange(count: 4)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1201, file: !1096, line: 110, baseType: !929, size: 32, align: 32, offset: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1201, file: !1096, line: 111, baseType: !929, size: 32, align: 32, offset: 288)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1201, file: !1096, line: 111, baseType: !929, size: 32, align: 32, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1201, file: !1096, line: 112, baseType: !1111, size: 256, align: 32, offset: 352)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1201, file: !1096, line: 113, baseType: !1215, size: 128, align: 32, offset: 608)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 128, align: 32, elements: !1208)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1201, file: !1096, line: 114, baseType: !929, size: 32, align: 32, offset: 736)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1201, file: !1096, line: 115, baseType: !929, size: 32, align: 32, offset: 768)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1201, file: !1096, line: 116, baseType: !929, size: 32, align: 32, offset: 800)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1095, file: !1096, line: 163, baseType: !931, size: 64, align: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1095, file: !1096, line: 165, baseType: !1221, size: 128, align: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1096, line: 122, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1096, line: 119, size: 128, align: 64, elements: !1223)
!1223 = !{!1224, !1248}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1222, file: !1096, line: 120, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1244, !1245, !1246, !1247}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1227, file: !14, line: 1451, baseType: !1139, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1227, file: !14, line: 1461, baseType: !1013, size: 64, align: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1227, file: !14, line: 1467, baseType: !1013, size: 64, align: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1227, file: !14, line: 1468, baseType: !945, size: 64, align: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1227, file: !14, line: 1469, baseType: !929, size: 32, align: 32, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1227, file: !14, line: 1470, baseType: !929, size: 32, align: 32, offset: 288)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1227, file: !14, line: 1474, baseType: !929, size: 32, align: 32, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1227, file: !14, line: 1479, baseType: !1237, size: 64, align: 64, offset: 384)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1240)
!1240 = !{!1241, !1242, !1243}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1239, file: !14, line: 1412, baseType: !945, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1239, file: !14, line: 1413, baseType: !929, size: 32, align: 32, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1239, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1227, file: !14, line: 1480, baseType: !929, size: 32, align: 32, offset: 448)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1227, file: !14, line: 1486, baseType: !1013, size: 64, align: 64, offset: 512)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1227, file: !14, line: 1488, baseType: !1013, size: 64, align: 64, offset: 576)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1227, file: !14, line: 1497, baseType: !1013, size: 64, align: 64, offset: 640)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1222, file: !1096, line: 121, baseType: !1102, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1095, file: !1096, line: 166, baseType: !1250, size: 128, align: 64, offset: 448)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1096, line: 127, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1096, line: 124, size: 128, align: 64, elements: !1252)
!1252 = !{!1253, !1326}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1251, file: !1096, line: 125, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1284, !1288, !1289, !1323, !1324, !1325}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1257, file: !14, line: 5751, baseType: !990, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1257, file: !14, line: 5756, baseType: !1261, size: 64, align: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1263)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1264)
!1264 = !{!1265, !1266, !1269, !1270, !1271, !1275, !1279, !1283}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1263, file: !14, line: 5797, baseType: !958, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1263, file: !14, line: 5804, baseType: !1267, size: 64, align: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1263, file: !14, line: 5815, baseType: !990, size: 64, align: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1263, file: !14, line: 5825, baseType: !929, size: 32, align: 32, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1263, file: !14, line: 5826, baseType: !1272, size: 64, align: 64, offset: 256)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!929, !1255}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1263, file: !14, line: 5827, baseType: !1276, size: 64, align: 64, offset: 320)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{!929, !1255, !1225}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1263, file: !14, line: 5828, baseType: !1280, size: 64, align: 64, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{null, !1255}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1263, file: !14, line: 5829, baseType: !1280, size: 64, align: 64, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1257, file: !14, line: 5762, baseType: !1285, size: 64, align: 64, offset: 128)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1287)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1257, file: !14, line: 5768, baseType: !931, size: 64, align: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1257, file: !14, line: 5775, baseType: !1290, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1292, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1292, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1292, file: !14, line: 3948, baseType: !937, size: 32, align: 32, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1292, file: !14, line: 3958, baseType: !945, size: 64, align: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1292, file: !14, line: 3962, baseType: !929, size: 32, align: 32, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1292, file: !14, line: 3968, baseType: !929, size: 32, align: 32, offset: 224)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1292, file: !14, line: 3973, baseType: !1013, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1292, file: !14, line: 3986, baseType: !929, size: 32, align: 32, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1292, file: !14, line: 3999, baseType: !929, size: 32, align: 32, offset: 352)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1292, file: !14, line: 4004, baseType: !929, size: 32, align: 32, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1292, file: !14, line: 4005, baseType: !929, size: 32, align: 32, offset: 416)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1292, file: !14, line: 4010, baseType: !929, size: 32, align: 32, offset: 448)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1292, file: !14, line: 4011, baseType: !929, size: 32, align: 32, offset: 480)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1292, file: !14, line: 4020, baseType: !968, size: 64, align: 32, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1292, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1292, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1292, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1292, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1292, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1292, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1292, file: !14, line: 4039, baseType: !929, size: 32, align: 32, offset: 768)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1292, file: !14, line: 4046, baseType: !986, size: 64, align: 64, offset: 832)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1292, file: !14, line: 4050, baseType: !929, size: 32, align: 32, offset: 896)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1292, file: !14, line: 4054, baseType: !929, size: 32, align: 32, offset: 928)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1292, file: !14, line: 4061, baseType: !929, size: 32, align: 32, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1292, file: !14, line: 4065, baseType: !929, size: 32, align: 32, offset: 992)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1292, file: !14, line: 4073, baseType: !929, size: 32, align: 32, offset: 1024)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1292, file: !14, line: 4080, baseType: !929, size: 32, align: 32, offset: 1056)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1292, file: !14, line: 4084, baseType: !929, size: 32, align: 32, offset: 1088)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1257, file: !14, line: 5781, baseType: !1290, size: 64, align: 64, offset: 320)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1257, file: !14, line: 5787, baseType: !968, size: 64, align: 32, offset: 384)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1257, file: !14, line: 5793, baseType: !968, size: 64, align: 32, offset: 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1251, file: !1096, line: 126, baseType: !929, size: 32, align: 32, offset: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1095, file: !1096, line: 172, baseType: !1225, size: 64, align: 64, offset: 576)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1095, file: !1096, line: 177, baseType: !945, size: 64, align: 64, offset: 640)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1095, file: !1096, line: 178, baseType: !930, size: 32, align: 32, offset: 704)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1095, file: !1096, line: 180, baseType: !931, size: 64, align: 64, offset: 768)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1095, file: !1096, line: 185, baseType: !929, size: 32, align: 32, offset: 832)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1095, file: !1096, line: 190, baseType: !931, size: 64, align: 64, offset: 896)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1095, file: !1096, line: 195, baseType: !929, size: 32, align: 32, offset: 960)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1095, file: !1096, line: 200, baseType: !1225, size: 64, align: 64, offset: 1024)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1095, file: !1096, line: 201, baseType: !929, size: 32, align: 32, offset: 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1095, file: !1096, line: 202, baseType: !1102, size: 64, align: 64, offset: 1152)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1095, file: !1096, line: 203, baseType: !929, size: 32, align: 32, offset: 1216)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1095, file: !1096, line: 205, baseType: !929, size: 32, align: 32, offset: 1248)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1095, file: !1096, line: 206, baseType: !929, size: 32, align: 32, offset: 1280)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1095, file: !1096, line: 209, baseType: !1192, size: 64, align: 64, offset: 1344)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1095, file: !1096, line: 212, baseType: !1192, size: 64, align: 64, offset: 1408)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1095, file: !1096, line: 213, baseType: !1102, size: 64, align: 64, offset: 1472)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1095, file: !1096, line: 215, baseType: !929, size: 32, align: 32, offset: 1536)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1095, file: !1096, line: 217, baseType: !929, size: 32, align: 32, offset: 1568)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1095, file: !1096, line: 220, baseType: !929, size: 32, align: 32, offset: 1600)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1082, file: !14, line: 1598, baseType: !931, size: 64, align: 64, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1082, file: !14, line: 1606, baseType: !1013, size: 64, align: 64, offset: 448)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1082, file: !14, line: 1614, baseType: !929, size: 32, align: 32, offset: 512)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1082, file: !14, line: 1622, baseType: !929, size: 32, align: 32, offset: 544)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1082, file: !14, line: 1628, baseType: !929, size: 32, align: 32, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1082, file: !14, line: 1636, baseType: !929, size: 32, align: 32, offset: 608)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1082, file: !14, line: 1643, baseType: !929, size: 32, align: 32, offset: 640)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1082, file: !14, line: 1657, baseType: !945, size: 64, align: 64, offset: 704)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1082, file: !14, line: 1658, baseType: !929, size: 32, align: 32, offset: 768)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1082, file: !14, line: 1679, baseType: !968, size: 64, align: 32, offset: 800)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1082, file: !14, line: 1688, baseType: !929, size: 32, align: 32, offset: 864)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1082, file: !14, line: 1712, baseType: !929, size: 32, align: 32, offset: 896)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1082, file: !14, line: 1729, baseType: !929, size: 32, align: 32, offset: 928)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1082, file: !14, line: 1729, baseType: !929, size: 32, align: 32, offset: 960)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1082, file: !14, line: 1744, baseType: !929, size: 32, align: 32, offset: 992)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1082, file: !14, line: 1744, baseType: !929, size: 32, align: 32, offset: 1024)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1082, file: !14, line: 1751, baseType: !929, size: 32, align: 32, offset: 1056)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1082, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1082, file: !14, line: 1791, baseType: !1365, size: 64, align: 64, offset: 1152)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{null, !1368, !1369, !1371, !929, !929, !929}
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1103)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1082, file: !14, line: 1808, baseType: !1373, size: 64, align: 64, offset: 1216)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!473, !1368, !975}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1082, file: !14, line: 1816, baseType: !929, size: 32, align: 32, offset: 1280)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1082, file: !14, line: 1825, baseType: !1378, size: 32, align: 32, offset: 1312)
!1378 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1082, file: !14, line: 1830, baseType: !929, size: 32, align: 32, offset: 1344)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1082, file: !14, line: 1838, baseType: !1378, size: 32, align: 32, offset: 1376)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1082, file: !14, line: 1846, baseType: !929, size: 32, align: 32, offset: 1408)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1082, file: !14, line: 1851, baseType: !929, size: 32, align: 32, offset: 1440)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1082, file: !14, line: 1861, baseType: !1378, size: 32, align: 32, offset: 1472)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1082, file: !14, line: 1868, baseType: !1378, size: 32, align: 32, offset: 1504)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1082, file: !14, line: 1875, baseType: !1378, size: 32, align: 32, offset: 1536)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1082, file: !14, line: 1882, baseType: !1378, size: 32, align: 32, offset: 1568)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1082, file: !14, line: 1889, baseType: !1378, size: 32, align: 32, offset: 1600)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1082, file: !14, line: 1896, baseType: !1378, size: 32, align: 32, offset: 1632)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1082, file: !14, line: 1903, baseType: !1378, size: 32, align: 32, offset: 1664)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1082, file: !14, line: 1910, baseType: !929, size: 32, align: 32, offset: 1696)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1082, file: !14, line: 1915, baseType: !929, size: 32, align: 32, offset: 1728)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1082, file: !14, line: 1926, baseType: !1371, size: 64, align: 64, offset: 1792)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1082, file: !14, line: 1935, baseType: !968, size: 64, align: 32, offset: 1856)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1082, file: !14, line: 1942, baseType: !929, size: 32, align: 32, offset: 1920)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1082, file: !14, line: 1948, baseType: !929, size: 32, align: 32, offset: 1952)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1082, file: !14, line: 1954, baseType: !929, size: 32, align: 32, offset: 1984)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1082, file: !14, line: 1960, baseType: !929, size: 32, align: 32, offset: 2016)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1082, file: !14, line: 1984, baseType: !929, size: 32, align: 32, offset: 2048)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1082, file: !14, line: 1991, baseType: !929, size: 32, align: 32, offset: 2080)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1082, file: !14, line: 1996, baseType: !929, size: 32, align: 32, offset: 2112)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1082, file: !14, line: 2004, baseType: !929, size: 32, align: 32, offset: 2144)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1082, file: !14, line: 2011, baseType: !929, size: 32, align: 32, offset: 2176)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1082, file: !14, line: 2018, baseType: !929, size: 32, align: 32, offset: 2208)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1082, file: !14, line: 2027, baseType: !929, size: 32, align: 32, offset: 2240)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1082, file: !14, line: 2034, baseType: !929, size: 32, align: 32, offset: 2272)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1082, file: !14, line: 2044, baseType: !929, size: 32, align: 32, offset: 2304)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1082, file: !14, line: 2054, baseType: !1408, size: 64, align: 64, offset: 2368)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1082, file: !14, line: 2061, baseType: !1408, size: 64, align: 64, offset: 2432)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1082, file: !14, line: 2066, baseType: !929, size: 32, align: 32, offset: 2496)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1082, file: !14, line: 2070, baseType: !929, size: 32, align: 32, offset: 2528)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1082, file: !14, line: 2078, baseType: !929, size: 32, align: 32, offset: 2560)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1082, file: !14, line: 2085, baseType: !929, size: 32, align: 32, offset: 2592)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1082, file: !14, line: 2092, baseType: !929, size: 32, align: 32, offset: 2624)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1082, file: !14, line: 2099, baseType: !929, size: 32, align: 32, offset: 2656)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1082, file: !14, line: 2106, baseType: !929, size: 32, align: 32, offset: 2688)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1082, file: !14, line: 2113, baseType: !929, size: 32, align: 32, offset: 2720)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1082, file: !14, line: 2120, baseType: !929, size: 32, align: 32, offset: 2752)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1082, file: !14, line: 2125, baseType: !929, size: 32, align: 32, offset: 2784)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1082, file: !14, line: 2133, baseType: !929, size: 32, align: 32, offset: 2816)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1082, file: !14, line: 2140, baseType: !929, size: 32, align: 32, offset: 2848)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1082, file: !14, line: 2145, baseType: !929, size: 32, align: 32, offset: 2880)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1082, file: !14, line: 2153, baseType: !929, size: 32, align: 32, offset: 2912)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1082, file: !14, line: 2158, baseType: !929, size: 32, align: 32, offset: 2944)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1082, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1082, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1082, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1082, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1082, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1082, file: !14, line: 2203, baseType: !929, size: 32, align: 32, offset: 3136)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1082, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1082, file: !14, line: 2212, baseType: !929, size: 32, align: 32, offset: 3200)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1082, file: !14, line: 2213, baseType: !929, size: 32, align: 32, offset: 3232)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1082, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1082, file: !14, line: 2232, baseType: !929, size: 32, align: 32, offset: 3296)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1082, file: !14, line: 2243, baseType: !929, size: 32, align: 32, offset: 3328)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1082, file: !14, line: 2249, baseType: !929, size: 32, align: 32, offset: 3360)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1082, file: !14, line: 2256, baseType: !929, size: 32, align: 32, offset: 3392)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1082, file: !14, line: 2263, baseType: !986, size: 64, align: 64, offset: 3456)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1082, file: !14, line: 2270, baseType: !986, size: 64, align: 64, offset: 3520)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1082, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1082, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1082, file: !14, line: 2367, baseType: !1444, size: 64, align: 64, offset: 3648)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{!929, !1368, !1102, !929}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1082, file: !14, line: 2383, baseType: !929, size: 32, align: 32, offset: 3712)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1082, file: !14, line: 2386, baseType: !1378, size: 32, align: 32, offset: 3744)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1082, file: !14, line: 2387, baseType: !1378, size: 32, align: 32, offset: 3776)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1082, file: !14, line: 2394, baseType: !929, size: 32, align: 32, offset: 3808)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1082, file: !14, line: 2401, baseType: !929, size: 32, align: 32, offset: 3840)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1082, file: !14, line: 2408, baseType: !929, size: 32, align: 32, offset: 3872)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1082, file: !14, line: 2415, baseType: !929, size: 32, align: 32, offset: 3904)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1082, file: !14, line: 2422, baseType: !929, size: 32, align: 32, offset: 3936)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1082, file: !14, line: 2423, baseType: !1456, size: 64, align: 64, offset: 3968)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1459)
!1459 = !{!1460, !1461, !1462, !1463}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1458, file: !14, line: 827, baseType: !929, size: 32, align: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1458, file: !14, line: 828, baseType: !929, size: 32, align: 32, offset: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1458, file: !14, line: 829, baseType: !929, size: 32, align: 32, offset: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1458, file: !14, line: 830, baseType: !1378, size: 32, align: 32, offset: 96)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1082, file: !14, line: 2430, baseType: !1013, size: 64, align: 64, offset: 4032)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1082, file: !14, line: 2437, baseType: !1013, size: 64, align: 64, offset: 4096)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1082, file: !14, line: 2444, baseType: !1378, size: 32, align: 32, offset: 4160)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1082, file: !14, line: 2451, baseType: !1378, size: 32, align: 32, offset: 4192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1082, file: !14, line: 2458, baseType: !929, size: 32, align: 32, offset: 4224)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1082, file: !14, line: 2469, baseType: !929, size: 32, align: 32, offset: 4256)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1082, file: !14, line: 2475, baseType: !929, size: 32, align: 32, offset: 4288)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1082, file: !14, line: 2481, baseType: !929, size: 32, align: 32, offset: 4320)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1082, file: !14, line: 2485, baseType: !929, size: 32, align: 32, offset: 4352)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1082, file: !14, line: 2489, baseType: !929, size: 32, align: 32, offset: 4384)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1082, file: !14, line: 2493, baseType: !929, size: 32, align: 32, offset: 4416)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1082, file: !14, line: 2501, baseType: !929, size: 32, align: 32, offset: 4448)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1082, file: !14, line: 2506, baseType: !929, size: 32, align: 32, offset: 4480)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1082, file: !14, line: 2510, baseType: !929, size: 32, align: 32, offset: 4512)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1082, file: !14, line: 2514, baseType: !1013, size: 64, align: 64, offset: 4544)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1082, file: !14, line: 2528, baseType: !1480, size: 64, align: 64, offset: 4608)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{null, !1368, !931, !929, !929}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1082, file: !14, line: 2534, baseType: !929, size: 32, align: 32, offset: 4672)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1082, file: !14, line: 2545, baseType: !929, size: 32, align: 32, offset: 4704)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1082, file: !14, line: 2547, baseType: !929, size: 32, align: 32, offset: 4736)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1082, file: !14, line: 2549, baseType: !929, size: 32, align: 32, offset: 4768)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1082, file: !14, line: 2551, baseType: !929, size: 32, align: 32, offset: 4800)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1082, file: !14, line: 2553, baseType: !929, size: 32, align: 32, offset: 4832)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1082, file: !14, line: 2555, baseType: !929, size: 32, align: 32, offset: 4864)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1082, file: !14, line: 2557, baseType: !929, size: 32, align: 32, offset: 4896)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1082, file: !14, line: 2559, baseType: !929, size: 32, align: 32, offset: 4928)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1082, file: !14, line: 2563, baseType: !929, size: 32, align: 32, offset: 4960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1082, file: !14, line: 2571, baseType: !1494, size: 64, align: 64, offset: 4992)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1082, file: !14, line: 2579, baseType: !1494, size: 64, align: 64, offset: 5056)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1082, file: !14, line: 2586, baseType: !929, size: 32, align: 32, offset: 5120)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1082, file: !14, line: 2615, baseType: !929, size: 32, align: 32, offset: 5152)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1082, file: !14, line: 2627, baseType: !929, size: 32, align: 32, offset: 5184)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1082, file: !14, line: 2637, baseType: !929, size: 32, align: 32, offset: 5216)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1082, file: !14, line: 2681, baseType: !929, size: 32, align: 32, offset: 5248)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1082, file: !14, line: 2709, baseType: !1013, size: 64, align: 64, offset: 5312)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1082, file: !14, line: 2716, baseType: !1503, size: 64, align: 64, offset: 5376)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1506)
!1506 = !{!1507, !1508, !1509, !1510, !1511, !1512, !1516, !1520, !1524, !1525, !1526, !1527, !1533, !1534, !1535, !1536, !1537}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1505, file: !14, line: 3642, baseType: !958, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1505, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1505, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1505, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1505, file: !14, line: 3669, baseType: !929, size: 32, align: 32, offset: 160)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1505, file: !14, line: 3682, baseType: !1513, size: 64, align: 64, offset: 192)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!929, !1080, !1102}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1505, file: !14, line: 3698, baseType: !1517, size: 64, align: 64, offset: 256)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64, align: 64)
!1518 = !DISubroutineType(types: !1519)
!1519 = !{!929, !1080, !950, !937}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1505, file: !14, line: 3712, baseType: !1521, size: 64, align: 64, offset: 320)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!929, !1080, !929, !950, !937}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1505, file: !14, line: 3726, baseType: !1517, size: 64, align: 64, offset: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1505, file: !14, line: 3737, baseType: !1077, size: 64, align: 64, offset: 448)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1505, file: !14, line: 3746, baseType: !929, size: 32, align: 32, offset: 512)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1505, file: !14, line: 3757, baseType: !1528, size: 64, align: 64, offset: 576)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{null, !1531}
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1505, file: !14, line: 3766, baseType: !1077, size: 64, align: 64, offset: 640)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1505, file: !14, line: 3774, baseType: !1077, size: 64, align: 64, offset: 704)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1505, file: !14, line: 3780, baseType: !929, size: 32, align: 32, offset: 768)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1505, file: !14, line: 3785, baseType: !929, size: 32, align: 32, offset: 800)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1505, file: !14, line: 3795, baseType: !1538, size: 64, align: 64, offset: 832)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!929, !1080, !1139}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1082, file: !14, line: 2728, baseType: !931, size: 64, align: 64, offset: 5440)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1082, file: !14, line: 2735, baseType: !1129, size: 512, align: 64, offset: 5504)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1082, file: !14, line: 2742, baseType: !929, size: 32, align: 32, offset: 6016)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1082, file: !14, line: 2755, baseType: !929, size: 32, align: 32, offset: 6048)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1082, file: !14, line: 2776, baseType: !929, size: 32, align: 32, offset: 6080)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1082, file: !14, line: 2783, baseType: !929, size: 32, align: 32, offset: 6112)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1082, file: !14, line: 2791, baseType: !929, size: 32, align: 32, offset: 6144)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1082, file: !14, line: 2802, baseType: !1102, size: 64, align: 64, offset: 6208)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1082, file: !14, line: 2811, baseType: !929, size: 32, align: 32, offset: 6272)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1082, file: !14, line: 2821, baseType: !929, size: 32, align: 32, offset: 6304)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1082, file: !14, line: 2830, baseType: !929, size: 32, align: 32, offset: 6336)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1082, file: !14, line: 2840, baseType: !929, size: 32, align: 32, offset: 6368)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1082, file: !14, line: 2851, baseType: !1554, size: 64, align: 64, offset: 6400)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!929, !1368, !1557, !931, !1371, !929, !929}
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!929, !1368, !931}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1082, file: !14, line: 2871, baseType: !1561, size: 64, align: 64, offset: 6464)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!929, !1368, !1564, !931, !1371, !929}
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{!929, !1368, !931, !929, !929}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1082, file: !14, line: 2878, baseType: !929, size: 32, align: 32, offset: 6528)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1082, file: !14, line: 2885, baseType: !929, size: 32, align: 32, offset: 6560)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1082, file: !14, line: 3005, baseType: !929, size: 32, align: 32, offset: 6592)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1082, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1082, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1082, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1082, file: !14, line: 3037, baseType: !945, size: 64, align: 64, offset: 6720)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1082, file: !14, line: 3038, baseType: !929, size: 32, align: 32, offset: 6784)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1082, file: !14, line: 3050, baseType: !986, size: 64, align: 64, offset: 6848)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1082, file: !14, line: 3065, baseType: !929, size: 32, align: 32, offset: 6912)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1082, file: !14, line: 3083, baseType: !929, size: 32, align: 32, offset: 6944)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1082, file: !14, line: 3092, baseType: !968, size: 64, align: 32, offset: 6976)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1082, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1082, file: !14, line: 3106, baseType: !968, size: 64, align: 32, offset: 7072)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1082, file: !14, line: 3113, baseType: !1582, size: 64, align: 64, offset: 7168)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1584)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1585)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1586)
!1586 = !{!1587, !1588, !1589, !1590, !1591, !1592, !1595}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1585, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1585, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1585, file: !14, line: 720, baseType: !958, size: 64, align: 64, offset: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1585, file: !14, line: 724, baseType: !958, size: 64, align: 64, offset: 128)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1585, file: !14, line: 728, baseType: !929, size: 32, align: 32, offset: 192)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1585, file: !14, line: 734, baseType: !1593, size: 64, align: 64, offset: 256)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1585, file: !14, line: 739, baseType: !1596, size: 64, align: 64, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1082, file: !14, line: 3129, baseType: !1013, size: 64, align: 64, offset: 7232)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1082, file: !14, line: 3130, baseType: !1013, size: 64, align: 64, offset: 7296)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1082, file: !14, line: 3131, baseType: !1013, size: 64, align: 64, offset: 7360)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1082, file: !14, line: 3132, baseType: !1013, size: 64, align: 64, offset: 7424)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1082, file: !14, line: 3139, baseType: !1494, size: 64, align: 64, offset: 7488)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1082, file: !14, line: 3147, baseType: !929, size: 32, align: 32, offset: 7552)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1082, file: !14, line: 3165, baseType: !929, size: 32, align: 32, offset: 7584)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1082, file: !14, line: 3172, baseType: !929, size: 32, align: 32, offset: 7616)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1082, file: !14, line: 3180, baseType: !929, size: 32, align: 32, offset: 7648)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1082, file: !14, line: 3191, baseType: !1408, size: 64, align: 64, offset: 7680)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1082, file: !14, line: 3199, baseType: !945, size: 64, align: 64, offset: 7744)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1082, file: !14, line: 3207, baseType: !1494, size: 64, align: 64, offset: 7808)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1082, file: !14, line: 3214, baseType: !930, size: 32, align: 32, offset: 7872)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1082, file: !14, line: 3224, baseType: !1237, size: 64, align: 64, offset: 7936)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1082, file: !14, line: 3225, baseType: !929, size: 32, align: 32, offset: 8000)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1082, file: !14, line: 3249, baseType: !1139, size: 64, align: 64, offset: 8064)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1082, file: !14, line: 3256, baseType: !929, size: 32, align: 32, offset: 8128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1082, file: !14, line: 3271, baseType: !929, size: 32, align: 32, offset: 8160)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1082, file: !14, line: 3279, baseType: !1013, size: 64, align: 64, offset: 8192)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1082, file: !14, line: 3301, baseType: !1139, size: 64, align: 64, offset: 8256)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1082, file: !14, line: 3310, baseType: !929, size: 32, align: 32, offset: 8320)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1082, file: !14, line: 3337, baseType: !929, size: 32, align: 32, offset: 8352)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1082, file: !14, line: 3351, baseType: !929, size: 32, align: 32, offset: 8384)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1082, file: !14, line: 3359, baseType: !929, size: 32, align: 32, offset: 8416)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !955, file: !14, line: 3535, baseType: !1623, size: 64, align: 64, offset: 1024)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!929, !1080, !1626}
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !955, file: !14, line: 3541, baseType: !1629, size: 64, align: 64, offset: 1088)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1631)
!1631 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1096, line: 223, size: 128, align: 64, elements: !1633)
!1633 = !{!1634, !1635}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1632, file: !1096, line: 224, baseType: !950, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1632, file: !1096, line: 225, baseType: !950, size: 64, align: 64, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !955, file: !14, line: 3549, baseType: !1637, size: 64, align: 64, offset: 1152)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !1075}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !955, file: !14, line: 3551, baseType: !1077, size: 64, align: 64, offset: 1216)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !955, file: !14, line: 3552, baseType: !1642, size: 64, align: 64, offset: 1280)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64, align: 64)
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!929, !1080, !945, !929, !1645}
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1648)
!1648 = !{!1649, !1650, !1651, !1652, !1653, !1677}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1647, file: !14, line: 3921, baseType: !943, size: 16, align: 16)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1647, file: !14, line: 3922, baseType: !937, size: 32, align: 32, offset: 32)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1647, file: !14, line: 3923, baseType: !937, size: 32, align: 32, offset: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1647, file: !14, line: 3924, baseType: !930, size: 32, align: 32, offset: 96)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1647, file: !14, line: 3925, baseType: !1654, size: 64, align: 64, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1658)
!1658 = !{!1659, !1660, !1661, !1662, !1663, !1664, !1670, !1672, !1673, !1674, !1675, !1676}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1657, file: !14, line: 3886, baseType: !929, size: 32, align: 32)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1657, file: !14, line: 3887, baseType: !929, size: 32, align: 32, offset: 32)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1657, file: !14, line: 3888, baseType: !929, size: 32, align: 32, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1657, file: !14, line: 3889, baseType: !929, size: 32, align: 32, offset: 96)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1657, file: !14, line: 3890, baseType: !929, size: 32, align: 32, offset: 128)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1657, file: !14, line: 3897, baseType: !1665, size: 768, align: 64, offset: 192)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1666)
!1666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1667)
!1667 = !{!1668, !1669}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1666, file: !14, line: 3855, baseType: !1107, size: 512, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1666, file: !14, line: 3857, baseType: !1111, size: 256, align: 32, offset: 512)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1657, file: !14, line: 3903, baseType: !1671, size: 256, align: 64, offset: 960)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 64, elements: !1208)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1657, file: !14, line: 3904, baseType: !1215, size: 128, align: 32, offset: 1216)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1657, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1657, file: !14, line: 3908, baseType: !1494, size: 64, align: 64, offset: 1408)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1657, file: !14, line: 3915, baseType: !1494, size: 64, align: 64, offset: 1472)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1657, file: !14, line: 3917, baseType: !929, size: 32, align: 32, offset: 1536)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1647, file: !14, line: 3926, baseType: !1013, size: 64, align: 64, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !955, file: !14, line: 3564, baseType: !1679, size: 64, align: 64, offset: 1344)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{!929, !1080, !1225, !1369, !1371}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !955, file: !14, line: 3566, baseType: !1683, size: 64, align: 64, offset: 1408)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!929, !1080, !931, !1371, !1225}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !955, file: !14, line: 3567, baseType: !1077, size: 64, align: 64, offset: 1472)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !955, file: !14, line: 3576, baseType: !1688, size: 64, align: 64, offset: 1536)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!929, !1080, !1369}
