; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--src_movie.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--src_movie.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVFilter = type { i8*, i8*, %struct.AVFilterPad*, %struct.AVFilterPad*, %struct.AVClass*, i32, i32 (%struct.AVFilterContext*)*, i32 (%struct.AVFilterContext*)*, i32 (%struct.AVFilterContext*, %struct.AVDictionary**)*, void (%struct.AVFilterContext*)*, i32 (%struct.AVFilterContext*)*, i32, i32, %struct.AVFilter*, i32 (%struct.AVFilterContext*, i8*, i8*, i8*, i32, i32)*, i32 (%struct.AVFilterContext*, i8*)*, i32 (%struct.AVFilterContext*)* }
%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }

!114 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !575)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !536, !537, !538, !539, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !436, !437, !439, !441, !443, !444, !445, !446, !447, !487, !488, !494, !503, !504, !505, !507, !508, !509, !510, !511}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !404, !405, !406, !407, !411, !412, !417, !421, !422, !423, !424, !426, !431, !435}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!278 = !{!279, !280, !281, !388, !392, !396, !400, !401, !402, !403}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !386, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !296, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !338, !340, !341, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !294)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !207, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !297, size: 256, align: 32, offset: 512)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !294)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !315, size: 512, align: 64, offset: 1472)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 512, align: 64, elements: !294)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !207, line: 55, baseType: !317)
!317 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !316, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !326, size: 512, align: 64, offset: 2304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, align: 64, elements: !294)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !329, line: 94, baseType: !330)
!329 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !329, line: 81, size: 192, align: 64, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !330, file: !329, line: 82, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !329, line: 73, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !329, line: 73, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !329, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !339, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !342, size: 64, align: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !24, line: 205, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !353, line: 86, baseType: !354)
!353 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !353, line: 86, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !24, line: 206, baseType: !327, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !351, size: 64, align: 64, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !371, size: 64, align: 64, offset: 3648)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 36, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !327, size: 64, align: 64, offset: 3776)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !327, size: 64, align: 64, offset: 3840)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !327, size: 64, align: 64, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !380, size: 64, align: 64, offset: 3968)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 216, baseType: !317)
!381 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !380, size: 64, align: 64, offset: 4032)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !380, size: 64, align: 64, offset: 4096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !380, size: 64, align: 64, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !327, size: 64, align: 64, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!285, !386, !200}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!200, !386, !285}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !397, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!200, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !397, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !397, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !173}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !408, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !413, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!200, !173, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !418, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !173}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !408, size: 64, align: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !427, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!200, !173, !184, !184, !430, !200, !200}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !432, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!200, !173, !191}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !408, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !430, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !440, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !442, size: 32, align: 32, offset: 320)
!442 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !438, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !440, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !442, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !448, size: 64, align: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458, !459, !481, !482, !483, !484, !485, !486}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !449, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !449, file: !169, line: 842, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !449, file: !169, line: 843, baseType: !442, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !449, file: !169, line: 845, baseType: !430, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !449, file: !169, line: 847, baseType: !430, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !449, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !449, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !449, file: !169, line: 874, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !463)
!463 = !{!464, !465, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !462, file: !277, line: 150, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !468)
!468 = !DISubroutineType(types: !469)
!469 = !{!200, !173, !470, !191, !474, !200}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !472)
!472 = !DISubroutineType(types: !473)
!473 = !{!200, !173, !191, !200, !200}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !462, file: !277, line: 151, baseType: !476, size: 8, align: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !477, line: 48, baseType: !478)
!477 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !477, line: 46, size: 8, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !478, file: !477, line: 47, baseType: !186, size: 8, align: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !449, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !449, file: !169, line: 895, baseType: !466, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !449, file: !169, line: 897, baseType: !430, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !449, file: !169, line: 906, baseType: !440, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !449, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !449, file: !169, line: 909, baseType: !442, size: 32, align: 32, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !491, file: !277, line: 155, baseType: !466, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !495, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !496, file: !277, line: 40, baseType: !430, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !277, line: 41, baseType: !430, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !277, line: 43, baseType: !495, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !430, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !506, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !327, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !442, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !438, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !438, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !316, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !527, line: 64, size: 256, align: 64, elements: !528)
!527 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !526, file: !527, line: 65, baseType: !442, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !526, file: !527, line: 66, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !526, file: !527, line: 68, baseType: !442, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !526, file: !527, line: 69, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !524, size: 64, align: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !524, size: 64, align: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !524, size: 64, align: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !527, line: 85, size: 256, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !541, file: !527, line: 86, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !541, file: !527, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !541, file: !527, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !541, file: !527, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !541, file: !527, line: 91, baseType: !442, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !541, file: !527, line: 92, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !540, size: 64, align: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !448, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !442, size: 32, align: 32, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !327, size: 64, align: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !572, size: 491520, align: 8, offset: 1984)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 61440)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!577 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!578 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !580, line: 1175, size: 32, align: 32, elements: !581)
!580 = !DIFile(filename: "./libavcodec/avcodec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!582 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!583 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!584 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!585 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!586 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!587 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!588 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!589 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!590 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!591 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!592 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!593 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!594 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!595 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!596 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!597 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!598 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!599 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!600 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!601 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!602 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!603 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!604 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!605 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!606 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!607 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!608 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!609 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!610 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVCodecID", file: !580, line: 215, size: 32, align: 32, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068}
!612 = !DIEnumerator(name: "AV_CODEC_ID_NONE", value: 0)
!613 = !DIEnumerator(name: "AV_CODEC_ID_MPEG1VIDEO", value: 1)
!614 = !DIEnumerator(name: "AV_CODEC_ID_MPEG2VIDEO", value: 2)
!615 = !DIEnumerator(name: "AV_CODEC_ID_H261", value: 3)
!616 = !DIEnumerator(name: "AV_CODEC_ID_H263", value: 4)
!617 = !DIEnumerator(name: "AV_CODEC_ID_RV10", value: 5)
!618 = !DIEnumerator(name: "AV_CODEC_ID_RV20", value: 6)
!619 = !DIEnumerator(name: "AV_CODEC_ID_MJPEG", value: 7)
!620 = !DIEnumerator(name: "AV_CODEC_ID_MJPEGB", value: 8)
!621 = !DIEnumerator(name: "AV_CODEC_ID_LJPEG", value: 9)
!622 = !DIEnumerator(name: "AV_CODEC_ID_SP5X", value: 10)
!623 = !DIEnumerator(name: "AV_CODEC_ID_JPEGLS", value: 11)
!624 = !DIEnumerator(name: "AV_CODEC_ID_MPEG4", value: 12)
!625 = !DIEnumerator(name: "AV_CODEC_ID_RAWVIDEO", value: 13)
!626 = !DIEnumerator(name: "AV_CODEC_ID_MSMPEG4V1", value: 14)
!627 = !DIEnumerator(name: "AV_CODEC_ID_MSMPEG4V2", value: 15)
!628 = !DIEnumerator(name: "AV_CODEC_ID_MSMPEG4V3", value: 16)
!629 = !DIEnumerator(name: "AV_CODEC_ID_WMV1", value: 17)
!630 = !DIEnumerator(name: "AV_CODEC_ID_WMV2", value: 18)
!631 = !DIEnumerator(name: "AV_CODEC_ID_H263P", value: 19)
!632 = !DIEnumerator(name: "AV_CODEC_ID_H263I", value: 20)
!633 = !DIEnumerator(name: "AV_CODEC_ID_FLV1", value: 21)
!634 = !DIEnumerator(name: "AV_CODEC_ID_SVQ1", value: 22)
!635 = !DIEnumerator(name: "AV_CODEC_ID_SVQ3", value: 23)
!636 = !DIEnumerator(name: "AV_CODEC_ID_DVVIDEO", value: 24)
!637 = !DIEnumerator(name: "AV_CODEC_ID_HUFFYUV", value: 25)
!638 = !DIEnumerator(name: "AV_CODEC_ID_CYUV", value: 26)
!639 = !DIEnumerator(name: "AV_CODEC_ID_H264", value: 27)
!640 = !DIEnumerator(name: "AV_CODEC_ID_INDEO3", value: 28)
!641 = !DIEnumerator(name: "AV_CODEC_ID_VP3", value: 29)
!642 = !DIEnumerator(name: "AV_CODEC_ID_THEORA", value: 30)
!643 = !DIEnumerator(name: "AV_CODEC_ID_ASV1", value: 31)
!644 = !DIEnumerator(name: "AV_CODEC_ID_ASV2", value: 32)
!645 = !DIEnumerator(name: "AV_CODEC_ID_FFV1", value: 33)
!646 = !DIEnumerator(name: "AV_CODEC_ID_4XM", value: 34)
!647 = !DIEnumerator(name: "AV_CODEC_ID_VCR1", value: 35)
!648 = !DIEnumerator(name: "AV_CODEC_ID_CLJR", value: 36)
!649 = !DIEnumerator(name: "AV_CODEC_ID_MDEC", value: 37)
!650 = !DIEnumerator(name: "AV_CODEC_ID_ROQ", value: 38)
!651 = !DIEnumerator(name: "AV_CODEC_ID_INTERPLAY_VIDEO", value: 39)
!652 = !DIEnumerator(name: "AV_CODEC_ID_XAN_WC3", value: 40)
!653 = !DIEnumerator(name: "AV_CODEC_ID_XAN_WC4", value: 41)
!654 = !DIEnumerator(name: "AV_CODEC_ID_RPZA", value: 42)
!655 = !DIEnumerator(name: "AV_CODEC_ID_CINEPAK", value: 43)
!656 = !DIEnumerator(name: "AV_CODEC_ID_WS_VQA", value: 44)
!657 = !DIEnumerator(name: "AV_CODEC_ID_MSRLE", value: 45)
!658 = !DIEnumerator(name: "AV_CODEC_ID_MSVIDEO1", value: 46)
!659 = !DIEnumerator(name: "AV_CODEC_ID_IDCIN", value: 47)
!660 = !DIEnumerator(name: "AV_CODEC_ID_8BPS", value: 48)
!661 = !DIEnumerator(name: "AV_CODEC_ID_SMC", value: 49)
!662 = !DIEnumerator(name: "AV_CODEC_ID_FLIC", value: 50)
!663 = !DIEnumerator(name: "AV_CODEC_ID_TRUEMOTION1", value: 51)
!664 = !DIEnumerator(name: "AV_CODEC_ID_VMDVIDEO", value: 52)
!665 = !DIEnumerator(name: "AV_CODEC_ID_MSZH", value: 53)
!666 = !DIEnumerator(name: "AV_CODEC_ID_ZLIB", value: 54)
!667 = !DIEnumerator(name: "AV_CODEC_ID_QTRLE", value: 55)
!668 = !DIEnumerator(name: "AV_CODEC_ID_TSCC", value: 56)
!669 = !DIEnumerator(name: "AV_CODEC_ID_ULTI", value: 57)
!670 = !DIEnumerator(name: "AV_CODEC_ID_QDRAW", value: 58)
!671 = !DIEnumerator(name: "AV_CODEC_ID_VIXL", value: 59)
!672 = !DIEnumerator(name: "AV_CODEC_ID_QPEG", value: 60)
!673 = !DIEnumerator(name: "AV_CODEC_ID_PNG", value: 61)
!674 = !DIEnumerator(name: "AV_CODEC_ID_PPM", value: 62)
!675 = !DIEnumerator(name: "AV_CODEC_ID_PBM", value: 63)
!676 = !DIEnumerator(name: "AV_CODEC_ID_PGM", value: 64)
!677 = !DIEnumerator(name: "AV_CODEC_ID_PGMYUV", value: 65)
!678 = !DIEnumerator(name: "AV_CODEC_ID_PAM", value: 66)
!679 = !DIEnumerator(name: "AV_CODEC_ID_FFVHUFF", value: 67)
!680 = !DIEnumerator(name: "AV_CODEC_ID_RV30", value: 68)
!681 = !DIEnumerator(name: "AV_CODEC_ID_RV40", value: 69)
!682 = !DIEnumerator(name: "AV_CODEC_ID_VC1", value: 70)
!683 = !DIEnumerator(name: "AV_CODEC_ID_WMV3", value: 71)
!684 = !DIEnumerator(name: "AV_CODEC_ID_LOCO", value: 72)
!685 = !DIEnumerator(name: "AV_CODEC_ID_WNV1", value: 73)
!686 = !DIEnumerator(name: "AV_CODEC_ID_AASC", value: 74)
!687 = !DIEnumerator(name: "AV_CODEC_ID_INDEO2", value: 75)
!688 = !DIEnumerator(name: "AV_CODEC_ID_FRAPS", value: 76)
!689 = !DIEnumerator(name: "AV_CODEC_ID_TRUEMOTION2", value: 77)
!690 = !DIEnumerator(name: "AV_CODEC_ID_BMP", value: 78)
!691 = !DIEnumerator(name: "AV_CODEC_ID_CSCD", value: 79)
!692 = !DIEnumerator(name: "AV_CODEC_ID_MMVIDEO", value: 80)
!693 = !DIEnumerator(name: "AV_CODEC_ID_ZMBV", value: 81)
!694 = !DIEnumerator(name: "AV_CODEC_ID_AVS", value: 82)
!695 = !DIEnumerator(name: "AV_CODEC_ID_SMACKVIDEO", value: 83)
!696 = !DIEnumerator(name: "AV_CODEC_ID_NUV", value: 84)
!697 = !DIEnumerator(name: "AV_CODEC_ID_KMVC", value: 85)
!698 = !DIEnumerator(name: "AV_CODEC_ID_FLASHSV", value: 86)
!699 = !DIEnumerator(name: "AV_CODEC_ID_CAVS", value: 87)
!700 = !DIEnumerator(name: "AV_CODEC_ID_JPEG2000", value: 88)
!701 = !DIEnumerator(name: "AV_CODEC_ID_VMNC", value: 89)
!702 = !DIEnumerator(name: "AV_CODEC_ID_VP5", value: 90)
!703 = !DIEnumerator(name: "AV_CODEC_ID_VP6", value: 91)
!704 = !DIEnumerator(name: "AV_CODEC_ID_VP6F", value: 92)
!705 = !DIEnumerator(name: "AV_CODEC_ID_TARGA", value: 93)
!706 = !DIEnumerator(name: "AV_CODEC_ID_DSICINVIDEO", value: 94)
!707 = !DIEnumerator(name: "AV_CODEC_ID_TIERTEXSEQVIDEO", value: 95)
!708 = !DIEnumerator(name: "AV_CODEC_ID_TIFF", value: 96)
!709 = !DIEnumerator(name: "AV_CODEC_ID_GIF", value: 97)
!710 = !DIEnumerator(name: "AV_CODEC_ID_DXA", value: 98)
!711 = !DIEnumerator(name: "AV_CODEC_ID_DNXHD", value: 99)
!712 = !DIEnumerator(name: "AV_CODEC_ID_THP", value: 100)
!713 = !DIEnumerator(name: "AV_CODEC_ID_SGI", value: 101)
!714 = !DIEnumerator(name: "AV_CODEC_ID_C93", value: 102)
!715 = !DIEnumerator(name: "AV_CODEC_ID_BETHSOFTVID", value: 103)
!716 = !DIEnumerator(name: "AV_CODEC_ID_PTX", value: 104)
!717 = !DIEnumerator(name: "AV_CODEC_ID_TXD", value: 105)
!718 = !DIEnumerator(name: "AV_CODEC_ID_VP6A", value: 106)
!719 = !DIEnumerator(name: "AV_CODEC_ID_AMV", value: 107)
!720 = !DIEnumerator(name: "AV_CODEC_ID_VB", value: 108)
!721 = !DIEnumerator(name: "AV_CODEC_ID_PCX", value: 109)
!722 = !DIEnumerator(name: "AV_CODEC_ID_SUNRAST", value: 110)
!723 = !DIEnumerator(name: "AV_CODEC_ID_INDEO4", value: 111)
!724 = !DIEnumerator(name: "AV_CODEC_ID_INDEO5", value: 112)
!725 = !DIEnumerator(name: "AV_CODEC_ID_MIMIC", value: 113)
!726 = !DIEnumerator(name: "AV_CODEC_ID_RL2", value: 114)
!727 = !DIEnumerator(name: "AV_CODEC_ID_ESCAPE124", value: 115)
!728 = !DIEnumerator(name: "AV_CODEC_ID_DIRAC", value: 116)
!729 = !DIEnumerator(name: "AV_CODEC_ID_BFI", value: 117)
!730 = !DIEnumerator(name: "AV_CODEC_ID_CMV", value: 118)
!731 = !DIEnumerator(name: "AV_CODEC_ID_MOTIONPIXELS", value: 119)
!732 = !DIEnumerator(name: "AV_CODEC_ID_TGV", value: 120)
!733 = !DIEnumerator(name: "AV_CODEC_ID_TGQ", value: 121)
!734 = !DIEnumerator(name: "AV_CODEC_ID_TQI", value: 122)
!735 = !DIEnumerator(name: "AV_CODEC_ID_AURA", value: 123)
!736 = !DIEnumerator(name: "AV_CODEC_ID_AURA2", value: 124)
!737 = !DIEnumerator(name: "AV_CODEC_ID_V210X", value: 125)
!738 = !DIEnumerator(name: "AV_CODEC_ID_TMV", value: 126)
!739 = !DIEnumerator(name: "AV_CODEC_ID_V210", value: 127)
!740 = !DIEnumerator(name: "AV_CODEC_ID_DPX", value: 128)
!741 = !DIEnumerator(name: "AV_CODEC_ID_MAD", value: 129)
!742 = !DIEnumerator(name: "AV_CODEC_ID_FRWU", value: 130)
!743 = !DIEnumerator(name: "AV_CODEC_ID_FLASHSV2", value: 131)
!744 = !DIEnumerator(name: "AV_CODEC_ID_CDGRAPHICS", value: 132)
!745 = !DIEnumerator(name: "AV_CODEC_ID_R210", value: 133)
!746 = !DIEnumerator(name: "AV_CODEC_ID_ANM", value: 134)
!747 = !DIEnumerator(name: "AV_CODEC_ID_BINKVIDEO", value: 135)
!748 = !DIEnumerator(name: "AV_CODEC_ID_IFF_ILBM", value: 136)
!749 = !DIEnumerator(name: "AV_CODEC_ID_KGV1", value: 137)
!750 = !DIEnumerator(name: "AV_CODEC_ID_YOP", value: 138)
!751 = !DIEnumerator(name: "AV_CODEC_ID_VP8", value: 139)
!752 = !DIEnumerator(name: "AV_CODEC_ID_PICTOR", value: 140)
!753 = !DIEnumerator(name: "AV_CODEC_ID_ANSI", value: 141)
!754 = !DIEnumerator(name: "AV_CODEC_ID_A64_MULTI", value: 142)
!755 = !DIEnumerator(name: "AV_CODEC_ID_A64_MULTI5", value: 143)
!756 = !DIEnumerator(name: "AV_CODEC_ID_R10K", value: 144)
!757 = !DIEnumerator(name: "AV_CODEC_ID_MXPEG", value: 145)
!758 = !DIEnumerator(name: "AV_CODEC_ID_LAGARITH", value: 146)
!759 = !DIEnumerator(name: "AV_CODEC_ID_PRORES", value: 147)
!760 = !DIEnumerator(name: "AV_CODEC_ID_JV", value: 148)
!761 = !DIEnumerator(name: "AV_CODEC_ID_DFA", value: 149)
!762 = !DIEnumerator(name: "AV_CODEC_ID_WMV3IMAGE", value: 150)
!763 = !DIEnumerator(name: "AV_CODEC_ID_VC1IMAGE", value: 151)
!764 = !DIEnumerator(name: "AV_CODEC_ID_UTVIDEO", value: 152)
!765 = !DIEnumerator(name: "AV_CODEC_ID_BMV_VIDEO", value: 153)
!766 = !DIEnumerator(name: "AV_CODEC_ID_VBLE", value: 154)
!767 = !DIEnumerator(name: "AV_CODEC_ID_DXTORY", value: 155)
!768 = !DIEnumerator(name: "AV_CODEC_ID_V410", value: 156)
!769 = !DIEnumerator(name: "AV_CODEC_ID_XWD", value: 157)
!770 = !DIEnumerator(name: "AV_CODEC_ID_CDXL", value: 158)
!771 = !DIEnumerator(name: "AV_CODEC_ID_XBM", value: 159)
!772 = !DIEnumerator(name: "AV_CODEC_ID_ZEROCODEC", value: 160)
!773 = !DIEnumerator(name: "AV_CODEC_ID_MSS1", value: 161)
!774 = !DIEnumerator(name: "AV_CODEC_ID_MSA1", value: 162)
!775 = !DIEnumerator(name: "AV_CODEC_ID_TSCC2", value: 163)
!776 = !DIEnumerator(name: "AV_CODEC_ID_MTS2", value: 164)
!777 = !DIEnumerator(name: "AV_CODEC_ID_CLLC", value: 165)
!778 = !DIEnumerator(name: "AV_CODEC_ID_MSS2", value: 166)
!779 = !DIEnumerator(name: "AV_CODEC_ID_VP9", value: 167)
!780 = !DIEnumerator(name: "AV_CODEC_ID_AIC", value: 168)
!781 = !DIEnumerator(name: "AV_CODEC_ID_ESCAPE130", value: 169)
!782 = !DIEnumerator(name: "AV_CODEC_ID_G2M", value: 170)
!783 = !DIEnumerator(name: "AV_CODEC_ID_WEBP", value: 171)
!784 = !DIEnumerator(name: "AV_CODEC_ID_HNM4_VIDEO", value: 172)
!785 = !DIEnumerator(name: "AV_CODEC_ID_HEVC", value: 173)
!786 = !DIEnumerator(name: "AV_CODEC_ID_FIC", value: 174)
!787 = !DIEnumerator(name: "AV_CODEC_ID_ALIAS_PIX", value: 175)
!788 = !DIEnumerator(name: "AV_CODEC_ID_BRENDER_PIX", value: 176)
!789 = !DIEnumerator(name: "AV_CODEC_ID_PAF_VIDEO", value: 177)
!790 = !DIEnumerator(name: "AV_CODEC_ID_EXR", value: 178)
!791 = !DIEnumerator(name: "AV_CODEC_ID_VP7", value: 179)
!792 = !DIEnumerator(name: "AV_CODEC_ID_SANM", value: 180)
!793 = !DIEnumerator(name: "AV_CODEC_ID_SGIRLE", value: 181)
!794 = !DIEnumerator(name: "AV_CODEC_ID_MVC1", value: 182)
!795 = !DIEnumerator(name: "AV_CODEC_ID_MVC2", value: 183)
!796 = !DIEnumerator(name: "AV_CODEC_ID_HQX", value: 184)
!797 = !DIEnumerator(name: "AV_CODEC_ID_TDSC", value: 185)
!798 = !DIEnumerator(name: "AV_CODEC_ID_HQ_HQA", value: 186)
!799 = !DIEnumerator(name: "AV_CODEC_ID_HAP", value: 187)
!800 = !DIEnumerator(name: "AV_CODEC_ID_DDS", value: 188)
!801 = !DIEnumerator(name: "AV_CODEC_ID_DXV", value: 189)
!802 = !DIEnumerator(name: "AV_CODEC_ID_SCREENPRESSO", value: 190)
!803 = !DIEnumerator(name: "AV_CODEC_ID_RSCC", value: 191)
!804 = !DIEnumerator(name: "AV_CODEC_ID_AVS2", value: 192)
!805 = !DIEnumerator(name: "AV_CODEC_ID_Y41P", value: 32768)
!806 = !DIEnumerator(name: "AV_CODEC_ID_AVRP", value: 32769)
!807 = !DIEnumerator(name: "AV_CODEC_ID_012V", value: 32770)
!808 = !DIEnumerator(name: "AV_CODEC_ID_AVUI", value: 32771)
!809 = !DIEnumerator(name: "AV_CODEC_ID_AYUV", value: 32772)
!810 = !DIEnumerator(name: "AV_CODEC_ID_TARGA_Y216", value: 32773)
!811 = !DIEnumerator(name: "AV_CODEC_ID_V308", value: 32774)
!812 = !DIEnumerator(name: "AV_CODEC_ID_V408", value: 32775)
!813 = !DIEnumerator(name: "AV_CODEC_ID_YUV4", value: 32776)
!814 = !DIEnumerator(name: "AV_CODEC_ID_AVRN", value: 32777)
!815 = !DIEnumerator(name: "AV_CODEC_ID_CPIA", value: 32778)
!816 = !DIEnumerator(name: "AV_CODEC_ID_XFACE", value: 32779)
!817 = !DIEnumerator(name: "AV_CODEC_ID_SNOW", value: 32780)
!818 = !DIEnumerator(name: "AV_CODEC_ID_SMVJPEG", value: 32781)
!819 = !DIEnumerator(name: "AV_CODEC_ID_APNG", value: 32782)
!820 = !DIEnumerator(name: "AV_CODEC_ID_DAALA", value: 32783)
!821 = !DIEnumerator(name: "AV_CODEC_ID_CFHD", value: 32784)
!822 = !DIEnumerator(name: "AV_CODEC_ID_TRUEMOTION2RT", value: 32785)
!823 = !DIEnumerator(name: "AV_CODEC_ID_M101", value: 32786)
!824 = !DIEnumerator(name: "AV_CODEC_ID_MAGICYUV", value: 32787)
!825 = !DIEnumerator(name: "AV_CODEC_ID_SHEERVIDEO", value: 32788)
!826 = !DIEnumerator(name: "AV_CODEC_ID_YLC", value: 32789)
!827 = !DIEnumerator(name: "AV_CODEC_ID_PSD", value: 32790)
!828 = !DIEnumerator(name: "AV_CODEC_ID_PIXLET", value: 32791)
!829 = !DIEnumerator(name: "AV_CODEC_ID_SPEEDHQ", value: 32792)
!830 = !DIEnumerator(name: "AV_CODEC_ID_FMVC", value: 32793)
!831 = !DIEnumerator(name: "AV_CODEC_ID_SCPR", value: 32794)
!832 = !DIEnumerator(name: "AV_CODEC_ID_CLEARVIDEO", value: 32795)
!833 = !DIEnumerator(name: "AV_CODEC_ID_XPM", value: 32796)
!834 = !DIEnumerator(name: "AV_CODEC_ID_AV1", value: 32797)
!835 = !DIEnumerator(name: "AV_CODEC_ID_BITPACKED", value: 32798)
!836 = !DIEnumerator(name: "AV_CODEC_ID_MSCC", value: 32799)
!837 = !DIEnumerator(name: "AV_CODEC_ID_SRGC", value: 32800)
!838 = !DIEnumerator(name: "AV_CODEC_ID_SVG", value: 32801)
!839 = !DIEnumerator(name: "AV_CODEC_ID_GDV", value: 32802)
!840 = !DIEnumerator(name: "AV_CODEC_ID_FITS", value: 32803)
!841 = !DIEnumerator(name: "AV_CODEC_ID_IMM4", value: 32804)
!842 = !DIEnumerator(name: "AV_CODEC_ID_PROSUMER", value: 32805)
!843 = !DIEnumerator(name: "AV_CODEC_ID_MWSC", value: 32806)
!844 = !DIEnumerator(name: "AV_CODEC_ID_WCMV", value: 32807)
!845 = !DIEnumerator(name: "AV_CODEC_ID_RASC", value: 32808)
!846 = !DIEnumerator(name: "AV_CODEC_ID_HYMT", value: 32809)
!847 = !DIEnumerator(name: "AV_CODEC_ID_ARBC", value: 32810)
!848 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_AUDIO", value: 65536)
!849 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S16LE", value: 65536)
!850 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S16BE", value: 65537)
!851 = !DIEnumerator(name: "AV_CODEC_ID_PCM_U16LE", value: 65538)
!852 = !DIEnumerator(name: "AV_CODEC_ID_PCM_U16BE", value: 65539)
!853 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S8", value: 65540)
!854 = !DIEnumerator(name: "AV_CODEC_ID_PCM_U8", value: 65541)
!855 = !DIEnumerator(name: "AV_CODEC_ID_PCM_MULAW", value: 65542)
!856 = !DIEnumerator(name: "AV_CODEC_ID_PCM_ALAW", value: 65543)
!857 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S32LE", value: 65544)
!858 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S32BE", value: 65545)
!859 = !DIEnumerator(name: "AV_CODEC_ID_PCM_U32LE", value: 65546)
!860 = !DIEnumerator(name: "AV_CODEC_ID_PCM_U32BE", value: 65547)
!861 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S24LE", value: 65548)
!862 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S24BE", value: 65549)
!863 = !DIEnumerator(name: "AV_CODEC_ID_PCM_U24LE", value: 65550)
!864 = !DIEnumerator(name: "AV_CODEC_ID_PCM_U24BE", value: 65551)
!865 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S24DAUD", value: 65552)
!866 = !DIEnumerator(name: "AV_CODEC_ID_PCM_ZORK", value: 65553)
!867 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S16LE_PLANAR", value: 65554)
!868 = !DIEnumerator(name: "AV_CODEC_ID_PCM_DVD", value: 65555)
!869 = !DIEnumerator(name: "AV_CODEC_ID_PCM_F32BE", value: 65556)
!870 = !DIEnumerator(name: "AV_CODEC_ID_PCM_F32LE", value: 65557)
!871 = !DIEnumerator(name: "AV_CODEC_ID_PCM_F64BE", value: 65558)
!872 = !DIEnumerator(name: "AV_CODEC_ID_PCM_F64LE", value: 65559)
!873 = !DIEnumerator(name: "AV_CODEC_ID_PCM_BLURAY", value: 65560)
!874 = !DIEnumerator(name: "AV_CODEC_ID_PCM_LXF", value: 65561)
!875 = !DIEnumerator(name: "AV_CODEC_ID_S302M", value: 65562)
!876 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S8_PLANAR", value: 65563)
!877 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S24LE_PLANAR", value: 65564)
!878 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S32LE_PLANAR", value: 65565)
!879 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S16BE_PLANAR", value: 65566)
!880 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S64LE", value: 67584)
!881 = !DIEnumerator(name: "AV_CODEC_ID_PCM_S64BE", value: 67585)
!882 = !DIEnumerator(name: "AV_CODEC_ID_PCM_F16LE", value: 67586)
!883 = !DIEnumerator(name: "AV_CODEC_ID_PCM_F24LE", value: 67587)
!884 = !DIEnumerator(name: "AV_CODEC_ID_PCM_VIDC", value: 67588)
!885 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_QT", value: 69632)
!886 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_WAV", value: 69633)
!887 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_DK3", value: 69634)
!888 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_DK4", value: 69635)
!889 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_WS", value: 69636)
!890 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_SMJPEG", value: 69637)
!891 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_MS", value: 69638)
!892 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_4XM", value: 69639)
!893 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_XA", value: 69640)
!894 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_ADX", value: 69641)
!895 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_EA", value: 69642)
!896 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_G726", value: 69643)
!897 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_CT", value: 69644)
!898 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_SWF", value: 69645)
!899 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_YAMAHA", value: 69646)
!900 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_SBPRO_4", value: 69647)
!901 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_SBPRO_3", value: 69648)
!902 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_SBPRO_2", value: 69649)
!903 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_THP", value: 69650)
!904 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_AMV", value: 69651)
!905 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_EA_R1", value: 69652)
!906 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_EA_R3", value: 69653)
!907 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_EA_R2", value: 69654)
!908 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_EA_SEAD", value: 69655)
!909 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_EA_EACS", value: 69656)
!910 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_EA_XAS", value: 69657)
!911 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_EA_MAXIS_XA", value: 69658)
!912 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_ISS", value: 69659)
!913 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_G722", value: 69660)
!914 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_APC", value: 69661)
!915 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_VIMA", value: 69662)
!916 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_AFC", value: 71680)
!917 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_OKI", value: 71681)
!918 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_DTK", value: 71682)
!919 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_RAD", value: 71683)
!920 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_G726LE", value: 71684)
!921 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_THP_LE", value: 71685)
!922 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_PSX", value: 71686)
!923 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_AICA", value: 71687)
!924 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_IMA_DAT4", value: 71688)
!925 = !DIEnumerator(name: "AV_CODEC_ID_ADPCM_MTAF", value: 71689)
!926 = !DIEnumerator(name: "AV_CODEC_ID_AMR_NB", value: 73728)
!927 = !DIEnumerator(name: "AV_CODEC_ID_AMR_WB", value: 73729)
!928 = !DIEnumerator(name: "AV_CODEC_ID_RA_144", value: 77824)
!929 = !DIEnumerator(name: "AV_CODEC_ID_RA_288", value: 77825)
!930 = !DIEnumerator(name: "AV_CODEC_ID_ROQ_DPCM", value: 81920)
!931 = !DIEnumerator(name: "AV_CODEC_ID_INTERPLAY_DPCM", value: 81921)
!932 = !DIEnumerator(name: "AV_CODEC_ID_XAN_DPCM", value: 81922)
!933 = !DIEnumerator(name: "AV_CODEC_ID_SOL_DPCM", value: 81923)
!934 = !DIEnumerator(name: "AV_CODEC_ID_SDX2_DPCM", value: 83968)
!935 = !DIEnumerator(name: "AV_CODEC_ID_GREMLIN_DPCM", value: 83969)
!936 = !DIEnumerator(name: "AV_CODEC_ID_MP2", value: 86016)
!937 = !DIEnumerator(name: "AV_CODEC_ID_MP3", value: 86017)
!938 = !DIEnumerator(name: "AV_CODEC_ID_AAC", value: 86018)
!939 = !DIEnumerator(name: "AV_CODEC_ID_AC3", value: 86019)
!940 = !DIEnumerator(name: "AV_CODEC_ID_DTS", value: 86020)
!941 = !DIEnumerator(name: "AV_CODEC_ID_VORBIS", value: 86021)
!942 = !DIEnumerator(name: "AV_CODEC_ID_DVAUDIO", value: 86022)
!943 = !DIEnumerator(name: "AV_CODEC_ID_WMAV1", value: 86023)
!944 = !DIEnumerator(name: "AV_CODEC_ID_WMAV2", value: 86024)
!945 = !DIEnumerator(name: "AV_CODEC_ID_MACE3", value: 86025)
!946 = !DIEnumerator(name: "AV_CODEC_ID_MACE6", value: 86026)
!947 = !DIEnumerator(name: "AV_CODEC_ID_VMDAUDIO", value: 86027)
!948 = !DIEnumerator(name: "AV_CODEC_ID_FLAC", value: 86028)
!949 = !DIEnumerator(name: "AV_CODEC_ID_MP3ADU", value: 86029)
!950 = !DIEnumerator(name: "AV_CODEC_ID_MP3ON4", value: 86030)
!951 = !DIEnumerator(name: "AV_CODEC_ID_SHORTEN", value: 86031)
!952 = !DIEnumerator(name: "AV_CODEC_ID_ALAC", value: 86032)
!953 = !DIEnumerator(name: "AV_CODEC_ID_WESTWOOD_SND1", value: 86033)
!954 = !DIEnumerator(name: "AV_CODEC_ID_GSM", value: 86034)
!955 = !DIEnumerator(name: "AV_CODEC_ID_QDM2", value: 86035)
!956 = !DIEnumerator(name: "AV_CODEC_ID_COOK", value: 86036)
!957 = !DIEnumerator(name: "AV_CODEC_ID_TRUESPEECH", value: 86037)
!958 = !DIEnumerator(name: "AV_CODEC_ID_TTA", value: 86038)
!959 = !DIEnumerator(name: "AV_CODEC_ID_SMACKAUDIO", value: 86039)
!960 = !DIEnumerator(name: "AV_CODEC_ID_QCELP", value: 86040)
!961 = !DIEnumerator(name: "AV_CODEC_ID_WAVPACK", value: 86041)
!962 = !DIEnumerator(name: "AV_CODEC_ID_DSICINAUDIO", value: 86042)
!963 = !DIEnumerator(name: "AV_CODEC_ID_IMC", value: 86043)
!964 = !DIEnumerator(name: "AV_CODEC_ID_MUSEPACK7", value: 86044)
!965 = !DIEnumerator(name: "AV_CODEC_ID_MLP", value: 86045)
!966 = !DIEnumerator(name: "AV_CODEC_ID_GSM_MS", value: 86046)
!967 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC3", value: 86047)
!968 = !DIEnumerator(name: "AV_CODEC_ID_APE", value: 86048)
!969 = !DIEnumerator(name: "AV_CODEC_ID_NELLYMOSER", value: 86049)
!970 = !DIEnumerator(name: "AV_CODEC_ID_MUSEPACK8", value: 86050)
!971 = !DIEnumerator(name: "AV_CODEC_ID_SPEEX", value: 86051)
!972 = !DIEnumerator(name: "AV_CODEC_ID_WMAVOICE", value: 86052)
!973 = !DIEnumerator(name: "AV_CODEC_ID_WMAPRO", value: 86053)
!974 = !DIEnumerator(name: "AV_CODEC_ID_WMALOSSLESS", value: 86054)
!975 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC3P", value: 86055)
!976 = !DIEnumerator(name: "AV_CODEC_ID_EAC3", value: 86056)
!977 = !DIEnumerator(name: "AV_CODEC_ID_SIPR", value: 86057)
!978 = !DIEnumerator(name: "AV_CODEC_ID_MP1", value: 86058)
!979 = !DIEnumerator(name: "AV_CODEC_ID_TWINVQ", value: 86059)
!980 = !DIEnumerator(name: "AV_CODEC_ID_TRUEHD", value: 86060)
!981 = !DIEnumerator(name: "AV_CODEC_ID_MP4ALS", value: 86061)
!982 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC1", value: 86062)
!983 = !DIEnumerator(name: "AV_CODEC_ID_BINKAUDIO_RDFT", value: 86063)
!984 = !DIEnumerator(name: "AV_CODEC_ID_BINKAUDIO_DCT", value: 86064)
!985 = !DIEnumerator(name: "AV_CODEC_ID_AAC_LATM", value: 86065)
!986 = !DIEnumerator(name: "AV_CODEC_ID_QDMC", value: 86066)
!987 = !DIEnumerator(name: "AV_CODEC_ID_CELT", value: 86067)
!988 = !DIEnumerator(name: "AV_CODEC_ID_G723_1", value: 86068)
!989 = !DIEnumerator(name: "AV_CODEC_ID_G729", value: 86069)
!990 = !DIEnumerator(name: "AV_CODEC_ID_8SVX_EXP", value: 86070)
!991 = !DIEnumerator(name: "AV_CODEC_ID_8SVX_FIB", value: 86071)
!992 = !DIEnumerator(name: "AV_CODEC_ID_BMV_AUDIO", value: 86072)
!993 = !DIEnumerator(name: "AV_CODEC_ID_RALF", value: 86073)
!994 = !DIEnumerator(name: "AV_CODEC_ID_IAC", value: 86074)
!995 = !DIEnumerator(name: "AV_CODEC_ID_ILBC", value: 86075)
!996 = !DIEnumerator(name: "AV_CODEC_ID_OPUS", value: 86076)
!997 = !DIEnumerator(name: "AV_CODEC_ID_COMFORT_NOISE", value: 86077)
!998 = !DIEnumerator(name: "AV_CODEC_ID_TAK", value: 86078)
!999 = !DIEnumerator(name: "AV_CODEC_ID_METASOUND", value: 86079)
!1000 = !DIEnumerator(name: "AV_CODEC_ID_PAF_AUDIO", value: 86080)
!1001 = !DIEnumerator(name: "AV_CODEC_ID_ON2AVC", value: 86081)
!1002 = !DIEnumerator(name: "AV_CODEC_ID_DSS_SP", value: 86082)
!1003 = !DIEnumerator(name: "AV_CODEC_ID_CODEC2", value: 86083)
!1004 = !DIEnumerator(name: "AV_CODEC_ID_FFWAVESYNTH", value: 88064)
!1005 = !DIEnumerator(name: "AV_CODEC_ID_SONIC", value: 88065)
!1006 = !DIEnumerator(name: "AV_CODEC_ID_SONIC_LS", value: 88066)
!1007 = !DIEnumerator(name: "AV_CODEC_ID_EVRC", value: 88067)
!1008 = !DIEnumerator(name: "AV_CODEC_ID_SMV", value: 88068)
!1009 = !DIEnumerator(name: "AV_CODEC_ID_DSD_LSBF", value: 88069)
!1010 = !DIEnumerator(name: "AV_CODEC_ID_DSD_MSBF", value: 88070)
!1011 = !DIEnumerator(name: "AV_CODEC_ID_DSD_LSBF_PLANAR", value: 88071)
!1012 = !DIEnumerator(name: "AV_CODEC_ID_DSD_MSBF_PLANAR", value: 88072)
!1013 = !DIEnumerator(name: "AV_CODEC_ID_4GV", value: 88073)
!1014 = !DIEnumerator(name: "AV_CODEC_ID_INTERPLAY_ACM", value: 88074)
!1015 = !DIEnumerator(name: "AV_CODEC_ID_XMA1", value: 88075)
!1016 = !DIEnumerator(name: "AV_CODEC_ID_XMA2", value: 88076)
!1017 = !DIEnumerator(name: "AV_CODEC_ID_DST", value: 88077)
!1018 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC3AL", value: 88078)
!1019 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC3PAL", value: 88079)
!1020 = !DIEnumerator(name: "AV_CODEC_ID_DOLBY_E", value: 88080)
!1021 = !DIEnumerator(name: "AV_CODEC_ID_APTX", value: 88081)
!1022 = !DIEnumerator(name: "AV_CODEC_ID_APTX_HD", value: 88082)
!1023 = !DIEnumerator(name: "AV_CODEC_ID_SBC", value: 88083)
!1024 = !DIEnumerator(name: "AV_CODEC_ID_ATRAC9", value: 88084)
!1025 = !DIEnumerator(name: "AV_CODEC_ID_HCOM", value: 88085)
!1026 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_SUBTITLE", value: 94208)
!1027 = !DIEnumerator(name: "AV_CODEC_ID_DVD_SUBTITLE", value: 94208)
!1028 = !DIEnumerator(name: "AV_CODEC_ID_DVB_SUBTITLE", value: 94209)
!1029 = !DIEnumerator(name: "AV_CODEC_ID_TEXT", value: 94210)
!1030 = !DIEnumerator(name: "AV_CODEC_ID_XSUB", value: 94211)
!1031 = !DIEnumerator(name: "AV_CODEC_ID_SSA", value: 94212)
!1032 = !DIEnumerator(name: "AV_CODEC_ID_MOV_TEXT", value: 94213)
!1033 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_PGS_SUBTITLE", value: 94214)
!1034 = !DIEnumerator(name: "AV_CODEC_ID_DVB_TELETEXT", value: 94215)
!1035 = !DIEnumerator(name: "AV_CODEC_ID_SRT", value: 94216)
!1036 = !DIEnumerator(name: "AV_CODEC_ID_MICRODVD", value: 96256)
!1037 = !DIEnumerator(name: "AV_CODEC_ID_EIA_608", value: 96257)
!1038 = !DIEnumerator(name: "AV_CODEC_ID_JACOSUB", value: 96258)
!1039 = !DIEnumerator(name: "AV_CODEC_ID_SAMI", value: 96259)
!1040 = !DIEnumerator(name: "AV_CODEC_ID_REALTEXT", value: 96260)
!1041 = !DIEnumerator(name: "AV_CODEC_ID_STL", value: 96261)
!1042 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER1", value: 96262)
!1043 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER", value: 96263)
!1044 = !DIEnumerator(name: "AV_CODEC_ID_SUBRIP", value: 96264)
!1045 = !DIEnumerator(name: "AV_CODEC_ID_WEBVTT", value: 96265)
!1046 = !DIEnumerator(name: "AV_CODEC_ID_MPL2", value: 96266)
!1047 = !DIEnumerator(name: "AV_CODEC_ID_VPLAYER", value: 96267)
!1048 = !DIEnumerator(name: "AV_CODEC_ID_PJS", value: 96268)
!1049 = !DIEnumerator(name: "AV_CODEC_ID_ASS", value: 96269)
!1050 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_TEXT_SUBTITLE", value: 96270)
!1051 = !DIEnumerator(name: "AV_CODEC_ID_TTML", value: 96271)
!1052 = !DIEnumerator(name: "AV_CODEC_ID_ARIB_CAPTION", value: 96272)
!1053 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_UNKNOWN", value: 98304)
!1054 = !DIEnumerator(name: "AV_CODEC_ID_TTF", value: 98304)
!1055 = !DIEnumerator(name: "AV_CODEC_ID_SCTE_35", value: 98305)
!1056 = !DIEnumerator(name: "AV_CODEC_ID_BINTEXT", value: 100352)
!1057 = !DIEnumerator(name: "AV_CODEC_ID_XBIN", value: 100353)
!1058 = !DIEnumerator(name: "AV_CODEC_ID_IDF", value: 100354)
!1059 = !DIEnumerator(name: "AV_CODEC_ID_OTF", value: 100355)
!1060 = !DIEnumerator(name: "AV_CODEC_ID_SMPTE_KLV", value: 100356)
!1061 = !DIEnumerator(name: "AV_CODEC_ID_DVD_NAV", value: 100357)
!1062 = !DIEnumerator(name: "AV_CODEC_ID_TIMED_ID3", value: 100358)
!1063 = !DIEnumerator(name: "AV_CODEC_ID_BIN_DATA", value: 100359)
!1064 = !DIEnumerator(name: "AV_CODEC_ID_PROBE", value: 102400)
!1065 = !DIEnumerator(name: "AV_CODEC_ID_MPEG2TS", value: 131072)
!1066 = !DIEnumerator(name: "AV_CODEC_ID_MPEG4SYSTEMS", value: 131073)
!1067 = !DIEnumerator(name: "AV_CODEC_ID_FFMETADATA", value: 135168)
!1068 = !DIEnumerator(name: "AV_CODEC_ID_WRAPPED_AVFRAME", value: 135169)
!1069 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVIODataMarkerType", file: !1070, line: 111, size: 32, align: 32, elements: !1071)
!1070 = !DIFile(filename: "./libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077}
!1072 = !DIEnumerator(name: "AVIO_DATA_MARKER_HEADER", value: 0)
!1073 = !DIEnumerator(name: "AVIO_DATA_MARKER_SYNC_POINT", value: 1)
!1074 = !DIEnumerator(name: "AVIO_DATA_MARKER_BOUNDARY_POINT", value: 2)
!1075 = !DIEnumerator(name: "AVIO_DATA_MARKER_UNKNOWN", value: 3)
!1076 = !DIEnumerator(name: "AVIO_DATA_MARKER_TRAILER", value: 4)
!1077 = !DIEnumerator(name: "AVIO_DATA_MARKER_FLUSH_POINT", value: 5)
!1078 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !48, line: 64, size: 32, align: 32, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276}
!1080 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!1081 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!1082 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!1083 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!1084 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!1085 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!1086 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!1087 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!1088 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!1089 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!1090 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!1091 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!1092 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!1093 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!1094 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!1095 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!1096 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!1097 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!1098 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!1099 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!1100 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!1101 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!1102 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!1103 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!1104 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!1105 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!1106 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!1107 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!1108 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!1109 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!1110 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!1111 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!1112 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!1113 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!1114 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!1115 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!1116 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!1117 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!1118 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!1119 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!1120 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!1121 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!1122 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!1123 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!1124 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!1125 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!1126 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!1127 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!1128 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!1129 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!1130 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!1131 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!1132 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!1133 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!1134 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!1135 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!1136 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!1137 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!1138 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!1139 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!1140 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!1141 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!1142 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!1143 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!1144 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!1145 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!1146 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!1147 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!1148 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!1149 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!1150 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!1151 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!1152 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!1153 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!1154 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!1155 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!1156 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!1157 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!1158 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!1159 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!1160 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!1161 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!1162 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!1163 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!1164 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!1165 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!1166 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!1167 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!1168 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!1169 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!1170 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!1171 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!1172 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!1173 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!1174 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!1175 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!1176 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!1177 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!1178 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!1179 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!1180 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!1181 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!1182 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!1183 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!1184 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!1185 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!1186 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!1187 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!1188 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!1189 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!1190 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!1191 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!1192 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!1193 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!1194 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!1195 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!1196 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!1197 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!1198 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!1199 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!1200 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!1201 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!1202 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!1203 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!1204 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!1205 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!1206 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!1207 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!1208 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!1209 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!1210 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!1211 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!1212 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!1213 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!1214 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!1215 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!1216 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!1217 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!1218 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!1219 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!1220 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!1221 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!1222 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!1223 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!1224 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!1225 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!1226 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!1227 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!1228 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!1229 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!1230 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!1231 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!1232 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!1233 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!1234 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!1235 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!1236 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!1237 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!1238 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!1239 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!1240 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!1241 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!1242 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!1243 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!1244 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!1245 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!1246 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!1247 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!1248 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
