; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_direct.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_direct.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!921 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!922 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!923 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!924 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "av_alias32", file: !928, line: 41, baseType: !929)
!928 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !928, line: 36, size: 32, align: 32, elements: !930)
!930 = !{!931, !933, !939, !945}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "u32", scope: !929, file: !928, line: 37, baseType: !932, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !921, line: 51, baseType: !924)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "u16", scope: !929, file: !928, line: 38, baseType: !934, size: 32, align: 16)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !935, size: 32, align: 16, elements: !937)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !921, line: 49, baseType: !936)
!936 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!937 = !{!938}
!938 = !DISubrange(count: 2)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "u8", scope: !929, file: !928, line: 39, baseType: !940, size: 32, align: 8)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 32, align: 8, elements: !943)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !921, line: 48, baseType: !942)
!942 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!943 = !{!944}
!944 = !DISubrange(count: 4)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "f32", scope: !929, file: !928, line: 40, baseType: !946, size: 32, align: 32)
!946 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !921, line: 55, baseType: !953)
!953 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!954 = !{!955}
!955 = distinct !DIGlobalVariable(name: "scan8", scope: !0, file: !888, line: 644, type: !956, isLocal: true, isDefinition: true, variable: [51 x i8]* @scan8)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 408, align: 8, elements: !958)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!958 = !{!959}
!959 = !DISubrange(count: 51)
!960 = !{i32 2, !"Dwarf Version", i32 4}
!961 = !{i32 2, !"Debug Info Version", i32 3}
!962 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!963 = distinct !DISubprogram(name: "ff_h264_direct_dist_scale_factor", scope: !964, file: !964, line: 62, type: !965, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2603)
!964 = !DIFile(filename: "libavcodec/h264_direct.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!965 = !DISubroutineType(types: !966)
!966 = !{null, !967, !1869}
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264Context", file: !888, line: 554, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264Context", file: !888, line: 337, size: 416128, align: 64, elements: !972)
!972 = !{!973, !1017, !1688, !1702, !1785, !1797, !1812, !1864, !1866, !1867, !1868, !2181, !2182, !2183, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2278, !2282, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2299, !2300, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2453, !2454, !2468, !2470, !2472, !2473, !2477, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2499, !2500, !2501, !2502, !2596, !2597, !2598, !2599, !2600}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !971, file: !888, line: 338, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !978)
!978 = !{!979, !983, !987, !991, !992, !993, !994, !998, !1004, !1006, !1010}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !977, file: !4, line: 72, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !977, file: !4, line: 78, baseType: !984, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!980, !919}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !977, file: !4, line: 85, baseType: !988, size: 64, align: 64, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !977, file: !4, line: 93, baseType: !923, size: 32, align: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !977, file: !4, line: 99, baseType: !923, size: 32, align: 32, offset: 224)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !977, file: !4, line: 108, baseType: !923, size: 32, align: 32, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !977, file: !4, line: 113, baseType: !995, size: 64, align: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!919, !919, !919}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !977, file: !4, line: 123, baseType: !999, size: 64, align: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!1002, !1002}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !977, file: !4, line: 130, baseType: !1005, size: 32, align: 32, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !977, file: !4, line: 136, baseType: !1007, size: 64, align: 64, offset: 512)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!1005, !919}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !977, file: !4, line: 142, baseType: !1011, size: 64, align: 64, offset: 576)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!923, !1014, !919, !980, !923}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !971, file: !888, line: 339, baseType: !1018, size: 64, align: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1288, !1289, !1290, !1291, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1444, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1626, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1020, file: !35, line: 1561, baseType: !974, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1020, file: !35, line: 1562, baseType: !923, size: 32, align: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1020, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1020, file: !35, line: 1565, baseType: !1026, size: 64, align: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1044, !1047, !1050, !1053, !1056, !1057, !1058, !1066, !1067, !1068, !1070, !1074, !1080, !1090, !1094, !1095, !1138, !1259, !1263, !1264, !1268, !1272, !1277, !1281, !1282, !1283}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1028, file: !35, line: 3475, baseType: !980, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1028, file: !35, line: 3480, baseType: !980, size: 64, align: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1028, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1028, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1028, file: !35, line: 3487, baseType: !923, size: 32, align: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1028, file: !35, line: 3488, baseType: !1036, size: 64, align: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1039, line: 61, baseType: !1040)
!1039 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1039, line: 58, size: 64, align: 32, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1040, file: !1039, line: 59, baseType: !923, size: 32, align: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1040, file: !1039, line: 60, baseType: !923, size: 32, align: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1028, file: !35, line: 3489, baseType: !1045, size: 64, align: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1028, file: !35, line: 3490, baseType: !1048, size: 64, align: 64, offset: 384)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1028, file: !35, line: 3491, baseType: !1051, size: 64, align: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1028, file: !35, line: 3492, baseType: !1054, size: 64, align: 64, offset: 512)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1028, file: !35, line: 3493, baseType: !941, size: 8, align: 8, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1028, file: !35, line: 3494, baseType: !974, size: 64, align: 64, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1028, file: !35, line: 3495, baseType: !1059, size: 64, align: 64, offset: 704)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1062, file: !35, line: 3402, baseType: !923, size: 32, align: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1062, file: !35, line: 3403, baseType: !980, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1028, file: !35, line: 3507, baseType: !980, size: 64, align: 64, offset: 768)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1028, file: !35, line: 3516, baseType: !923, size: 32, align: 32, offset: 832)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !35, line: 3517, baseType: !1069, size: 64, align: 64, offset: 896)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1028, file: !35, line: 3527, baseType: !1071, size: 64, align: 64, offset: 960)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!923, !1018}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1028, file: !35, line: 3535, baseType: !1075, size: 64, align: 64, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!923, !1018, !1078}
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1028, file: !35, line: 3541, baseType: !1081, size: 64, align: 64, offset: 1088)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1085, line: 223, size: 128, align: 64, elements: !1086)
!1085 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1086 = !{!1087, !1089}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1084, file: !1085, line: 224, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1084, file: !1085, line: 225, baseType: !1088, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1028, file: !35, line: 3549, baseType: !1091, size: 64, align: 64, offset: 1152)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{null, !1069}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1028, file: !35, line: 3551, baseType: !1071, size: 64, align: 64, offset: 1216)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1028, file: !35, line: 3552, baseType: !1096, size: 64, align: 64, offset: 1280)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!923, !1018, !948, !923, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1106, !1107, !1137}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1101, file: !35, line: 3921, baseType: !935, size: 16, align: 16)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1101, file: !35, line: 3922, baseType: !932, size: 32, align: 32, offset: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1101, file: !35, line: 3923, baseType: !932, size: 32, align: 32, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1101, file: !35, line: 3924, baseType: !924, size: 32, align: 32, offset: 96)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1101, file: !35, line: 3925, baseType: !1108, size: 64, align: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118, !1128, !1130, !1132, !1133, !1135, !1136}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1111, file: !35, line: 3886, baseType: !923, size: 32, align: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1111, file: !35, line: 3887, baseType: !923, size: 32, align: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1111, file: !35, line: 3888, baseType: !923, size: 32, align: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1111, file: !35, line: 3889, baseType: !923, size: 32, align: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1111, file: !35, line: 3890, baseType: !923, size: 32, align: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1111, file: !35, line: 3897, baseType: !1119, size: 768, align: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1121)
!1121 = !{!1122, !1126}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1120, file: !35, line: 3855, baseType: !1123, size: 512, align: 64)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 512, align: 64, elements: !1124)
!1124 = !{!1125}
!1125 = !DISubrange(count: 8)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1120, file: !35, line: 3857, baseType: !1127, size: 256, align: 32, offset: 512)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 256, align: 32, elements: !1124)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1111, file: !35, line: 3903, baseType: !1129, size: 256, align: 64, offset: 960)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !948, size: 256, align: 64, elements: !943)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1111, file: !35, line: 3904, baseType: !1131, size: 128, align: 32, offset: 1216)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 128, align: 32, elements: !943)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1111, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1111, file: !35, line: 3908, baseType: !1134, size: 64, align: 64, offset: 1408)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1111, file: !35, line: 3915, baseType: !1134, size: 64, align: 64, offset: 1472)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1111, file: !35, line: 3917, baseType: !923, size: 32, align: 32, offset: 1536)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1101, file: !35, line: 3926, baseType: !920, size: 64, align: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1028, file: !35, line: 3564, baseType: !1139, size: 64, align: 64, offset: 1344)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!923, !1018, !1142, !1176, !1258}
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1145)
!1145 = !{!1146, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1172, !1173, !1174, !1175}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1144, file: !35, line: 1451, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1149, line: 94, baseType: !1150)
!1149 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1149, line: 81, size: 192, align: 64, elements: !1151)
!1151 = !{!1152, !1156, !1157}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1150, file: !1149, line: 82, baseType: !1153, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1149, line: 73, baseType: !1155)
!1155 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1149, line: 73, flags: DIFlagFwdDecl)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1150, file: !1149, line: 89, baseType: !948, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1150, file: !1149, line: 93, baseType: !923, size: 32, align: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1144, file: !35, line: 1461, baseType: !920, size: 64, align: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1144, file: !35, line: 1467, baseType: !920, size: 64, align: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !35, line: 1468, baseType: !948, size: 64, align: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !35, line: 1469, baseType: !923, size: 32, align: 32, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1144, file: !35, line: 1470, baseType: !923, size: 32, align: 32, offset: 288)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1144, file: !35, line: 1474, baseType: !923, size: 32, align: 32, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1144, file: !35, line: 1479, baseType: !1165, size: 64, align: 64, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !35, line: 1412, baseType: !948, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !35, line: 1413, baseType: !923, size: 32, align: 32, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1167, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1144, file: !35, line: 1480, baseType: !923, size: 32, align: 32, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1144, file: !35, line: 1486, baseType: !920, size: 64, align: 64, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1144, file: !35, line: 1488, baseType: !920, size: 64, align: 64, offset: 576)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1144, file: !35, line: 1497, baseType: !920, size: 64, align: 64, offset: 640)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1178)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1212, !1213, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246, !1247, !1248, !1249, !1250, !1251, !1254, !1255, !1256, !1257}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !758, line: 282, baseType: !1123, size: 512, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1179, file: !758, line: 299, baseType: !1127, size: 256, align: 32, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1179, file: !758, line: 315, baseType: !1184, size: 64, align: 64, offset: 768)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1179, file: !758, line: 326, baseType: !923, size: 32, align: 32, offset: 832)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1179, file: !758, line: 326, baseType: !923, size: 32, align: 32, offset: 864)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1179, file: !758, line: 334, baseType: !923, size: 32, align: 32, offset: 896)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1179, file: !758, line: 341, baseType: !923, size: 32, align: 32, offset: 928)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1179, file: !758, line: 346, baseType: !923, size: 32, align: 32, offset: 960)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1179, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1179, file: !758, line: 356, baseType: !1038, size: 64, align: 32, offset: 1024)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1179, file: !758, line: 361, baseType: !920, size: 64, align: 64, offset: 1088)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1179, file: !758, line: 369, baseType: !920, size: 64, align: 64, offset: 1152)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1179, file: !758, line: 377, baseType: !920, size: 64, align: 64, offset: 1216)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1179, file: !758, line: 382, baseType: !923, size: 32, align: 32, offset: 1280)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1179, file: !758, line: 386, baseType: !923, size: 32, align: 32, offset: 1312)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1179, file: !758, line: 391, baseType: !923, size: 32, align: 32, offset: 1344)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1179, file: !758, line: 396, baseType: !919, size: 64, align: 64, offset: 1408)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1179, file: !758, line: 403, baseType: !1200, size: 512, align: 64, offset: 1472)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 512, align: 64, elements: !1124)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1179, file: !758, line: 410, baseType: !923, size: 32, align: 32, offset: 1984)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1179, file: !758, line: 415, baseType: !923, size: 32, align: 32, offset: 2016)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1179, file: !758, line: 420, baseType: !923, size: 32, align: 32, offset: 2048)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1179, file: !758, line: 425, baseType: !923, size: 32, align: 32, offset: 2080)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1179, file: !758, line: 435, baseType: !920, size: 64, align: 64, offset: 2112)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1179, file: !758, line: 440, baseType: !923, size: 32, align: 32, offset: 2176)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1179, file: !758, line: 445, baseType: !952, size: 64, align: 64, offset: 2240)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1179, file: !758, line: 459, baseType: !1209, size: 512, align: 64, offset: 2304)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 512, align: 64, elements: !1124)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1179, file: !758, line: 473, baseType: !1211, size: 64, align: 64, offset: 2816)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1179, file: !758, line: 477, baseType: !923, size: 32, align: 32, offset: 2880)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1179, file: !758, line: 479, baseType: !1214, size: 64, align: 64, offset: 2944)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1218)
!1218 = !{!1219, !1220, !1221, !1222, !1227}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1217, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !758, line: 203, baseType: !948, size: 64, align: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !758, line: 204, baseType: !923, size: 32, align: 32, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1217, file: !758, line: 205, baseType: !1223, size: 64, align: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1225, line: 86, baseType: !1226)
!1225 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1225, line: 86, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1217, file: !758, line: 206, baseType: !1147, size: 64, align: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1179, file: !758, line: 480, baseType: !923, size: 32, align: 32, offset: 3008)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1179, file: !758, line: 505, baseType: !923, size: 32, align: 32, offset: 3040)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1179, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1179, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1179, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1179, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1179, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1179, file: !758, line: 532, baseType: !920, size: 64, align: 64, offset: 3264)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1179, file: !758, line: 539, baseType: !920, size: 64, align: 64, offset: 3328)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1179, file: !758, line: 547, baseType: !920, size: 64, align: 64, offset: 3392)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1179, file: !758, line: 554, baseType: !1223, size: 64, align: 64, offset: 3456)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1179, file: !758, line: 563, baseType: !923, size: 32, align: 32, offset: 3520)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1179, file: !758, line: 572, baseType: !923, size: 32, align: 32, offset: 3552)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1179, file: !758, line: 581, baseType: !923, size: 32, align: 32, offset: 3584)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1179, file: !758, line: 588, baseType: !1243, size: 64, align: 64, offset: 3648)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !921, line: 36, baseType: !1245)
!1245 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1179, file: !758, line: 593, baseType: !923, size: 32, align: 32, offset: 3712)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1179, file: !758, line: 596, baseType: !923, size: 32, align: 32, offset: 3744)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1179, file: !758, line: 599, baseType: !1147, size: 64, align: 64, offset: 3776)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1179, file: !758, line: 605, baseType: !1147, size: 64, align: 64, offset: 3840)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1179, file: !758, line: 616, baseType: !1147, size: 64, align: 64, offset: 3904)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1179, file: !758, line: 626, baseType: !1252, size: 64, align: 64, offset: 3968)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1253, line: 216, baseType: !953)
!1253 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1179, file: !758, line: 627, baseType: !1252, size: 64, align: 64, offset: 4032)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1179, file: !758, line: 628, baseType: !1252, size: 64, align: 64, offset: 4096)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1179, file: !758, line: 629, baseType: !1252, size: 64, align: 64, offset: 4160)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1179, file: !758, line: 645, baseType: !1147, size: 64, align: 64, offset: 4224)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1028, file: !35, line: 3566, baseType: !1260, size: 64, align: 64, offset: 1408)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!923, !1018, !919, !1258, !1142}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1028, file: !35, line: 3567, baseType: !1071, size: 64, align: 64, offset: 1472)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1028, file: !35, line: 3576, baseType: !1265, size: 64, align: 64, offset: 1536)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!923, !1018, !1176}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1028, file: !35, line: 3577, baseType: !1269, size: 64, align: 64, offset: 1600)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!923, !1018, !1142}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1028, file: !35, line: 3584, baseType: !1273, size: 64, align: 64, offset: 1664)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!923, !1018, !1276}
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1028, file: !35, line: 3589, baseType: !1278, size: 64, align: 64, offset: 1728)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{null, !1018}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1028, file: !35, line: 3594, baseType: !923, size: 32, align: 32, offset: 1792)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1028, file: !35, line: 3600, baseType: !980, size: 64, align: 64, offset: 1856)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1028, file: !35, line: 3609, baseType: !1284, size: 64, align: 64, offset: 1920)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64, align: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1287)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1020, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1020, file: !35, line: 1581, baseType: !924, size: 32, align: 32, offset: 224)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1020, file: !35, line: 1583, baseType: !919, size: 64, align: 64, offset: 256)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1020, file: !35, line: 1591, baseType: !1292, size: 64, align: 64, offset: 320)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1085, line: 129, size: 1664, align: 64, elements: !1294)
!1294 = !{!1295, !1296, !1297, !1298, !1299, !1317, !1318, !1324, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1293, file: !1085, line: 136, baseType: !923, size: 32, align: 32)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1293, file: !1085, line: 151, baseType: !923, size: 32, align: 32, offset: 32)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1293, file: !1085, line: 157, baseType: !923, size: 32, align: 32, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1293, file: !1085, line: 159, baseType: !1276, size: 64, align: 64, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1293, file: !1085, line: 161, baseType: !1300, size: 64, align: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1085, line: 117, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1085, line: 100, size: 832, align: 64, elements: !1303)
!1303 = !{!1304, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1302, file: !1085, line: 105, baseType: !1305, size: 256, align: 64)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1306, size: 256, align: 64, elements: !943)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1149, line: 238, baseType: !1308)
!1308 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1149, line: 238, flags: DIFlagFwdDecl)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1302, file: !1085, line: 110, baseType: !923, size: 32, align: 32, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1302, file: !1085, line: 111, baseType: !923, size: 32, align: 32, offset: 288)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1302, file: !1085, line: 111, baseType: !923, size: 32, align: 32, offset: 320)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1302, file: !1085, line: 112, baseType: !1127, size: 256, align: 32, offset: 352)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1302, file: !1085, line: 113, baseType: !1131, size: 128, align: 32, offset: 608)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1302, file: !1085, line: 114, baseType: !923, size: 32, align: 32, offset: 736)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1302, file: !1085, line: 115, baseType: !923, size: 32, align: 32, offset: 768)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1302, file: !1085, line: 116, baseType: !923, size: 32, align: 32, offset: 800)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1293, file: !1085, line: 163, baseType: !919, size: 64, align: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1293, file: !1085, line: 165, baseType: !1319, size: 128, align: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1085, line: 122, baseType: !1320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1085, line: 119, size: 128, align: 64, elements: !1321)
!1321 = !{!1322, !1323}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1320, file: !1085, line: 120, baseType: !1142, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1320, file: !1085, line: 121, baseType: !1276, size: 64, align: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1293, file: !1085, line: 166, baseType: !1325, size: 128, align: 64, offset: 448)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1085, line: 127, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1085, line: 124, size: 128, align: 64, elements: !1327)
!1327 = !{!1328, !1401}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1326, file: !1085, line: 125, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1333)
!1333 = !{!1334, !1335, !1359, !1363, !1364, !1398, !1399, !1400}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1332, file: !35, line: 5751, baseType: !974, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1332, file: !35, line: 5756, baseType: !1336, size: 64, align: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1339)
!1339 = !{!1340, !1341, !1344, !1345, !1346, !1350, !1354, !1358}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1338, file: !35, line: 5797, baseType: !980, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1338, file: !35, line: 5804, baseType: !1342, size: 64, align: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1338, file: !35, line: 5815, baseType: !974, size: 64, align: 64, offset: 128)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1338, file: !35, line: 5825, baseType: !923, size: 32, align: 32, offset: 192)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1338, file: !35, line: 5826, baseType: !1347, size: 64, align: 64, offset: 256)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!923, !1330}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1338, file: !35, line: 5827, baseType: !1351, size: 64, align: 64, offset: 320)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!923, !1330, !1142}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1338, file: !35, line: 5828, baseType: !1355, size: 64, align: 64, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{null, !1330}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1338, file: !35, line: 5829, baseType: !1355, size: 64, align: 64, offset: 448)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1332, file: !35, line: 5762, baseType: !1360, size: 64, align: 64, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1362)
!1362 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1332, file: !35, line: 5768, baseType: !919, size: 64, align: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1332, file: !35, line: 5775, baseType: !1365, size: 64, align: 64, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1367, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1367, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1367, file: !35, line: 3948, baseType: !932, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1367, file: !35, line: 3958, baseType: !948, size: 64, align: 64, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1367, file: !35, line: 3962, baseType: !923, size: 32, align: 32, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1367, file: !35, line: 3968, baseType: !923, size: 32, align: 32, offset: 224)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1367, file: !35, line: 3973, baseType: !920, size: 64, align: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1367, file: !35, line: 3986, baseType: !923, size: 32, align: 32, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1367, file: !35, line: 3999, baseType: !923, size: 32, align: 32, offset: 352)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1367, file: !35, line: 4004, baseType: !923, size: 32, align: 32, offset: 384)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1367, file: !35, line: 4005, baseType: !923, size: 32, align: 32, offset: 416)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1367, file: !35, line: 4010, baseType: !923, size: 32, align: 32, offset: 448)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1367, file: !35, line: 4011, baseType: !923, size: 32, align: 32, offset: 480)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1367, file: !35, line: 4020, baseType: !1038, size: 64, align: 32, offset: 512)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1367, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1367, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1367, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1367, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1367, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1367, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1367, file: !35, line: 4039, baseType: !923, size: 32, align: 32, offset: 768)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1367, file: !35, line: 4046, baseType: !952, size: 64, align: 64, offset: 832)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1367, file: !35, line: 4050, baseType: !923, size: 32, align: 32, offset: 896)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1367, file: !35, line: 4054, baseType: !923, size: 32, align: 32, offset: 928)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1367, file: !35, line: 4061, baseType: !923, size: 32, align: 32, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1367, file: !35, line: 4065, baseType: !923, size: 32, align: 32, offset: 992)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1367, file: !35, line: 4073, baseType: !923, size: 32, align: 32, offset: 1024)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1367, file: !35, line: 4080, baseType: !923, size: 32, align: 32, offset: 1056)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1367, file: !35, line: 4084, baseType: !923, size: 32, align: 32, offset: 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1332, file: !35, line: 5781, baseType: !1365, size: 64, align: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1332, file: !35, line: 5787, baseType: !1038, size: 64, align: 32, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1332, file: !35, line: 5793, baseType: !1038, size: 64, align: 32, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1326, file: !1085, line: 126, baseType: !923, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1293, file: !1085, line: 172, baseType: !1142, size: 64, align: 64, offset: 576)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1293, file: !1085, line: 177, baseType: !948, size: 64, align: 64, offset: 640)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1293, file: !1085, line: 178, baseType: !924, size: 32, align: 32, offset: 704)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1293, file: !1085, line: 180, baseType: !919, size: 64, align: 64, offset: 768)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1293, file: !1085, line: 185, baseType: !923, size: 32, align: 32, offset: 832)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1293, file: !1085, line: 190, baseType: !919, size: 64, align: 64, offset: 896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1293, file: !1085, line: 195, baseType: !923, size: 32, align: 32, offset: 960)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1293, file: !1085, line: 200, baseType: !1142, size: 64, align: 64, offset: 1024)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1293, file: !1085, line: 201, baseType: !923, size: 32, align: 32, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1293, file: !1085, line: 202, baseType: !1276, size: 64, align: 64, offset: 1152)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1293, file: !1085, line: 203, baseType: !923, size: 32, align: 32, offset: 1216)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1293, file: !1085, line: 205, baseType: !923, size: 32, align: 32, offset: 1248)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1293, file: !1085, line: 206, baseType: !923, size: 32, align: 32, offset: 1280)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1293, file: !1085, line: 209, baseType: !1252, size: 64, align: 64, offset: 1344)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1293, file: !1085, line: 212, baseType: !1252, size: 64, align: 64, offset: 1408)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1293, file: !1085, line: 213, baseType: !1276, size: 64, align: 64, offset: 1472)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1293, file: !1085, line: 215, baseType: !923, size: 32, align: 32, offset: 1536)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1293, file: !1085, line: 217, baseType: !923, size: 32, align: 32, offset: 1568)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1293, file: !1085, line: 220, baseType: !923, size: 32, align: 32, offset: 1600)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1020, file: !35, line: 1598, baseType: !919, size: 64, align: 64, offset: 384)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1020, file: !35, line: 1606, baseType: !920, size: 64, align: 64, offset: 448)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1020, file: !35, line: 1614, baseType: !923, size: 32, align: 32, offset: 512)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1020, file: !35, line: 1622, baseType: !923, size: 32, align: 32, offset: 544)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1020, file: !35, line: 1628, baseType: !923, size: 32, align: 32, offset: 576)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !35, line: 1636, baseType: !923, size: 32, align: 32, offset: 608)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1020, file: !35, line: 1643, baseType: !923, size: 32, align: 32, offset: 640)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1020, file: !35, line: 1657, baseType: !948, size: 64, align: 64, offset: 704)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1020, file: !35, line: 1658, baseType: !923, size: 32, align: 32, offset: 768)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1020, file: !35, line: 1679, baseType: !1038, size: 64, align: 32, offset: 800)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1020, file: !35, line: 1688, baseType: !923, size: 32, align: 32, offset: 864)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1020, file: !35, line: 1712, baseType: !923, size: 32, align: 32, offset: 896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1020, file: !35, line: 1729, baseType: !923, size: 32, align: 32, offset: 928)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1020, file: !35, line: 1729, baseType: !923, size: 32, align: 32, offset: 960)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1020, file: !35, line: 1744, baseType: !923, size: 32, align: 32, offset: 992)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1020, file: !35, line: 1744, baseType: !923, size: 32, align: 32, offset: 1024)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1020, file: !35, line: 1751, baseType: !923, size: 32, align: 32, offset: 1056)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1020, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1020, file: !35, line: 1791, baseType: !1440, size: 64, align: 64, offset: 1152)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{null, !1443, !1176, !1258, !923, !923, !923}
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1020, file: !35, line: 1808, baseType: !1445, size: 64, align: 64, offset: 1216)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!494, !1443, !1045}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1020, file: !35, line: 1816, baseType: !923, size: 32, align: 32, offset: 1280)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1020, file: !35, line: 1825, baseType: !946, size: 32, align: 32, offset: 1312)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1020, file: !35, line: 1830, baseType: !923, size: 32, align: 32, offset: 1344)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1020, file: !35, line: 1838, baseType: !946, size: 32, align: 32, offset: 1376)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1020, file: !35, line: 1846, baseType: !923, size: 32, align: 32, offset: 1408)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1020, file: !35, line: 1851, baseType: !923, size: 32, align: 32, offset: 1440)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1020, file: !35, line: 1861, baseType: !946, size: 32, align: 32, offset: 1472)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1020, file: !35, line: 1868, baseType: !946, size: 32, align: 32, offset: 1504)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1020, file: !35, line: 1875, baseType: !946, size: 32, align: 32, offset: 1536)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1020, file: !35, line: 1882, baseType: !946, size: 32, align: 32, offset: 1568)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1020, file: !35, line: 1889, baseType: !946, size: 32, align: 32, offset: 1600)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1020, file: !35, line: 1896, baseType: !946, size: 32, align: 32, offset: 1632)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1020, file: !35, line: 1903, baseType: !946, size: 32, align: 32, offset: 1664)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1020, file: !35, line: 1910, baseType: !923, size: 32, align: 32, offset: 1696)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1020, file: !35, line: 1915, baseType: !923, size: 32, align: 32, offset: 1728)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1020, file: !35, line: 1926, baseType: !1258, size: 64, align: 64, offset: 1792)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1020, file: !35, line: 1935, baseType: !1038, size: 64, align: 32, offset: 1856)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1020, file: !35, line: 1942, baseType: !923, size: 32, align: 32, offset: 1920)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1020, file: !35, line: 1948, baseType: !923, size: 32, align: 32, offset: 1952)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1020, file: !35, line: 1954, baseType: !923, size: 32, align: 32, offset: 1984)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1020, file: !35, line: 1960, baseType: !923, size: 32, align: 32, offset: 2016)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1020, file: !35, line: 1984, baseType: !923, size: 32, align: 32, offset: 2048)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1020, file: !35, line: 1991, baseType: !923, size: 32, align: 32, offset: 2080)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1020, file: !35, line: 1996, baseType: !923, size: 32, align: 32, offset: 2112)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1020, file: !35, line: 2004, baseType: !923, size: 32, align: 32, offset: 2144)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1020, file: !35, line: 2011, baseType: !923, size: 32, align: 32, offset: 2176)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1020, file: !35, line: 2018, baseType: !923, size: 32, align: 32, offset: 2208)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1020, file: !35, line: 2027, baseType: !923, size: 32, align: 32, offset: 2240)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1020, file: !35, line: 2034, baseType: !923, size: 32, align: 32, offset: 2272)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1020, file: !35, line: 2044, baseType: !923, size: 32, align: 32, offset: 2304)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1020, file: !35, line: 2054, baseType: !949, size: 64, align: 64, offset: 2368)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1020, file: !35, line: 2061, baseType: !949, size: 64, align: 64, offset: 2432)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1020, file: !35, line: 2066, baseType: !923, size: 32, align: 32, offset: 2496)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1020, file: !35, line: 2070, baseType: !923, size: 32, align: 32, offset: 2528)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1020, file: !35, line: 2078, baseType: !923, size: 32, align: 32, offset: 2560)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1020, file: !35, line: 2085, baseType: !923, size: 32, align: 32, offset: 2592)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1020, file: !35, line: 2092, baseType: !923, size: 32, align: 32, offset: 2624)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1020, file: !35, line: 2099, baseType: !923, size: 32, align: 32, offset: 2656)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1020, file: !35, line: 2106, baseType: !923, size: 32, align: 32, offset: 2688)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1020, file: !35, line: 2113, baseType: !923, size: 32, align: 32, offset: 2720)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1020, file: !35, line: 2120, baseType: !923, size: 32, align: 32, offset: 2752)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1020, file: !35, line: 2125, baseType: !923, size: 32, align: 32, offset: 2784)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1020, file: !35, line: 2133, baseType: !923, size: 32, align: 32, offset: 2816)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1020, file: !35, line: 2140, baseType: !923, size: 32, align: 32, offset: 2848)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1020, file: !35, line: 2145, baseType: !923, size: 32, align: 32, offset: 2880)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1020, file: !35, line: 2153, baseType: !923, size: 32, align: 32, offset: 2912)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1020, file: !35, line: 2158, baseType: !923, size: 32, align: 32, offset: 2944)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1020, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1020, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1020, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1020, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1020, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1020, file: !35, line: 2203, baseType: !923, size: 32, align: 32, offset: 3136)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1020, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1020, file: !35, line: 2212, baseType: !923, size: 32, align: 32, offset: 3200)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1020, file: !35, line: 2213, baseType: !923, size: 32, align: 32, offset: 3232)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1020, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1020, file: !35, line: 2232, baseType: !923, size: 32, align: 32, offset: 3296)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1020, file: !35, line: 2243, baseType: !923, size: 32, align: 32, offset: 3328)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1020, file: !35, line: 2249, baseType: !923, size: 32, align: 32, offset: 3360)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1020, file: !35, line: 2256, baseType: !923, size: 32, align: 32, offset: 3392)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1020, file: !35, line: 2263, baseType: !952, size: 64, align: 64, offset: 3456)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1020, file: !35, line: 2270, baseType: !952, size: 64, align: 64, offset: 3520)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1020, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1020, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1020, file: !35, line: 2367, baseType: !1514, size: 64, align: 64, offset: 3648)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!923, !1443, !1276, !923}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1020, file: !35, line: 2383, baseType: !923, size: 32, align: 32, offset: 3712)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1020, file: !35, line: 2386, baseType: !946, size: 32, align: 32, offset: 3744)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1020, file: !35, line: 2387, baseType: !946, size: 32, align: 32, offset: 3776)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1020, file: !35, line: 2394, baseType: !923, size: 32, align: 32, offset: 3808)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1020, file: !35, line: 2401, baseType: !923, size: 32, align: 32, offset: 3840)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1020, file: !35, line: 2408, baseType: !923, size: 32, align: 32, offset: 3872)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1020, file: !35, line: 2415, baseType: !923, size: 32, align: 32, offset: 3904)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1020, file: !35, line: 2422, baseType: !923, size: 32, align: 32, offset: 3936)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1020, file: !35, line: 2423, baseType: !1526, size: 64, align: 64, offset: 3968)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1528)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1529)
!1529 = !{!1530, !1531, !1532, !1533}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1528, file: !35, line: 827, baseType: !923, size: 32, align: 32)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1528, file: !35, line: 828, baseType: !923, size: 32, align: 32, offset: 32)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1528, file: !35, line: 829, baseType: !923, size: 32, align: 32, offset: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1528, file: !35, line: 830, baseType: !946, size: 32, align: 32, offset: 96)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1020, file: !35, line: 2430, baseType: !920, size: 64, align: 64, offset: 4032)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1020, file: !35, line: 2437, baseType: !920, size: 64, align: 64, offset: 4096)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1020, file: !35, line: 2444, baseType: !946, size: 32, align: 32, offset: 4160)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1020, file: !35, line: 2451, baseType: !946, size: 32, align: 32, offset: 4192)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1020, file: !35, line: 2458, baseType: !923, size: 32, align: 32, offset: 4224)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1020, file: !35, line: 2469, baseType: !923, size: 32, align: 32, offset: 4256)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1020, file: !35, line: 2475, baseType: !923, size: 32, align: 32, offset: 4288)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1020, file: !35, line: 2481, baseType: !923, size: 32, align: 32, offset: 4320)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1020, file: !35, line: 2485, baseType: !923, size: 32, align: 32, offset: 4352)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1020, file: !35, line: 2489, baseType: !923, size: 32, align: 32, offset: 4384)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1020, file: !35, line: 2493, baseType: !923, size: 32, align: 32, offset: 4416)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1020, file: !35, line: 2501, baseType: !923, size: 32, align: 32, offset: 4448)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1020, file: !35, line: 2506, baseType: !923, size: 32, align: 32, offset: 4480)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1020, file: !35, line: 2510, baseType: !923, size: 32, align: 32, offset: 4512)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1020, file: !35, line: 2514, baseType: !920, size: 64, align: 64, offset: 4544)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1020, file: !35, line: 2528, baseType: !1550, size: 64, align: 64, offset: 4608)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{null, !1443, !919, !923, !923}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1020, file: !35, line: 2534, baseType: !923, size: 32, align: 32, offset: 4672)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1020, file: !35, line: 2545, baseType: !923, size: 32, align: 32, offset: 4704)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1020, file: !35, line: 2547, baseType: !923, size: 32, align: 32, offset: 4736)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1020, file: !35, line: 2549, baseType: !923, size: 32, align: 32, offset: 4768)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1020, file: !35, line: 2551, baseType: !923, size: 32, align: 32, offset: 4800)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1020, file: !35, line: 2553, baseType: !923, size: 32, align: 32, offset: 4832)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1020, file: !35, line: 2555, baseType: !923, size: 32, align: 32, offset: 4864)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1020, file: !35, line: 2557, baseType: !923, size: 32, align: 32, offset: 4896)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1020, file: !35, line: 2559, baseType: !923, size: 32, align: 32, offset: 4928)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1020, file: !35, line: 2563, baseType: !923, size: 32, align: 32, offset: 4960)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1020, file: !35, line: 2571, baseType: !1134, size: 64, align: 64, offset: 4992)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1020, file: !35, line: 2579, baseType: !1134, size: 64, align: 64, offset: 5056)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1020, file: !35, line: 2586, baseType: !923, size: 32, align: 32, offset: 5120)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1020, file: !35, line: 2615, baseType: !923, size: 32, align: 32, offset: 5152)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1020, file: !35, line: 2627, baseType: !923, size: 32, align: 32, offset: 5184)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1020, file: !35, line: 2637, baseType: !923, size: 32, align: 32, offset: 5216)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1020, file: !35, line: 2681, baseType: !923, size: 32, align: 32, offset: 5248)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1020, file: !35, line: 2709, baseType: !920, size: 64, align: 64, offset: 5312)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1020, file: !35, line: 2716, baseType: !1572, size: 64, align: 64, offset: 5376)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1574)
!1574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1575)
!1575 = !{!1576, !1577, !1578, !1579, !1580, !1581, !1582, !1586, !1590, !1591, !1592, !1593, !1599, !1600, !1601, !1602, !1603}
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1574, file: !35, line: 3642, baseType: !980, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1574, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1574, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1574, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1574, file: !35, line: 3669, baseType: !923, size: 32, align: 32, offset: 160)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1574, file: !35, line: 3682, baseType: !1273, size: 64, align: 64, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1574, file: !35, line: 3698, baseType: !1583, size: 64, align: 64, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64, align: 64)
!1584 = !DISubroutineType(types: !1585)
!1585 = !{!923, !1018, !1088, !932}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1574, file: !35, line: 3712, baseType: !1587, size: 64, align: 64, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{!923, !1018, !923, !1088, !932}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1574, file: !35, line: 3726, baseType: !1583, size: 64, align: 64, offset: 384)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1574, file: !35, line: 3737, baseType: !1071, size: 64, align: 64, offset: 448)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1574, file: !35, line: 3746, baseType: !923, size: 32, align: 32, offset: 512)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1574, file: !35, line: 3757, baseType: !1594, size: 64, align: 64, offset: 576)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DISubroutineType(types: !1596)
!1596 = !{null, !1597}
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1574, file: !35, line: 3766, baseType: !1071, size: 64, align: 64, offset: 640)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1574, file: !35, line: 3774, baseType: !1071, size: 64, align: 64, offset: 704)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1574, file: !35, line: 3780, baseType: !923, size: 32, align: 32, offset: 768)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1574, file: !35, line: 3785, baseType: !923, size: 32, align: 32, offset: 800)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1574, file: !35, line: 3795, baseType: !1604, size: 64, align: 64, offset: 832)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{!923, !1018, !1147}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1020, file: !35, line: 2728, baseType: !919, size: 64, align: 64, offset: 5440)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1020, file: !35, line: 2735, baseType: !1200, size: 512, align: 64, offset: 5504)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1020, file: !35, line: 2742, baseType: !923, size: 32, align: 32, offset: 6016)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1020, file: !35, line: 2755, baseType: !923, size: 32, align: 32, offset: 6048)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1020, file: !35, line: 2776, baseType: !923, size: 32, align: 32, offset: 6080)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1020, file: !35, line: 2783, baseType: !923, size: 32, align: 32, offset: 6112)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1020, file: !35, line: 2791, baseType: !923, size: 32, align: 32, offset: 6144)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1020, file: !35, line: 2802, baseType: !1276, size: 64, align: 64, offset: 6208)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1020, file: !35, line: 2811, baseType: !923, size: 32, align: 32, offset: 6272)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1020, file: !35, line: 2821, baseType: !923, size: 32, align: 32, offset: 6304)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1020, file: !35, line: 2830, baseType: !923, size: 32, align: 32, offset: 6336)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1020, file: !35, line: 2840, baseType: !923, size: 32, align: 32, offset: 6368)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1020, file: !35, line: 2851, baseType: !1620, size: 64, align: 64, offset: 6400)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!923, !1443, !1623, !919, !1258, !923, !923}
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{!923, !1443, !919}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1020, file: !35, line: 2871, baseType: !1627, size: 64, align: 64, offset: 6464)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{!923, !1443, !1630, !919, !1258, !923}
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!923, !1443, !919, !923, !923}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1020, file: !35, line: 2878, baseType: !923, size: 32, align: 32, offset: 6528)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1020, file: !35, line: 2885, baseType: !923, size: 32, align: 32, offset: 6560)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1020, file: !35, line: 3005, baseType: !923, size: 32, align: 32, offset: 6592)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1020, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1020, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1020, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1020, file: !35, line: 3037, baseType: !948, size: 64, align: 64, offset: 6720)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1020, file: !35, line: 3038, baseType: !923, size: 32, align: 32, offset: 6784)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1020, file: !35, line: 3050, baseType: !952, size: 64, align: 64, offset: 6848)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1020, file: !35, line: 3065, baseType: !923, size: 32, align: 32, offset: 6912)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1020, file: !35, line: 3083, baseType: !923, size: 32, align: 32, offset: 6944)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1020, file: !35, line: 3092, baseType: !1038, size: 64, align: 32, offset: 6976)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1020, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1020, file: !35, line: 3106, baseType: !1038, size: 64, align: 32, offset: 7072)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1020, file: !35, line: 3113, baseType: !1648, size: 64, align: 64, offset: 7168)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1650)
!1650 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1651)
!1651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1652)
!1652 = !{!1653, !1654, !1655, !1656, !1657, !1658, !1661}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1651, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1651, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1651, file: !35, line: 720, baseType: !980, size: 64, align: 64, offset: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1651, file: !35, line: 724, baseType: !980, size: 64, align: 64, offset: 128)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1651, file: !35, line: 728, baseType: !923, size: 32, align: 32, offset: 192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1651, file: !35, line: 734, baseType: !1659, size: 64, align: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1651, file: !35, line: 739, baseType: !1662, size: 64, align: 64, offset: 320)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1020, file: !35, line: 3129, baseType: !920, size: 64, align: 64, offset: 7232)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1020, file: !35, line: 3130, baseType: !920, size: 64, align: 64, offset: 7296)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1020, file: !35, line: 3131, baseType: !920, size: 64, align: 64, offset: 7360)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1020, file: !35, line: 3132, baseType: !920, size: 64, align: 64, offset: 7424)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1020, file: !35, line: 3139, baseType: !1134, size: 64, align: 64, offset: 7488)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1020, file: !35, line: 3147, baseType: !923, size: 32, align: 32, offset: 7552)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1020, file: !35, line: 3165, baseType: !923, size: 32, align: 32, offset: 7584)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1020, file: !35, line: 3172, baseType: !923, size: 32, align: 32, offset: 7616)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1020, file: !35, line: 3180, baseType: !923, size: 32, align: 32, offset: 7648)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1020, file: !35, line: 3191, baseType: !949, size: 64, align: 64, offset: 7680)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1020, file: !35, line: 3199, baseType: !948, size: 64, align: 64, offset: 7744)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1020, file: !35, line: 3207, baseType: !1134, size: 64, align: 64, offset: 7808)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1020, file: !35, line: 3214, baseType: !924, size: 32, align: 32, offset: 7872)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1020, file: !35, line: 3224, baseType: !1165, size: 64, align: 64, offset: 7936)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1020, file: !35, line: 3225, baseType: !923, size: 32, align: 32, offset: 8000)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1020, file: !35, line: 3249, baseType: !1147, size: 64, align: 64, offset: 8064)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1020, file: !35, line: 3256, baseType: !923, size: 32, align: 32, offset: 8128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1020, file: !35, line: 3271, baseType: !923, size: 32, align: 32, offset: 8160)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1020, file: !35, line: 3279, baseType: !920, size: 64, align: 64, offset: 8192)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1020, file: !35, line: 3301, baseType: !1147, size: 64, align: 64, offset: 8256)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1020, file: !35, line: 3310, baseType: !923, size: 32, align: 32, offset: 8320)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1020, file: !35, line: 3337, baseType: !923, size: 32, align: 32, offset: 8352)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1020, file: !35, line: 3351, baseType: !923, size: 32, align: 32, offset: 8384)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1020, file: !35, line: 3359, baseType: !923, size: 32, align: 32, offset: 8416)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "vdsp", scope: !971, file: !888, line: 340, baseType: !1689, size: 128, align: 64, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDSPContext", file: !1690, line: 77, baseType: !1691)
!1690 = !DIFile(filename: "libavcodec/videodsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VideoDSPContext", file: !1690, line: 41, size: 128, align: 64, elements: !1692)
!1692 = !{!1693, !1698}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "emulated_edge_mc", scope: !1691, file: !1690, line: 63, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{null, !948, !1088, !1697, !1697, !923, !923, !923, !923, !923, !923}
!1697 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1253, line: 149, baseType: !922)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "prefetch", scope: !1691, file: !1690, line: 76, baseType: !1699, size: 64, align: 64, offset: 64)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64, align: 64)
!1700 = !DISubroutineType(types: !1701)
!1701 = !{null, !948, !1697, !923}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "h264dsp", scope: !971, file: !888, line: 341, baseType: !1703, size: 2176, align: 64, offset: 256)
!1703 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264DSPContext", file: !1704, line: 118, baseType: !1705)
!1704 = !DIFile(filename: "libavcodec/h264dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264DSPContext", file: !1704, line: 42, size: 2176, align: 64, elements: !1706)
!1706 = !{!1707, !1713, !1719, !1723, !1724, !1725, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1753, !1758, !1759, !1760, !1761, !1765, !1766, !1770, !1771, !1775, !1779, !1780, !1781}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "weight_h264_pixels_tab", scope: !1705, file: !1704, line: 44, baseType: !1708, size: 256, align: 64)
!1708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1709, size: 256, align: 64, elements: !943)
!1709 = !DIDerivedType(tag: DW_TAG_typedef, name: "h264_weight_func", file: !1704, line: 33, baseType: !1710)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64, align: 64)
!1711 = !DISubroutineType(types: !1712)
!1712 = !{null, !948, !1697, !923, !923, !923, !923}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "biweight_h264_pixels_tab", scope: !1705, file: !1704, line: 45, baseType: !1714, size: 256, align: 64, offset: 256)
!1714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1715, size: 256, align: 64, elements: !943)
!1715 = !DIDerivedType(tag: DW_TAG_typedef, name: "h264_biweight_func", file: !1704, line: 35, baseType: !1716)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{null, !948, !948, !1697, !923, !923, !923, !923, !923}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "h264_v_loop_filter_luma", scope: !1705, file: !1704, line: 48, baseType: !1720, size: 64, align: 64, offset: 512)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DISubroutineType(types: !1722)
!1722 = !{null, !948, !923, !923, !923, !1243}
