; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--ivfenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--ivfenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !920, line: 221, size: 32, align: 8, elements: !921)
!920 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !919, file: !920, line: 221, baseType: !923, size: 32, align: 32)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !924, line: 51, baseType: !925)
!924 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!926 = !{!927, !2143}
!927 = distinct !DIGlobalVariable(name: "ff_ivf_muxer", scope: !0, file: !928, line: 113, type: !929, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_ivf_muxer)
!928 = !DIFile(filename: "libavformat/ivfenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !931)
!931 = !{!932, !936, !937, !938, !939, !940, !941, !942, !944, !954, !996, !998, !999, !2108, !2109, !2110, !2114, !2118, !2122, !2123, !2128, !2129, !2130, !2131, !2132, !2133, !2137}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !930, file: !897, line: 498, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !930, file: !897, line: 504, baseType: !933, size: 64, align: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !930, file: !897, line: 505, baseType: !933, size: 64, align: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !930, file: !897, line: 506, baseType: !933, size: 64, align: 64, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !930, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !930, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !930, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !930, file: !897, line: 517, baseType: !943, size: 32, align: 32, offset: 352)
!943 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !930, file: !897, line: 523, baseType: !945, size: 64, align: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !950, line: 44, size: 64, align: 32, elements: !951)
!950 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !949, file: !950, line: 45, baseType: !3, size: 32, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !949, file: !950, line: 46, baseType: !925, size: 32, align: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !930, file: !897, line: 526, baseType: !955, size: 64, align: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !959)
!959 = !{!960, !961, !966, !970, !971, !972, !973, !977, !983, !985, !989}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !958, file: !464, line: 72, baseType: !933, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !958, file: !464, line: 78, baseType: !962, size: 64, align: 64, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!933, !965}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !958, file: !464, line: 85, baseType: !967, size: 64, align: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !958, file: !464, line: 93, baseType: !943, size: 32, align: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !958, file: !464, line: 99, baseType: !943, size: 32, align: 32, offset: 224)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !958, file: !464, line: 108, baseType: !943, size: 32, align: 32, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !958, file: !464, line: 113, baseType: !974, size: 64, align: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!965, !965, !965}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !958, file: !464, line: 123, baseType: !978, size: 64, align: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!981, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !958, file: !464, line: 130, baseType: !984, size: 32, align: 32, offset: 448)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !958, file: !464, line: 136, baseType: !986, size: 64, align: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!984, !965}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !958, file: !464, line: 142, baseType: !990, size: 64, align: 64, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!943, !993, !965, !933, !943}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !930, file: !897, line: 535, baseType: !997, size: 64, align: 64, offset: 512)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !930, file: !897, line: 539, baseType: !943, size: 32, align: 32, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !930, file: !897, line: 541, baseType: !1000, size: 64, align: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!943, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1005)
!1005 = !{!1006, !1007, !1107, !1108, !1109, !1175, !1176, !1177, !1962, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2016, !2017, !2018, !2019, !2020, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2071, !2072, !2075, !2076, !2077, !2078, !2079, !2080, !2085, !2086, !2087, !2088, !2096, !2097, !2101, !2105, !2106, !2107}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1004, file: !897, line: 1342, baseType: !955, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1004, file: !897, line: 1349, baseType: !1008, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1010)
!1010 = !{!1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1035, !1036, !1078, !1079, !1083, !1088, !1089, !1090, !1094, !1100, !1106}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !897, line: 638, baseType: !933, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1009, file: !897, line: 645, baseType: !933, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1009, file: !897, line: 652, baseType: !943, size: 32, align: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1009, file: !897, line: 659, baseType: !933, size: 64, align: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1009, file: !897, line: 661, baseType: !945, size: 64, align: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1009, file: !897, line: 663, baseType: !955, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1009, file: !897, line: 670, baseType: !933, size: 64, align: 64, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !897, line: 679, baseType: !1008, size: 64, align: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1009, file: !897, line: 684, baseType: !943, size: 32, align: 32, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1009, file: !897, line: 689, baseType: !943, size: 32, align: 32, offset: 544)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1009, file: !897, line: 696, baseType: !1022, size: 64, align: 64, offset: 576)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!943, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1033, !1034}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1027, file: !897, line: 449, baseType: !933, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1027, file: !897, line: 450, baseType: !1031, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1027, file: !897, line: 451, baseType: !943, size: 32, align: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1027, file: !897, line: 452, baseType: !933, size: 64, align: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1009, file: !897, line: 703, baseType: !1000, size: 64, align: 64, offset: 640)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1009, file: !897, line: 714, baseType: !1037, size: 64, align: 64, offset: 704)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!943, !1003, !1040}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1043)
!1043 = !{!1044, !1058, !1061, !1062, !1063, !1064, !1065, !1066, !1074, !1075, !1076, !1077}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1042, file: !4, line: 1451, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1047, line: 94, baseType: !1048)
!1047 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1047, line: 81, size: 192, align: 64, elements: !1049)
!1049 = !{!1050, !1054, !1057}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1048, file: !1047, line: 82, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1047, line: 73, baseType: !1053)
!1053 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1047, line: 73, flags: DIFlagFwdDecl)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1048, file: !1047, line: 89, baseType: !1055, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !924, line: 48, baseType: !1032)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1048, file: !1047, line: 93, baseType: !943, size: 32, align: 32, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1042, file: !4, line: 1461, baseType: !1059, size: 64, align: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !924, line: 40, baseType: !1060)
!1060 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1042, file: !4, line: 1467, baseType: !1059, size: 64, align: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1042, file: !4, line: 1468, baseType: !1055, size: 64, align: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1042, file: !4, line: 1469, baseType: !943, size: 32, align: 32, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1042, file: !4, line: 1470, baseType: !943, size: 32, align: 32, offset: 288)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1042, file: !4, line: 1474, baseType: !943, size: 32, align: 32, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1042, file: !4, line: 1479, baseType: !1067, size: 64, align: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1069, file: !4, line: 1412, baseType: !1055, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1069, file: !4, line: 1413, baseType: !943, size: 32, align: 32, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1069, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1042, file: !4, line: 1480, baseType: !943, size: 32, align: 32, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1042, file: !4, line: 1486, baseType: !1059, size: 64, align: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1042, file: !4, line: 1488, baseType: !1059, size: 64, align: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1042, file: !4, line: 1497, baseType: !1059, size: 64, align: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1009, file: !897, line: 720, baseType: !1000, size: 64, align: 64, offset: 768)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1009, file: !897, line: 730, baseType: !1080, size: 64, align: 64, offset: 832)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!943, !1003, !943, !1059, !943}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1009, file: !897, line: 737, baseType: !1084, size: 64, align: 64, offset: 896)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!1059, !1003, !943, !1087, !1059}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1009, file: !897, line: 744, baseType: !1000, size: 64, align: 64, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1009, file: !897, line: 750, baseType: !1000, size: 64, align: 64, offset: 1024)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1009, file: !897, line: 758, baseType: !1091, size: 64, align: 64, offset: 1088)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!943, !1003, !943, !1059, !1059, !1059, !943}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1009, file: !897, line: 764, baseType: !1095, size: 64, align: 64, offset: 1152)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!943, !1003, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1009, file: !897, line: 770, baseType: !1101, size: 64, align: 64, offset: 1216)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!943, !1003, !1104}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1009, file: !897, line: 776, baseType: !1101, size: 64, align: 64, offset: 1280)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1004, file: !897, line: 1356, baseType: !997, size: 64, align: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1004, file: !897, line: 1365, baseType: !965, size: 64, align: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1004, file: !897, line: 1379, baseType: !1110, size: 64, align: 64, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119, !1120, !1124, !1125, !1129, !1130, !1131, !1132, !1133, !1135, !1136, !1142, !1143, !1147, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1165, !1166, !1167, !1168, !1172, !1173, !1174}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1112, file: !515, line: 174, baseType: !955, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1112, file: !515, line: 226, baseType: !1031, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1112, file: !515, line: 227, baseType: !943, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1112, file: !515, line: 228, baseType: !1031, size: 64, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1112, file: !515, line: 229, baseType: !1031, size: 64, align: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1112, file: !515, line: 233, baseType: !965, size: 64, align: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1112, file: !515, line: 235, baseType: !1121, size: 64, align: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!943, !965, !1055, !943}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1112, file: !515, line: 236, baseType: !1121, size: 64, align: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1112, file: !515, line: 237, baseType: !1126, size: 64, align: 64, offset: 512)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1059, !965, !1059, !943}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1112, file: !515, line: 238, baseType: !1059, size: 64, align: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1112, file: !515, line: 239, baseType: !943, size: 32, align: 32, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1112, file: !515, line: 240, baseType: !943, size: 32, align: 32, offset: 672)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1112, file: !515, line: 241, baseType: !943, size: 32, align: 32, offset: 704)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1112, file: !515, line: 242, baseType: !1134, size: 64, align: 64, offset: 768)
!1134 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1112, file: !515, line: 243, baseType: !1031, size: 64, align: 64, offset: 832)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1112, file: !515, line: 244, baseType: !1137, size: 64, align: 64, offset: 896)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!1134, !1134, !1140, !925}
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1112, file: !515, line: 245, baseType: !943, size: 32, align: 32, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1112, file: !515, line: 249, baseType: !1144, size: 64, align: 64, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!943, !965, !943}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1112, file: !515, line: 255, baseType: !1148, size: 64, align: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!1059, !965, !943, !1059, !943}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1112, file: !515, line: 260, baseType: !943, size: 32, align: 32, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1112, file: !515, line: 266, baseType: !1059, size: 64, align: 64, offset: 1216)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1112, file: !515, line: 273, baseType: !943, size: 32, align: 32, offset: 1280)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1112, file: !515, line: 279, baseType: !1059, size: 64, align: 64, offset: 1344)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1112, file: !515, line: 285, baseType: !943, size: 32, align: 32, offset: 1408)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1112, file: !515, line: 291, baseType: !943, size: 32, align: 32, offset: 1440)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1112, file: !515, line: 298, baseType: !943, size: 32, align: 32, offset: 1472)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1112, file: !515, line: 304, baseType: !943, size: 32, align: 32, offset: 1504)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1112, file: !515, line: 309, baseType: !933, size: 64, align: 64, offset: 1536)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1112, file: !515, line: 314, baseType: !933, size: 64, align: 64, offset: 1600)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1112, file: !515, line: 319, baseType: !1162, size: 64, align: 64, offset: 1664)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!943, !965, !1055, !943, !514, !1059}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1112, file: !515, line: 326, baseType: !943, size: 32, align: 32, offset: 1728)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1112, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1112, file: !515, line: 332, baseType: !1059, size: 64, align: 64, offset: 1792)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1112, file: !515, line: 338, baseType: !1169, size: 64, align: 64, offset: 1856)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!943, !965}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1112, file: !515, line: 340, baseType: !1059, size: 64, align: 64, offset: 1920)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1112, file: !515, line: 346, baseType: !1031, size: 64, align: 64, offset: 1984)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1112, file: !515, line: 351, baseType: !943, size: 32, align: 32, offset: 2048)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1004, file: !897, line: 1386, baseType: !943, size: 32, align: 32, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1004, file: !897, line: 1393, baseType: !925, size: 32, align: 32, offset: 352)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1004, file: !897, line: 1405, baseType: !1178, size: 64, align: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1747, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1848, !1854, !1855, !1859, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1891, !1892, !1893, !1894, !1895, !1896}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1181, file: !897, line: 866, baseType: !943, size: 32, align: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1181, file: !897, line: 872, baseType: !943, size: 32, align: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1181, file: !897, line: 878, baseType: !1186, size: 64, align: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1188)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1422, !1423, !1424, !1425, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1451, !1455, !1456, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1635, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1188, file: !4, line: 1561, baseType: !955, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1188, file: !4, line: 1562, baseType: !943, size: 32, align: 32, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1188, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1188, file: !4, line: 1565, baseType: !1194, size: 64, align: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202, !1203, !1212, !1215, !1218, !1221, !1225, !1226, !1227, !1235, !1236, !1237, !1239, !1243, !1249, !1254, !1258, !1259, !1306, !1393, !1397, !1398, !1402, !1406, !1411, !1415, !1416, !1417}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1196, file: !4, line: 3475, baseType: !933, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1196, file: !4, line: 3480, baseType: !933, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1196, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1196, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1196, file: !4, line: 3487, baseType: !943, size: 32, align: 32, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1196, file: !4, line: 3488, baseType: !1204, size: 64, align: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1206)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1207, line: 61, baseType: !1208)
!1207 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1207, line: 58, size: 64, align: 32, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1208, file: !1207, line: 59, baseType: !943, size: 32, align: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1208, file: !1207, line: 60, baseType: !943, size: 32, align: 32, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1196, file: !4, line: 3489, baseType: !1213, size: 64, align: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1196, file: !4, line: 3490, baseType: !1216, size: 64, align: 64, offset: 384)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1196, file: !4, line: 3491, baseType: !1219, size: 64, align: 64, offset: 448)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1196, file: !4, line: 3492, baseType: !1222, size: 64, align: 64, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1224)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !924, line: 55, baseType: !1134)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1196, file: !4, line: 3493, baseType: !1056, size: 8, align: 8, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1196, file: !4, line: 3494, baseType: !955, size: 64, align: 64, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1196, file: !4, line: 3495, baseType: !1228, size: 64, align: 64, offset: 704)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1230)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1231)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1232)
!1232 = !{!1233, !1234}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1231, file: !4, line: 3402, baseType: !943, size: 32, align: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1231, file: !4, line: 3403, baseType: !933, size: 64, align: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1196, file: !4, line: 3507, baseType: !933, size: 64, align: 64, offset: 768)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1196, file: !4, line: 3516, baseType: !943, size: 32, align: 32, offset: 832)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1196, file: !4, line: 3517, baseType: !1238, size: 64, align: 64, offset: 896)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1196, file: !4, line: 3527, baseType: !1240, size: 64, align: 64, offset: 960)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!943, !1186}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1196, file: !4, line: 3535, baseType: !1244, size: 64, align: 64, offset: 1024)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!943, !1186, !1247}
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1196, file: !4, line: 3541, baseType: !1250, size: 64, align: 64, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1253)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1196, file: !4, line: 3549, baseType: !1255, size: 64, align: 64, offset: 1152)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{null, !1238}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1196, file: !4, line: 3551, baseType: !1240, size: 64, align: 64, offset: 1216)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1196, file: !4, line: 3552, baseType: !1260, size: 64, align: 64, offset: 1280)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!943, !1186, !1055, !943, !1263}
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1266)
!1266 = !{!1267, !1270, !1271, !1272, !1273, !1305}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1265, file: !4, line: 3921, baseType: !1268, size: 16, align: 16)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !924, line: 49, baseType: !1269)
!1269 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1265, file: !4, line: 3922, baseType: !923, size: 32, align: 32, offset: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1265, file: !4, line: 3923, baseType: !923, size: 32, align: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1265, file: !4, line: 3924, baseType: !925, size: 32, align: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1265, file: !4, line: 3925, baseType: !1274, size: 64, align: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1283, !1284, !1294, !1298, !1300, !1301, !1303, !1304}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1277, file: !4, line: 3886, baseType: !943, size: 32, align: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1277, file: !4, line: 3887, baseType: !943, size: 32, align: 32, offset: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1277, file: !4, line: 3888, baseType: !943, size: 32, align: 32, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1277, file: !4, line: 3889, baseType: !943, size: 32, align: 32, offset: 96)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1277, file: !4, line: 3890, baseType: !943, size: 32, align: 32, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1277, file: !4, line: 3897, baseType: !1285, size: 768, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1287)
!1287 = !{!1288, !1292}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1286, file: !4, line: 3855, baseType: !1289, size: 512, align: 64)
!1289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 512, align: 64, elements: !1290)
!1290 = !{!1291}
!1291 = !DISubrange(count: 8)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1286, file: !4, line: 3857, baseType: !1293, size: 256, align: 32, offset: 512)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 32, elements: !1290)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1277, file: !4, line: 3903, baseType: !1295, size: 256, align: 64, offset: 960)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 256, align: 64, elements: !1296)
!1296 = !{!1297}
!1297 = !DISubrange(count: 4)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1277, file: !4, line: 3904, baseType: !1299, size: 128, align: 32, offset: 1216)
!1299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, align: 32, elements: !1296)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1277, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1277, file: !4, line: 3908, baseType: !1302, size: 64, align: 64, offset: 1408)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1277, file: !4, line: 3915, baseType: !1302, size: 64, align: 64, offset: 1472)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1277, file: !4, line: 3917, baseType: !943, size: 32, align: 32, offset: 1536)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1265, file: !4, line: 3926, baseType: !1059, size: 64, align: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1196, file: !4, line: 3564, baseType: !1307, size: 64, align: 64, offset: 1344)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!943, !1186, !1040, !1310, !1392}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1344, !1346, !1347, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1380, !1381, !1382, !1383, !1384, !1385, !1388, !1389, !1390, !1391}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1313, file: !767, line: 282, baseType: !1289, size: 512, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1313, file: !767, line: 299, baseType: !1293, size: 256, align: 32, offset: 512)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1313, file: !767, line: 315, baseType: !1318, size: 64, align: 64, offset: 768)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1313, file: !767, line: 326, baseType: !943, size: 32, align: 32, offset: 832)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1313, file: !767, line: 326, baseType: !943, size: 32, align: 32, offset: 864)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1313, file: !767, line: 334, baseType: !943, size: 32, align: 32, offset: 896)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1313, file: !767, line: 341, baseType: !943, size: 32, align: 32, offset: 928)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1313, file: !767, line: 346, baseType: !943, size: 32, align: 32, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1313, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1313, file: !767, line: 356, baseType: !1206, size: 64, align: 32, offset: 1024)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1313, file: !767, line: 361, baseType: !1059, size: 64, align: 64, offset: 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1313, file: !767, line: 369, baseType: !1059, size: 64, align: 64, offset: 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1313, file: !767, line: 377, baseType: !1059, size: 64, align: 64, offset: 1216)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1313, file: !767, line: 382, baseType: !943, size: 32, align: 32, offset: 1280)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1313, file: !767, line: 386, baseType: !943, size: 32, align: 32, offset: 1312)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1313, file: !767, line: 391, baseType: !943, size: 32, align: 32, offset: 1344)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1313, file: !767, line: 396, baseType: !965, size: 64, align: 64, offset: 1408)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1313, file: !767, line: 403, baseType: !1334, size: 512, align: 64, offset: 1472)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1224, size: 512, align: 64, elements: !1290)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1313, file: !767, line: 410, baseType: !943, size: 32, align: 32, offset: 1984)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1313, file: !767, line: 415, baseType: !943, size: 32, align: 32, offset: 2016)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1313, file: !767, line: 420, baseType: !943, size: 32, align: 32, offset: 2048)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1313, file: !767, line: 425, baseType: !943, size: 32, align: 32, offset: 2080)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1313, file: !767, line: 435, baseType: !1059, size: 64, align: 64, offset: 2112)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1313, file: !767, line: 440, baseType: !943, size: 32, align: 32, offset: 2176)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1313, file: !767, line: 445, baseType: !1224, size: 64, align: 64, offset: 2240)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1313, file: !767, line: 459, baseType: !1343, size: 512, align: 64, offset: 2304)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 512, align: 64, elements: !1290)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1313, file: !767, line: 473, baseType: !1345, size: 64, align: 64, offset: 2816)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1313, file: !767, line: 477, baseType: !943, size: 32, align: 32, offset: 2880)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1313, file: !767, line: 479, baseType: !1348, size: 64, align: 64, offset: 2944)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1351)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1361}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1351, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1351, file: !767, line: 203, baseType: !1055, size: 64, align: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1351, file: !767, line: 204, baseType: !943, size: 32, align: 32, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1351, file: !767, line: 205, baseType: !1357, size: 64, align: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1359, line: 86, baseType: !1360)
!1359 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1360 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1359, line: 86, flags: DIFlagFwdDecl)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1351, file: !767, line: 206, baseType: !1045, size: 64, align: 64, offset: 256)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1313, file: !767, line: 480, baseType: !943, size: 32, align: 32, offset: 3008)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1313, file: !767, line: 505, baseType: !943, size: 32, align: 32, offset: 3040)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1313, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1313, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1313, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1313, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1313, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1313, file: !767, line: 532, baseType: !1059, size: 64, align: 64, offset: 3264)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1313, file: !767, line: 539, baseType: !1059, size: 64, align: 64, offset: 3328)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1313, file: !767, line: 547, baseType: !1059, size: 64, align: 64, offset: 3392)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1313, file: !767, line: 554, baseType: !1357, size: 64, align: 64, offset: 3456)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1313, file: !767, line: 563, baseType: !943, size: 32, align: 32, offset: 3520)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1313, file: !767, line: 572, baseType: !943, size: 32, align: 32, offset: 3552)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1313, file: !767, line: 581, baseType: !943, size: 32, align: 32, offset: 3584)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1313, file: !767, line: 588, baseType: !1377, size: 64, align: 64, offset: 3648)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !924, line: 36, baseType: !1379)
!1379 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1313, file: !767, line: 593, baseType: !943, size: 32, align: 32, offset: 3712)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1313, file: !767, line: 596, baseType: !943, size: 32, align: 32, offset: 3744)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1313, file: !767, line: 599, baseType: !1045, size: 64, align: 64, offset: 3776)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1313, file: !767, line: 605, baseType: !1045, size: 64, align: 64, offset: 3840)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1313, file: !767, line: 616, baseType: !1045, size: 64, align: 64, offset: 3904)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1313, file: !767, line: 626, baseType: !1386, size: 64, align: 64, offset: 3968)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1387, line: 216, baseType: !1134)
!1387 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1313, file: !767, line: 627, baseType: !1386, size: 64, align: 64, offset: 4032)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1313, file: !767, line: 628, baseType: !1386, size: 64, align: 64, offset: 4096)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1313, file: !767, line: 629, baseType: !1386, size: 64, align: 64, offset: 4160)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1313, file: !767, line: 645, baseType: !1045, size: 64, align: 64, offset: 4224)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1196, file: !4, line: 3566, baseType: !1394, size: 64, align: 64, offset: 1408)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DISubroutineType(types: !1396)
!1396 = !{!943, !1186, !965, !1392, !1040}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1196, file: !4, line: 3567, baseType: !1240, size: 64, align: 64, offset: 1472)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1196, file: !4, line: 3576, baseType: !1399, size: 64, align: 64, offset: 1536)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!943, !1186, !1310}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1196, file: !4, line: 3577, baseType: !1403, size: 64, align: 64, offset: 1600)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64, align: 64)
!1404 = !DISubroutineType(types: !1405)
!1405 = !{!943, !1186, !1040}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1196, file: !4, line: 3584, baseType: !1407, size: 64, align: 64, offset: 1664)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DISubroutineType(types: !1409)
!1409 = !{!943, !1186, !1410}
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1196, file: !4, line: 3589, baseType: !1412, size: 64, align: 64, offset: 1728)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{null, !1186}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1196, file: !4, line: 3594, baseType: !943, size: 32, align: 32, offset: 1792)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1196, file: !4, line: 3600, baseType: !933, size: 64, align: 64, offset: 1856)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1196, file: !4, line: 3609, baseType: !1418, size: 64, align: 64, offset: 1920)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1188, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1188, file: !4, line: 1581, baseType: !925, size: 32, align: 32, offset: 224)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1188, file: !4, line: 1583, baseType: !965, size: 64, align: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1188, file: !4, line: 1591, baseType: !1426, size: 64, align: 64, offset: 320)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1188, file: !4, line: 1598, baseType: !965, size: 64, align: 64, offset: 384)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1188, file: !4, line: 1606, baseType: !1059, size: 64, align: 64, offset: 448)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1188, file: !4, line: 1614, baseType: !943, size: 32, align: 32, offset: 512)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1188, file: !4, line: 1622, baseType: !943, size: 32, align: 32, offset: 544)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1188, file: !4, line: 1628, baseType: !943, size: 32, align: 32, offset: 576)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1188, file: !4, line: 1636, baseType: !943, size: 32, align: 32, offset: 608)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1188, file: !4, line: 1643, baseType: !943, size: 32, align: 32, offset: 640)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1188, file: !4, line: 1657, baseType: !1055, size: 64, align: 64, offset: 704)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1188, file: !4, line: 1658, baseType: !943, size: 32, align: 32, offset: 768)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1188, file: !4, line: 1679, baseType: !1206, size: 64, align: 32, offset: 800)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1188, file: !4, line: 1688, baseType: !943, size: 32, align: 32, offset: 864)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1188, file: !4, line: 1712, baseType: !943, size: 32, align: 32, offset: 896)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1188, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 928)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1188, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1188, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 992)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1188, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 1024)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1188, file: !4, line: 1751, baseType: !943, size: 32, align: 32, offset: 1056)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1188, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1188, file: !4, line: 1791, baseType: !1447, size: 64, align: 64, offset: 1152)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{null, !1450, !1310, !1392, !943, !943, !943}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1188, file: !4, line: 1808, baseType: !1452, size: 64, align: 64, offset: 1216)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!533, !1450, !1213}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1188, file: !4, line: 1816, baseType: !943, size: 32, align: 32, offset: 1280)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1188, file: !4, line: 1825, baseType: !1457, size: 32, align: 32, offset: 1312)
!1457 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1188, file: !4, line: 1830, baseType: !943, size: 32, align: 32, offset: 1344)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1188, file: !4, line: 1838, baseType: !1457, size: 32, align: 32, offset: 1376)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1188, file: !4, line: 1846, baseType: !943, size: 32, align: 32, offset: 1408)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1188, file: !4, line: 1851, baseType: !943, size: 32, align: 32, offset: 1440)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1188, file: !4, line: 1861, baseType: !1457, size: 32, align: 32, offset: 1472)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1188, file: !4, line: 1868, baseType: !1457, size: 32, align: 32, offset: 1504)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1188, file: !4, line: 1875, baseType: !1457, size: 32, align: 32, offset: 1536)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1188, file: !4, line: 1882, baseType: !1457, size: 32, align: 32, offset: 1568)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1188, file: !4, line: 1889, baseType: !1457, size: 32, align: 32, offset: 1600)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1188, file: !4, line: 1896, baseType: !1457, size: 32, align: 32, offset: 1632)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1188, file: !4, line: 1903, baseType: !1457, size: 32, align: 32, offset: 1664)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1188, file: !4, line: 1910, baseType: !943, size: 32, align: 32, offset: 1696)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1188, file: !4, line: 1915, baseType: !943, size: 32, align: 32, offset: 1728)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1188, file: !4, line: 1926, baseType: !1392, size: 64, align: 64, offset: 1792)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1188, file: !4, line: 1935, baseType: !1206, size: 64, align: 32, offset: 1856)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1188, file: !4, line: 1942, baseType: !943, size: 32, align: 32, offset: 1920)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1188, file: !4, line: 1948, baseType: !943, size: 32, align: 32, offset: 1952)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1188, file: !4, line: 1954, baseType: !943, size: 32, align: 32, offset: 1984)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1188, file: !4, line: 1960, baseType: !943, size: 32, align: 32, offset: 2016)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1188, file: !4, line: 1984, baseType: !943, size: 32, align: 32, offset: 2048)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1188, file: !4, line: 1991, baseType: !943, size: 32, align: 32, offset: 2080)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1188, file: !4, line: 1996, baseType: !943, size: 32, align: 32, offset: 2112)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1188, file: !4, line: 2004, baseType: !943, size: 32, align: 32, offset: 2144)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1188, file: !4, line: 2011, baseType: !943, size: 32, align: 32, offset: 2176)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1188, file: !4, line: 2018, baseType: !943, size: 32, align: 32, offset: 2208)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1188, file: !4, line: 2027, baseType: !943, size: 32, align: 32, offset: 2240)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1188, file: !4, line: 2034, baseType: !943, size: 32, align: 32, offset: 2272)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1188, file: !4, line: 2044, baseType: !943, size: 32, align: 32, offset: 2304)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1188, file: !4, line: 2054, baseType: !1487, size: 64, align: 64, offset: 2368)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1188, file: !4, line: 2061, baseType: !1487, size: 64, align: 64, offset: 2432)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1188, file: !4, line: 2066, baseType: !943, size: 32, align: 32, offset: 2496)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1188, file: !4, line: 2070, baseType: !943, size: 32, align: 32, offset: 2528)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1188, file: !4, line: 2078, baseType: !943, size: 32, align: 32, offset: 2560)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1188, file: !4, line: 2085, baseType: !943, size: 32, align: 32, offset: 2592)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1188, file: !4, line: 2092, baseType: !943, size: 32, align: 32, offset: 2624)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1188, file: !4, line: 2099, baseType: !943, size: 32, align: 32, offset: 2656)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1188, file: !4, line: 2106, baseType: !943, size: 32, align: 32, offset: 2688)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1188, file: !4, line: 2113, baseType: !943, size: 32, align: 32, offset: 2720)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1188, file: !4, line: 2120, baseType: !943, size: 32, align: 32, offset: 2752)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1188, file: !4, line: 2125, baseType: !943, size: 32, align: 32, offset: 2784)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1188, file: !4, line: 2133, baseType: !943, size: 32, align: 32, offset: 2816)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1188, file: !4, line: 2140, baseType: !943, size: 32, align: 32, offset: 2848)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1188, file: !4, line: 2145, baseType: !943, size: 32, align: 32, offset: 2880)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1188, file: !4, line: 2153, baseType: !943, size: 32, align: 32, offset: 2912)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1188, file: !4, line: 2158, baseType: !943, size: 32, align: 32, offset: 2944)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1188, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1188, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1188, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1188, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1188, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1188, file: !4, line: 2203, baseType: !943, size: 32, align: 32, offset: 3136)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1188, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1188, file: !4, line: 2212, baseType: !943, size: 32, align: 32, offset: 3200)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1188, file: !4, line: 2213, baseType: !943, size: 32, align: 32, offset: 3232)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1188, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1188, file: !4, line: 2232, baseType: !943, size: 32, align: 32, offset: 3296)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1188, file: !4, line: 2243, baseType: !943, size: 32, align: 32, offset: 3328)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1188, file: !4, line: 2249, baseType: !943, size: 32, align: 32, offset: 3360)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1188, file: !4, line: 2256, baseType: !943, size: 32, align: 32, offset: 3392)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1188, file: !4, line: 2263, baseType: !1224, size: 64, align: 64, offset: 3456)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1188, file: !4, line: 2270, baseType: !1224, size: 64, align: 64, offset: 3520)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1188, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1188, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1188, file: !4, line: 2367, baseType: !1523, size: 64, align: 64, offset: 3648)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{!943, !1450, !1410, !943}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1188, file: !4, line: 2383, baseType: !943, size: 32, align: 32, offset: 3712)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1188, file: !4, line: 2386, baseType: !1457, size: 32, align: 32, offset: 3744)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1188, file: !4, line: 2387, baseType: !1457, size: 32, align: 32, offset: 3776)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1188, file: !4, line: 2394, baseType: !943, size: 32, align: 32, offset: 3808)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1188, file: !4, line: 2401, baseType: !943, size: 32, align: 32, offset: 3840)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1188, file: !4, line: 2408, baseType: !943, size: 32, align: 32, offset: 3872)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1188, file: !4, line: 2415, baseType: !943, size: 32, align: 32, offset: 3904)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1188, file: !4, line: 2422, baseType: !943, size: 32, align: 32, offset: 3936)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1188, file: !4, line: 2423, baseType: !1535, size: 64, align: 64, offset: 3968)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1537)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1542}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1537, file: !4, line: 827, baseType: !943, size: 32, align: 32)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1537, file: !4, line: 828, baseType: !943, size: 32, align: 32, offset: 32)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1537, file: !4, line: 829, baseType: !943, size: 32, align: 32, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1537, file: !4, line: 830, baseType: !1457, size: 32, align: 32, offset: 96)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1188, file: !4, line: 2430, baseType: !1059, size: 64, align: 64, offset: 4032)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1188, file: !4, line: 2437, baseType: !1059, size: 64, align: 64, offset: 4096)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1188, file: !4, line: 2444, baseType: !1457, size: 32, align: 32, offset: 4160)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1188, file: !4, line: 2451, baseType: !1457, size: 32, align: 32, offset: 4192)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1188, file: !4, line: 2458, baseType: !943, size: 32, align: 32, offset: 4224)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1188, file: !4, line: 2469, baseType: !943, size: 32, align: 32, offset: 4256)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1188, file: !4, line: 2475, baseType: !943, size: 32, align: 32, offset: 4288)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1188, file: !4, line: 2481, baseType: !943, size: 32, align: 32, offset: 4320)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1188, file: !4, line: 2485, baseType: !943, size: 32, align: 32, offset: 4352)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1188, file: !4, line: 2489, baseType: !943, size: 32, align: 32, offset: 4384)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1188, file: !4, line: 2493, baseType: !943, size: 32, align: 32, offset: 4416)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1188, file: !4, line: 2501, baseType: !943, size: 32, align: 32, offset: 4448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1188, file: !4, line: 2506, baseType: !943, size: 32, align: 32, offset: 4480)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1188, file: !4, line: 2510, baseType: !943, size: 32, align: 32, offset: 4512)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1188, file: !4, line: 2514, baseType: !1059, size: 64, align: 64, offset: 4544)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1188, file: !4, line: 2528, baseType: !1559, size: 64, align: 64, offset: 4608)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{null, !1450, !965, !943, !943}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1188, file: !4, line: 2534, baseType: !943, size: 32, align: 32, offset: 4672)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1188, file: !4, line: 2545, baseType: !943, size: 32, align: 32, offset: 4704)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1188, file: !4, line: 2547, baseType: !943, size: 32, align: 32, offset: 4736)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1188, file: !4, line: 2549, baseType: !943, size: 32, align: 32, offset: 4768)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1188, file: !4, line: 2551, baseType: !943, size: 32, align: 32, offset: 4800)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1188, file: !4, line: 2553, baseType: !943, size: 32, align: 32, offset: 4832)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1188, file: !4, line: 2555, baseType: !943, size: 32, align: 32, offset: 4864)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1188, file: !4, line: 2557, baseType: !943, size: 32, align: 32, offset: 4896)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1188, file: !4, line: 2559, baseType: !943, size: 32, align: 32, offset: 4928)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1188, file: !4, line: 2563, baseType: !943, size: 32, align: 32, offset: 4960)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1188, file: !4, line: 2571, baseType: !1302, size: 64, align: 64, offset: 4992)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1188, file: !4, line: 2579, baseType: !1302, size: 64, align: 64, offset: 5056)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1188, file: !4, line: 2586, baseType: !943, size: 32, align: 32, offset: 5120)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1188, file: !4, line: 2615, baseType: !943, size: 32, align: 32, offset: 5152)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1188, file: !4, line: 2627, baseType: !943, size: 32, align: 32, offset: 5184)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1188, file: !4, line: 2637, baseType: !943, size: 32, align: 32, offset: 5216)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1188, file: !4, line: 2681, baseType: !943, size: 32, align: 32, offset: 5248)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1188, file: !4, line: 2709, baseType: !1059, size: 64, align: 64, offset: 5312)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1188, file: !4, line: 2716, baseType: !1581, size: 64, align: 64, offset: 5376)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1584)
!1584 = !{!1585, !1586, !1587, !1588, !1589, !1590, !1591, !1595, !1599, !1600, !1601, !1602, !1608, !1609, !1610, !1611, !1612}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1583, file: !4, line: 3642, baseType: !933, size: 64, align: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1583, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1583, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1583, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1583, file: !4, line: 3669, baseType: !943, size: 32, align: 32, offset: 160)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1583, file: !4, line: 3682, baseType: !1407, size: 64, align: 64, offset: 192)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1583, file: !4, line: 3698, baseType: !1592, size: 64, align: 64, offset: 256)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!943, !1186, !1140, !923}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1583, file: !4, line: 3712, baseType: !1596, size: 64, align: 64, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!943, !1186, !943, !1140, !923}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1583, file: !4, line: 3726, baseType: !1592, size: 64, align: 64, offset: 384)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1583, file: !4, line: 3737, baseType: !1240, size: 64, align: 64, offset: 448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1583, file: !4, line: 3746, baseType: !943, size: 32, align: 32, offset: 512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1583, file: !4, line: 3757, baseType: !1603, size: 64, align: 64, offset: 576)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{null, !1606}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1583, file: !4, line: 3766, baseType: !1240, size: 64, align: 64, offset: 640)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1583, file: !4, line: 3774, baseType: !1240, size: 64, align: 64, offset: 704)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1583, file: !4, line: 3780, baseType: !943, size: 32, align: 32, offset: 768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1583, file: !4, line: 3785, baseType: !943, size: 32, align: 32, offset: 800)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1583, file: !4, line: 3795, baseType: !1613, size: 64, align: 64, offset: 832)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DISubroutineType(types: !1615)
!1615 = !{!943, !1186, !1045}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1188, file: !4, line: 2728, baseType: !965, size: 64, align: 64, offset: 5440)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1188, file: !4, line: 2735, baseType: !1334, size: 512, align: 64, offset: 5504)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1188, file: !4, line: 2742, baseType: !943, size: 32, align: 32, offset: 6016)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1188, file: !4, line: 2755, baseType: !943, size: 32, align: 32, offset: 6048)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1188, file: !4, line: 2776, baseType: !943, size: 32, align: 32, offset: 6080)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1188, file: !4, line: 2783, baseType: !943, size: 32, align: 32, offset: 6112)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1188, file: !4, line: 2791, baseType: !943, size: 32, align: 32, offset: 6144)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1188, file: !4, line: 2802, baseType: !1410, size: 64, align: 64, offset: 6208)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1188, file: !4, line: 2811, baseType: !943, size: 32, align: 32, offset: 6272)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1188, file: !4, line: 2821, baseType: !943, size: 32, align: 32, offset: 6304)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1188, file: !4, line: 2830, baseType: !943, size: 32, align: 32, offset: 6336)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1188, file: !4, line: 2840, baseType: !943, size: 32, align: 32, offset: 6368)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1188, file: !4, line: 2851, baseType: !1629, size: 64, align: 64, offset: 6400)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!943, !1450, !1632, !965, !1392, !943, !943}
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DISubroutineType(types: !1634)
!1634 = !{!943, !1450, !965}
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1188, file: !4, line: 2871, baseType: !1636, size: 64, align: 64, offset: 6464)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!943, !1450, !1639, !965, !1392, !943}
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{!943, !1450, !965, !943, !943}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1188, file: !4, line: 2878, baseType: !943, size: 32, align: 32, offset: 6528)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1188, file: !4, line: 2885, baseType: !943, size: 32, align: 32, offset: 6560)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1188, file: !4, line: 3005, baseType: !943, size: 32, align: 32, offset: 6592)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1188, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1188, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1188, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1188, file: !4, line: 3037, baseType: !1055, size: 64, align: 64, offset: 6720)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1188, file: !4, line: 3038, baseType: !943, size: 32, align: 32, offset: 6784)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1188, file: !4, line: 3050, baseType: !1224, size: 64, align: 64, offset: 6848)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1188, file: !4, line: 3065, baseType: !943, size: 32, align: 32, offset: 6912)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1188, file: !4, line: 3083, baseType: !943, size: 32, align: 32, offset: 6944)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1188, file: !4, line: 3092, baseType: !1206, size: 64, align: 32, offset: 6976)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1188, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1188, file: !4, line: 3106, baseType: !1206, size: 64, align: 32, offset: 7072)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1188, file: !4, line: 3113, baseType: !1657, size: 64, align: 64, offset: 7168)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1659)
!1659 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1667, !1670}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1660, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1660, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1660, file: !4, line: 720, baseType: !933, size: 64, align: 64, offset: 64)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1660, file: !4, line: 724, baseType: !933, size: 64, align: 64, offset: 128)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1660, file: !4, line: 728, baseType: !943, size: 32, align: 32, offset: 192)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1660, file: !4, line: 734, baseType: !1668, size: 64, align: 64, offset: 256)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1660, file: !4, line: 739, baseType: !1671, size: 64, align: 64, offset: 320)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1231)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1188, file: !4, line: 3129, baseType: !1059, size: 64, align: 64, offset: 7232)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1188, file: !4, line: 3130, baseType: !1059, size: 64, align: 64, offset: 7296)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1188, file: !4, line: 3131, baseType: !1059, size: 64, align: 64, offset: 7360)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1188, file: !4, line: 3132, baseType: !1059, size: 64, align: 64, offset: 7424)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1188, file: !4, line: 3139, baseType: !1302, size: 64, align: 64, offset: 7488)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1188, file: !4, line: 3147, baseType: !943, size: 32, align: 32, offset: 7552)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1188, file: !4, line: 3165, baseType: !943, size: 32, align: 32, offset: 7584)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1188, file: !4, line: 3172, baseType: !943, size: 32, align: 32, offset: 7616)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1188, file: !4, line: 3180, baseType: !943, size: 32, align: 32, offset: 7648)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1188, file: !4, line: 3191, baseType: !1487, size: 64, align: 64, offset: 7680)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1188, file: !4, line: 3199, baseType: !1055, size: 64, align: 64, offset: 7744)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1188, file: !4, line: 3207, baseType: !1302, size: 64, align: 64, offset: 7808)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1188, file: !4, line: 3214, baseType: !925, size: 32, align: 32, offset: 7872)
