; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--pixblockdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--pixblockdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.PixblockDSPContext = type { void (i16*, i8*, i64)*, void (i16*, i8*, i8*, i64)*, void (i16*, i8*, i8*, i64)* }

!852 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!853 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!854 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!855 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!856 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!857 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !35, line: 1534, size: 32, align: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!861 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!862 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!863 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!864 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!865 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !35, line: 810, size: 32, align: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!872 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!873 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !35, line: 798, size: 32, align: 32, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!881 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!882 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!883 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!884 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!885 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!886 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!887 = !{!888, !897, !898, !901}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !891, line: 220, size: 64, align: 8, elements: !892)
!891 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !890, file: !891, line: 220, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !895, line: 55, baseType: !896)
!895 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!896 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!900 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!902 = !{i32 2, !"Dwarf Version", i32 4}
!903 = !{i32 2, !"Debug Info Version", i32 3}
!904 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!905 = distinct !DISubprogram(name: "ff_pixblockdsp_init", scope: !906, file: !906, line: 81, type: !907, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1522)
!906 = !DIFile(filename: "libavcodec/pixblockdsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!907 = !DISubroutineType(types: !908)
!908 = !{null, !909, !934}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixblockDSPContext", file: !911, line: 41, baseType: !912)
!911 = !DIFile(filename: "libavcodec/pixblockdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PixblockDSPContext", file: !911, line: 28, size: 192, align: 64, elements: !913)
!913 = !{!914, !929, !933}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixels", scope: !912, file: !911, line: 29, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !918, !922, !926}
!918 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !895, line: 37, baseType: !921)
!921 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !895, line: 48, baseType: !925)
!925 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !927, line: 149, baseType: !928)
!927 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "diff_pixels", scope: !912, file: !911, line: 32, baseType: !930, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !918, !922, !922, !926}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "diff_pixels_unaligned", scope: !912, file: !911, line: 36, baseType: !930, size: 64, align: 64, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !937)
!937 = !{!938, !981, !982, !983, !1247, !1248, !1249, !1250, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1276, !1280, !1281, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1460, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !936, file: !35, line: 1561, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !943)
!943 = !{!944, !945, !950, !954, !956, !957, !958, !962, !968, !970, !974}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !942, file: !4, line: 72, baseType: !898, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !942, file: !4, line: 78, baseType: !946, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!898, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !942, file: !4, line: 85, baseType: !951, size: 64, align: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !942, file: !4, line: 93, baseType: !955, size: 32, align: 32, offset: 192)
!955 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !942, file: !4, line: 99, baseType: !955, size: 32, align: 32, offset: 224)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !942, file: !4, line: 108, baseType: !955, size: 32, align: 32, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !942, file: !4, line: 113, baseType: !959, size: 64, align: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!949, !949, !949}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !942, file: !4, line: 123, baseType: !963, size: 64, align: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!966, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !942, file: !4, line: 130, baseType: !969, size: 32, align: 32, offset: 448)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !942, file: !4, line: 136, baseType: !971, size: 64, align: 64, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!969, !949}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !942, file: !4, line: 142, baseType: !975, size: 64, align: 64, offset: 576)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!955, !978, !949, !898, !955}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !936, file: !35, line: 1562, baseType: !955, size: 32, align: 32, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !936, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !936, file: !35, line: 1565, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993, !1002, !1005, !1008, !1011, !1014, !1015, !1016, !1024, !1025, !1026, !1028, !1032, !1038, !1043, !1047, !1048, !1098, !1218, !1222, !1223, !1227, !1231, !1236, !1240, !1241, !1242}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !35, line: 3475, baseType: !898, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !986, file: !35, line: 3480, baseType: !898, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !986, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !986, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !986, file: !35, line: 3487, baseType: !955, size: 32, align: 32, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !986, file: !35, line: 3488, baseType: !994, size: 64, align: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !997, line: 61, baseType: !998)
!997 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !997, line: 58, size: 64, align: 32, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !998, file: !997, line: 59, baseType: !955, size: 32, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !998, file: !997, line: 60, baseType: !955, size: 32, align: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !986, file: !35, line: 3489, baseType: !1003, size: 64, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !986, file: !35, line: 3490, baseType: !1006, size: 64, align: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !986, file: !35, line: 3491, baseType: !1009, size: 64, align: 64, offset: 448)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !986, file: !35, line: 3492, baseType: !1012, size: 64, align: 64, offset: 512)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !986, file: !35, line: 3493, baseType: !924, size: 8, align: 8, offset: 576)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !986, file: !35, line: 3494, baseType: !939, size: 64, align: 64, offset: 640)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !986, file: !35, line: 3495, baseType: !1017, size: 64, align: 64, offset: 704)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1020, file: !35, line: 3402, baseType: !955, size: 32, align: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !35, line: 3403, baseType: !898, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !986, file: !35, line: 3507, baseType: !898, size: 64, align: 64, offset: 768)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !986, file: !35, line: 3516, baseType: !955, size: 32, align: 32, offset: 832)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !35, line: 3517, baseType: !1027, size: 64, align: 64, offset: 896)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !986, file: !35, line: 3527, baseType: !1029, size: 64, align: 64, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!955, !934}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !986, file: !35, line: 3535, baseType: !1033, size: 64, align: 64, offset: 1024)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!955, !934, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !986, file: !35, line: 3541, baseType: !1039, size: 64, align: 64, offset: 1088)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1042)
!1042 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !986, file: !35, line: 3549, baseType: !1044, size: 64, align: 64, offset: 1152)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !1027}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !986, file: !35, line: 3551, baseType: !1029, size: 64, align: 64, offset: 1216)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !986, file: !35, line: 3552, baseType: !1049, size: 64, align: 64, offset: 1280)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!955, !934, !1052, !955, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1056)
!1056 = !{!1057, !1060, !1063, !1064, !1065, !1096}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1055, file: !35, line: 3921, baseType: !1058, size: 16, align: 16)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !895, line: 49, baseType: !1059)
!1059 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1055, file: !35, line: 3922, baseType: !1061, size: 32, align: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !895, line: 51, baseType: !1062)
!1062 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1055, file: !35, line: 3923, baseType: !1061, size: 32, align: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1055, file: !35, line: 3924, baseType: !1062, size: 32, align: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1055, file: !35, line: 3925, baseType: !1066, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1086, !1090, !1092, !1093, !1094, !1095}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1069, file: !35, line: 3886, baseType: !955, size: 32, align: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1069, file: !35, line: 3887, baseType: !955, size: 32, align: 32, offset: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1069, file: !35, line: 3888, baseType: !955, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1069, file: !35, line: 3889, baseType: !955, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1069, file: !35, line: 3890, baseType: !955, size: 32, align: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1069, file: !35, line: 3897, baseType: !1077, size: 768, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1079)
!1079 = !{!1080, !1084}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1078, file: !35, line: 3855, baseType: !1081, size: 512, align: 64)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 512, align: 64, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 8)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1078, file: !35, line: 3857, baseType: !1085, size: 256, align: 32, offset: 512)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 256, align: 32, elements: !1082)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1069, file: !35, line: 3903, baseType: !1087, size: 256, align: 64, offset: 960)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 256, align: 64, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 4)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1069, file: !35, line: 3904, baseType: !1091, size: 128, align: 32, offset: 1216)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 128, align: 32, elements: !1088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1069, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1069, file: !35, line: 3908, baseType: !901, size: 64, align: 64, offset: 1408)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1069, file: !35, line: 3915, baseType: !901, size: 64, align: 64, offset: 1472)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1069, file: !35, line: 3917, baseType: !955, size: 32, align: 32, offset: 1536)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1055, file: !35, line: 3926, baseType: !1097, size: 64, align: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !895, line: 40, baseType: !928)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !986, file: !35, line: 3564, baseType: !1099, size: 64, align: 64, offset: 1344)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!955, !934, !1102, !1136, !1217}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1105)
!1105 = !{!1106, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1132, !1133, !1134, !1135}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1104, file: !35, line: 1451, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1109, line: 94, baseType: !1110)
!1109 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1109, line: 81, size: 192, align: 64, elements: !1111)
!1111 = !{!1112, !1116, !1117}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1110, file: !1109, line: 82, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1109, line: 73, baseType: !1115)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1109, line: 73, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1110, file: !1109, line: 89, baseType: !1052, size: 64, align: 64, offset: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1110, file: !1109, line: 93, baseType: !955, size: 32, align: 32, offset: 128)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1104, file: !35, line: 1461, baseType: !1097, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1104, file: !35, line: 1467, baseType: !1097, size: 64, align: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !35, line: 1468, baseType: !1052, size: 64, align: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !35, line: 1469, baseType: !955, size: 32, align: 32, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1104, file: !35, line: 1470, baseType: !955, size: 32, align: 32, offset: 288)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1104, file: !35, line: 1474, baseType: !955, size: 32, align: 32, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1104, file: !35, line: 1479, baseType: !1125, size: 64, align: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1127, file: !35, line: 1412, baseType: !1052, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1127, file: !35, line: 1413, baseType: !955, size: 32, align: 32, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1127, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1104, file: !35, line: 1480, baseType: !955, size: 32, align: 32, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1104, file: !35, line: 1486, baseType: !1097, size: 64, align: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1104, file: !35, line: 1488, baseType: !1097, size: 64, align: 64, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1104, file: !35, line: 1497, baseType: !1097, size: 64, align: 64, offset: 640)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1170, !1172, !1173, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1214, !1215, !1216}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !758, line: 282, baseType: !1081, size: 512, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1139, file: !758, line: 299, baseType: !1085, size: 256, align: 32, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1139, file: !758, line: 315, baseType: !1144, size: 64, align: 64, offset: 768)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1139, file: !758, line: 326, baseType: !955, size: 32, align: 32, offset: 832)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1139, file: !758, line: 326, baseType: !955, size: 32, align: 32, offset: 864)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1139, file: !758, line: 334, baseType: !955, size: 32, align: 32, offset: 896)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1139, file: !758, line: 341, baseType: !955, size: 32, align: 32, offset: 928)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1139, file: !758, line: 346, baseType: !955, size: 32, align: 32, offset: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1139, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1139, file: !758, line: 356, baseType: !996, size: 64, align: 32, offset: 1024)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1139, file: !758, line: 361, baseType: !1097, size: 64, align: 64, offset: 1088)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1139, file: !758, line: 369, baseType: !1097, size: 64, align: 64, offset: 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1139, file: !758, line: 377, baseType: !1097, size: 64, align: 64, offset: 1216)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1139, file: !758, line: 382, baseType: !955, size: 32, align: 32, offset: 1280)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1139, file: !758, line: 386, baseType: !955, size: 32, align: 32, offset: 1312)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1139, file: !758, line: 391, baseType: !955, size: 32, align: 32, offset: 1344)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1139, file: !758, line: 396, baseType: !949, size: 64, align: 64, offset: 1408)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1139, file: !758, line: 403, baseType: !1160, size: 512, align: 64, offset: 1472)
!1160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !894, size: 512, align: 64, elements: !1082)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1139, file: !758, line: 410, baseType: !955, size: 32, align: 32, offset: 1984)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1139, file: !758, line: 415, baseType: !955, size: 32, align: 32, offset: 2016)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1139, file: !758, line: 420, baseType: !955, size: 32, align: 32, offset: 2048)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1139, file: !758, line: 425, baseType: !955, size: 32, align: 32, offset: 2080)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1139, file: !758, line: 435, baseType: !1097, size: 64, align: 64, offset: 2112)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1139, file: !758, line: 440, baseType: !955, size: 32, align: 32, offset: 2176)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1139, file: !758, line: 445, baseType: !894, size: 64, align: 64, offset: 2240)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1139, file: !758, line: 459, baseType: !1169, size: 512, align: 64, offset: 2304)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 512, align: 64, elements: !1082)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1139, file: !758, line: 473, baseType: !1171, size: 64, align: 64, offset: 2816)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1139, file: !758, line: 477, baseType: !955, size: 32, align: 32, offset: 2880)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1139, file: !758, line: 479, baseType: !1174, size: 64, align: 64, offset: 2944)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182, !1187}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1177, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !758, line: 203, baseType: !1052, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1177, file: !758, line: 204, baseType: !955, size: 32, align: 32, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1177, file: !758, line: 205, baseType: !1183, size: 64, align: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1185, line: 86, baseType: !1186)
!1185 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1185, line: 86, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1177, file: !758, line: 206, baseType: !1107, size: 64, align: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1139, file: !758, line: 480, baseType: !955, size: 32, align: 32, offset: 3008)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1139, file: !758, line: 505, baseType: !955, size: 32, align: 32, offset: 3040)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1139, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1139, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1139, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1139, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1139, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1139, file: !758, line: 532, baseType: !1097, size: 64, align: 64, offset: 3264)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1139, file: !758, line: 539, baseType: !1097, size: 64, align: 64, offset: 3328)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1139, file: !758, line: 547, baseType: !1097, size: 64, align: 64, offset: 3392)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1139, file: !758, line: 554, baseType: !1183, size: 64, align: 64, offset: 3456)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1139, file: !758, line: 563, baseType: !955, size: 32, align: 32, offset: 3520)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1139, file: !758, line: 572, baseType: !955, size: 32, align: 32, offset: 3552)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1139, file: !758, line: 581, baseType: !955, size: 32, align: 32, offset: 3584)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1139, file: !758, line: 588, baseType: !1203, size: 64, align: 64, offset: 3648)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !895, line: 36, baseType: !1205)
!1205 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1139, file: !758, line: 593, baseType: !955, size: 32, align: 32, offset: 3712)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1139, file: !758, line: 596, baseType: !955, size: 32, align: 32, offset: 3744)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1139, file: !758, line: 599, baseType: !1107, size: 64, align: 64, offset: 3776)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1139, file: !758, line: 605, baseType: !1107, size: 64, align: 64, offset: 3840)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1139, file: !758, line: 616, baseType: !1107, size: 64, align: 64, offset: 3904)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1139, file: !758, line: 626, baseType: !1212, size: 64, align: 64, offset: 3968)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !927, line: 216, baseType: !896)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1139, file: !758, line: 627, baseType: !1212, size: 64, align: 64, offset: 4032)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1139, file: !758, line: 628, baseType: !1212, size: 64, align: 64, offset: 4096)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1139, file: !758, line: 629, baseType: !1212, size: 64, align: 64, offset: 4160)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1139, file: !758, line: 645, baseType: !1107, size: 64, align: 64, offset: 4224)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !986, file: !35, line: 3566, baseType: !1219, size: 64, align: 64, offset: 1408)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!955, !934, !949, !1217, !1102}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !986, file: !35, line: 3567, baseType: !1029, size: 64, align: 64, offset: 1472)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !986, file: !35, line: 3576, baseType: !1224, size: 64, align: 64, offset: 1536)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DISubroutineType(types: !1226)
!1226 = !{!955, !934, !1136}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !986, file: !35, line: 3577, baseType: !1228, size: 64, align: 64, offset: 1600)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!955, !934, !1102}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !986, file: !35, line: 3584, baseType: !1232, size: 64, align: 64, offset: 1664)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DISubroutineType(types: !1234)
!1234 = !{!955, !934, !1235}
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !986, file: !35, line: 3589, baseType: !1237, size: 64, align: 64, offset: 1728)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{null, !934}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !986, file: !35, line: 3594, baseType: !955, size: 32, align: 32, offset: 1792)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !986, file: !35, line: 3600, baseType: !898, size: 64, align: 64, offset: 1856)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !986, file: !35, line: 3609, baseType: !1243, size: 64, align: 64, offset: 1920)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1246)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !936, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !936, file: !35, line: 1581, baseType: !1062, size: 32, align: 32, offset: 224)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !936, file: !35, line: 1583, baseType: !949, size: 64, align: 64, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !936, file: !35, line: 1591, baseType: !1251, size: 64, align: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !936, file: !35, line: 1598, baseType: !949, size: 64, align: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !936, file: !35, line: 1606, baseType: !1097, size: 64, align: 64, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !936, file: !35, line: 1614, baseType: !955, size: 32, align: 32, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !936, file: !35, line: 1622, baseType: !955, size: 32, align: 32, offset: 544)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !936, file: !35, line: 1628, baseType: !955, size: 32, align: 32, offset: 576)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !936, file: !35, line: 1636, baseType: !955, size: 32, align: 32, offset: 608)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !936, file: !35, line: 1643, baseType: !955, size: 32, align: 32, offset: 640)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !936, file: !35, line: 1657, baseType: !1052, size: 64, align: 64, offset: 704)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !936, file: !35, line: 1658, baseType: !955, size: 32, align: 32, offset: 768)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !936, file: !35, line: 1679, baseType: !996, size: 64, align: 32, offset: 800)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !936, file: !35, line: 1688, baseType: !955, size: 32, align: 32, offset: 864)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !936, file: !35, line: 1712, baseType: !955, size: 32, align: 32, offset: 896)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !936, file: !35, line: 1729, baseType: !955, size: 32, align: 32, offset: 928)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !936, file: !35, line: 1729, baseType: !955, size: 32, align: 32, offset: 960)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !936, file: !35, line: 1744, baseType: !955, size: 32, align: 32, offset: 992)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !936, file: !35, line: 1744, baseType: !955, size: 32, align: 32, offset: 1024)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !936, file: !35, line: 1751, baseType: !955, size: 32, align: 32, offset: 1056)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !936, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !936, file: !35, line: 1791, baseType: !1272, size: 64, align: 64, offset: 1152)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{null, !1275, !1136, !1217, !955, !955, !955}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !936, file: !35, line: 1808, baseType: !1277, size: 64, align: 64, offset: 1216)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!494, !1275, !1003}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !936, file: !35, line: 1816, baseType: !955, size: 32, align: 32, offset: 1280)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !936, file: !35, line: 1825, baseType: !1282, size: 32, align: 32, offset: 1312)
!1282 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !936, file: !35, line: 1830, baseType: !955, size: 32, align: 32, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !936, file: !35, line: 1838, baseType: !1282, size: 32, align: 32, offset: 1376)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !936, file: !35, line: 1846, baseType: !955, size: 32, align: 32, offset: 1408)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !936, file: !35, line: 1851, baseType: !955, size: 32, align: 32, offset: 1440)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !936, file: !35, line: 1861, baseType: !1282, size: 32, align: 32, offset: 1472)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !936, file: !35, line: 1868, baseType: !1282, size: 32, align: 32, offset: 1504)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !936, file: !35, line: 1875, baseType: !1282, size: 32, align: 32, offset: 1536)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !936, file: !35, line: 1882, baseType: !1282, size: 32, align: 32, offset: 1568)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !936, file: !35, line: 1889, baseType: !1282, size: 32, align: 32, offset: 1600)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !936, file: !35, line: 1896, baseType: !1282, size: 32, align: 32, offset: 1632)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !936, file: !35, line: 1903, baseType: !1282, size: 32, align: 32, offset: 1664)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !936, file: !35, line: 1910, baseType: !955, size: 32, align: 32, offset: 1696)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !936, file: !35, line: 1915, baseType: !955, size: 32, align: 32, offset: 1728)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !936, file: !35, line: 1926, baseType: !1217, size: 64, align: 64, offset: 1792)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !936, file: !35, line: 1935, baseType: !996, size: 64, align: 32, offset: 1856)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !936, file: !35, line: 1942, baseType: !955, size: 32, align: 32, offset: 1920)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !936, file: !35, line: 1948, baseType: !955, size: 32, align: 32, offset: 1952)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !936, file: !35, line: 1954, baseType: !955, size: 32, align: 32, offset: 1984)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !936, file: !35, line: 1960, baseType: !955, size: 32, align: 32, offset: 2016)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !936, file: !35, line: 1984, baseType: !955, size: 32, align: 32, offset: 2048)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !936, file: !35, line: 1991, baseType: !955, size: 32, align: 32, offset: 2080)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !936, file: !35, line: 1996, baseType: !955, size: 32, align: 32, offset: 2112)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !936, file: !35, line: 2004, baseType: !955, size: 32, align: 32, offset: 2144)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !936, file: !35, line: 2011, baseType: !955, size: 32, align: 32, offset: 2176)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !936, file: !35, line: 2018, baseType: !955, size: 32, align: 32, offset: 2208)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !936, file: !35, line: 2027, baseType: !955, size: 32, align: 32, offset: 2240)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !936, file: !35, line: 2034, baseType: !955, size: 32, align: 32, offset: 2272)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !936, file: !35, line: 2044, baseType: !955, size: 32, align: 32, offset: 2304)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !936, file: !35, line: 2054, baseType: !1312, size: 64, align: 64, offset: 2368)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !936, file: !35, line: 2061, baseType: !1312, size: 64, align: 64, offset: 2432)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !936, file: !35, line: 2066, baseType: !955, size: 32, align: 32, offset: 2496)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !936, file: !35, line: 2070, baseType: !955, size: 32, align: 32, offset: 2528)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !936, file: !35, line: 2078, baseType: !955, size: 32, align: 32, offset: 2560)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !936, file: !35, line: 2085, baseType: !955, size: 32, align: 32, offset: 2592)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !936, file: !35, line: 2092, baseType: !955, size: 32, align: 32, offset: 2624)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !936, file: !35, line: 2099, baseType: !955, size: 32, align: 32, offset: 2656)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !936, file: !35, line: 2106, baseType: !955, size: 32, align: 32, offset: 2688)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !936, file: !35, line: 2113, baseType: !955, size: 32, align: 32, offset: 2720)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !936, file: !35, line: 2120, baseType: !955, size: 32, align: 32, offset: 2752)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !936, file: !35, line: 2125, baseType: !955, size: 32, align: 32, offset: 2784)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !936, file: !35, line: 2133, baseType: !955, size: 32, align: 32, offset: 2816)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !936, file: !35, line: 2140, baseType: !955, size: 32, align: 32, offset: 2848)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !936, file: !35, line: 2145, baseType: !955, size: 32, align: 32, offset: 2880)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !936, file: !35, line: 2153, baseType: !955, size: 32, align: 32, offset: 2912)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !936, file: !35, line: 2158, baseType: !955, size: 32, align: 32, offset: 2944)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !936, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !936, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !936, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !936, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !936, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !936, file: !35, line: 2203, baseType: !955, size: 32, align: 32, offset: 3136)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !936, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !936, file: !35, line: 2212, baseType: !955, size: 32, align: 32, offset: 3200)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !936, file: !35, line: 2213, baseType: !955, size: 32, align: 32, offset: 3232)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !936, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !936, file: !35, line: 2232, baseType: !955, size: 32, align: 32, offset: 3296)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !936, file: !35, line: 2243, baseType: !955, size: 32, align: 32, offset: 3328)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !936, file: !35, line: 2249, baseType: !955, size: 32, align: 32, offset: 3360)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !936, file: !35, line: 2256, baseType: !955, size: 32, align: 32, offset: 3392)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !936, file: !35, line: 2263, baseType: !894, size: 64, align: 64, offset: 3456)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !936, file: !35, line: 2270, baseType: !894, size: 64, align: 64, offset: 3520)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !936, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !936, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !936, file: !35, line: 2367, baseType: !1348, size: 64, align: 64, offset: 3648)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!955, !1275, !1235, !955}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !936, file: !35, line: 2383, baseType: !955, size: 32, align: 32, offset: 3712)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !936, file: !35, line: 2386, baseType: !1282, size: 32, align: 32, offset: 3744)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !936, file: !35, line: 2387, baseType: !1282, size: 32, align: 32, offset: 3776)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !936, file: !35, line: 2394, baseType: !955, size: 32, align: 32, offset: 3808)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !936, file: !35, line: 2401, baseType: !955, size: 32, align: 32, offset: 3840)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !936, file: !35, line: 2408, baseType: !955, size: 32, align: 32, offset: 3872)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !936, file: !35, line: 2415, baseType: !955, size: 32, align: 32, offset: 3904)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !936, file: !35, line: 2422, baseType: !955, size: 32, align: 32, offset: 3936)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !936, file: !35, line: 2423, baseType: !1360, size: 64, align: 64, offset: 3968)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1362, file: !35, line: 827, baseType: !955, size: 32, align: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1362, file: !35, line: 828, baseType: !955, size: 32, align: 32, offset: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1362, file: !35, line: 829, baseType: !955, size: 32, align: 32, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1362, file: !35, line: 830, baseType: !1282, size: 32, align: 32, offset: 96)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !936, file: !35, line: 2430, baseType: !1097, size: 64, align: 64, offset: 4032)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !936, file: !35, line: 2437, baseType: !1097, size: 64, align: 64, offset: 4096)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !936, file: !35, line: 2444, baseType: !1282, size: 32, align: 32, offset: 4160)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !936, file: !35, line: 2451, baseType: !1282, size: 32, align: 32, offset: 4192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !936, file: !35, line: 2458, baseType: !955, size: 32, align: 32, offset: 4224)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !936, file: !35, line: 2469, baseType: !955, size: 32, align: 32, offset: 4256)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !936, file: !35, line: 2475, baseType: !955, size: 32, align: 32, offset: 4288)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !936, file: !35, line: 2481, baseType: !955, size: 32, align: 32, offset: 4320)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !936, file: !35, line: 2485, baseType: !955, size: 32, align: 32, offset: 4352)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !936, file: !35, line: 2489, baseType: !955, size: 32, align: 32, offset: 4384)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !936, file: !35, line: 2493, baseType: !955, size: 32, align: 32, offset: 4416)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !936, file: !35, line: 2501, baseType: !955, size: 32, align: 32, offset: 4448)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !936, file: !35, line: 2506, baseType: !955, size: 32, align: 32, offset: 4480)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !936, file: !35, line: 2510, baseType: !955, size: 32, align: 32, offset: 4512)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !936, file: !35, line: 2514, baseType: !1097, size: 64, align: 64, offset: 4544)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !936, file: !35, line: 2528, baseType: !1384, size: 64, align: 64, offset: 4608)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{null, !1275, !949, !955, !955}
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !936, file: !35, line: 2534, baseType: !955, size: 32, align: 32, offset: 4672)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !936, file: !35, line: 2545, baseType: !955, size: 32, align: 32, offset: 4704)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !936, file: !35, line: 2547, baseType: !955, size: 32, align: 32, offset: 4736)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !936, file: !35, line: 2549, baseType: !955, size: 32, align: 32, offset: 4768)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !936, file: !35, line: 2551, baseType: !955, size: 32, align: 32, offset: 4800)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !936, file: !35, line: 2553, baseType: !955, size: 32, align: 32, offset: 4832)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !936, file: !35, line: 2555, baseType: !955, size: 32, align: 32, offset: 4864)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !936, file: !35, line: 2557, baseType: !955, size: 32, align: 32, offset: 4896)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !936, file: !35, line: 2559, baseType: !955, size: 32, align: 32, offset: 4928)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !936, file: !35, line: 2563, baseType: !955, size: 32, align: 32, offset: 4960)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !936, file: !35, line: 2571, baseType: !901, size: 64, align: 64, offset: 4992)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !936, file: !35, line: 2579, baseType: !901, size: 64, align: 64, offset: 5056)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !936, file: !35, line: 2586, baseType: !955, size: 32, align: 32, offset: 5120)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !936, file: !35, line: 2615, baseType: !955, size: 32, align: 32, offset: 5152)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !936, file: !35, line: 2627, baseType: !955, size: 32, align: 32, offset: 5184)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !936, file: !35, line: 2637, baseType: !955, size: 32, align: 32, offset: 5216)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !936, file: !35, line: 2681, baseType: !955, size: 32, align: 32, offset: 5248)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !936, file: !35, line: 2709, baseType: !1097, size: 64, align: 64, offset: 5312)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !936, file: !35, line: 2716, baseType: !1406, size: 64, align: 64, offset: 5376)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1408)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1409)
!1409 = !{!1410, !1411, !1412, !1413, !1414, !1415, !1416, !1420, !1424, !1425, !1426, !1427, !1433, !1434, !1435, !1436, !1437}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1408, file: !35, line: 3642, baseType: !898, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1408, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1408, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1408, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1408, file: !35, line: 3669, baseType: !955, size: 32, align: 32, offset: 160)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1408, file: !35, line: 3682, baseType: !1232, size: 64, align: 64, offset: 192)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1408, file: !35, line: 3698, baseType: !1417, size: 64, align: 64, offset: 256)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!955, !934, !922, !1061}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1408, file: !35, line: 3712, baseType: !1421, size: 64, align: 64, offset: 320)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DISubroutineType(types: !1423)
!1423 = !{!955, !934, !955, !922, !1061}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1408, file: !35, line: 3726, baseType: !1417, size: 64, align: 64, offset: 384)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1408, file: !35, line: 3737, baseType: !1029, size: 64, align: 64, offset: 448)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1408, file: !35, line: 3746, baseType: !955, size: 32, align: 32, offset: 512)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1408, file: !35, line: 3757, baseType: !1428, size: 64, align: 64, offset: 576)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{null, !1431}
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1408, file: !35, line: 3766, baseType: !1029, size: 64, align: 64, offset: 640)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1408, file: !35, line: 3774, baseType: !1029, size: 64, align: 64, offset: 704)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1408, file: !35, line: 3780, baseType: !955, size: 32, align: 32, offset: 768)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1408, file: !35, line: 3785, baseType: !955, size: 32, align: 32, offset: 800)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1408, file: !35, line: 3795, baseType: !1438, size: 64, align: 64, offset: 832)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!955, !934, !1107}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !936, file: !35, line: 2728, baseType: !949, size: 64, align: 64, offset: 5440)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !936, file: !35, line: 2735, baseType: !1160, size: 512, align: 64, offset: 5504)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !936, file: !35, line: 2742, baseType: !955, size: 32, align: 32, offset: 6016)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !936, file: !35, line: 2755, baseType: !955, size: 32, align: 32, offset: 6048)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !936, file: !35, line: 2776, baseType: !955, size: 32, align: 32, offset: 6080)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !936, file: !35, line: 2783, baseType: !955, size: 32, align: 32, offset: 6112)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !936, file: !35, line: 2791, baseType: !955, size: 32, align: 32, offset: 6144)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !936, file: !35, line: 2802, baseType: !1235, size: 64, align: 64, offset: 6208)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !936, file: !35, line: 2811, baseType: !955, size: 32, align: 32, offset: 6272)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !936, file: !35, line: 2821, baseType: !955, size: 32, align: 32, offset: 6304)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !936, file: !35, line: 2830, baseType: !955, size: 32, align: 32, offset: 6336)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !936, file: !35, line: 2840, baseType: !955, size: 32, align: 32, offset: 6368)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !936, file: !35, line: 2851, baseType: !1454, size: 64, align: 64, offset: 6400)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{!955, !1275, !1457, !949, !1217, !955, !955}
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!955, !1275, !949}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !936, file: !35, line: 2871, baseType: !1461, size: 64, align: 64, offset: 6464)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!955, !1275, !1464, !949, !1217, !955}
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!955, !1275, !949, !955, !955}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !936, file: !35, line: 2878, baseType: !955, size: 32, align: 32, offset: 6528)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !936, file: !35, line: 2885, baseType: !955, size: 32, align: 32, offset: 6560)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !936, file: !35, line: 3005, baseType: !955, size: 32, align: 32, offset: 6592)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !936, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !936, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !936, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !936, file: !35, line: 3037, baseType: !1052, size: 64, align: 64, offset: 6720)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !936, file: !35, line: 3038, baseType: !955, size: 32, align: 32, offset: 6784)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !936, file: !35, line: 3050, baseType: !894, size: 64, align: 64, offset: 6848)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !936, file: !35, line: 3065, baseType: !955, size: 32, align: 32, offset: 6912)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !936, file: !35, line: 3083, baseType: !955, size: 32, align: 32, offset: 6944)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !936, file: !35, line: 3092, baseType: !996, size: 64, align: 32, offset: 6976)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !936, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !936, file: !35, line: 3106, baseType: !996, size: 64, align: 32, offset: 7072)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !936, file: !35, line: 3113, baseType: !1482, size: 64, align: 64, offset: 7168)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1484)
!1484 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1485)
!1485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1486)
!1486 = !{!1487, !1488, !1489, !1490, !1491, !1492, !1495}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1485, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1485, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1485, file: !35, line: 720, baseType: !898, size: 64, align: 64, offset: 64)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1485, file: !35, line: 724, baseType: !898, size: 64, align: 64, offset: 128)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1485, file: !35, line: 728, baseType: !955, size: 32, align: 32, offset: 192)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1485, file: !35, line: 734, baseType: !1493, size: 64, align: 64, offset: 256)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1485, file: !35, line: 739, baseType: !1496, size: 64, align: 64, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !936, file: !35, line: 3129, baseType: !1097, size: 64, align: 64, offset: 7232)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !936, file: !35, line: 3130, baseType: !1097, size: 64, align: 64, offset: 7296)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !936, file: !35, line: 3131, baseType: !1097, size: 64, align: 64, offset: 7360)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !936, file: !35, line: 3132, baseType: !1097, size: 64, align: 64, offset: 7424)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !936, file: !35, line: 3139, baseType: !901, size: 64, align: 64, offset: 7488)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !936, file: !35, line: 3147, baseType: !955, size: 32, align: 32, offset: 7552)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !936, file: !35, line: 3165, baseType: !955, size: 32, align: 32, offset: 7584)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !936, file: !35, line: 3172, baseType: !955, size: 32, align: 32, offset: 7616)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !936, file: !35, line: 3180, baseType: !955, size: 32, align: 32, offset: 7648)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !936, file: !35, line: 3191, baseType: !1312, size: 64, align: 64, offset: 7680)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !936, file: !35, line: 3199, baseType: !1052, size: 64, align: 64, offset: 7744)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !936, file: !35, line: 3207, baseType: !901, size: 64, align: 64, offset: 7808)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !936, file: !35, line: 3214, baseType: !1062, size: 32, align: 32, offset: 7872)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !936, file: !35, line: 3224, baseType: !1125, size: 64, align: 64, offset: 7936)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !936, file: !35, line: 3225, baseType: !955, size: 32, align: 32, offset: 8000)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !936, file: !35, line: 3249, baseType: !1107, size: 64, align: 64, offset: 8064)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !936, file: !35, line: 3256, baseType: !955, size: 32, align: 32, offset: 8128)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !936, file: !35, line: 3271, baseType: !955, size: 32, align: 32, offset: 8160)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !936, file: !35, line: 3279, baseType: !1097, size: 64, align: 64, offset: 8192)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !936, file: !35, line: 3301, baseType: !1107, size: 64, align: 64, offset: 8256)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !936, file: !35, line: 3310, baseType: !955, size: 32, align: 32, offset: 8320)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !936, file: !35, line: 3337, baseType: !955, size: 32, align: 32, offset: 8352)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !936, file: !35, line: 3351, baseType: !955, size: 32, align: 32, offset: 8384)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !936, file: !35, line: 3359, baseType: !955, size: 32, align: 32, offset: 8416)
!1522 = !{}
!1523 = !DILocalVariable(name: "c", arg: 1, scope: !905, file: !906, line: 81, type: !909)
!1524 = !DIExpression()
!1525 = !DILocation(line: 81, column: 68, scope: !905)
!1526 = !DILocalVariable(name: "avctx", arg: 2, scope: !905, file: !906, line: 81, type: !934)
!1527 = !DILocation(line: 81, column: 87, scope: !905)
!1528 = !DILocalVariable(name: "high_bit_depth", scope: !905, file: !906, line: 83, type: !1529)
!1529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1530 = !DILocation(line: 83, column: 20, scope: !905)
!1531 = !DILocation(line: 83, column: 37, scope: !905)
!1532 = !DILocation(line: 83, column: 44, scope: !905)
!1533 = !DILocation(line: 83, column: 64, scope: !905)
!1534 = !DILocation(line: 86, column: 5, scope: !905)
!1535 = !DILocation(line: 86, column: 8, scope: !905)
!1536 = !DILocation(line: 86, column: 20, scope: !905)
!1537 = !DILocation(line: 85, column: 5, scope: !905)
!1538 = !DILocation(line: 85, column: 8, scope: !905)
!1539 = !DILocation(line: 85, column: 30, scope: !905)
!1540 = !DILocation(line: 88, column: 13, scope: !905)
!1541 = !DILocation(line: 88, column: 20, scope: !905)
!1542 = !DILocation(line: 88, column: 5, scope: !905)
!1543 = !DILocation(line: 93, column: 9, scope: !1544)
!1544 = distinct !DILexicalBlock(scope: !905, file: !906, line: 88, column: 41)
!1545 = !DILocation(line: 93, column: 12, scope: !1544)
!1546 = !DILocation(line: 93, column: 23, scope: !1544)
!1547 = !DILocation(line: 94, column: 9, scope: !1544)
!1548 = !DILocation(line: 96, column: 13, scope: !1549)
!1549 = distinct !DILexicalBlock(scope: !1544, file: !906, line: 96, column: 13)
!1550 = !DILocation(line: 96, column: 20, scope: !1549)
!1551 = !DILocation(line: 96, column: 39, scope: !1549)
!1552 = !DILocation(line: 96, column: 43, scope: !1549)
!1553 = !DILocation(line: 96, column: 46, scope: !1554)
!1554 = !DILexicalBlockFile(scope: !1549, file: !906, discriminator: 1)
!1555 = !DILocation(line: 96, column: 53, scope: !1554)
!1556 = !DILocation(line: 96, column: 64, scope: !1554)
!1557 = !DILocation(line: 96, column: 13, scope: !1554)
!1558 = !DILocation(line: 97, column: 13, scope: !1559)
!1559 = distinct !DILexicalBlock(scope: !1549, file: !906, line: 96, column: 87)
!1560 = !DILocation(line: 97, column: 16, scope: !1559)
!1561 = !DILocation(line: 97, column: 27, scope: !1559)
!1562 = !DILocation(line: 98, column: 9, scope: !1559)
!1563 = !DILocation(line: 99, column: 9, scope: !1544)
!1564 = !DILocation(line: 109, column: 33, scope: !1565)
!1565 = distinct !DILexicalBlock(scope: !905, file: !906, line: 108, column: 9)
!1566 = !DILocation(line: 109, column: 36, scope: !1565)
!1567 = !DILocation(line: 109, column: 43, scope: !1565)
!1568 = !DILocation(line: 109, column: 9, scope: !1565)
!1569 = !DILocation(line: 112, column: 1, scope: !905)
!1570 = distinct !DISubprogram(name: "diff_pixels_c", scope: !906, file: !906, line: 60, type: !931, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1522)
!1571 = !DILocalVariable(name: "block", arg: 1, scope: !1570, file: !906, line: 60, type: !918)
!1572 = !DILocation(line: 60, column: 45, scope: !1570)
!1573 = !DILocalVariable(name: "s1", arg: 2, scope: !1570, file: !906, line: 60, type: !922)
!1574 = !DILocation(line: 60, column: 67, scope: !1570)
!1575 = !DILocalVariable(name: "s2", arg: 3, scope: !1570, file: !906, line: 61, type: !922)
!1576 = !DILocation(line: 61, column: 42, scope: !1570)
!1577 = !DILocalVariable(name: "stride", arg: 4, scope: !1570, file: !906, line: 61, type: !926)
!1578 = !DILocation(line: 61, column: 56, scope: !1570)
!1579 = !DILocalVariable(name: "i", scope: !1570, file: !906, line: 63, type: !955)
!1580 = !DILocation(line: 63, column: 9, scope: !1570)
!1581 = !DILocation(line: 66, column: 12, scope: !1582)
