; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dca_lbr.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dca_lbr.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VLC = type { i32, [2 x i16]*, i32, i32 }
%struct.DCALbrDecoder = type { %struct.AVCodecContext*, %struct.GetBitContext, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [3 x [32 x i8]], [32 x i8], [3 x [32 x i8]], [3 x [32 x i8]], [6 x i32], [6 x [12 x [8 x i8]]], [6 x [3 x [64 x i8]]], [6 x [28 x i8]], [6 x [28 x [8 x i8]]], [6 x i32], [6 x [32 x [8 x i8]]], [6 x [8 x [5 x i8]]], i8, [2 x [6 x [3 x [2 x [8 x float]]]]], [32 x float], [6 x [32 x float*]], float*, i32, [20 x i8], [6 x [128 x float]], [128 x float], [64 x float], [5 x [2 x float]], float, [6 x i8], [5 x [32 x [2 x i16]]], [512 x %struct.DCALbrTone], i32, %struct.FFTContext, %struct.AVFloatDSPContext*, %struct.DCADSPContext*, [8 x i8] }

!1038 = distinct !DIGlobalVariable(name: "channel_counts", scope: !0, file: !898, line: 109, type: !1039, isLocal: true, isDefinition: true, variable: [7 x i8]* @channel_counts)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 56, align: 8, elements: !1036)
!1040 = distinct !DIGlobalVariable(name: "channel_reorder_lfe", scope: !0, file: !898, line: 95, type: !1041, isLocal: true, isDefinition: true, variable: [7 x [5 x i8]]* @channel_reorder_lfe)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 280, align: 8, elements: !1045)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1016, line: 36, baseType: !1044)
!1044 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1045 = !{!1037, !1046}
!1046 = !DISubrange(count: 5)
!1047 = distinct !DIGlobalVariable(name: "channel_reorder_nolfe", scope: !0, file: !898, line: 85, type: !1041, isLocal: true, isDefinition: true, variable: [7 x [5 x i8]]* @channel_reorder_nolfe)
!1048 = distinct !DIGlobalVariable(name: "cos_tab", scope: !0, file: !898, line: 123, type: !1049, isLocal: true, isDefinition: true, variable: [256 x float]* @cos_tab)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1007, size: 8192, align: 32, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 256)
!1052 = distinct !DIGlobalVariable(name: "lfe_index", scope: !0, file: !898, line: 105, type: !1039, isLocal: true, isDefinition: true, variable: [7 x i8]* @lfe_index)
!1053 = distinct !DIGlobalVariable(name: "initialized", scope: !1054, file: !898, line: 128, type: !1004, isLocal: true, isDefinition: true, variable: i32* @init_tables.initialized)
!1054 = distinct !DISubprogram(name: "init_tables", scope: !898, file: !898, line: 126, type: !1055, isLocal: true, isDefinition: true, scopeLine: 127, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1057)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{null}
!1057 = !{}
!1058 = !{i32 2, !"Dwarf Version", i32 4}
!1059 = !{i32 2, !"Debug Info Version", i32 3}
!1060 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1061 = distinct !DISubprogram(name: "ff_dca_lbr_parse", scope: !898, file: !898, line: 1143, type: !1062, isLocal: false, isDefinition: true, scopeLine: 1144, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1057)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!1004, !1064, !1195, !2097}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCALbrDecoder", file: !1066, line: 127, baseType: !1067)
!1066 = !DIFile(filename: "libavcodec/dca_lbr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCALbrDecoder", file: !1066, line: 58, size: 178944, align: 256, elements: !1068)
!1068 = !{!1069, !1788, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1822, !1825, !1826, !1827, !1831, !1835, !1839, !1843, !1846, !1847, !1850, !1853, !1854, !1858, !1860, !1863, !1864, !1865, !1869, !1872, !1875, !1878, !1879, !1881, !1884, !1897, !1898, !1943, !1988}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1067, file: !1066, line: 59, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !1073)
!1073 = !{!1074, !1118, !1119, !1120, !1387, !1388, !1389, !1390, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1543, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1726, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1072, file: !35, line: 1561, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !1079)
!1079 = !{!1080, !1084, !1088, !1092, !1093, !1094, !1095, !1099, !1105, !1107, !1111}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1078, file: !4, line: 72, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1083)
!1083 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1078, file: !4, line: 78, baseType: !1085, size: 64, align: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!1081, !1008}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1078, file: !4, line: 85, baseType: !1089, size: 64, align: 64, offset: 128)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1091)
!1091 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1078, file: !4, line: 93, baseType: !1004, size: 32, align: 32, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1078, file: !4, line: 99, baseType: !1004, size: 32, align: 32, offset: 224)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1078, file: !4, line: 108, baseType: !1004, size: 32, align: 32, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1078, file: !4, line: 113, baseType: !1096, size: 64, align: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!1008, !1008, !1008}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1078, file: !4, line: 123, baseType: !1100, size: 64, align: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{!1103, !1103}
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1078, file: !4, line: 130, baseType: !1106, size: 32, align: 32, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1078, file: !4, line: 136, baseType: !1108, size: 64, align: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!1106, !1008}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1078, file: !4, line: 142, baseType: !1112, size: 64, align: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DISubroutineType(types: !1114)
!1114 = !{!1004, !1115, !1008, !1081, !1004}
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1072, file: !35, line: 1562, baseType: !1004, size: 32, align: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1072, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1072, file: !35, line: 1565, baseType: !1121, size: 64, align: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130, !1139, !1142, !1145, !1148, !1153, !1154, !1155, !1163, !1164, !1165, !1167, !1171, !1177, !1186, !1190, !1191, !1239, !1358, !1362, !1363, !1367, !1371, !1376, !1380, !1381, !1382}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1123, file: !35, line: 3475, baseType: !1081, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1123, file: !35, line: 3480, baseType: !1081, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1123, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1123, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1123, file: !35, line: 3487, baseType: !1004, size: 32, align: 32, offset: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1123, file: !35, line: 3488, baseType: !1131, size: 64, align: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1134, line: 61, baseType: !1135)
!1134 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1134, line: 58, size: 64, align: 32, elements: !1136)
!1136 = !{!1137, !1138}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1135, file: !1134, line: 59, baseType: !1004, size: 32, align: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1135, file: !1134, line: 60, baseType: !1004, size: 32, align: 32, offset: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1123, file: !35, line: 3489, baseType: !1140, size: 64, align: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1123, file: !35, line: 3490, baseType: !1143, size: 64, align: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1123, file: !35, line: 3491, baseType: !1146, size: 64, align: 64, offset: 448)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1123, file: !35, line: 3492, baseType: !1149, size: 64, align: 64, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1151)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1016, line: 55, baseType: !1152)
!1152 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1123, file: !35, line: 3493, baseType: !1019, size: 8, align: 8, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1123, file: !35, line: 3494, baseType: !1075, size: 64, align: 64, offset: 640)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1123, file: !35, line: 3495, baseType: !1156, size: 64, align: 64, offset: 704)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1159, file: !35, line: 3402, baseType: !1004, size: 32, align: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1159, file: !35, line: 3403, baseType: !1081, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1123, file: !35, line: 3507, baseType: !1081, size: 64, align: 64, offset: 768)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1123, file: !35, line: 3516, baseType: !1004, size: 32, align: 32, offset: 832)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1123, file: !35, line: 3517, baseType: !1166, size: 64, align: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1123, file: !35, line: 3527, baseType: !1168, size: 64, align: 64, offset: 960)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{!1004, !1070}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1123, file: !35, line: 3535, baseType: !1172, size: 64, align: 64, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!1004, !1070, !1175}
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1123, file: !35, line: 3541, baseType: !1178, size: 64, align: 64, offset: 1088)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1182, line: 223, size: 128, align: 64, elements: !1183)
!1182 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1183 = !{!1184, !1185}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1181, file: !1182, line: 224, baseType: !1017, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1181, file: !1182, line: 225, baseType: !1017, size: 64, align: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1123, file: !35, line: 3549, baseType: !1187, size: 64, align: 64, offset: 1152)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DISubroutineType(types: !1189)
!1189 = !{null, !1166}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1123, file: !35, line: 3551, baseType: !1168, size: 64, align: 64, offset: 1216)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1123, file: !35, line: 3552, baseType: !1192, size: 64, align: 64, offset: 1280)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DISubroutineType(types: !1194)
!1194 = !{!1004, !1070, !1195, !1004, !1196}
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1236}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1198, file: !35, line: 3921, baseType: !1026, size: 16, align: 16)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1198, file: !35, line: 3922, baseType: !1015, size: 32, align: 32, offset: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1198, file: !35, line: 3923, baseType: !1015, size: 32, align: 32, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1198, file: !35, line: 3924, baseType: !1005, size: 32, align: 32, offset: 96)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1198, file: !35, line: 3925, baseType: !1205, size: 64, align: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215, !1225, !1229, !1231, !1232, !1234, !1235}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1208, file: !35, line: 3886, baseType: !1004, size: 32, align: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1208, file: !35, line: 3887, baseType: !1004, size: 32, align: 32, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1208, file: !35, line: 3888, baseType: !1004, size: 32, align: 32, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1208, file: !35, line: 3889, baseType: !1004, size: 32, align: 32, offset: 96)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1208, file: !35, line: 3890, baseType: !1004, size: 32, align: 32, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1208, file: !35, line: 3897, baseType: !1216, size: 768, align: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1218)
!1218 = !{!1219, !1223}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1217, file: !35, line: 3855, baseType: !1220, size: 512, align: 64)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1195, size: 512, align: 64, elements: !1221)
!1221 = !{!1222}
!1222 = !DISubrange(count: 8)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1217, file: !35, line: 3857, baseType: !1224, size: 256, align: 32, offset: 512)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1004, size: 256, align: 32, elements: !1221)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !35, line: 3903, baseType: !1226, size: 256, align: 64, offset: 960)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1195, size: 256, align: 64, elements: !1227)
!1227 = !{!1228}
!1228 = !DISubrange(count: 4)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1208, file: !35, line: 3904, baseType: !1230, size: 128, align: 32, offset: 1216)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1004, size: 128, align: 32, elements: !1227)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1208, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1208, file: !35, line: 3908, baseType: !1233, size: 64, align: 64, offset: 1408)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1208, file: !35, line: 3915, baseType: !1233, size: 64, align: 64, offset: 1472)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1208, file: !35, line: 3917, baseType: !1004, size: 32, align: 32, offset: 1536)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1198, file: !35, line: 3926, baseType: !1237, size: 64, align: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1016, line: 40, baseType: !1238)
!1238 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1123, file: !35, line: 3564, baseType: !1240, size: 64, align: 64, offset: 1344)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!1004, !1070, !1243, !1277, !1357}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1246)
!1246 = !{!1247, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1273, !1274, !1275, !1276}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1245, file: !35, line: 1451, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1250, line: 94, baseType: !1251)
!1250 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1250, line: 81, size: 192, align: 64, elements: !1252)
!1252 = !{!1253, !1257, !1258}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1251, file: !1250, line: 82, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1250, line: 73, baseType: !1256)
!1256 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1250, line: 73, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1251, file: !1250, line: 89, baseType: !1195, size: 64, align: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1251, file: !1250, line: 93, baseType: !1004, size: 32, align: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1245, file: !35, line: 1461, baseType: !1237, size: 64, align: 64, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1245, file: !35, line: 1467, baseType: !1237, size: 64, align: 64, offset: 128)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1245, file: !35, line: 1468, baseType: !1195, size: 64, align: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1245, file: !35, line: 1469, baseType: !1004, size: 32, align: 32, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1245, file: !35, line: 1470, baseType: !1004, size: 32, align: 32, offset: 288)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1245, file: !35, line: 1474, baseType: !1004, size: 32, align: 32, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1245, file: !35, line: 1479, baseType: !1266, size: 64, align: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1269)
!1269 = !{!1270, !1271, !1272}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1268, file: !35, line: 1412, baseType: !1195, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1268, file: !35, line: 1413, baseType: !1004, size: 32, align: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1268, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1245, file: !35, line: 1480, baseType: !1004, size: 32, align: 32, offset: 448)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1245, file: !35, line: 1486, baseType: !1237, size: 64, align: 64, offset: 512)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1245, file: !35, line: 1488, baseType: !1237, size: 64, align: 64, offset: 576)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1245, file: !35, line: 1497, baseType: !1237, size: 64, align: 64, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1281)
!1281 = !{!1282, !1283, !1284, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1311, !1313, !1314, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1345, !1346, !1347, !1348, !1349, !1350, !1353, !1354, !1355, !1356}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1280, file: !758, line: 282, baseType: !1220, size: 512, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1280, file: !758, line: 299, baseType: !1224, size: 256, align: 32, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1280, file: !758, line: 315, baseType: !1285, size: 64, align: 64, offset: 768)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1280, file: !758, line: 326, baseType: !1004, size: 32, align: 32, offset: 832)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1280, file: !758, line: 326, baseType: !1004, size: 32, align: 32, offset: 864)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1280, file: !758, line: 334, baseType: !1004, size: 32, align: 32, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1280, file: !758, line: 341, baseType: !1004, size: 32, align: 32, offset: 928)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1280, file: !758, line: 346, baseType: !1004, size: 32, align: 32, offset: 960)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1280, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1280, file: !758, line: 356, baseType: !1133, size: 64, align: 32, offset: 1024)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1280, file: !758, line: 361, baseType: !1237, size: 64, align: 64, offset: 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1280, file: !758, line: 369, baseType: !1237, size: 64, align: 64, offset: 1152)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1280, file: !758, line: 377, baseType: !1237, size: 64, align: 64, offset: 1216)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1280, file: !758, line: 382, baseType: !1004, size: 32, align: 32, offset: 1280)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1280, file: !758, line: 386, baseType: !1004, size: 32, align: 32, offset: 1312)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1280, file: !758, line: 391, baseType: !1004, size: 32, align: 32, offset: 1344)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1280, file: !758, line: 396, baseType: !1008, size: 64, align: 64, offset: 1408)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1280, file: !758, line: 403, baseType: !1301, size: 512, align: 64, offset: 1472)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 512, align: 64, elements: !1221)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1280, file: !758, line: 410, baseType: !1004, size: 32, align: 32, offset: 1984)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1280, file: !758, line: 415, baseType: !1004, size: 32, align: 32, offset: 2016)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1280, file: !758, line: 420, baseType: !1004, size: 32, align: 32, offset: 2048)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1280, file: !758, line: 425, baseType: !1004, size: 32, align: 32, offset: 2080)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1280, file: !758, line: 435, baseType: !1237, size: 64, align: 64, offset: 2112)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1280, file: !758, line: 440, baseType: !1004, size: 32, align: 32, offset: 2176)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1280, file: !758, line: 445, baseType: !1151, size: 64, align: 64, offset: 2240)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1280, file: !758, line: 459, baseType: !1310, size: 512, align: 64, offset: 2304)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 512, align: 64, elements: !1221)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1280, file: !758, line: 473, baseType: !1312, size: 64, align: 64, offset: 2816)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1280, file: !758, line: 477, baseType: !1004, size: 32, align: 32, offset: 2880)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1280, file: !758, line: 479, baseType: !1315, size: 64, align: 64, offset: 2944)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1328}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1318, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1318, file: !758, line: 203, baseType: !1195, size: 64, align: 64, offset: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1318, file: !758, line: 204, baseType: !1004, size: 32, align: 32, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1318, file: !758, line: 205, baseType: !1324, size: 64, align: 64, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1326, line: 86, baseType: !1327)
!1326 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1327 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1326, line: 86, flags: DIFlagFwdDecl)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1318, file: !758, line: 206, baseType: !1248, size: 64, align: 64, offset: 256)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1280, file: !758, line: 480, baseType: !1004, size: 32, align: 32, offset: 3008)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1280, file: !758, line: 505, baseType: !1004, size: 32, align: 32, offset: 3040)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1280, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1280, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1280, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1280, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1280, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1280, file: !758, line: 532, baseType: !1237, size: 64, align: 64, offset: 3264)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1280, file: !758, line: 539, baseType: !1237, size: 64, align: 64, offset: 3328)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1280, file: !758, line: 547, baseType: !1237, size: 64, align: 64, offset: 3392)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1280, file: !758, line: 554, baseType: !1324, size: 64, align: 64, offset: 3456)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1280, file: !758, line: 563, baseType: !1004, size: 32, align: 32, offset: 3520)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1280, file: !758, line: 572, baseType: !1004, size: 32, align: 32, offset: 3552)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1280, file: !758, line: 581, baseType: !1004, size: 32, align: 32, offset: 3584)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1280, file: !758, line: 588, baseType: !1344, size: 64, align: 64, offset: 3648)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1280, file: !758, line: 593, baseType: !1004, size: 32, align: 32, offset: 3712)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1280, file: !758, line: 596, baseType: !1004, size: 32, align: 32, offset: 3744)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1280, file: !758, line: 599, baseType: !1248, size: 64, align: 64, offset: 3776)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1280, file: !758, line: 605, baseType: !1248, size: 64, align: 64, offset: 3840)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1280, file: !758, line: 616, baseType: !1248, size: 64, align: 64, offset: 3904)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1280, file: !758, line: 626, baseType: !1351, size: 64, align: 64, offset: 3968)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1352, line: 216, baseType: !1152)
!1352 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1280, file: !758, line: 627, baseType: !1351, size: 64, align: 64, offset: 4032)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1280, file: !758, line: 628, baseType: !1351, size: 64, align: 64, offset: 4096)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1280, file: !758, line: 629, baseType: !1351, size: 64, align: 64, offset: 4160)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1280, file: !758, line: 645, baseType: !1248, size: 64, align: 64, offset: 4224)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1123, file: !35, line: 3566, baseType: !1359, size: 64, align: 64, offset: 1408)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!1004, !1070, !1008, !1357, !1243}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1123, file: !35, line: 3567, baseType: !1168, size: 64, align: 64, offset: 1472)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1123, file: !35, line: 3576, baseType: !1364, size: 64, align: 64, offset: 1536)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DISubroutineType(types: !1366)
!1366 = !{!1004, !1070, !1277}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1123, file: !35, line: 3577, baseType: !1368, size: 64, align: 64, offset: 1600)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{!1004, !1070, !1243}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1123, file: !35, line: 3584, baseType: !1372, size: 64, align: 64, offset: 1664)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DISubroutineType(types: !1374)
!1374 = !{!1004, !1070, !1375}
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1123, file: !35, line: 3589, baseType: !1377, size: 64, align: 64, offset: 1728)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{null, !1070}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1123, file: !35, line: 3594, baseType: !1004, size: 32, align: 32, offset: 1792)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1123, file: !35, line: 3600, baseType: !1081, size: 64, align: 64, offset: 1856)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1123, file: !35, line: 3609, baseType: !1383, size: 64, align: 64, offset: 1920)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1386)
!1386 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1072, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1072, file: !35, line: 1581, baseType: !1005, size: 32, align: 32, offset: 224)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1072, file: !35, line: 1583, baseType: !1008, size: 64, align: 64, offset: 256)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1072, file: !35, line: 1591, baseType: !1391, size: 64, align: 64, offset: 320)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1182, line: 129, size: 1664, align: 64, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397, !1398, !1416, !1417, !1423, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1392, file: !1182, line: 136, baseType: !1004, size: 32, align: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1392, file: !1182, line: 151, baseType: !1004, size: 32, align: 32, offset: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1392, file: !1182, line: 157, baseType: !1004, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1392, file: !1182, line: 159, baseType: !1375, size: 64, align: 64, offset: 128)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1392, file: !1182, line: 161, baseType: !1399, size: 64, align: 64, offset: 192)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1182, line: 117, baseType: !1401)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1182, line: 100, size: 832, align: 64, elements: !1402)
!1402 = !{!1403, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1401, file: !1182, line: 105, baseType: !1404, size: 256, align: 64)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1405, size: 256, align: 64, elements: !1227)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1250, line: 238, baseType: !1407)
!1407 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1250, line: 238, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1401, file: !1182, line: 110, baseType: !1004, size: 32, align: 32, offset: 256)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1401, file: !1182, line: 111, baseType: !1004, size: 32, align: 32, offset: 288)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1401, file: !1182, line: 111, baseType: !1004, size: 32, align: 32, offset: 320)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1401, file: !1182, line: 112, baseType: !1224, size: 256, align: 32, offset: 352)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1401, file: !1182, line: 113, baseType: !1230, size: 128, align: 32, offset: 608)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1401, file: !1182, line: 114, baseType: !1004, size: 32, align: 32, offset: 736)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1401, file: !1182, line: 115, baseType: !1004, size: 32, align: 32, offset: 768)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1401, file: !1182, line: 116, baseType: !1004, size: 32, align: 32, offset: 800)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1392, file: !1182, line: 163, baseType: !1008, size: 64, align: 64, offset: 256)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1392, file: !1182, line: 165, baseType: !1418, size: 128, align: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1182, line: 122, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1182, line: 119, size: 128, align: 64, elements: !1420)
!1420 = !{!1421, !1422}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1419, file: !1182, line: 120, baseType: !1243, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1419, file: !1182, line: 121, baseType: !1375, size: 64, align: 64, offset: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1392, file: !1182, line: 166, baseType: !1424, size: 128, align: 64, offset: 448)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1182, line: 127, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1182, line: 124, size: 128, align: 64, elements: !1426)
!1426 = !{!1427, !1500}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1425, file: !1182, line: 125, baseType: !1428, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1432)
!1432 = !{!1433, !1434, !1458, !1462, !1463, !1497, !1498, !1499}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1431, file: !35, line: 5751, baseType: !1075, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1431, file: !35, line: 5756, baseType: !1435, size: 64, align: 64, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1438)
!1438 = !{!1439, !1440, !1443, !1444, !1445, !1449, !1453, !1457}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1437, file: !35, line: 5797, baseType: !1081, size: 64, align: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1437, file: !35, line: 5804, baseType: !1441, size: 64, align: 64, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1437, file: !35, line: 5815, baseType: !1075, size: 64, align: 64, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1437, file: !35, line: 5825, baseType: !1004, size: 32, align: 32, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1437, file: !35, line: 5826, baseType: !1446, size: 64, align: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!1004, !1429}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1437, file: !35, line: 5827, baseType: !1450, size: 64, align: 64, offset: 320)
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DISubroutineType(types: !1452)
!1452 = !{!1004, !1429, !1243}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1437, file: !35, line: 5828, baseType: !1454, size: 64, align: 64, offset: 384)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DISubroutineType(types: !1456)
!1456 = !{null, !1429}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1437, file: !35, line: 5829, baseType: !1454, size: 64, align: 64, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1431, file: !35, line: 5762, baseType: !1459, size: 64, align: 64, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1461)
!1461 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1431, file: !35, line: 5768, baseType: !1008, size: 64, align: 64, offset: 192)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1431, file: !35, line: 5775, baseType: !1464, size: 64, align: 64, offset: 256)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1466)
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1467)
!1467 = !{!1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1466, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1466, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1466, file: !35, line: 3948, baseType: !1015, size: 32, align: 32, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1466, file: !35, line: 3958, baseType: !1195, size: 64, align: 64, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1466, file: !35, line: 3962, baseType: !1004, size: 32, align: 32, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1466, file: !35, line: 3968, baseType: !1004, size: 32, align: 32, offset: 224)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1466, file: !35, line: 3973, baseType: !1237, size: 64, align: 64, offset: 256)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1466, file: !35, line: 3986, baseType: !1004, size: 32, align: 32, offset: 320)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1466, file: !35, line: 3999, baseType: !1004, size: 32, align: 32, offset: 352)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1466, file: !35, line: 4004, baseType: !1004, size: 32, align: 32, offset: 384)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1466, file: !35, line: 4005, baseType: !1004, size: 32, align: 32, offset: 416)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1466, file: !35, line: 4010, baseType: !1004, size: 32, align: 32, offset: 448)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1466, file: !35, line: 4011, baseType: !1004, size: 32, align: 32, offset: 480)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1466, file: !35, line: 4020, baseType: !1133, size: 64, align: 32, offset: 512)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1466, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1466, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1466, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1466, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1466, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1466, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1466, file: !35, line: 4039, baseType: !1004, size: 32, align: 32, offset: 768)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1466, file: !35, line: 4046, baseType: !1151, size: 64, align: 64, offset: 832)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1466, file: !35, line: 4050, baseType: !1004, size: 32, align: 32, offset: 896)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1466, file: !35, line: 4054, baseType: !1004, size: 32, align: 32, offset: 928)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1466, file: !35, line: 4061, baseType: !1004, size: 32, align: 32, offset: 960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1466, file: !35, line: 4065, baseType: !1004, size: 32, align: 32, offset: 992)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1466, file: !35, line: 4073, baseType: !1004, size: 32, align: 32, offset: 1024)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1466, file: !35, line: 4080, baseType: !1004, size: 32, align: 32, offset: 1056)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1466, file: !35, line: 4084, baseType: !1004, size: 32, align: 32, offset: 1088)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1431, file: !35, line: 5781, baseType: !1464, size: 64, align: 64, offset: 320)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1431, file: !35, line: 5787, baseType: !1133, size: 64, align: 32, offset: 384)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1431, file: !35, line: 5793, baseType: !1133, size: 64, align: 32, offset: 448)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1425, file: !1182, line: 126, baseType: !1004, size: 32, align: 32, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1392, file: !1182, line: 172, baseType: !1243, size: 64, align: 64, offset: 576)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1392, file: !1182, line: 177, baseType: !1195, size: 64, align: 64, offset: 640)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1392, file: !1182, line: 178, baseType: !1005, size: 32, align: 32, offset: 704)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1392, file: !1182, line: 180, baseType: !1008, size: 64, align: 64, offset: 768)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1392, file: !1182, line: 185, baseType: !1004, size: 32, align: 32, offset: 832)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1392, file: !1182, line: 190, baseType: !1008, size: 64, align: 64, offset: 896)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1392, file: !1182, line: 195, baseType: !1004, size: 32, align: 32, offset: 960)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1392, file: !1182, line: 200, baseType: !1243, size: 64, align: 64, offset: 1024)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1392, file: !1182, line: 201, baseType: !1004, size: 32, align: 32, offset: 1088)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1392, file: !1182, line: 202, baseType: !1375, size: 64, align: 64, offset: 1152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1392, file: !1182, line: 203, baseType: !1004, size: 32, align: 32, offset: 1216)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1392, file: !1182, line: 205, baseType: !1004, size: 32, align: 32, offset: 1248)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1392, file: !1182, line: 206, baseType: !1004, size: 32, align: 32, offset: 1280)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1392, file: !1182, line: 209, baseType: !1351, size: 64, align: 64, offset: 1344)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1392, file: !1182, line: 212, baseType: !1351, size: 64, align: 64, offset: 1408)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1392, file: !1182, line: 213, baseType: !1375, size: 64, align: 64, offset: 1472)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1392, file: !1182, line: 215, baseType: !1004, size: 32, align: 32, offset: 1536)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1392, file: !1182, line: 217, baseType: !1004, size: 32, align: 32, offset: 1568)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1392, file: !1182, line: 220, baseType: !1004, size: 32, align: 32, offset: 1600)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1072, file: !35, line: 1598, baseType: !1008, size: 64, align: 64, offset: 384)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1072, file: !35, line: 1606, baseType: !1237, size: 64, align: 64, offset: 448)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1072, file: !35, line: 1614, baseType: !1004, size: 32, align: 32, offset: 512)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1072, file: !35, line: 1622, baseType: !1004, size: 32, align: 32, offset: 544)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1072, file: !35, line: 1628, baseType: !1004, size: 32, align: 32, offset: 576)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1072, file: !35, line: 1636, baseType: !1004, size: 32, align: 32, offset: 608)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1072, file: !35, line: 1643, baseType: !1004, size: 32, align: 32, offset: 640)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1072, file: !35, line: 1657, baseType: !1195, size: 64, align: 64, offset: 704)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1072, file: !35, line: 1658, baseType: !1004, size: 32, align: 32, offset: 768)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1072, file: !35, line: 1679, baseType: !1133, size: 64, align: 32, offset: 800)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1072, file: !35, line: 1688, baseType: !1004, size: 32, align: 32, offset: 864)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1072, file: !35, line: 1712, baseType: !1004, size: 32, align: 32, offset: 896)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1072, file: !35, line: 1729, baseType: !1004, size: 32, align: 32, offset: 928)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1072, file: !35, line: 1729, baseType: !1004, size: 32, align: 32, offset: 960)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1072, file: !35, line: 1744, baseType: !1004, size: 32, align: 32, offset: 992)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1072, file: !35, line: 1744, baseType: !1004, size: 32, align: 32, offset: 1024)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1072, file: !35, line: 1751, baseType: !1004, size: 32, align: 32, offset: 1056)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1072, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1072, file: !35, line: 1791, baseType: !1539, size: 64, align: 64, offset: 1152)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64, align: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{null, !1542, !1277, !1357, !1004, !1004, !1004}
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1072, file: !35, line: 1808, baseType: !1544, size: 64, align: 64, offset: 1216)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{!494, !1542, !1140}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1072, file: !35, line: 1816, baseType: !1004, size: 32, align: 32, offset: 1280)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1072, file: !35, line: 1825, baseType: !1007, size: 32, align: 32, offset: 1312)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1072, file: !35, line: 1830, baseType: !1004, size: 32, align: 32, offset: 1344)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1072, file: !35, line: 1838, baseType: !1007, size: 32, align: 32, offset: 1376)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1072, file: !35, line: 1846, baseType: !1004, size: 32, align: 32, offset: 1408)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1072, file: !35, line: 1851, baseType: !1004, size: 32, align: 32, offset: 1440)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1072, file: !35, line: 1861, baseType: !1007, size: 32, align: 32, offset: 1472)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1072, file: !35, line: 1868, baseType: !1007, size: 32, align: 32, offset: 1504)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1072, file: !35, line: 1875, baseType: !1007, size: 32, align: 32, offset: 1536)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1072, file: !35, line: 1882, baseType: !1007, size: 32, align: 32, offset: 1568)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1072, file: !35, line: 1889, baseType: !1007, size: 32, align: 32, offset: 1600)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1072, file: !35, line: 1896, baseType: !1007, size: 32, align: 32, offset: 1632)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1072, file: !35, line: 1903, baseType: !1007, size: 32, align: 32, offset: 1664)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1072, file: !35, line: 1910, baseType: !1004, size: 32, align: 32, offset: 1696)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1072, file: !35, line: 1915, baseType: !1004, size: 32, align: 32, offset: 1728)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1072, file: !35, line: 1926, baseType: !1357, size: 64, align: 64, offset: 1792)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1072, file: !35, line: 1935, baseType: !1133, size: 64, align: 32, offset: 1856)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1072, file: !35, line: 1942, baseType: !1004, size: 32, align: 32, offset: 1920)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1072, file: !35, line: 1948, baseType: !1004, size: 32, align: 32, offset: 1952)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1072, file: !35, line: 1954, baseType: !1004, size: 32, align: 32, offset: 1984)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1072, file: !35, line: 1960, baseType: !1004, size: 32, align: 32, offset: 2016)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1072, file: !35, line: 1984, baseType: !1004, size: 32, align: 32, offset: 2048)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1072, file: !35, line: 1991, baseType: !1004, size: 32, align: 32, offset: 2080)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1072, file: !35, line: 1996, baseType: !1004, size: 32, align: 32, offset: 2112)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1072, file: !35, line: 2004, baseType: !1004, size: 32, align: 32, offset: 2144)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1072, file: !35, line: 2011, baseType: !1004, size: 32, align: 32, offset: 2176)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1072, file: !35, line: 2018, baseType: !1004, size: 32, align: 32, offset: 2208)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1072, file: !35, line: 2027, baseType: !1004, size: 32, align: 32, offset: 2240)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1072, file: !35, line: 2034, baseType: !1004, size: 32, align: 32, offset: 2272)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1072, file: !35, line: 2044, baseType: !1004, size: 32, align: 32, offset: 2304)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1072, file: !35, line: 2054, baseType: !1578, size: 64, align: 64, offset: 2368)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1072, file: !35, line: 2061, baseType: !1578, size: 64, align: 64, offset: 2432)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1072, file: !35, line: 2066, baseType: !1004, size: 32, align: 32, offset: 2496)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1072, file: !35, line: 2070, baseType: !1004, size: 32, align: 32, offset: 2528)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1072, file: !35, line: 2078, baseType: !1004, size: 32, align: 32, offset: 2560)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1072, file: !35, line: 2085, baseType: !1004, size: 32, align: 32, offset: 2592)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1072, file: !35, line: 2092, baseType: !1004, size: 32, align: 32, offset: 2624)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1072, file: !35, line: 2099, baseType: !1004, size: 32, align: 32, offset: 2656)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1072, file: !35, line: 2106, baseType: !1004, size: 32, align: 32, offset: 2688)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1072, file: !35, line: 2113, baseType: !1004, size: 32, align: 32, offset: 2720)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1072, file: !35, line: 2120, baseType: !1004, size: 32, align: 32, offset: 2752)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1072, file: !35, line: 2125, baseType: !1004, size: 32, align: 32, offset: 2784)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1072, file: !35, line: 2133, baseType: !1004, size: 32, align: 32, offset: 2816)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1072, file: !35, line: 2140, baseType: !1004, size: 32, align: 32, offset: 2848)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1072, file: !35, line: 2145, baseType: !1004, size: 32, align: 32, offset: 2880)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1072, file: !35, line: 2153, baseType: !1004, size: 32, align: 32, offset: 2912)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1072, file: !35, line: 2158, baseType: !1004, size: 32, align: 32, offset: 2944)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1072, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1072, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1072, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1072, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1072, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1072, file: !35, line: 2203, baseType: !1004, size: 32, align: 32, offset: 3136)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1072, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1072, file: !35, line: 2212, baseType: !1004, size: 32, align: 32, offset: 3200)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1072, file: !35, line: 2213, baseType: !1004, size: 32, align: 32, offset: 3232)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1072, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1072, file: !35, line: 2232, baseType: !1004, size: 32, align: 32, offset: 3296)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1072, file: !35, line: 2243, baseType: !1004, size: 32, align: 32, offset: 3328)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1072, file: !35, line: 2249, baseType: !1004, size: 32, align: 32, offset: 3360)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1072, file: !35, line: 2256, baseType: !1004, size: 32, align: 32, offset: 3392)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1072, file: !35, line: 2263, baseType: !1151, size: 64, align: 64, offset: 3456)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1072, file: !35, line: 2270, baseType: !1151, size: 64, align: 64, offset: 3520)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1072, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1072, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1072, file: !35, line: 2367, baseType: !1614, size: 64, align: 64, offset: 3648)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{!1004, !1542, !1375, !1004}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1072, file: !35, line: 2383, baseType: !1004, size: 32, align: 32, offset: 3712)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1072, file: !35, line: 2386, baseType: !1007, size: 32, align: 32, offset: 3744)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1072, file: !35, line: 2387, baseType: !1007, size: 32, align: 32, offset: 3776)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1072, file: !35, line: 2394, baseType: !1004, size: 32, align: 32, offset: 3808)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1072, file: !35, line: 2401, baseType: !1004, size: 32, align: 32, offset: 3840)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1072, file: !35, line: 2408, baseType: !1004, size: 32, align: 32, offset: 3872)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1072, file: !35, line: 2415, baseType: !1004, size: 32, align: 32, offset: 3904)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1072, file: !35, line: 2422, baseType: !1004, size: 32, align: 32, offset: 3936)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1072, file: !35, line: 2423, baseType: !1626, size: 64, align: 64, offset: 3968)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1628, file: !35, line: 827, baseType: !1004, size: 32, align: 32)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1628, file: !35, line: 828, baseType: !1004, size: 32, align: 32, offset: 32)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1628, file: !35, line: 829, baseType: !1004, size: 32, align: 32, offset: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1628, file: !35, line: 830, baseType: !1007, size: 32, align: 32, offset: 96)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1072, file: !35, line: 2430, baseType: !1237, size: 64, align: 64, offset: 4032)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1072, file: !35, line: 2437, baseType: !1237, size: 64, align: 64, offset: 4096)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1072, file: !35, line: 2444, baseType: !1007, size: 32, align: 32, offset: 4160)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1072, file: !35, line: 2451, baseType: !1007, size: 32, align: 32, offset: 4192)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1072, file: !35, line: 2458, baseType: !1004, size: 32, align: 32, offset: 4224)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1072, file: !35, line: 2469, baseType: !1004, size: 32, align: 32, offset: 4256)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1072, file: !35, line: 2475, baseType: !1004, size: 32, align: 32, offset: 4288)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1072, file: !35, line: 2481, baseType: !1004, size: 32, align: 32, offset: 4320)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1072, file: !35, line: 2485, baseType: !1004, size: 32, align: 32, offset: 4352)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1072, file: !35, line: 2489, baseType: !1004, size: 32, align: 32, offset: 4384)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1072, file: !35, line: 2493, baseType: !1004, size: 32, align: 32, offset: 4416)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1072, file: !35, line: 2501, baseType: !1004, size: 32, align: 32, offset: 4448)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1072, file: !35, line: 2506, baseType: !1004, size: 32, align: 32, offset: 4480)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1072, file: !35, line: 2510, baseType: !1004, size: 32, align: 32, offset: 4512)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1072, file: !35, line: 2514, baseType: !1237, size: 64, align: 64, offset: 4544)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1072, file: !35, line: 2528, baseType: !1650, size: 64, align: 64, offset: 4608)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{null, !1542, !1008, !1004, !1004}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1072, file: !35, line: 2534, baseType: !1004, size: 32, align: 32, offset: 4672)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1072, file: !35, line: 2545, baseType: !1004, size: 32, align: 32, offset: 4704)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1072, file: !35, line: 2547, baseType: !1004, size: 32, align: 32, offset: 4736)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1072, file: !35, line: 2549, baseType: !1004, size: 32, align: 32, offset: 4768)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1072, file: !35, line: 2551, baseType: !1004, size: 32, align: 32, offset: 4800)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1072, file: !35, line: 2553, baseType: !1004, size: 32, align: 32, offset: 4832)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1072, file: !35, line: 2555, baseType: !1004, size: 32, align: 32, offset: 4864)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1072, file: !35, line: 2557, baseType: !1004, size: 32, align: 32, offset: 4896)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1072, file: !35, line: 2559, baseType: !1004, size: 32, align: 32, offset: 4928)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1072, file: !35, line: 2563, baseType: !1004, size: 32, align: 32, offset: 4960)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1072, file: !35, line: 2571, baseType: !1233, size: 64, align: 64, offset: 4992)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1072, file: !35, line: 2579, baseType: !1233, size: 64, align: 64, offset: 5056)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1072, file: !35, line: 2586, baseType: !1004, size: 32, align: 32, offset: 5120)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1072, file: !35, line: 2615, baseType: !1004, size: 32, align: 32, offset: 5152)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1072, file: !35, line: 2627, baseType: !1004, size: 32, align: 32, offset: 5184)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1072, file: !35, line: 2637, baseType: !1004, size: 32, align: 32, offset: 5216)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1072, file: !35, line: 2681, baseType: !1004, size: 32, align: 32, offset: 5248)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1072, file: !35, line: 2709, baseType: !1237, size: 64, align: 64, offset: 5312)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1072, file: !35, line: 2716, baseType: !1672, size: 64, align: 64, offset: 5376)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1674)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1675)
!1675 = !{!1676, !1677, !1678, !1679, !1680, !1681, !1682, !1686, !1690, !1691, !1692, !1693, !1699, !1700, !1701, !1702, !1703}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1674, file: !35, line: 3642, baseType: !1081, size: 64, align: 64)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1674, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1674, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1674, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1674, file: !35, line: 3669, baseType: !1004, size: 32, align: 32, offset: 160)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1674, file: !35, line: 3682, baseType: !1372, size: 64, align: 64, offset: 192)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1674, file: !35, line: 3698, baseType: !1683, size: 64, align: 64, offset: 256)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DISubroutineType(types: !1685)
!1685 = !{!1004, !1070, !1017, !1015}
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1674, file: !35, line: 3712, baseType: !1687, size: 64, align: 64, offset: 320)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!1004, !1070, !1004, !1017, !1015}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1674, file: !35, line: 3726, baseType: !1683, size: 64, align: 64, offset: 384)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1674, file: !35, line: 3737, baseType: !1168, size: 64, align: 64, offset: 448)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1674, file: !35, line: 3746, baseType: !1004, size: 32, align: 32, offset: 512)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1674, file: !35, line: 3757, baseType: !1694, size: 64, align: 64, offset: 576)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{null, !1697}
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1674, file: !35, line: 3766, baseType: !1168, size: 64, align: 64, offset: 640)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1674, file: !35, line: 3774, baseType: !1168, size: 64, align: 64, offset: 704)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1674, file: !35, line: 3780, baseType: !1004, size: 32, align: 32, offset: 768)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1674, file: !35, line: 3785, baseType: !1004, size: 32, align: 32, offset: 800)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1674, file: !35, line: 3795, baseType: !1704, size: 64, align: 64, offset: 832)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1705, size: 64, align: 64)
!1705 = !DISubroutineType(types: !1706)
!1706 = !{!1004, !1070, !1248}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1072, file: !35, line: 2728, baseType: !1008, size: 64, align: 64, offset: 5440)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1072, file: !35, line: 2735, baseType: !1301, size: 512, align: 64, offset: 5504)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1072, file: !35, line: 2742, baseType: !1004, size: 32, align: 32, offset: 6016)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1072, file: !35, line: 2755, baseType: !1004, size: 32, align: 32, offset: 6048)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1072, file: !35, line: 2776, baseType: !1004, size: 32, align: 32, offset: 6080)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1072, file: !35, line: 2783, baseType: !1004, size: 32, align: 32, offset: 6112)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1072, file: !35, line: 2791, baseType: !1004, size: 32, align: 32, offset: 6144)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1072, file: !35, line: 2802, baseType: !1375, size: 64, align: 64, offset: 6208)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1072, file: !35, line: 2811, baseType: !1004, size: 32, align: 32, offset: 6272)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1072, file: !35, line: 2821, baseType: !1004, size: 32, align: 32, offset: 6304)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1072, file: !35, line: 2830, baseType: !1004, size: 32, align: 32, offset: 6336)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1072, file: !35, line: 2840, baseType: !1004, size: 32, align: 32, offset: 6368)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1072, file: !35, line: 2851, baseType: !1720, size: 64, align: 64, offset: 6400)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DISubroutineType(types: !1722)
!1722 = !{!1004, !1542, !1723, !1008, !1357, !1004, !1004}
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{!1004, !1542, !1008}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1072, file: !35, line: 2871, baseType: !1727, size: 64, align: 64, offset: 6464)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64, align: 64)
!1728 = !DISubroutineType(types: !1729)
!1729 = !{!1004, !1542, !1730, !1008, !1357, !1004}
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64, align: 64)
!1731 = !DISubroutineType(types: !1732)
!1732 = !{!1004, !1542, !1008, !1004, !1004}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1072, file: !35, line: 2878, baseType: !1004, size: 32, align: 32, offset: 6528)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1072, file: !35, line: 2885, baseType: !1004, size: 32, align: 32, offset: 6560)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1072, file: !35, line: 3005, baseType: !1004, size: 32, align: 32, offset: 6592)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1072, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1072, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1072, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1072, file: !35, line: 3037, baseType: !1195, size: 64, align: 64, offset: 6720)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1072, file: !35, line: 3038, baseType: !1004, size: 32, align: 32, offset: 6784)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1072, file: !35, line: 3050, baseType: !1151, size: 64, align: 64, offset: 6848)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1072, file: !35, line: 3065, baseType: !1004, size: 32, align: 32, offset: 6912)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1072, file: !35, line: 3083, baseType: !1004, size: 32, align: 32, offset: 6944)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1072, file: !35, line: 3092, baseType: !1133, size: 64, align: 32, offset: 6976)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1072, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1072, file: !35, line: 3106, baseType: !1133, size: 64, align: 32, offset: 7072)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1072, file: !35, line: 3113, baseType: !1748, size: 64, align: 64, offset: 7168)
!1748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1749, size: 64, align: 64)
!1749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1750)
!1750 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1751)
!1751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1752)
!1752 = !{!1753, !1754, !1755, !1756, !1757, !1758, !1761}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1751, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1751, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1751, file: !35, line: 720, baseType: !1081, size: 64, align: 64, offset: 64)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1751, file: !35, line: 724, baseType: !1081, size: 64, align: 64, offset: 128)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1751, file: !35, line: 728, baseType: !1004, size: 32, align: 32, offset: 192)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1751, file: !35, line: 734, baseType: !1759, size: 64, align: 64, offset: 256)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64, align: 64)
!1760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1081)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1751, file: !35, line: 739, baseType: !1762, size: 64, align: 64, offset: 320)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64, align: 64)
!1763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1159)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1072, file: !35, line: 3129, baseType: !1237, size: 64, align: 64, offset: 7232)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1072, file: !35, line: 3130, baseType: !1237, size: 64, align: 64, offset: 7296)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1072, file: !35, line: 3131, baseType: !1237, size: 64, align: 64, offset: 7360)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1072, file: !35, line: 3132, baseType: !1237, size: 64, align: 64, offset: 7424)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1072, file: !35, line: 3139, baseType: !1233, size: 64, align: 64, offset: 7488)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1072, file: !35, line: 3147, baseType: !1004, size: 32, align: 32, offset: 7552)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1072, file: !35, line: 3165, baseType: !1004, size: 32, align: 32, offset: 7584)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1072, file: !35, line: 3172, baseType: !1004, size: 32, align: 32, offset: 7616)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1072, file: !35, line: 3180, baseType: !1004, size: 32, align: 32, offset: 7648)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1072, file: !35, line: 3191, baseType: !1578, size: 64, align: 64, offset: 7680)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1072, file: !35, line: 3199, baseType: !1195, size: 64, align: 64, offset: 7744)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1072, file: !35, line: 3207, baseType: !1233, size: 64, align: 64, offset: 7808)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1072, file: !35, line: 3214, baseType: !1005, size: 32, align: 32, offset: 7872)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1072, file: !35, line: 3224, baseType: !1266, size: 64, align: 64, offset: 7936)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1072, file: !35, line: 3225, baseType: !1004, size: 32, align: 32, offset: 8000)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1072, file: !35, line: 3249, baseType: !1248, size: 64, align: 64, offset: 8064)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1072, file: !35, line: 3256, baseType: !1004, size: 32, align: 32, offset: 8128)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1072, file: !35, line: 3271, baseType: !1004, size: 32, align: 32, offset: 8160)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1072, file: !35, line: 3279, baseType: !1237, size: 64, align: 64, offset: 8192)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1072, file: !35, line: 3301, baseType: !1248, size: 64, align: 64, offset: 8256)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1072, file: !35, line: 3310, baseType: !1004, size: 32, align: 32, offset: 8320)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1072, file: !35, line: 3337, baseType: !1004, size: 32, align: 32, offset: 8352)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1072, file: !35, line: 3351, baseType: !1004, size: 32, align: 32, offset: 8384)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1072, file: !35, line: 3359, baseType: !1004, size: 32, align: 32, offset: 8416)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1067, file: !1066, line: 60, baseType: !1789, size: 256, align: 64, offset: 64)
!1789 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1790, line: 70, baseType: !1791)
!1790 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1790, line: 61, size: 256, align: 64, elements: !1792)
!1792 = !{!1793, !1794, !1795, !1796, !1797}
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1791, file: !1790, line: 62, baseType: !1017, size: 64, align: 64)
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1791, file: !1790, line: 62, baseType: !1017, size: 64, align: 64, offset: 64)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1791, file: !1790, line: 67, baseType: !1004, size: 32, align: 32, offset: 128)
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1791, file: !1790, line: 68, baseType: !1004, size: 32, align: 32, offset: 160)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1791, file: !1790, line: 69, baseType: !1004, size: 32, align: 32, offset: 192)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1067, file: !1066, line: 62, baseType: !1004, size: 32, align: 32, offset: 320)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "ch_mask", scope: !1067, file: !1066, line: 63, baseType: !1004, size: 32, align: 32, offset: 352)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1067, file: !1066, line: 64, baseType: !1004, size: 32, align: 32, offset: 384)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_orig", scope: !1067, file: !1066, line: 65, baseType: !1004, size: 32, align: 32, offset: 416)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_scaled", scope: !1067, file: !1066, line: 66, baseType: !1004, size: 32, align: 32, offset: 448)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "nchannels", scope: !1067, file: !1066, line: 68, baseType: !1004, size: 32, align: 32, offset: 480)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "nchannels_total", scope: !1067, file: !1066, line: 69, baseType: !1004, size: 32, align: 32, offset: 512)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "freq_range", scope: !1067, file: !1066, line: 70, baseType: !1004, size: 32, align: 32, offset: 544)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "band_limit", scope: !1067, file: !1066, line: 71, baseType: !1004, size: 32, align: 32, offset: 576)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "limited_rate", scope: !1067, file: !1066, line: 72, baseType: !1004, size: 32, align: 32, offset: 608)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "limited_range", scope: !1067, file: !1066, line: 73, baseType: !1004, size: 32, align: 32, offset: 640)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "res_profile", scope: !1067, file: !1066, line: 74, baseType: !1004, size: 32, align: 32, offset: 672)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "nsubbands", scope: !1067, file: !1066, line: 75, baseType: !1004, size: 32, align: 32, offset: 704)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "g3_avg_only_start_sb", scope: !1067, file: !1066, line: 76, baseType: !1004, size: 32, align: 32, offset: 736)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "min_mono_subband", scope: !1067, file: !1066, line: 77, baseType: !1004, size: 32, align: 32, offset: 768)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "max_mono_subband", scope: !1067, file: !1066, line: 78, baseType: !1004, size: 32, align: 32, offset: 800)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "framenum", scope: !1067, file: !1066, line: 80, baseType: !1004, size: 32, align: 32, offset: 832)
