; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswresample--resample_dsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswresample--resample_dsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ResampleContext = type { %struct.AVClass*, i8*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, double, double, i32, i32, i32, i32, %struct.anon }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.anon = type { void (i8*, i8*, i32, i64, i64)*, i32 (%struct.ResampleContext*, i8*, i8*, i32, i32)*, i32 (%struct.ResampleContext*, i8*, i8*, i32, i32)* }

; Function Attrs: nounwind uwtable
define void @swri_resample_dsp_init(%struct.ResampleContext* %c) #0 !dbg !64 {
entry:
  %c.addr = alloca %struct.ResampleContext*, align 8
  store %struct.ResampleContext* %c, %struct.ResampleContext** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.ResampleContext** %c.addr, metadata !157, metadata !158), !dbg !159
  %0 = load %struct.ResampleContext*, %struct.ResampleContext** %c.addr, align 8, !dbg !160
  %format = getelementptr inbounds %struct.ResampleContext, %struct.ResampleContext* %0, i32 0, i32 17, !dbg !161

!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwrFilterType", file: !25, line: 166, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "libswresample/swresample.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "SWR_FILTER_TYPE_CUBIC", value: 0)
!28 = !DIEnumerator(name: "SWR_FILTER_TYPE_BLACKMAN_NUTTALL", value: 1)
!29 = !DIEnumerator(name: "SWR_FILTER_TYPE_KAISER", value: 2)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !31, line: 58, size: 32, align: 32, elements: !32)
!31 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!32 = !{!33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!33 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!34 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!35 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!36 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!37 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!38 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!39 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!40 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!41 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!42 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!43 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!44 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!45 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!46 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!47 = !{!48, !52, !54, !56, !57, !58, !59, !60}
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !50, line: 37, baseType: !51)
!50 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!51 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !50, line: 38, baseType: !53)
!53 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !50, line: 40, baseType: !55)
!55 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!64 = distinct !DISubprogram(name: "swri_resample_dsp_init", scope: !65, file: !65, line: 46, type: !66, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !156)
!65 = !DIFile(filename: "libswresample/resample_dsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "ResampleContext", file: !70, line: 61, baseType: !71)
!70 = !DIFile(filename: "libswresample/resample.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ResampleContext", file: !70, line: 30, size: 1024, align: 64, elements: !72)
!72 = !{!73, !118, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !71, file: !70, line: 31, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !78)
!78 = !{!79, !83, !88, !92, !93, !94, !95, !99, !105, !107, !111}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !77, file: !4, line: 72, baseType: !80, size: 64, align: 64)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !77, file: !4, line: 78, baseType: !84, size: 64, align: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DISubroutineType(types: !86)
!86 = !{!80, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !77, file: !4, line: 85, baseType: !89, size: 64, align: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !77, file: !4, line: 93, baseType: !53, size: 32, align: 32, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !77, file: !4, line: 99, baseType: !53, size: 32, align: 32, offset: 224)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !77, file: !4, line: 108, baseType: !53, size: 32, align: 32, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !77, file: !4, line: 113, baseType: !96, size: 64, align: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!87, !87, !87}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !77, file: !4, line: 123, baseType: !100, size: 64, align: 64, offset: 384)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64)
!101 = !DISubroutineType(types: !102)
!102 = !{!103, !103}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !77, file: !4, line: 130, baseType: !106, size: 32, align: 32, offset: 448)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !77, file: !4, line: 136, baseType: !108, size: 64, align: 64, offset: 512)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!106, !87}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !77, file: !4, line: 142, baseType: !112, size: 64, align: 64, offset: 576)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!53, !115, !87, !80, !53}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64, align: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "filter_bank", scope: !71, file: !70, line: 32, baseType: !119, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !50, line: 48, baseType: !121)
!121 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "filter_length", scope: !71, file: !70, line: 33, baseType: !53, size: 32, align: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "filter_alloc", scope: !71, file: !70, line: 34, baseType: !53, size: 32, align: 32, offset: 160)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "ideal_dst_incr", scope: !71, file: !70, line: 35, baseType: !53, size: 32, align: 32, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dst_incr", scope: !71, file: !70, line: 36, baseType: !53, size: 32, align: 32, offset: 224)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dst_incr_div", scope: !71, file: !70, line: 37, baseType: !53, size: 32, align: 32, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dst_incr_mod", scope: !71, file: !70, line: 38, baseType: !53, size: 32, align: 32, offset: 288)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !71, file: !70, line: 39, baseType: !53, size: 32, align: 32, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "frac", scope: !71, file: !70, line: 40, baseType: !53, size: 32, align: 32, offset: 352)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "src_incr", scope: !71, file: !70, line: 41, baseType: !53, size: 32, align: 32, offset: 384)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "compensation_distance", scope: !71, file: !70, line: 42, baseType: !53, size: 32, align: 32, offset: 416)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "phase_count", scope: !71, file: !70, line: 43, baseType: !53, size: 32, align: 32, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "linear", scope: !71, file: !70, line: 44, baseType: !53, size: 32, align: 32, offset: 480)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !71, file: !70, line: 45, baseType: !24, size: 32, align: 32, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "kaiser_beta", scope: !71, file: !70, line: 46, baseType: !60, size: 64, align: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "factor", scope: !71, file: !70, line: 47, baseType: !60, size: 64, align: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !71, file: !70, line: 48, baseType: !30, size: 32, align: 32, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "felem_size", scope: !71, file: !70, line: 49, baseType: !53, size: 32, align: 32, offset: 736)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "filter_shift", scope: !71, file: !70, line: 50, baseType: !53, size: 32, align: 32, offset: 768)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "phase_count_compensation", scope: !71, file: !70, line: 51, baseType: !53, size: 32, align: 32, offset: 800)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !71, file: !70, line: 60, baseType: !142, size: 192, align: 64, offset: 832)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !71, file: !70, line: 53, size: 192, align: 64, elements: !143)
!143 = !{!144, !150, !155}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "resample_one", scope: !142, file: !70, line: 54, baseType: !145, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !87, !148, !53, !54, !54}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "resample_common", scope: !142, file: !70, line: 56, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DISubroutineType(types: !153)
!153 = !{!53, !154, !87, !148, !53, !53}
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "resample_linear", scope: !142, file: !70, line: 58, baseType: !151, size: 64, align: 64, offset: 128)
!156 = !{}
!157 = !DILocalVariable(name: "c", arg: 1, scope: !64, file: !65, line: 46, type: !68)
!158 = !DIExpression()
!159 = !DILocation(line: 46, column: 46, scope: !64)
!160 = !DILocation(line: 48, column: 12, scope: !64)
!161 = !DILocation(line: 48, column: 15, scope: !64)
!162 = !DILocation(line: 48, column: 5, scope: !64)
!163 = !DILocation(line: 50, column: 9, scope: !164)
!164 = distinct !DILexicalBlock(scope: !64, file: !65, line: 48, column: 22)
!165 = !DILocation(line: 50, column: 12, scope: !164)
!166 = !DILocation(line: 50, column: 16, scope: !164)
!167 = !DILocation(line: 50, column: 29, scope: !164)
!168 = !DILocation(line: 51, column: 9, scope: !164)
!169 = !DILocation(line: 51, column: 12, scope: !164)
!170 = !DILocation(line: 51, column: 16, scope: !164)
!171 = !DILocation(line: 51, column: 32, scope: !164)
!172 = !DILocation(line: 52, column: 9, scope: !164)
!173 = !DILocation(line: 52, column: 12, scope: !164)
!174 = !DILocation(line: 52, column: 16, scope: !164)
!175 = !DILocation(line: 52, column: 32, scope: !164)
!176 = !DILocation(line: 53, column: 9, scope: !164)
!177 = !DILocation(line: 55, column: 9, scope: !164)
!178 = !DILocation(line: 55, column: 12, scope: !164)
!179 = !DILocation(line: 55, column: 16, scope: !164)
!180 = !DILocation(line: 55, column: 29, scope: !164)
!181 = !DILocation(line: 56, column: 9, scope: !164)
!182 = !DILocation(line: 56, column: 12, scope: !164)
!183 = !DILocation(line: 56, column: 16, scope: !164)
!184 = !DILocation(line: 56, column: 32, scope: !164)
!185 = !DILocation(line: 57, column: 9, scope: !164)
!186 = !DILocation(line: 57, column: 12, scope: !164)
!187 = !DILocation(line: 57, column: 16, scope: !164)
!188 = !DILocation(line: 57, column: 32, scope: !164)
!189 = !DILocation(line: 58, column: 9, scope: !164)
!190 = !DILocation(line: 60, column: 9, scope: !164)
!191 = !DILocation(line: 60, column: 12, scope: !164)
!192 = !DILocation(line: 60, column: 16, scope: !164)
!193 = !DILocation(line: 60, column: 29, scope: !164)
!194 = !DILocation(line: 61, column: 9, scope: !164)
!195 = !DILocation(line: 61, column: 12, scope: !164)
!196 = !DILocation(line: 61, column: 16, scope: !164)
!197 = !DILocation(line: 61, column: 32, scope: !164)
!198 = !DILocation(line: 62, column: 9, scope: !164)
!199 = !DILocation(line: 62, column: 12, scope: !164)
!200 = !DILocation(line: 62, column: 16, scope: !164)
!201 = !DILocation(line: 62, column: 32, scope: !164)
!202 = !DILocation(line: 63, column: 9, scope: !164)
!203 = !DILocation(line: 65, column: 9, scope: !164)
!204 = !DILocation(line: 65, column: 12, scope: !164)
!205 = !DILocation(line: 65, column: 16, scope: !164)
!206 = !DILocation(line: 65, column: 29, scope: !164)
!207 = !DILocation(line: 66, column: 9, scope: !164)
!208 = !DILocation(line: 66, column: 12, scope: !164)
!209 = !DILocation(line: 66, column: 16, scope: !164)
!210 = !DILocation(line: 66, column: 32, scope: !164)
!211 = !DILocation(line: 67, column: 9, scope: !164)
!212 = !DILocation(line: 67, column: 12, scope: !164)
!213 = !DILocation(line: 67, column: 16, scope: !164)
!214 = !DILocation(line: 67, column: 32, scope: !164)
!215 = !DILocation(line: 68, column: 9, scope: !164)
!216 = !DILocation(line: 71, column: 39, scope: !217)
!217 = distinct !DILexicalBlock(scope: !64, file: !65, line: 71, column: 9)
!218 = !DILocation(line: 71, column: 12, scope: !217)
!219 = !DILocation(line: 74, column: 1, scope: !64)
!220 = distinct !DISubprogram(name: "resample_one_int16", scope: !221, file: !221, line: 75, type: !146, isLocal: true, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !156)
!221 = !DIFile(filename: "libswresample/resample_template.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
