; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--teeproto.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--teeproto.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, globals: !46)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--teeproto.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !{!47, !257, !259, !260}
!47 = distinct !DIGlobalVariable(name: "ff_tee_protocol", scope: !0, file: !48, line: 139, type: !49, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_tee_protocol)
!48 = !DIFile(filename: "libavformat/teeproto.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !51, line: 100, baseType: !52)
!51 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !51, line: 54, size: 1600, align: 64, elements: !53)
!53 = !{!54, !58, !174, !183, !188, !192, !198, !204, !208, !209, !213, !217, !218, !224, !225, !226, !227, !228, !229, !230, !231, !250, !251, !252, !256}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !51, line: 55, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !52, file: !51, line: 56, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!62, !63, !55, !62}
!62 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !51, line: 52, baseType: !65)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !51, line: 38, size: 768, align: 64, elements: !66)
!66 = !{!67, !150, !153, !154, !156, !157, !158, !159, !160, !170, !171, !172, !173}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !65, file: !51, line: 39, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !70)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !72)
!72 = !{!73, !74, !79, !109, !110, !111, !112, !116, !122, !124, !128}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !71, file: !26, line: 72, baseType: !55, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !71, file: !26, line: 78, baseType: !75, size: 64, align: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!55, !78}
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !71, file: !26, line: 85, baseType: !80, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !83)
!83 = !{!84, !85, !86, !87, !88, !105, !106, !107, !108}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !82, file: !4, line: 247, baseType: !55, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !82, file: !4, line: 253, baseType: !55, size: 64, align: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !82, file: !4, line: 259, baseType: !62, size: 32, align: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !82, file: !4, line: 271, baseType: !89, size: 64, align: 64, offset: 192)
!89 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !82, file: !4, line: 265, size: 64, align: 64, elements: !90)
!90 = !{!91, !95, !97, !98}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !89, file: !4, line: 266, baseType: !92, size: 64, align: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !93, line: 40, baseType: !94)
!93 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!94 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !89, file: !4, line: 267, baseType: !96, size: 64, align: 64)
!96 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !89, file: !4, line: 268, baseType: !55, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !89, file: !4, line: 270, baseType: !99, size: 64, align: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !100, line: 61, baseType: !101)
!100 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !100, line: 58, size: 64, align: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !101, file: !100, line: 59, baseType: !62, size: 32, align: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !101, file: !100, line: 60, baseType: !62, size: 32, align: 32, offset: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !82, file: !4, line: 272, baseType: !96, size: 64, align: 64, offset: 256)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !82, file: !4, line: 273, baseType: !96, size: 64, align: 64, offset: 320)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !82, file: !4, line: 275, baseType: !62, size: 32, align: 32, offset: 384)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !82, file: !4, line: 300, baseType: !55, size: 64, align: 64, offset: 448)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !71, file: !26, line: 93, baseType: !62, size: 32, align: 32, offset: 192)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !71, file: !26, line: 99, baseType: !62, size: 32, align: 32, offset: 224)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !71, file: !26, line: 108, baseType: !62, size: 32, align: 32, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !71, file: !26, line: 113, baseType: !113, size: 64, align: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64, align: 64)
!114 = !DISubroutineType(types: !115)
!115 = !{!78, !78, !78}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !71, file: !26, line: 123, baseType: !117, size: 64, align: 64, offset: 384)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64, align: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!120, !120}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !71, file: !26, line: 130, baseType: !123, size: 32, align: 32, offset: 448)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !71, file: !26, line: 136, baseType: !125, size: 64, align: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64, align: 64)
!126 = !DISubroutineType(types: !127)
!127 = !{!123, !78}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !71, file: !26, line: 142, baseType: !129, size: 64, align: 64, offset: 576)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!62, !132, !78, !55, !62}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64, align: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !135)
!135 = !{!136, !148, !149}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !134, file: !4, line: 360, baseType: !137, size: 64, align: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64, align: 64)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !141)
!141 = !{!142, !143, !144, !145, !146, !147}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !140, file: !4, line: 307, baseType: !55, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !140, file: !4, line: 313, baseType: !96, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !140, file: !4, line: 313, baseType: !96, size: 64, align: 64, offset: 128)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !140, file: !4, line: 318, baseType: !96, size: 64, align: 64, offset: 192)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !140, file: !4, line: 318, baseType: !96, size: 64, align: 64, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !140, file: !4, line: 323, baseType: !62, size: 32, align: 32, offset: 320)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !134, file: !4, line: 364, baseType: !62, size: 32, align: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !134, file: !4, line: 368, baseType: !62, size: 32, align: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !65, file: !51, line: 40, baseType: !151, size: 64, align: 64, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !65, file: !51, line: 41, baseType: !78, size: 64, align: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !65, file: !51, line: 42, baseType: !155, size: 64, align: 64, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !65, file: !51, line: 43, baseType: !62, size: 32, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !65, file: !51, line: 44, baseType: !62, size: 32, align: 32, offset: 288)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !65, file: !51, line: 45, baseType: !62, size: 32, align: 32, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !65, file: !51, line: 46, baseType: !62, size: 32, align: 32, offset: 352)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !65, file: !51, line: 47, baseType: !161, size: 128, align: 64, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !162, line: 61, baseType: !163)
!162 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !162, line: 58, size: 128, align: 64, elements: !164)
!164 = !{!165, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !163, file: !162, line: 59, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!62, !78}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !163, file: !162, line: 60, baseType: !78, size: 64, align: 64, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !65, file: !51, line: 48, baseType: !92, size: 64, align: 64, offset: 512)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !65, file: !51, line: 49, baseType: !55, size: 64, align: 64, offset: 576)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !65, file: !51, line: 50, baseType: !55, size: 64, align: 64, offset: 640)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !65, file: !51, line: 51, baseType: !62, size: 32, align: 32, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !52, file: !51, line: 62, baseType: !175, size: 64, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!62, !63, !55, !62, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !181, line: 86, baseType: !182)
!181 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !181, line: 86, flags: DIFlagFwdDecl)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !52, file: !51, line: 63, baseType: !184, size: 64, align: 64, offset: 192)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DISubroutineType(types: !186)
!186 = !{!62, !63, !187}
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !52, file: !51, line: 64, baseType: !189, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = !DISubroutineType(types: !191)
!191 = !{!62, !63}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !52, file: !51, line: 78, baseType: !193, size: 64, align: 64, offset: 320)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DISubroutineType(types: !195)
!195 = !{!62, !63, !196, !62}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !52, file: !51, line: 79, baseType: !199, size: 64, align: 64, offset: 384)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DISubroutineType(types: !201)
!201 = !{!62, !63, !202, !62}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !52, file: !51, line: 80, baseType: !205, size: 64, align: 64, offset: 448)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DISubroutineType(types: !207)
!207 = !{!92, !63, !92, !62}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !52, file: !51, line: 81, baseType: !189, size: 64, align: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !52, file: !51, line: 82, baseType: !210, size: 64, align: 64, offset: 576)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!62, !63, !62}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !52, file: !51, line: 83, baseType: !214, size: 64, align: 64, offset: 640)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64, align: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!92, !63, !62, !92, !62}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !52, file: !51, line: 85, baseType: !189, size: 64, align: 64, offset: 704)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !52, file: !51, line: 86, baseType: !219, size: 64, align: 64, offset: 768)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64, align: 64)
!220 = !DISubroutineType(types: !221)
!221 = !{!62, !63, !222, !223}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64, align: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !52, file: !51, line: 88, baseType: !189, size: 64, align: 64, offset: 832)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !52, file: !51, line: 89, baseType: !210, size: 64, align: 64, offset: 896)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !52, file: !51, line: 90, baseType: !62, size: 32, align: 32, offset: 960)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !52, file: !51, line: 91, baseType: !68, size: 64, align: 64, offset: 1024)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !52, file: !51, line: 92, baseType: !62, size: 32, align: 32, offset: 1088)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !52, file: !51, line: 93, baseType: !210, size: 64, align: 64, offset: 1152)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !52, file: !51, line: 94, baseType: !189, size: 64, align: 64, offset: 1216)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !52, file: !51, line: 95, baseType: !232, size: 64, align: 64, offset: 1280)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!62, !63, !235}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !162, line: 101, baseType: !238)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !162, line: 86, size: 576, align: 64, elements: !239)
!239 = !{!240, !241, !242, !243, !244, !245, !246, !247, !248, !249}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !238, file: !162, line: 87, baseType: !155, size: 64, align: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !238, file: !162, line: 88, baseType: !62, size: 32, align: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !238, file: !162, line: 89, baseType: !62, size: 32, align: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !238, file: !162, line: 91, baseType: !92, size: 64, align: 64, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !238, file: !162, line: 92, baseType: !92, size: 64, align: 64, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !238, file: !162, line: 94, baseType: !92, size: 64, align: 64, offset: 256)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !238, file: !162, line: 96, baseType: !92, size: 64, align: 64, offset: 320)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !238, file: !162, line: 98, baseType: !92, size: 64, align: 64, offset: 384)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !238, file: !162, line: 99, baseType: !92, size: 64, align: 64, offset: 448)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !238, file: !162, line: 100, baseType: !92, size: 64, align: 64, offset: 512)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !52, file: !51, line: 96, baseType: !189, size: 64, align: 64, offset: 1344)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !52, file: !51, line: 97, baseType: !189, size: 64, align: 64, offset: 1408)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !52, file: !51, line: 98, baseType: !253, size: 64, align: 64, offset: 1472)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64, align: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{!62, !63, !63}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !52, file: !51, line: 99, baseType: !55, size: 64, align: 64, offset: 1536)
!257 = distinct !DIGlobalVariable(name: "child_delim", scope: !0, file: !48, line: 49, type: !258, isLocal: true, isDefinition: true, variable: i8** @child_delim)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!259 = distinct !DIGlobalVariable(name: "tee_class", scope: !0, file: !48, line: 42, type: !69, isLocal: true, isDefinition: true, variable: %struct.AVClass* @tee_class)
!260 = distinct !DIGlobalVariable(name: "tee_options", scope: !0, file: !48, line: 38, type: !261, isLocal: true, isDefinition: true, variable: [1 x %struct.AVOption]* @tee_options)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 512, align: 64, elements: !264)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !82)
!264 = !{!265}
!265 = !DISubrange(count: 1)
!266 = !{i32 2, !"Dwarf Version", i32 4}
!267 = !{i32 2, !"Debug Info Version", i32 3}
!268 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!269 = distinct !DISubprogram(name: "tee_open", scope: !48, file: !48, line: 82, type: !60, isLocal: true, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !270)
!270 = !{}
!271 = !DILocalVariable(name: "h", arg: 1, scope: !269, file: !48, line: 82, type: !63)
!272 = !DIExpression()
!273 = !DILocation(line: 82, column: 33, scope: !269)
!274 = !DILocalVariable(name: "filename", arg: 2, scope: !269, file: !48, line: 82, type: !55)
!275 = !DILocation(line: 82, column: 48, scope: !269)
!276 = !DILocalVariable(name: "flags", arg: 3, scope: !269, file: !48, line: 82, type: !62)
!277 = !DILocation(line: 82, column: 62, scope: !269)
!278 = !DILocalVariable(name: "c", scope: !269, file: !48, line: 84, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "TeeContext", file: !48, line: 36, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TeeContext", file: !48, line: 32, size: 192, align: 64, elements: !282)
!282 = !{!283, !284, !285}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !281, file: !48, line: 33, baseType: !68, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "child_count", scope: !281, file: !48, line: 34, baseType: !62, size: 32, align: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !281, file: !48, line: 35, baseType: !286, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "ChildContext", file: !48, line: 30, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChildContext", file: !48, line: 28, size: 64, align: 64, elements: !289)
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "url_context", scope: !288, file: !48, line: 29, baseType: !63, size: 64, align: 64)
!291 = !DILocation(line: 84, column: 17, scope: !269)
!292 = !DILocation(line: 84, column: 21, scope: !269)
!293 = !DILocation(line: 84, column: 24, scope: !269)
!294 = !DILocalVariable(name: "ret", scope: !269, file: !48, line: 85, type: !62)
!295 = !DILocation(line: 85, column: 9, scope: !269)
!296 = !DILocalVariable(name: "i", scope: !269, file: !48, line: 85, type: !62)
!297 = !DILocation(line: 85, column: 14, scope: !269)
!298 = !DILocation(line: 87, column: 17, scope: !269)
!299 = !DILocation(line: 87, column: 5, scope: !269)
!300 = !DILocation(line: 89, column: 9, scope: !301)
!301 = distinct !DILexicalBlock(scope: !269, file: !48, line: 89, column: 9)
!302 = !DILocation(line: 89, column: 15, scope: !301)
!303 = !DILocation(line: 89, column: 9, scope: !269)
!304 = !DILocation(line: 90, column: 9, scope: !301)
!305 = !DILocation(line: 92, column: 5, scope: !269)
!306 = !DILocation(line: 92, column: 13, scope: !307)
!307 = !DILexicalBlockFile(scope: !269, file: !48, discriminator: 1)
!308 = !DILocation(line: 92, column: 12, scope: !307)
!309 = !DILocation(line: 92, column: 5, scope: !307)
!310 = !DILocalVariable(name: "child_string", scope: !311, file: !48, line: 93, type: !155)
!311 = distinct !DILexicalBlock(scope: !269, file: !48, line: 92, column: 23)
!312 = !DILocation(line: 93, column: 15, scope: !311)
!313 = !DILocation(line: 93, column: 54, scope: !311)
!314 = !DILocation(line: 93, column: 30, scope: !311)
!315 = !DILocalVariable(name: "child_name", scope: !311, file: !48, line: 94, type: !155)
!316 = !DILocation(line: 94, column: 15, scope: !311)
!317 = !DILocalVariable(name: "tmp", scope: !311, file: !48, line: 95, type: !78)
!318 = !DILocation(line: 95, column: 15, scope: !311)
!319 = !DILocalVariable(name: "options", scope: !311, file: !48, line: 96, type: !179)
!320 = !DILocation(line: 96, column: 23, scope: !311)
!321 = !DILocation(line: 97, column: 14, scope: !322)
!322 = distinct !DILexicalBlock(scope: !311, file: !48, line: 97, column: 13)
!323 = !DILocation(line: 97, column: 13, scope: !311)
!324 = !DILocation(line: 98, column: 17, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !48, line: 97, column: 28)
!326 = !DILocation(line: 99, column: 13, scope: !325)
!327 = !DILocation(line: 102, column: 32, scope: !311)
!328 = !DILocation(line: 102, column: 35, scope: !311)
!329 = !DILocation(line: 102, column: 42, scope: !311)
!330 = !DILocation(line: 102, column: 45, scope: !311)
!331 = !DILocation(line: 102, column: 57, scope: !311)
!332 = !DILocation(line: 102, column: 15, scope: !311)
!333 = !DILocation(line: 102, column: 13, scope: !311)
!334 = !DILocation(line: 103, column: 14, scope: !335)
!335 = distinct !DILexicalBlock(scope: !311, file: !48, line: 103, column: 13)
!336 = !DILocation(line: 103, column: 13, scope: !311)
!337 = !DILocation(line: 104, column: 17, scope: !338)
!338 = distinct !DILexicalBlock(scope: !335, file: !48, line: 103, column: 19)
!339 = !DILocation(line: 105, column: 13, scope: !338)
!340 = !DILocation(line: 107, column: 20, scope: !311)
!341 = !DILocation(line: 107, column: 9, scope: !311)
!342 = !DILocation(line: 107, column: 12, scope: !311)
!343 = !DILocation(line: 107, column: 18, scope: !311)
!344 = !DILocation(line: 108, column: 26, scope: !311)
!345 = !DILocation(line: 108, column: 29, scope: !311)
!346 = !DILocation(line: 108, column: 17, scope: !311)
