; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--jacosubdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--jacosubdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!859 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!860 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!861 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !4, line: 3865, size: 32, align: 32, elements: !862)
!862 = !{!863, !864, !865, !866}
!863 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!864 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!865 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!866 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sub_sort", file: !917, line: 29, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/subtitles.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920}
!919 = !DIEnumerator(name: "SUB_SORT_TS_POS", value: 0)
!920 = !DIEnumerator(name: "SUB_SORT_POS_TS", value: 1)
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !925, line: 48, baseType: !926)
!925 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!926 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!927 = !{!928, !2201}
!928 = distinct !DIGlobalVariable(name: "ff_jacosub_demuxer", scope: !0, file: !929, line: 265, type: !930, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_jacosub_demuxer)
!929 = !DIFile(filename: "libavformat/jacosubdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !897, line: 777, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !932)
!932 = !{!933, !937, !938, !940, !941, !952, !994, !995, !997, !998, !999, !1012, !2182, !2183, !2184, !2188, !2192, !2193, !2194, !2198, !2199, !2200}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !897, line: 638, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !931, file: !897, line: 645, baseType: !934, size: 64, align: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !931, file: !897, line: 652, baseType: !939, size: 32, align: 32, offset: 128)
!939 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !931, file: !897, line: 659, baseType: !934, size: 64, align: 64, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !931, file: !897, line: 661, baseType: !942, size: 64, align: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !947, line: 44, size: 64, align: 32, elements: !948)
!947 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!948 = !{!949, !950}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !946, file: !947, line: 45, baseType: !3, size: 32, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !946, file: !947, line: 46, baseType: !951, size: 32, align: 32, offset: 32)
!951 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !931, file: !897, line: 663, baseType: !953, size: 64, align: 64, offset: 320)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !957)
!957 = !{!958, !959, !964, !968, !969, !970, !971, !975, !981, !983, !987}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !956, file: !464, line: 72, baseType: !934, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !956, file: !464, line: 78, baseType: !960, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!934, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !956, file: !464, line: 85, baseType: !965, size: 64, align: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !956, file: !464, line: 93, baseType: !939, size: 32, align: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !956, file: !464, line: 99, baseType: !939, size: 32, align: 32, offset: 224)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !956, file: !464, line: 108, baseType: !939, size: 32, align: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !956, file: !464, line: 113, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!963, !963, !963}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !956, file: !464, line: 123, baseType: !976, size: 64, align: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!979, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !956, file: !464, line: 130, baseType: !982, size: 32, align: 32, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !956, file: !464, line: 136, baseType: !984, size: 64, align: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!982, !963}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !956, file: !464, line: 142, baseType: !988, size: 64, align: 64, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!939, !991, !963, !934, !939}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !931, file: !897, line: 670, baseType: !934, size: 64, align: 64, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !897, line: 679, baseType: !996, size: 64, align: 64, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !931, file: !897, line: 684, baseType: !939, size: 32, align: 32, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !931, file: !897, line: 689, baseType: !939, size: 32, align: 32, offset: 544)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !931, file: !897, line: 696, baseType: !1000, size: 64, align: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!939, !1003}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1010, !1011}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1005, file: !897, line: 449, baseType: !934, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1005, file: !897, line: 450, baseType: !1009, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1005, file: !897, line: 451, baseType: !939, size: 32, align: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1005, file: !897, line: 452, baseType: !934, size: 64, align: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !931, file: !897, line: 703, baseType: !1013, size: 64, align: 64, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!939, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1220, !1221, !1284, !1285, !1286, !2039, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2093, !2094, !2095, !2096, !2097, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2148, !2149, !2152, !2153, !2154, !2155, !2156, !2157, !2159, !2160, !2161, !2162, !2170, !2171, !2175, !2179, !2180, !2181}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1017, file: !897, line: 1342, baseType: !953, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1017, file: !897, line: 1349, baseType: !996, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1017, file: !897, line: 1356, baseType: !1022, size: 64, align: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1079, !1080, !1084, !1088, !1093, !1100, !1195, !1201, !1207, !1208, !1209, !1210, !1214}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !897, line: 498, baseType: !934, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1023, file: !897, line: 504, baseType: !934, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1023, file: !897, line: 505, baseType: !934, size: 64, align: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1023, file: !897, line: 506, baseType: !934, size: 64, align: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1023, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1023, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1023, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !897, line: 517, baseType: !939, size: 32, align: 32, offset: 352)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1023, file: !897, line: 523, baseType: !942, size: 64, align: 64, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1023, file: !897, line: 526, baseType: !953, size: 64, align: 64, offset: 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !897, line: 535, baseType: !1022, size: 64, align: 64, offset: 512)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1023, file: !897, line: 539, baseType: !939, size: 32, align: 32, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1023, file: !897, line: 541, baseType: !1013, size: 64, align: 64, offset: 640)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1023, file: !897, line: 549, baseType: !1039, size: 64, align: 64, offset: 704)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!939, !1016, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1045)
!1045 = !{!1046, !1059, !1062, !1063, !1064, !1065, !1066, !1067, !1075, !1076, !1077, !1078}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1044, file: !4, line: 1451, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1049, line: 94, baseType: !1050)
!1049 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1049, line: 81, size: 192, align: 64, elements: !1051)
!1051 = !{!1052, !1056, !1058}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1050, file: !1049, line: 82, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1049, line: 73, baseType: !1055)
!1055 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1049, line: 73, flags: DIFlagFwdDecl)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1050, file: !1049, line: 89, baseType: !1057, size: 64, align: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1050, file: !1049, line: 93, baseType: !939, size: 32, align: 32, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1044, file: !4, line: 1461, baseType: !1060, size: 64, align: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !925, line: 40, baseType: !1061)
!1061 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1044, file: !4, line: 1467, baseType: !1060, size: 64, align: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1044, file: !4, line: 1468, baseType: !1057, size: 64, align: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1044, file: !4, line: 1469, baseType: !939, size: 32, align: 32, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1044, file: !4, line: 1470, baseType: !939, size: 32, align: 32, offset: 288)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1044, file: !4, line: 1474, baseType: !939, size: 32, align: 32, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1044, file: !4, line: 1479, baseType: !1068, size: 64, align: 64, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1071)
!1071 = !{!1072, !1073, !1074}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1070, file: !4, line: 1412, baseType: !1057, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !4, line: 1413, baseType: !939, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1070, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1044, file: !4, line: 1480, baseType: !939, size: 32, align: 32, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1044, file: !4, line: 1486, baseType: !1060, size: 64, align: 64, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1044, file: !4, line: 1488, baseType: !1060, size: 64, align: 64, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1044, file: !4, line: 1497, baseType: !1060, size: 64, align: 64, offset: 640)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1023, file: !897, line: 550, baseType: !1013, size: 64, align: 64, offset: 768)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1023, file: !897, line: 554, baseType: !1081, size: 64, align: 64, offset: 832)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!939, !1016, !1042, !1042, !939}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1023, file: !897, line: 563, baseType: !1085, size: 64, align: 64, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!939, !3, !939}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1023, file: !897, line: 565, baseType: !1089, size: 64, align: 64, offset: 960)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !1016, !939, !1092, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1023, file: !897, line: 570, baseType: !1094, size: 64, align: 64, offset: 1024)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!939, !1016, !939, !963, !1097}
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1098, line: 216, baseType: !1099)
!1098 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1099 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1023, file: !897, line: 581, baseType: !1101, size: 64, align: 64, offset: 1088)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!939, !1016, !939, !1104, !951}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1108)
!1108 = !{!1109, !1113, !1115, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1149, !1151, !1152, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !526, line: 282, baseType: !1110, size: 512, align: 64)
!1110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 512, align: 64, elements: !1111)
!1111 = !{!1112}
!1112 = !DISubrange(count: 8)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1107, file: !526, line: 299, baseType: !1114, size: 256, align: 32, offset: 512)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 256, align: 32, elements: !1111)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1107, file: !526, line: 315, baseType: !1116, size: 64, align: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1107, file: !526, line: 326, baseType: !939, size: 32, align: 32, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1107, file: !526, line: 326, baseType: !939, size: 32, align: 32, offset: 864)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1107, file: !526, line: 334, baseType: !939, size: 32, align: 32, offset: 896)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1107, file: !526, line: 341, baseType: !939, size: 32, align: 32, offset: 928)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1107, file: !526, line: 346, baseType: !939, size: 32, align: 32, offset: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1107, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1107, file: !526, line: 356, baseType: !1124, size: 64, align: 32, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1125, line: 61, baseType: !1126)
!1125 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1125, line: 58, size: 64, align: 32, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1126, file: !1125, line: 59, baseType: !939, size: 32, align: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1126, file: !1125, line: 60, baseType: !939, size: 32, align: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1107, file: !526, line: 361, baseType: !1060, size: 64, align: 64, offset: 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1107, file: !526, line: 369, baseType: !1060, size: 64, align: 64, offset: 1152)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1107, file: !526, line: 377, baseType: !1060, size: 64, align: 64, offset: 1216)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1107, file: !526, line: 382, baseType: !939, size: 32, align: 32, offset: 1280)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1107, file: !526, line: 386, baseType: !939, size: 32, align: 32, offset: 1312)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1107, file: !526, line: 391, baseType: !939, size: 32, align: 32, offset: 1344)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1107, file: !526, line: 396, baseType: !963, size: 64, align: 64, offset: 1408)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1107, file: !526, line: 403, baseType: !1138, size: 512, align: 64, offset: 1472)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 512, align: 64, elements: !1111)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !925, line: 55, baseType: !1099)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1107, file: !526, line: 410, baseType: !939, size: 32, align: 32, offset: 1984)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1107, file: !526, line: 415, baseType: !939, size: 32, align: 32, offset: 2016)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1107, file: !526, line: 420, baseType: !939, size: 32, align: 32, offset: 2048)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1107, file: !526, line: 425, baseType: !939, size: 32, align: 32, offset: 2080)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1107, file: !526, line: 435, baseType: !1060, size: 64, align: 64, offset: 2112)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1107, file: !526, line: 440, baseType: !939, size: 32, align: 32, offset: 2176)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1107, file: !526, line: 445, baseType: !1139, size: 64, align: 64, offset: 2240)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1107, file: !526, line: 459, baseType: !1148, size: 512, align: 64, offset: 2304)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1047, size: 512, align: 64, elements: !1111)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1107, file: !526, line: 473, baseType: !1150, size: 64, align: 64, offset: 2816)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1107, file: !526, line: 477, baseType: !939, size: 32, align: 32, offset: 2880)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1107, file: !526, line: 479, baseType: !1153, size: 64, align: 64, offset: 2944)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1157)
!1157 = !{!1158, !1159, !1160, !1161, !1166}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !526, line: 203, baseType: !1057, size: 64, align: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !526, line: 204, baseType: !939, size: 32, align: 32, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1156, file: !526, line: 205, baseType: !1162, size: 64, align: 64, offset: 192)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1164, line: 86, baseType: !1165)
!1164 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1164, line: 86, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1156, file: !526, line: 206, baseType: !1047, size: 64, align: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1107, file: !526, line: 480, baseType: !939, size: 32, align: 32, offset: 3008)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1107, file: !526, line: 505, baseType: !939, size: 32, align: 32, offset: 3040)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1107, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1107, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1107, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1107, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1107, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1107, file: !526, line: 532, baseType: !1060, size: 64, align: 64, offset: 3264)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1107, file: !526, line: 539, baseType: !1060, size: 64, align: 64, offset: 3328)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1107, file: !526, line: 547, baseType: !1060, size: 64, align: 64, offset: 3392)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1107, file: !526, line: 554, baseType: !1162, size: 64, align: 64, offset: 3456)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1107, file: !526, line: 563, baseType: !939, size: 32, align: 32, offset: 3520)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1107, file: !526, line: 572, baseType: !939, size: 32, align: 32, offset: 3552)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1107, file: !526, line: 581, baseType: !939, size: 32, align: 32, offset: 3584)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1107, file: !526, line: 588, baseType: !1182, size: 64, align: 64, offset: 3648)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !925, line: 36, baseType: !1184)
!1184 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1107, file: !526, line: 593, baseType: !939, size: 32, align: 32, offset: 3712)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1107, file: !526, line: 596, baseType: !939, size: 32, align: 32, offset: 3744)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1107, file: !526, line: 599, baseType: !1047, size: 64, align: 64, offset: 3776)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1107, file: !526, line: 605, baseType: !1047, size: 64, align: 64, offset: 3840)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1107, file: !526, line: 616, baseType: !1047, size: 64, align: 64, offset: 3904)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1107, file: !526, line: 626, baseType: !1097, size: 64, align: 64, offset: 3968)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1107, file: !526, line: 627, baseType: !1097, size: 64, align: 64, offset: 4032)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1107, file: !526, line: 628, baseType: !1097, size: 64, align: 64, offset: 4096)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1107, file: !526, line: 629, baseType: !1097, size: 64, align: 64, offset: 4160)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1107, file: !526, line: 645, baseType: !1047, size: 64, align: 64, offset: 4224)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1023, file: !897, line: 587, baseType: !1196, size: 64, align: 64, offset: 1152)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!939, !1016, !1199}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1023, file: !897, line: 592, baseType: !1202, size: 64, align: 64, offset: 1216)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!939, !1016, !1205}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1023, file: !897, line: 597, baseType: !1202, size: 64, align: 64, offset: 1280)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1023, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1023, file: !897, line: 608, baseType: !1013, size: 64, align: 64, offset: 1408)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1023, file: !897, line: 617, baseType: !1211, size: 64, align: 64, offset: 1472)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{null, !1016}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1023, file: !897, line: 623, baseType: !1215, size: 64, align: 64, offset: 1536)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!939, !1016, !1218}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1017, file: !897, line: 1365, baseType: !963, size: 64, align: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1017, file: !897, line: 1379, baseType: !1222, size: 64, align: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1225)
!1225 = !{!1226, !1227, !1228, !1229, !1230, !1231, !1232, !1236, !1237, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1251, !1252, !1256, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1274, !1275, !1276, !1277, !1281, !1282, !1283}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1224, file: !628, line: 174, baseType: !953, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1224, file: !628, line: 226, baseType: !1009, size: 64, align: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1224, file: !628, line: 227, baseType: !939, size: 32, align: 32, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1224, file: !628, line: 228, baseType: !1009, size: 64, align: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1224, file: !628, line: 229, baseType: !1009, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1224, file: !628, line: 233, baseType: !963, size: 64, align: 64, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1224, file: !628, line: 235, baseType: !1233, size: 64, align: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!939, !963, !1057, !939}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1224, file: !628, line: 236, baseType: !1233, size: 64, align: 64, offset: 448)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1224, file: !628, line: 237, baseType: !1238, size: 64, align: 64, offset: 512)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!1060, !963, !1060, !939}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1224, file: !628, line: 238, baseType: !1060, size: 64, align: 64, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1224, file: !628, line: 239, baseType: !939, size: 32, align: 32, offset: 640)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1224, file: !628, line: 240, baseType: !939, size: 32, align: 32, offset: 672)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1224, file: !628, line: 241, baseType: !939, size: 32, align: 32, offset: 704)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1224, file: !628, line: 242, baseType: !1099, size: 64, align: 64, offset: 768)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1224, file: !628, line: 243, baseType: !1009, size: 64, align: 64, offset: 832)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1224, file: !628, line: 244, baseType: !1248, size: 64, align: 64, offset: 896)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!1099, !1099, !922, !951}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1224, file: !628, line: 245, baseType: !939, size: 32, align: 32, offset: 960)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1224, file: !628, line: 249, baseType: !1253, size: 64, align: 64, offset: 1024)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DISubroutineType(types: !1255)
!1255 = !{!939, !963, !939}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1224, file: !628, line: 255, baseType: !1257, size: 64, align: 64, offset: 1088)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!1060, !963, !939, !1060, !939}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1224, file: !628, line: 260, baseType: !939, size: 32, align: 32, offset: 1152)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1224, file: !628, line: 266, baseType: !1060, size: 64, align: 64, offset: 1216)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1224, file: !628, line: 273, baseType: !939, size: 32, align: 32, offset: 1280)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1224, file: !628, line: 279, baseType: !1060, size: 64, align: 64, offset: 1344)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1224, file: !628, line: 285, baseType: !939, size: 32, align: 32, offset: 1408)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1224, file: !628, line: 291, baseType: !939, size: 32, align: 32, offset: 1440)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1224, file: !628, line: 298, baseType: !939, size: 32, align: 32, offset: 1472)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1224, file: !628, line: 304, baseType: !939, size: 32, align: 32, offset: 1504)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1224, file: !628, line: 309, baseType: !934, size: 64, align: 64, offset: 1536)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1224, file: !628, line: 314, baseType: !934, size: 64, align: 64, offset: 1600)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1224, file: !628, line: 319, baseType: !1271, size: 64, align: 64, offset: 1664)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!939, !963, !1057, !939, !627, !1060}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1224, file: !628, line: 326, baseType: !939, size: 32, align: 32, offset: 1728)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1224, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1224, file: !628, line: 332, baseType: !1060, size: 64, align: 64, offset: 1792)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1224, file: !628, line: 338, baseType: !1278, size: 64, align: 64, offset: 1856)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!939, !963}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1224, file: !628, line: 340, baseType: !1060, size: 64, align: 64, offset: 1920)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1224, file: !628, line: 346, baseType: !1009, size: 64, align: 64, offset: 1984)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1224, file: !628, line: 351, baseType: !939, size: 32, align: 32, offset: 2048)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1017, file: !897, line: 1386, baseType: !939, size: 32, align: 32, offset: 320)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1017, file: !897, line: 1393, baseType: !951, size: 32, align: 32, offset: 352)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1017, file: !897, line: 1405, baseType: !1287, size: 64, align: 64, offset: 384)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1846, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1964, !1970, !1971, !1975, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2007, !2008, !2009, !2010, !2011, !2012}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1290, file: !897, line: 866, baseType: !939, size: 32, align: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1290, file: !897, line: 872, baseType: !939, size: 32, align: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1290, file: !897, line: 878, baseType: !1295, size: 64, align: 64, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1302, !1444, !1445, !1446, !1447, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1600, !1604, !1605, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1784, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1297, file: !4, line: 1561, baseType: !953, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1297, file: !4, line: 1562, baseType: !939, size: 32, align: 32, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1297, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1297, file: !4, line: 1565, baseType: !1303, size: 64, align: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1306)
!1306 = !{!1307, !1308, !1309, !1310, !1311, !1312, !1315, !1318, !1321, !1324, !1327, !1328, !1329, !1337, !1338, !1339, !1341, !1345, !1351, !1360, !1364, !1365, !1409, !1416, !1420, !1421, !1425, !1429, !1433, !1437, !1438, !1439}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1305, file: !4, line: 3475, baseType: !934, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1305, file: !4, line: 3480, baseType: !934, size: 64, align: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1305, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1305, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1305, file: !4, line: 3487, baseType: !939, size: 32, align: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1305, file: !4, line: 3488, baseType: !1313, size: 64, align: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64, align: 64)
!1314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1124)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1305, file: !4, line: 3489, baseType: !1316, size: 64, align: 64, offset: 320)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1305, file: !4, line: 3490, baseType: !1319, size: 64, align: 64, offset: 384)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1305, file: !4, line: 3491, baseType: !1322, size: 64, align: 64, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1305, file: !4, line: 3492, baseType: !1325, size: 64, align: 64, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1305, file: !4, line: 3493, baseType: !924, size: 8, align: 8, offset: 576)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1305, file: !4, line: 3494, baseType: !953, size: 64, align: 64, offset: 640)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1305, file: !4, line: 3495, baseType: !1330, size: 64, align: 64, offset: 704)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1332)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1333)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1334)
!1334 = !{!1335, !1336}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1333, file: !4, line: 3402, baseType: !939, size: 32, align: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1333, file: !4, line: 3403, baseType: !934, size: 64, align: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1305, file: !4, line: 3507, baseType: !934, size: 64, align: 64, offset: 768)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1305, file: !4, line: 3516, baseType: !939, size: 32, align: 32, offset: 832)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1305, file: !4, line: 3517, baseType: !1340, size: 64, align: 64, offset: 896)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1305, file: !4, line: 3527, baseType: !1342, size: 64, align: 64, offset: 960)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!939, !1295}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1305, file: !4, line: 3535, baseType: !1346, size: 64, align: 64, offset: 1024)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DISubroutineType(types: !1348)
!1348 = !{!939, !1295, !1349}
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1296)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1305, file: !4, line: 3541, baseType: !1352, size: 64, align: 64, offset: 1088)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1354)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1355)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1356, line: 223, size: 128, align: 64, elements: !1357)
!1356 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1357 = !{!1358, !1359}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1355, file: !1356, line: 224, baseType: !922, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1355, file: !1356, line: 225, baseType: !922, size: 64, align: 64, offset: 64)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1305, file: !4, line: 3549, baseType: !1361, size: 64, align: 64, offset: 1152)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{null, !1340}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1305, file: !4, line: 3551, baseType: !1342, size: 64, align: 64, offset: 1216)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1305, file: !4, line: 3552, baseType: !1366, size: 64, align: 64, offset: 1280)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!939, !1295, !1057, !939, !1369}
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1372)
!1372 = !{!1373, !1376, !1378, !1379, !1380, !1408}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1371, file: !4, line: 3921, baseType: !1374, size: 16, align: 16)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !925, line: 49, baseType: !1375)
!1375 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1371, file: !4, line: 3922, baseType: !1377, size: 32, align: 32, offset: 32)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !925, line: 51, baseType: !951)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1371, file: !4, line: 3923, baseType: !1377, size: 32, align: 32, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1371, file: !4, line: 3924, baseType: !951, size: 32, align: 32, offset: 96)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1371, file: !4, line: 3925, baseType: !1381, size: 64, align: 64, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389, !1390, !1391, !1397, !1401, !1403, !1404, !1406, !1407}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1384, file: !4, line: 3886, baseType: !939, size: 32, align: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1384, file: !4, line: 3887, baseType: !939, size: 32, align: 32, offset: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1384, file: !4, line: 3888, baseType: !939, size: 32, align: 32, offset: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1384, file: !4, line: 3889, baseType: !939, size: 32, align: 32, offset: 96)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1384, file: !4, line: 3890, baseType: !939, size: 32, align: 32, offset: 128)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1384, file: !4, line: 3897, baseType: !1392, size: 768, align: 64, offset: 192)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1394)
!1394 = !{!1395, !1396}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1393, file: !4, line: 3855, baseType: !1110, size: 512, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1393, file: !4, line: 3857, baseType: !1114, size: 256, align: 32, offset: 512)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1384, file: !4, line: 3903, baseType: !1398, size: 256, align: 64, offset: 960)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1057, size: 256, align: 64, elements: !1399)
!1399 = !{!1400}
!1400 = !DISubrange(count: 4)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1384, file: !4, line: 3904, baseType: !1402, size: 128, align: 32, offset: 1216)
!1402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 128, align: 32, elements: !1399)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1384, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1384, file: !4, line: 3908, baseType: !1405, size: 64, align: 64, offset: 1408)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1384, file: !4, line: 3915, baseType: !1405, size: 64, align: 64, offset: 1472)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1384, file: !4, line: 3917, baseType: !939, size: 32, align: 32, offset: 1536)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1371, file: !4, line: 3926, baseType: !1060, size: 64, align: 64, offset: 192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1305, file: !4, line: 3564, baseType: !1410, size: 64, align: 64, offset: 1344)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64, align: 64)
!1411 = !DISubroutineType(types: !1412)
!1412 = !{!939, !1295, !1042, !1413, !1415}
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1305, file: !4, line: 3566, baseType: !1417, size: 64, align: 64, offset: 1408)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DISubroutineType(types: !1419)
!1419 = !{!939, !1295, !963, !1415, !1042}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1305, file: !4, line: 3567, baseType: !1342, size: 64, align: 64, offset: 1472)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1305, file: !4, line: 3576, baseType: !1422, size: 64, align: 64, offset: 1536)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!939, !1295, !1413}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1305, file: !4, line: 3577, baseType: !1426, size: 64, align: 64, offset: 1600)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DISubroutineType(types: !1428)
!1428 = !{!939, !1295, !1042}
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1305, file: !4, line: 3584, baseType: !1430, size: 64, align: 64, offset: 1664)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{!939, !1295, !1105}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1305, file: !4, line: 3589, baseType: !1434, size: 64, align: 64, offset: 1728)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{null, !1295}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1305, file: !4, line: 3594, baseType: !939, size: 32, align: 32, offset: 1792)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1305, file: !4, line: 3600, baseType: !934, size: 64, align: 64, offset: 1856)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1305, file: !4, line: 3609, baseType: !1440, size: 64, align: 64, offset: 1920)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1443)
!1443 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1297, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1297, file: !4, line: 1581, baseType: !951, size: 32, align: 32, offset: 224)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1297, file: !4, line: 1583, baseType: !963, size: 64, align: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1297, file: !4, line: 1591, baseType: !1448, size: 64, align: 64, offset: 320)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1356, line: 129, size: 1664, align: 64, elements: !1450)
!1450 = !{!1451, !1452, !1453, !1454, !1455, !1473, !1474, !1480, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1449, file: !1356, line: 136, baseType: !939, size: 32, align: 32)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1449, file: !1356, line: 151, baseType: !939, size: 32, align: 32, offset: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1449, file: !1356, line: 157, baseType: !939, size: 32, align: 32, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1449, file: !1356, line: 159, baseType: !1105, size: 64, align: 64, offset: 128)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1449, file: !1356, line: 161, baseType: !1456, size: 64, align: 64, offset: 192)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1356, line: 117, baseType: !1458)
!1458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1356, line: 100, size: 832, align: 64, elements: !1459)
!1459 = !{!1460, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1458, file: !1356, line: 105, baseType: !1461, size: 256, align: 64)
!1461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1462, size: 256, align: 64, elements: !1399)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1049, line: 238, baseType: !1464)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1049, line: 238, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1458, file: !1356, line: 110, baseType: !939, size: 32, align: 32, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1458, file: !1356, line: 111, baseType: !939, size: 32, align: 32, offset: 288)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1458, file: !1356, line: 111, baseType: !939, size: 32, align: 32, offset: 320)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1458, file: !1356, line: 112, baseType: !1114, size: 256, align: 32, offset: 352)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1458, file: !1356, line: 113, baseType: !1402, size: 128, align: 32, offset: 608)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1458, file: !1356, line: 114, baseType: !939, size: 32, align: 32, offset: 736)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1458, file: !1356, line: 115, baseType: !939, size: 32, align: 32, offset: 768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1458, file: !1356, line: 116, baseType: !939, size: 32, align: 32, offset: 800)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1449, file: !1356, line: 163, baseType: !963, size: 64, align: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1449, file: !1356, line: 165, baseType: !1475, size: 128, align: 64, offset: 320)
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1356, line: 122, baseType: !1476)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1356, line: 119, size: 128, align: 64, elements: !1477)
!1477 = !{!1478, !1479}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1476, file: !1356, line: 120, baseType: !1042, size: 64, align: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1476, file: !1356, line: 121, baseType: !1105, size: 64, align: 64, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1449, file: !1356, line: 166, baseType: !1481, size: 128, align: 64, offset: 448)
!1481 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1356, line: 127, baseType: !1482)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1356, line: 124, size: 128, align: 64, elements: !1483)
!1483 = !{!1484, !1557}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1482, file: !1356, line: 125, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1488)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1489)
!1489 = !{!1490, !1491, !1515, !1519, !1520, !1554, !1555, !1556}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1488, file: !4, line: 5751, baseType: !953, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1488, file: !4, line: 5756, baseType: !1492, size: 64, align: 64, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1494)
!1494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1495)
!1495 = !{!1496, !1497, !1500, !1501, !1502, !1506, !1510, !1514}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1494, file: !4, line: 5797, baseType: !934, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1494, file: !4, line: 5804, baseType: !1498, size: 64, align: 64, offset: 64)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1494, file: !4, line: 5815, baseType: !953, size: 64, align: 64, offset: 128)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1494, file: !4, line: 5825, baseType: !939, size: 32, align: 32, offset: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1494, file: !4, line: 5826, baseType: !1503, size: 64, align: 64, offset: 256)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DISubroutineType(types: !1505)
!1505 = !{!939, !1486}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1494, file: !4, line: 5827, baseType: !1507, size: 64, align: 64, offset: 320)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DISubroutineType(types: !1509)
!1509 = !{!939, !1486, !1042}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1494, file: !4, line: 5828, baseType: !1511, size: 64, align: 64, offset: 384)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{null, !1486}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1494, file: !4, line: 5829, baseType: !1511, size: 64, align: 64, offset: 448)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1488, file: !4, line: 5762, baseType: !1516, size: 64, align: 64, offset: 128)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1518)
!1518 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1488, file: !4, line: 5768, baseType: !963, size: 64, align: 64, offset: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1488, file: !4, line: 5775, baseType: !1521, size: 64, align: 64, offset: 256)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1523)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1524)
!1524 = !{!1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1523, file: !4, line: 3940, baseType: !636, size: 32, align: 32)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1523, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1523, file: !4, line: 3948, baseType: !1377, size: 32, align: 32, offset: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1523, file: !4, line: 3958, baseType: !1057, size: 64, align: 64, offset: 128)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1523, file: !4, line: 3962, baseType: !939, size: 32, align: 32, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1523, file: !4, line: 3968, baseType: !939, size: 32, align: 32, offset: 224)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1523, file: !4, line: 3973, baseType: !1060, size: 64, align: 64, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1523, file: !4, line: 3986, baseType: !939, size: 32, align: 32, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1523, file: !4, line: 3999, baseType: !939, size: 32, align: 32, offset: 352)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1523, file: !4, line: 4004, baseType: !939, size: 32, align: 32, offset: 384)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1523, file: !4, line: 4005, baseType: !939, size: 32, align: 32, offset: 416)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1523, file: !4, line: 4010, baseType: !939, size: 32, align: 32, offset: 448)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1523, file: !4, line: 4011, baseType: !939, size: 32, align: 32, offset: 480)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1523, file: !4, line: 4020, baseType: !1124, size: 64, align: 32, offset: 512)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1523, file: !4, line: 4025, baseType: !867, size: 32, align: 32, offset: 576)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1523, file: !4, line: 4030, baseType: !549, size: 32, align: 32, offset: 608)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1523, file: !4, line: 4031, baseType: !556, size: 32, align: 32, offset: 640)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1523, file: !4, line: 4032, baseType: !574, size: 32, align: 32, offset: 672)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1523, file: !4, line: 4033, baseType: !598, size: 32, align: 32, offset: 704)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1523, file: !4, line: 4034, baseType: !617, size: 32, align: 32, offset: 736)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1523, file: !4, line: 4039, baseType: !939, size: 32, align: 32, offset: 768)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1523, file: !4, line: 4046, baseType: !1139, size: 64, align: 64, offset: 832)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1523, file: !4, line: 4050, baseType: !939, size: 32, align: 32, offset: 896)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1523, file: !4, line: 4054, baseType: !939, size: 32, align: 32, offset: 928)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1523, file: !4, line: 4061, baseType: !939, size: 32, align: 32, offset: 960)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1523, file: !4, line: 4065, baseType: !939, size: 32, align: 32, offset: 992)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1523, file: !4, line: 4073, baseType: !939, size: 32, align: 32, offset: 1024)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1523, file: !4, line: 4080, baseType: !939, size: 32, align: 32, offset: 1056)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1523, file: !4, line: 4084, baseType: !939, size: 32, align: 32, offset: 1088)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1488, file: !4, line: 5781, baseType: !1521, size: 64, align: 64, offset: 320)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1488, file: !4, line: 5787, baseType: !1124, size: 64, align: 32, offset: 384)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1488, file: !4, line: 5793, baseType: !1124, size: 64, align: 32, offset: 448)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1482, file: !1356, line: 126, baseType: !939, size: 32, align: 32, offset: 64)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1449, file: !1356, line: 172, baseType: !1042, size: 64, align: 64, offset: 576)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1449, file: !1356, line: 177, baseType: !1057, size: 64, align: 64, offset: 640)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1449, file: !1356, line: 178, baseType: !951, size: 32, align: 32, offset: 704)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1449, file: !1356, line: 180, baseType: !963, size: 64, align: 64, offset: 768)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1449, file: !1356, line: 185, baseType: !939, size: 32, align: 32, offset: 832)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1449, file: !1356, line: 190, baseType: !963, size: 64, align: 64, offset: 896)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1449, file: !1356, line: 195, baseType: !939, size: 32, align: 32, offset: 960)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1449, file: !1356, line: 200, baseType: !1042, size: 64, align: 64, offset: 1024)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1449, file: !1356, line: 201, baseType: !939, size: 32, align: 32, offset: 1088)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1449, file: !1356, line: 202, baseType: !1105, size: 64, align: 64, offset: 1152)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1449, file: !1356, line: 203, baseType: !939, size: 32, align: 32, offset: 1216)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1449, file: !1356, line: 205, baseType: !939, size: 32, align: 32, offset: 1248)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1449, file: !1356, line: 206, baseType: !939, size: 32, align: 32, offset: 1280)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1449, file: !1356, line: 209, baseType: !1097, size: 64, align: 64, offset: 1344)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1449, file: !1356, line: 212, baseType: !1097, size: 64, align: 64, offset: 1408)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1449, file: !1356, line: 213, baseType: !1105, size: 64, align: 64, offset: 1472)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1449, file: !1356, line: 215, baseType: !939, size: 32, align: 32, offset: 1536)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1449, file: !1356, line: 217, baseType: !939, size: 32, align: 32, offset: 1568)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1449, file: !1356, line: 220, baseType: !939, size: 32, align: 32, offset: 1600)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1297, file: !4, line: 1598, baseType: !963, size: 64, align: 64, offset: 384)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1297, file: !4, line: 1606, baseType: !1060, size: 64, align: 64, offset: 448)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1297, file: !4, line: 1614, baseType: !939, size: 32, align: 32, offset: 512)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1297, file: !4, line: 1622, baseType: !939, size: 32, align: 32, offset: 544)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1297, file: !4, line: 1628, baseType: !939, size: 32, align: 32, offset: 576)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1297, file: !4, line: 1636, baseType: !939, size: 32, align: 32, offset: 608)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1297, file: !4, line: 1643, baseType: !939, size: 32, align: 32, offset: 640)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1297, file: !4, line: 1657, baseType: !1057, size: 64, align: 64, offset: 704)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1297, file: !4, line: 1658, baseType: !939, size: 32, align: 32, offset: 768)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1297, file: !4, line: 1679, baseType: !1124, size: 64, align: 32, offset: 800)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1297, file: !4, line: 1688, baseType: !939, size: 32, align: 32, offset: 864)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1297, file: !4, line: 1712, baseType: !939, size: 32, align: 32, offset: 896)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1297, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 928)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1297, file: !4, line: 1729, baseType: !939, size: 32, align: 32, offset: 960)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1297, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 992)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1297, file: !4, line: 1744, baseType: !939, size: 32, align: 32, offset: 1024)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1297, file: !4, line: 1751, baseType: !939, size: 32, align: 32, offset: 1056)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1297, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1297, file: !4, line: 1791, baseType: !1596, size: 64, align: 64, offset: 1152)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{null, !1599, !1413, !1415, !939, !939, !939}
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1297, file: !4, line: 1808, baseType: !1601, size: 64, align: 64, offset: 1216)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!645, !1599, !1316}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1297, file: !4, line: 1816, baseType: !939, size: 32, align: 32, offset: 1280)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1297, file: !4, line: 1825, baseType: !1606, size: 32, align: 32, offset: 1312)
!1606 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1297, file: !4, line: 1830, baseType: !939, size: 32, align: 32, offset: 1344)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1297, file: !4, line: 1838, baseType: !1606, size: 32, align: 32, offset: 1376)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1297, file: !4, line: 1846, baseType: !939, size: 32, align: 32, offset: 1408)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1297, file: !4, line: 1851, baseType: !939, size: 32, align: 32, offset: 1440)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1297, file: !4, line: 1861, baseType: !1606, size: 32, align: 32, offset: 1472)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1297, file: !4, line: 1868, baseType: !1606, size: 32, align: 32, offset: 1504)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1297, file: !4, line: 1875, baseType: !1606, size: 32, align: 32, offset: 1536)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1297, file: !4, line: 1882, baseType: !1606, size: 32, align: 32, offset: 1568)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1297, file: !4, line: 1889, baseType: !1606, size: 32, align: 32, offset: 1600)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1297, file: !4, line: 1896, baseType: !1606, size: 32, align: 32, offset: 1632)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1297, file: !4, line: 1903, baseType: !1606, size: 32, align: 32, offset: 1664)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1297, file: !4, line: 1910, baseType: !939, size: 32, align: 32, offset: 1696)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1297, file: !4, line: 1915, baseType: !939, size: 32, align: 32, offset: 1728)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1297, file: !4, line: 1926, baseType: !1415, size: 64, align: 64, offset: 1792)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1297, file: !4, line: 1935, baseType: !1124, size: 64, align: 32, offset: 1856)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1297, file: !4, line: 1942, baseType: !939, size: 32, align: 32, offset: 1920)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1297, file: !4, line: 1948, baseType: !939, size: 32, align: 32, offset: 1952)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1297, file: !4, line: 1954, baseType: !939, size: 32, align: 32, offset: 1984)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1297, file: !4, line: 1960, baseType: !939, size: 32, align: 32, offset: 2016)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1297, file: !4, line: 1984, baseType: !939, size: 32, align: 32, offset: 2048)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1297, file: !4, line: 1991, baseType: !939, size: 32, align: 32, offset: 2080)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1297, file: !4, line: 1996, baseType: !939, size: 32, align: 32, offset: 2112)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1297, file: !4, line: 2004, baseType: !939, size: 32, align: 32, offset: 2144)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1297, file: !4, line: 2011, baseType: !939, size: 32, align: 32, offset: 2176)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1297, file: !4, line: 2018, baseType: !939, size: 32, align: 32, offset: 2208)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1297, file: !4, line: 2027, baseType: !939, size: 32, align: 32, offset: 2240)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1297, file: !4, line: 2034, baseType: !939, size: 32, align: 32, offset: 2272)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1297, file: !4, line: 2044, baseType: !939, size: 32, align: 32, offset: 2304)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1297, file: !4, line: 2054, baseType: !1636, size: 64, align: 64, offset: 2368)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1297, file: !4, line: 2061, baseType: !1636, size: 64, align: 64, offset: 2432)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1297, file: !4, line: 2066, baseType: !939, size: 32, align: 32, offset: 2496)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1297, file: !4, line: 2070, baseType: !939, size: 32, align: 32, offset: 2528)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1297, file: !4, line: 2078, baseType: !939, size: 32, align: 32, offset: 2560)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1297, file: !4, line: 2085, baseType: !939, size: 32, align: 32, offset: 2592)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1297, file: !4, line: 2092, baseType: !939, size: 32, align: 32, offset: 2624)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1297, file: !4, line: 2099, baseType: !939, size: 32, align: 32, offset: 2656)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1297, file: !4, line: 2106, baseType: !939, size: 32, align: 32, offset: 2688)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1297, file: !4, line: 2113, baseType: !939, size: 32, align: 32, offset: 2720)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1297, file: !4, line: 2120, baseType: !939, size: 32, align: 32, offset: 2752)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1297, file: !4, line: 2125, baseType: !939, size: 32, align: 32, offset: 2784)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1297, file: !4, line: 2133, baseType: !939, size: 32, align: 32, offset: 2816)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1297, file: !4, line: 2140, baseType: !939, size: 32, align: 32, offset: 2848)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1297, file: !4, line: 2145, baseType: !939, size: 32, align: 32, offset: 2880)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1297, file: !4, line: 2153, baseType: !939, size: 32, align: 32, offset: 2912)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1297, file: !4, line: 2158, baseType: !939, size: 32, align: 32, offset: 2944)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1297, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1297, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1297, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1297, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1297, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1297, file: !4, line: 2203, baseType: !939, size: 32, align: 32, offset: 3136)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1297, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1297, file: !4, line: 2212, baseType: !939, size: 32, align: 32, offset: 3200)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1297, file: !4, line: 2213, baseType: !939, size: 32, align: 32, offset: 3232)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1297, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1297, file: !4, line: 2232, baseType: !939, size: 32, align: 32, offset: 3296)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1297, file: !4, line: 2243, baseType: !939, size: 32, align: 32, offset: 3328)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1297, file: !4, line: 2249, baseType: !939, size: 32, align: 32, offset: 3360)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1297, file: !4, line: 2256, baseType: !939, size: 32, align: 32, offset: 3392)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1297, file: !4, line: 2263, baseType: !1139, size: 64, align: 64, offset: 3456)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1297, file: !4, line: 2270, baseType: !1139, size: 64, align: 64, offset: 3520)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1297, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1297, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1297, file: !4, line: 2367, baseType: !1672, size: 64, align: 64, offset: 3648)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!939, !1599, !1105, !939}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1297, file: !4, line: 2383, baseType: !939, size: 32, align: 32, offset: 3712)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1297, file: !4, line: 2386, baseType: !1606, size: 32, align: 32, offset: 3744)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1297, file: !4, line: 2387, baseType: !1606, size: 32, align: 32, offset: 3776)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1297, file: !4, line: 2394, baseType: !939, size: 32, align: 32, offset: 3808)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1297, file: !4, line: 2401, baseType: !939, size: 32, align: 32, offset: 3840)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1297, file: !4, line: 2408, baseType: !939, size: 32, align: 32, offset: 3872)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1297, file: !4, line: 2415, baseType: !939, size: 32, align: 32, offset: 3904)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1297, file: !4, line: 2422, baseType: !939, size: 32, align: 32, offset: 3936)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1297, file: !4, line: 2423, baseType: !1684, size: 64, align: 64, offset: 3968)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1686)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1687)
!1687 = !{!1688, !1689, !1690, !1691}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1686, file: !4, line: 827, baseType: !939, size: 32, align: 32)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1686, file: !4, line: 828, baseType: !939, size: 32, align: 32, offset: 32)
