; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--parsers.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--parsers.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParser = type { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }
%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!816 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!817 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!818 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!819 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !509, line: 464, size: 32, align: 32, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842}
!821 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!822 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!823 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!824 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!825 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!826 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!827 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!828 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!829 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!830 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!831 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!832 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!833 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!834 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!835 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!836 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!837 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!838 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!839 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!840 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!841 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!842 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !509, line: 493, size: 32, align: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!845 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!846 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!847 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!848 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!849 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!851 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!853 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!854 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!855 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!856 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!857 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !{!894, !1564, !913}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64, align: 64)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !897)
!897 = !{!898, !903, !904, !956, !1555, !1559, !1563}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !896, file: !4, line: 5260, baseType: !899, size: 160, align: 32)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 160, align: 32, elements: !901)
!900 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!901 = !{!902}
!902 = !DISubrange(count: 5)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !896, file: !4, line: 5261, baseType: !900, size: 32, align: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !896, file: !4, line: 5262, baseType: !905, size: 64, align: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DISubroutineType(types: !907)
!907 = !{!900, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !911)
!911 = !{!912, !914, !916, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !910, file: !4, line: 5093, baseType: !913, size: 64, align: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !910, file: !4, line: 5094, baseType: !915, size: 64, align: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !910, file: !4, line: 5095, baseType: !917, size: 64, align: 64, offset: 128)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !918, line: 40, baseType: !919)
!918 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !910, file: !4, line: 5096, baseType: !917, size: 64, align: 64, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !910, file: !4, line: 5098, baseType: !917, size: 64, align: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !910, file: !4, line: 5100, baseType: !900, size: 32, align: 32, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !910, file: !4, line: 5110, baseType: !900, size: 32, align: 32, offset: 352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !910, file: !4, line: 5111, baseType: !917, size: 64, align: 64, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !910, file: !4, line: 5112, baseType: !917, size: 64, align: 64, offset: 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !910, file: !4, line: 5115, baseType: !917, size: 64, align: 64, offset: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !910, file: !4, line: 5116, baseType: !917, size: 64, align: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !910, file: !4, line: 5117, baseType: !900, size: 32, align: 32, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !910, file: !4, line: 5120, baseType: !900, size: 32, align: 32, offset: 672)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !910, file: !4, line: 5121, baseType: !931, size: 256, align: 64, offset: 704)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 64, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 4)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !910, file: !4, line: 5122, baseType: !931, size: 256, align: 64, offset: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !910, file: !4, line: 5123, baseType: !931, size: 256, align: 64, offset: 1216)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !910, file: !4, line: 5125, baseType: !900, size: 32, align: 32, offset: 1472)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !910, file: !4, line: 5132, baseType: !917, size: 64, align: 64, offset: 1536)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !910, file: !4, line: 5133, baseType: !931, size: 256, align: 64, offset: 1600)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !910, file: !4, line: 5141, baseType: !900, size: 32, align: 32, offset: 1856)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !910, file: !4, line: 5148, baseType: !917, size: 64, align: 64, offset: 1920)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !910, file: !4, line: 5161, baseType: !900, size: 32, align: 32, offset: 1984)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !910, file: !4, line: 5176, baseType: !900, size: 32, align: 32, offset: 2016)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !910, file: !4, line: 5190, baseType: !900, size: 32, align: 32, offset: 2048)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !910, file: !4, line: 5197, baseType: !931, size: 256, align: 64, offset: 2112)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !910, file: !4, line: 5202, baseType: !917, size: 64, align: 64, offset: 2368)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !910, file: !4, line: 5207, baseType: !917, size: 64, align: 64, offset: 2432)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !910, file: !4, line: 5214, baseType: !900, size: 32, align: 32, offset: 2496)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !910, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !910, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !910, file: !4, line: 5234, baseType: !900, size: 32, align: 32, offset: 2592)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !910, file: !4, line: 5239, baseType: !900, size: 32, align: 32, offset: 2624)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !910, file: !4, line: 5240, baseType: !900, size: 32, align: 32, offset: 2656)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !910, file: !4, line: 5245, baseType: !900, size: 32, align: 32, offset: 2688)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !910, file: !4, line: 5246, baseType: !900, size: 32, align: 32, offset: 2720)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !910, file: !4, line: 5256, baseType: !900, size: 32, align: 32, offset: 2752)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !896, file: !4, line: 5265, baseType: !957, size: 64, align: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!900, !908, !960, !1554, !1247, !1450, !900}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !963)
!963 = !{!964, !1008, !1009, !1010, !1277, !1278, !1279, !1280, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1306, !1310, !1311, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1492, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !962, file: !4, line: 1561, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !969)
!969 = !{!970, !974, !978, !982, !983, !984, !985, !989, !995, !997, !1001}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !968, file: !19, line: 72, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !968, file: !19, line: 78, baseType: !975, size: 64, align: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DISubroutineType(types: !977)
!977 = !{!971, !913}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !968, file: !19, line: 85, baseType: !979, size: 64, align: 64, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !968, file: !19, line: 93, baseType: !900, size: 32, align: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !968, file: !19, line: 99, baseType: !900, size: 32, align: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !968, file: !19, line: 108, baseType: !900, size: 32, align: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !968, file: !19, line: 113, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!913, !913, !913}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !968, file: !19, line: 123, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!993, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !968, file: !19, line: 130, baseType: !996, size: 32, align: 32, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !968, file: !19, line: 136, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!996, !913}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !968, file: !19, line: 142, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!900, !1005, !913, !971, !900}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !962, file: !4, line: 1562, baseType: !900, size: 32, align: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !962, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !962, file: !4, line: 1565, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1029, !1032, !1035, !1038, !1043, !1046, !1047, !1055, !1056, !1057, !1059, !1063, !1069, !1074, !1078, !1079, !1127, !1248, !1252, !1253, !1257, !1261, !1266, !1270, !1271, !1272}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !4, line: 3475, baseType: !971, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1013, file: !4, line: 3480, baseType: !971, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1013, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1013, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1013, file: !4, line: 3487, baseType: !900, size: 32, align: 32, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1013, file: !4, line: 3488, baseType: !1021, size: 64, align: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1024, line: 61, baseType: !1025)
!1024 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1024, line: 58, size: 64, align: 32, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1025, file: !1024, line: 59, baseType: !900, size: 32, align: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1025, file: !1024, line: 60, baseType: !900, size: 32, align: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1013, file: !4, line: 3489, baseType: !1030, size: 64, align: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1013, file: !4, line: 3490, baseType: !1033, size: 64, align: 64, offset: 384)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !900)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1013, file: !4, line: 3491, baseType: !1036, size: 64, align: 64, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1013, file: !4, line: 3492, baseType: !1039, size: 64, align: 64, offset: 512)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !918, line: 55, baseType: !1042)
!1042 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1013, file: !4, line: 3493, baseType: !1044, size: 8, align: 8, offset: 576)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !918, line: 48, baseType: !1045)
!1045 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1013, file: !4, line: 3494, baseType: !965, size: 64, align: 64, offset: 640)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1013, file: !4, line: 3495, baseType: !1048, size: 64, align: 64, offset: 704)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1051, file: !4, line: 3402, baseType: !900, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1051, file: !4, line: 3403, baseType: !971, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1013, file: !4, line: 3507, baseType: !971, size: 64, align: 64, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1013, file: !4, line: 3516, baseType: !900, size: 32, align: 32, offset: 832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1013, file: !4, line: 3517, baseType: !1058, size: 64, align: 64, offset: 896)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1013, file: !4, line: 3527, baseType: !1060, size: 64, align: 64, offset: 960)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!900, !960}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1013, file: !4, line: 3535, baseType: !1064, size: 64, align: 64, offset: 1024)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DISubroutineType(types: !1066)
!1066 = !{!900, !960, !1067}
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1013, file: !4, line: 3541, baseType: !1070, size: 64, align: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1072)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1073)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1013, file: !4, line: 3549, baseType: !1075, size: 64, align: 64, offset: 1152)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !1058}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1013, file: !4, line: 3551, baseType: !1060, size: 64, align: 64, offset: 1216)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1013, file: !4, line: 3552, baseType: !1080, size: 64, align: 64, offset: 1280)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!900, !960, !1083, !900, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1087)
!1087 = !{!1088, !1091, !1094, !1095, !1096, !1126}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1086, file: !4, line: 3921, baseType: !1089, size: 16, align: 16)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !918, line: 49, baseType: !1090)
!1090 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1086, file: !4, line: 3922, baseType: !1092, size: 32, align: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !918, line: 51, baseType: !1093)
!1093 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1086, file: !4, line: 3923, baseType: !1092, size: 32, align: 32, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1086, file: !4, line: 3924, baseType: !1093, size: 32, align: 32, offset: 96)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1086, file: !4, line: 3925, baseType: !1097, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1117, !1119, !1121, !1122, !1124, !1125}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1100, file: !4, line: 3886, baseType: !900, size: 32, align: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1100, file: !4, line: 3887, baseType: !900, size: 32, align: 32, offset: 32)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1100, file: !4, line: 3888, baseType: !900, size: 32, align: 32, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1100, file: !4, line: 3889, baseType: !900, size: 32, align: 32, offset: 96)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1100, file: !4, line: 3890, baseType: !900, size: 32, align: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1100, file: !4, line: 3897, baseType: !1108, size: 768, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1110)
!1110 = !{!1111, !1115}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1109, file: !4, line: 3855, baseType: !1112, size: 512, align: 64)
!1112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 512, align: 64, elements: !1113)
!1113 = !{!1114}
!1114 = !DISubrange(count: 8)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1109, file: !4, line: 3857, baseType: !1116, size: 256, align: 32, offset: 512)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 256, align: 32, elements: !1113)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1100, file: !4, line: 3903, baseType: !1118, size: 256, align: 64, offset: 960)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 256, align: 64, elements: !932)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1100, file: !4, line: 3904, baseType: !1120, size: 128, align: 32, offset: 1216)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !900, size: 128, align: 32, elements: !932)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1100, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1100, file: !4, line: 3908, baseType: !1123, size: 64, align: 64, offset: 1408)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1100, file: !4, line: 3915, baseType: !1123, size: 64, align: 64, offset: 1472)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1100, file: !4, line: 3917, baseType: !900, size: 32, align: 32, offset: 1536)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1086, file: !4, line: 3926, baseType: !917, size: 64, align: 64, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1013, file: !4, line: 3564, baseType: !1128, size: 64, align: 64, offset: 1344)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!900, !960, !1131, !1165, !1247}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1134)
!1134 = !{!1135, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1161, !1162, !1163, !1164}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1133, file: !4, line: 1451, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1138, line: 94, baseType: !1139)
!1138 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1138, line: 81, size: 192, align: 64, elements: !1140)
!1140 = !{!1141, !1145, !1146}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1139, file: !1138, line: 82, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1138, line: 73, baseType: !1144)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1138, line: 73, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1139, file: !1138, line: 89, baseType: !1083, size: 64, align: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !1138, line: 93, baseType: !900, size: 32, align: 32, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1133, file: !4, line: 1461, baseType: !917, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1133, file: !4, line: 1467, baseType: !917, size: 64, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1133, file: !4, line: 1468, baseType: !1083, size: 64, align: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !4, line: 1469, baseType: !900, size: 32, align: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1133, file: !4, line: 1470, baseType: !900, size: 32, align: 32, offset: 288)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1133, file: !4, line: 1474, baseType: !900, size: 32, align: 32, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1133, file: !4, line: 1479, baseType: !1154, size: 64, align: 64, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1156)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1157)
!1157 = !{!1158, !1159, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1156, file: !4, line: 1412, baseType: !1083, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1156, file: !4, line: 1413, baseType: !900, size: 32, align: 32, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1156, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1133, file: !4, line: 1480, baseType: !900, size: 32, align: 32, offset: 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1133, file: !4, line: 1486, baseType: !917, size: 64, align: 64, offset: 512)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1133, file: !4, line: 1488, baseType: !917, size: 64, align: 64, offset: 576)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1133, file: !4, line: 1497, baseType: !917, size: 64, align: 64, offset: 640)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1199, !1201, !1202, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1235, !1236, !1237, !1238, !1239, !1240, !1243, !1244, !1245, !1246}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !772, line: 282, baseType: !1112, size: 512, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1168, file: !772, line: 299, baseType: !1116, size: 256, align: 32, offset: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1168, file: !772, line: 315, baseType: !1173, size: 64, align: 64, offset: 768)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1168, file: !772, line: 326, baseType: !900, size: 32, align: 32, offset: 832)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1168, file: !772, line: 326, baseType: !900, size: 32, align: 32, offset: 864)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1168, file: !772, line: 334, baseType: !900, size: 32, align: 32, offset: 896)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1168, file: !772, line: 341, baseType: !900, size: 32, align: 32, offset: 928)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1168, file: !772, line: 346, baseType: !900, size: 32, align: 32, offset: 960)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1168, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1168, file: !772, line: 356, baseType: !1023, size: 64, align: 32, offset: 1024)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1168, file: !772, line: 361, baseType: !917, size: 64, align: 64, offset: 1088)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1168, file: !772, line: 369, baseType: !917, size: 64, align: 64, offset: 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1168, file: !772, line: 377, baseType: !917, size: 64, align: 64, offset: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1168, file: !772, line: 382, baseType: !900, size: 32, align: 32, offset: 1280)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1168, file: !772, line: 386, baseType: !900, size: 32, align: 32, offset: 1312)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1168, file: !772, line: 391, baseType: !900, size: 32, align: 32, offset: 1344)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1168, file: !772, line: 396, baseType: !913, size: 64, align: 64, offset: 1408)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1168, file: !772, line: 403, baseType: !1189, size: 512, align: 64, offset: 1472)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 512, align: 64, elements: !1113)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1168, file: !772, line: 410, baseType: !900, size: 32, align: 32, offset: 1984)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1168, file: !772, line: 415, baseType: !900, size: 32, align: 32, offset: 2016)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1168, file: !772, line: 420, baseType: !900, size: 32, align: 32, offset: 2048)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1168, file: !772, line: 425, baseType: !900, size: 32, align: 32, offset: 2080)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1168, file: !772, line: 435, baseType: !917, size: 64, align: 64, offset: 2112)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1168, file: !772, line: 440, baseType: !900, size: 32, align: 32, offset: 2176)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1168, file: !772, line: 445, baseType: !1041, size: 64, align: 64, offset: 2240)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1168, file: !772, line: 459, baseType: !1198, size: 512, align: 64, offset: 2304)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 512, align: 64, elements: !1113)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1168, file: !772, line: 473, baseType: !1200, size: 64, align: 64, offset: 2816)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1168, file: !772, line: 477, baseType: !900, size: 32, align: 32, offset: 2880)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1168, file: !772, line: 479, baseType: !1203, size: 64, align: 64, offset: 2944)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1207)
!1207 = !{!1208, !1209, !1210, !1211, !1216}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1206, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1206, file: !772, line: 203, baseType: !1083, size: 64, align: 64, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1206, file: !772, line: 204, baseType: !900, size: 32, align: 32, offset: 128)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1206, file: !772, line: 205, baseType: !1212, size: 64, align: 64, offset: 192)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1214, line: 86, baseType: !1215)
!1214 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1215 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1214, line: 86, flags: DIFlagFwdDecl)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1206, file: !772, line: 206, baseType: !1136, size: 64, align: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1168, file: !772, line: 480, baseType: !900, size: 32, align: 32, offset: 3008)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1168, file: !772, line: 505, baseType: !900, size: 32, align: 32, offset: 3040)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1168, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1168, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1168, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1168, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1168, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1168, file: !772, line: 532, baseType: !917, size: 64, align: 64, offset: 3264)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1168, file: !772, line: 539, baseType: !917, size: 64, align: 64, offset: 3328)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1168, file: !772, line: 547, baseType: !917, size: 64, align: 64, offset: 3392)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1168, file: !772, line: 554, baseType: !1212, size: 64, align: 64, offset: 3456)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1168, file: !772, line: 563, baseType: !900, size: 32, align: 32, offset: 3520)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1168, file: !772, line: 572, baseType: !900, size: 32, align: 32, offset: 3552)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1168, file: !772, line: 581, baseType: !900, size: 32, align: 32, offset: 3584)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1168, file: !772, line: 588, baseType: !1232, size: 64, align: 64, offset: 3648)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !918, line: 36, baseType: !1234)
!1234 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1168, file: !772, line: 593, baseType: !900, size: 32, align: 32, offset: 3712)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1168, file: !772, line: 596, baseType: !900, size: 32, align: 32, offset: 3744)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1168, file: !772, line: 599, baseType: !1136, size: 64, align: 64, offset: 3776)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1168, file: !772, line: 605, baseType: !1136, size: 64, align: 64, offset: 3840)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1168, file: !772, line: 616, baseType: !1136, size: 64, align: 64, offset: 3904)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1168, file: !772, line: 626, baseType: !1241, size: 64, align: 64, offset: 3968)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1242, line: 216, baseType: !1042)
!1242 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1168, file: !772, line: 627, baseType: !1241, size: 64, align: 64, offset: 4032)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1168, file: !772, line: 628, baseType: !1241, size: 64, align: 64, offset: 4096)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1168, file: !772, line: 629, baseType: !1241, size: 64, align: 64, offset: 4160)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1168, file: !772, line: 645, baseType: !1136, size: 64, align: 64, offset: 4224)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1013, file: !4, line: 3566, baseType: !1249, size: 64, align: 64, offset: 1408)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64, align: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{!900, !960, !913, !1247, !1131}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1013, file: !4, line: 3567, baseType: !1060, size: 64, align: 64, offset: 1472)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1013, file: !4, line: 3576, baseType: !1254, size: 64, align: 64, offset: 1536)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!900, !960, !1165}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1013, file: !4, line: 3577, baseType: !1258, size: 64, align: 64, offset: 1600)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!900, !960, !1131}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1013, file: !4, line: 3584, baseType: !1262, size: 64, align: 64, offset: 1664)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!900, !960, !1265}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1013, file: !4, line: 3589, baseType: !1267, size: 64, align: 64, offset: 1728)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DISubroutineType(types: !1269)
!1269 = !{null, !960}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1013, file: !4, line: 3594, baseType: !900, size: 32, align: 32, offset: 1792)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1013, file: !4, line: 3600, baseType: !971, size: 64, align: 64, offset: 1856)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1013, file: !4, line: 3609, baseType: !1273, size: 64, align: 64, offset: 1920)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !962, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !962, file: !4, line: 1581, baseType: !1093, size: 32, align: 32, offset: 224)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !962, file: !4, line: 1583, baseType: !913, size: 64, align: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !962, file: !4, line: 1591, baseType: !1281, size: 64, align: 64, offset: 320)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !962, file: !4, line: 1598, baseType: !913, size: 64, align: 64, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !962, file: !4, line: 1606, baseType: !917, size: 64, align: 64, offset: 448)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !962, file: !4, line: 1614, baseType: !900, size: 32, align: 32, offset: 512)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !962, file: !4, line: 1622, baseType: !900, size: 32, align: 32, offset: 544)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !962, file: !4, line: 1628, baseType: !900, size: 32, align: 32, offset: 576)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !962, file: !4, line: 1636, baseType: !900, size: 32, align: 32, offset: 608)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !962, file: !4, line: 1643, baseType: !900, size: 32, align: 32, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !962, file: !4, line: 1657, baseType: !1083, size: 64, align: 64, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !962, file: !4, line: 1658, baseType: !900, size: 32, align: 32, offset: 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !962, file: !4, line: 1679, baseType: !1023, size: 64, align: 32, offset: 800)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !962, file: !4, line: 1688, baseType: !900, size: 32, align: 32, offset: 864)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !962, file: !4, line: 1712, baseType: !900, size: 32, align: 32, offset: 896)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !962, file: !4, line: 1729, baseType: !900, size: 32, align: 32, offset: 928)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !962, file: !4, line: 1729, baseType: !900, size: 32, align: 32, offset: 960)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !962, file: !4, line: 1744, baseType: !900, size: 32, align: 32, offset: 992)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !962, file: !4, line: 1744, baseType: !900, size: 32, align: 32, offset: 1024)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !962, file: !4, line: 1751, baseType: !900, size: 32, align: 32, offset: 1056)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !962, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !962, file: !4, line: 1791, baseType: !1302, size: 64, align: 64, offset: 1152)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{null, !1305, !1165, !1247, !900, !900, !900}
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !962, file: !4, line: 1808, baseType: !1307, size: 64, align: 64, offset: 1216)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!508, !1305, !1030}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !962, file: !4, line: 1816, baseType: !900, size: 32, align: 32, offset: 1280)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !962, file: !4, line: 1825, baseType: !1312, size: 32, align: 32, offset: 1312)
!1312 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !962, file: !4, line: 1830, baseType: !900, size: 32, align: 32, offset: 1344)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !962, file: !4, line: 1838, baseType: !1312, size: 32, align: 32, offset: 1376)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !962, file: !4, line: 1846, baseType: !900, size: 32, align: 32, offset: 1408)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !962, file: !4, line: 1851, baseType: !900, size: 32, align: 32, offset: 1440)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !962, file: !4, line: 1861, baseType: !1312, size: 32, align: 32, offset: 1472)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !962, file: !4, line: 1868, baseType: !1312, size: 32, align: 32, offset: 1504)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !962, file: !4, line: 1875, baseType: !1312, size: 32, align: 32, offset: 1536)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !962, file: !4, line: 1882, baseType: !1312, size: 32, align: 32, offset: 1568)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !962, file: !4, line: 1889, baseType: !1312, size: 32, align: 32, offset: 1600)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !962, file: !4, line: 1896, baseType: !1312, size: 32, align: 32, offset: 1632)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !962, file: !4, line: 1903, baseType: !1312, size: 32, align: 32, offset: 1664)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !962, file: !4, line: 1910, baseType: !900, size: 32, align: 32, offset: 1696)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !962, file: !4, line: 1915, baseType: !900, size: 32, align: 32, offset: 1728)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !962, file: !4, line: 1926, baseType: !1247, size: 64, align: 64, offset: 1792)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !962, file: !4, line: 1935, baseType: !1023, size: 64, align: 32, offset: 1856)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !962, file: !4, line: 1942, baseType: !900, size: 32, align: 32, offset: 1920)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !962, file: !4, line: 1948, baseType: !900, size: 32, align: 32, offset: 1952)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !962, file: !4, line: 1954, baseType: !900, size: 32, align: 32, offset: 1984)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !962, file: !4, line: 1960, baseType: !900, size: 32, align: 32, offset: 2016)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !962, file: !4, line: 1984, baseType: !900, size: 32, align: 32, offset: 2048)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !962, file: !4, line: 1991, baseType: !900, size: 32, align: 32, offset: 2080)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !962, file: !4, line: 1996, baseType: !900, size: 32, align: 32, offset: 2112)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !962, file: !4, line: 2004, baseType: !900, size: 32, align: 32, offset: 2144)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !962, file: !4, line: 2011, baseType: !900, size: 32, align: 32, offset: 2176)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !962, file: !4, line: 2018, baseType: !900, size: 32, align: 32, offset: 2208)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !962, file: !4, line: 2027, baseType: !900, size: 32, align: 32, offset: 2240)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !962, file: !4, line: 2034, baseType: !900, size: 32, align: 32, offset: 2272)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !962, file: !4, line: 2044, baseType: !900, size: 32, align: 32, offset: 2304)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !962, file: !4, line: 2054, baseType: !1342, size: 64, align: 64, offset: 2368)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !962, file: !4, line: 2061, baseType: !1342, size: 64, align: 64, offset: 2432)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !962, file: !4, line: 2066, baseType: !900, size: 32, align: 32, offset: 2496)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !962, file: !4, line: 2070, baseType: !900, size: 32, align: 32, offset: 2528)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !962, file: !4, line: 2078, baseType: !900, size: 32, align: 32, offset: 2560)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !962, file: !4, line: 2085, baseType: !900, size: 32, align: 32, offset: 2592)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !962, file: !4, line: 2092, baseType: !900, size: 32, align: 32, offset: 2624)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !962, file: !4, line: 2099, baseType: !900, size: 32, align: 32, offset: 2656)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !962, file: !4, line: 2106, baseType: !900, size: 32, align: 32, offset: 2688)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !962, file: !4, line: 2113, baseType: !900, size: 32, align: 32, offset: 2720)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !962, file: !4, line: 2120, baseType: !900, size: 32, align: 32, offset: 2752)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !962, file: !4, line: 2125, baseType: !900, size: 32, align: 32, offset: 2784)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !962, file: !4, line: 2133, baseType: !900, size: 32, align: 32, offset: 2816)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !962, file: !4, line: 2140, baseType: !900, size: 32, align: 32, offset: 2848)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !962, file: !4, line: 2145, baseType: !900, size: 32, align: 32, offset: 2880)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !962, file: !4, line: 2153, baseType: !900, size: 32, align: 32, offset: 2912)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !962, file: !4, line: 2158, baseType: !900, size: 32, align: 32, offset: 2944)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !962, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !962, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !962, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !962, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !962, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !962, file: !4, line: 2203, baseType: !900, size: 32, align: 32, offset: 3136)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !962, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !962, file: !4, line: 2212, baseType: !900, size: 32, align: 32, offset: 3200)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !962, file: !4, line: 2213, baseType: !900, size: 32, align: 32, offset: 3232)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !962, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !962, file: !4, line: 2232, baseType: !900, size: 32, align: 32, offset: 3296)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !962, file: !4, line: 2243, baseType: !900, size: 32, align: 32, offset: 3328)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !962, file: !4, line: 2249, baseType: !900, size: 32, align: 32, offset: 3360)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !962, file: !4, line: 2256, baseType: !900, size: 32, align: 32, offset: 3392)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !962, file: !4, line: 2263, baseType: !1041, size: 64, align: 64, offset: 3456)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !962, file: !4, line: 2270, baseType: !1041, size: 64, align: 64, offset: 3520)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !962, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !962, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !962, file: !4, line: 2367, baseType: !1378, size: 64, align: 64, offset: 3648)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!900, !1305, !1265, !900}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !962, file: !4, line: 2383, baseType: !900, size: 32, align: 32, offset: 3712)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !962, file: !4, line: 2386, baseType: !1312, size: 32, align: 32, offset: 3744)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !962, file: !4, line: 2387, baseType: !1312, size: 32, align: 32, offset: 3776)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !962, file: !4, line: 2394, baseType: !900, size: 32, align: 32, offset: 3808)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !962, file: !4, line: 2401, baseType: !900, size: 32, align: 32, offset: 3840)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !962, file: !4, line: 2408, baseType: !900, size: 32, align: 32, offset: 3872)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !962, file: !4, line: 2415, baseType: !900, size: 32, align: 32, offset: 3904)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !962, file: !4, line: 2422, baseType: !900, size: 32, align: 32, offset: 3936)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !962, file: !4, line: 2423, baseType: !1390, size: 64, align: 64, offset: 3968)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1393)
!1393 = !{!1394, !1395, !1396, !1397}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1392, file: !4, line: 827, baseType: !900, size: 32, align: 32)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1392, file: !4, line: 828, baseType: !900, size: 32, align: 32, offset: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1392, file: !4, line: 829, baseType: !900, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1392, file: !4, line: 830, baseType: !1312, size: 32, align: 32, offset: 96)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !962, file: !4, line: 2430, baseType: !917, size: 64, align: 64, offset: 4032)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !962, file: !4, line: 2437, baseType: !917, size: 64, align: 64, offset: 4096)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !962, file: !4, line: 2444, baseType: !1312, size: 32, align: 32, offset: 4160)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !962, file: !4, line: 2451, baseType: !1312, size: 32, align: 32, offset: 4192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !962, file: !4, line: 2458, baseType: !900, size: 32, align: 32, offset: 4224)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !962, file: !4, line: 2469, baseType: !900, size: 32, align: 32, offset: 4256)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !962, file: !4, line: 2475, baseType: !900, size: 32, align: 32, offset: 4288)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !962, file: !4, line: 2481, baseType: !900, size: 32, align: 32, offset: 4320)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !962, file: !4, line: 2485, baseType: !900, size: 32, align: 32, offset: 4352)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !962, file: !4, line: 2489, baseType: !900, size: 32, align: 32, offset: 4384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !962, file: !4, line: 2493, baseType: !900, size: 32, align: 32, offset: 4416)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !962, file: !4, line: 2501, baseType: !900, size: 32, align: 32, offset: 4448)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !962, file: !4, line: 2506, baseType: !900, size: 32, align: 32, offset: 4480)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !962, file: !4, line: 2510, baseType: !900, size: 32, align: 32, offset: 4512)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !962, file: !4, line: 2514, baseType: !917, size: 64, align: 64, offset: 4544)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !962, file: !4, line: 2528, baseType: !1414, size: 64, align: 64, offset: 4608)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{null, !1305, !913, !900, !900}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !962, file: !4, line: 2534, baseType: !900, size: 32, align: 32, offset: 4672)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !962, file: !4, line: 2545, baseType: !900, size: 32, align: 32, offset: 4704)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !962, file: !4, line: 2547, baseType: !900, size: 32, align: 32, offset: 4736)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !962, file: !4, line: 2549, baseType: !900, size: 32, align: 32, offset: 4768)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !962, file: !4, line: 2551, baseType: !900, size: 32, align: 32, offset: 4800)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !962, file: !4, line: 2553, baseType: !900, size: 32, align: 32, offset: 4832)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !962, file: !4, line: 2555, baseType: !900, size: 32, align: 32, offset: 4864)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !962, file: !4, line: 2557, baseType: !900, size: 32, align: 32, offset: 4896)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !962, file: !4, line: 2559, baseType: !900, size: 32, align: 32, offset: 4928)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !962, file: !4, line: 2563, baseType: !900, size: 32, align: 32, offset: 4960)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !962, file: !4, line: 2571, baseType: !1123, size: 64, align: 64, offset: 4992)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !962, file: !4, line: 2579, baseType: !1123, size: 64, align: 64, offset: 5056)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !962, file: !4, line: 2586, baseType: !900, size: 32, align: 32, offset: 5120)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !962, file: !4, line: 2615, baseType: !900, size: 32, align: 32, offset: 5152)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !962, file: !4, line: 2627, baseType: !900, size: 32, align: 32, offset: 5184)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !962, file: !4, line: 2637, baseType: !900, size: 32, align: 32, offset: 5216)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !962, file: !4, line: 2681, baseType: !900, size: 32, align: 32, offset: 5248)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !962, file: !4, line: 2709, baseType: !917, size: 64, align: 64, offset: 5312)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !962, file: !4, line: 2716, baseType: !1436, size: 64, align: 64, offset: 5376)
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1443, !1444, !1445, !1446, !1452, !1456, !1457, !1458, !1459, !1465, !1466, !1467, !1468, !1469}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1438, file: !4, line: 3642, baseType: !971, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1438, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1438, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1438, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1438, file: !4, line: 3669, baseType: !900, size: 32, align: 32, offset: 160)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1438, file: !4, line: 3682, baseType: !1262, size: 64, align: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1438, file: !4, line: 3698, baseType: !1447, size: 64, align: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DISubroutineType(types: !1449)
!1449 = !{!900, !960, !1450, !1092}
!1450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64, align: 64)
!1451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1438, file: !4, line: 3712, baseType: !1453, size: 64, align: 64, offset: 320)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DISubroutineType(types: !1455)
!1455 = !{!900, !960, !900, !1450, !1092}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1438, file: !4, line: 3726, baseType: !1447, size: 64, align: 64, offset: 384)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1438, file: !4, line: 3737, baseType: !1060, size: 64, align: 64, offset: 448)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1438, file: !4, line: 3746, baseType: !900, size: 32, align: 32, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1438, file: !4, line: 3757, baseType: !1460, size: 64, align: 64, offset: 576)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{null, !1463}
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64, align: 64)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1438, file: !4, line: 3766, baseType: !1060, size: 64, align: 64, offset: 640)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1438, file: !4, line: 3774, baseType: !1060, size: 64, align: 64, offset: 704)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1438, file: !4, line: 3780, baseType: !900, size: 32, align: 32, offset: 768)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1438, file: !4, line: 3785, baseType: !900, size: 32, align: 32, offset: 800)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1438, file: !4, line: 3795, baseType: !1470, size: 64, align: 64, offset: 832)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{!900, !960, !1136}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !962, file: !4, line: 2728, baseType: !913, size: 64, align: 64, offset: 5440)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !962, file: !4, line: 2735, baseType: !1189, size: 512, align: 64, offset: 5504)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !962, file: !4, line: 2742, baseType: !900, size: 32, align: 32, offset: 6016)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !962, file: !4, line: 2755, baseType: !900, size: 32, align: 32, offset: 6048)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !962, file: !4, line: 2776, baseType: !900, size: 32, align: 32, offset: 6080)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !962, file: !4, line: 2783, baseType: !900, size: 32, align: 32, offset: 6112)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !962, file: !4, line: 2791, baseType: !900, size: 32, align: 32, offset: 6144)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !962, file: !4, line: 2802, baseType: !1265, size: 64, align: 64, offset: 6208)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !962, file: !4, line: 2811, baseType: !900, size: 32, align: 32, offset: 6272)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !962, file: !4, line: 2821, baseType: !900, size: 32, align: 32, offset: 6304)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !962, file: !4, line: 2830, baseType: !900, size: 32, align: 32, offset: 6336)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !962, file: !4, line: 2840, baseType: !900, size: 32, align: 32, offset: 6368)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !962, file: !4, line: 2851, baseType: !1486, size: 64, align: 64, offset: 6400)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!900, !1305, !1489, !913, !1247, !900, !900}
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!900, !1305, !913}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !962, file: !4, line: 2871, baseType: !1493, size: 64, align: 64, offset: 6464)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!900, !1305, !1496, !913, !1247, !900}
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!900, !1305, !913, !900, !900}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !962, file: !4, line: 2878, baseType: !900, size: 32, align: 32, offset: 6528)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !962, file: !4, line: 2885, baseType: !900, size: 32, align: 32, offset: 6560)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !962, file: !4, line: 3005, baseType: !900, size: 32, align: 32, offset: 6592)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !962, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !962, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !962, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !962, file: !4, line: 3037, baseType: !1083, size: 64, align: 64, offset: 6720)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !962, file: !4, line: 3038, baseType: !900, size: 32, align: 32, offset: 6784)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !962, file: !4, line: 3050, baseType: !1041, size: 64, align: 64, offset: 6848)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !962, file: !4, line: 3065, baseType: !900, size: 32, align: 32, offset: 6912)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !962, file: !4, line: 3083, baseType: !900, size: 32, align: 32, offset: 6944)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !962, file: !4, line: 3092, baseType: !1023, size: 64, align: 32, offset: 6976)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !962, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !962, file: !4, line: 3106, baseType: !1023, size: 64, align: 32, offset: 7072)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !962, file: !4, line: 3113, baseType: !1514, size: 64, align: 64, offset: 7168)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1517)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1518)
!1518 = !{!1519, !1520, !1521, !1522, !1523, !1524, !1527}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1517, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1517, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1517, file: !4, line: 720, baseType: !971, size: 64, align: 64, offset: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1517, file: !4, line: 724, baseType: !971, size: 64, align: 64, offset: 128)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1517, file: !4, line: 728, baseType: !900, size: 32, align: 32, offset: 192)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1517, file: !4, line: 734, baseType: !1525, size: 64, align: 64, offset: 256)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1517, file: !4, line: 739, baseType: !1528, size: 64, align: 64, offset: 320)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !962, file: !4, line: 3129, baseType: !917, size: 64, align: 64, offset: 7232)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !962, file: !4, line: 3130, baseType: !917, size: 64, align: 64, offset: 7296)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !962, file: !4, line: 3131, baseType: !917, size: 64, align: 64, offset: 7360)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !962, file: !4, line: 3132, baseType: !917, size: 64, align: 64, offset: 7424)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !962, file: !4, line: 3139, baseType: !1123, size: 64, align: 64, offset: 7488)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !962, file: !4, line: 3147, baseType: !900, size: 32, align: 32, offset: 7552)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !962, file: !4, line: 3165, baseType: !900, size: 32, align: 32, offset: 7584)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !962, file: !4, line: 3172, baseType: !900, size: 32, align: 32, offset: 7616)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !962, file: !4, line: 3180, baseType: !900, size: 32, align: 32, offset: 7648)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !962, file: !4, line: 3191, baseType: !1342, size: 64, align: 64, offset: 7680)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !962, file: !4, line: 3199, baseType: !1083, size: 64, align: 64, offset: 7744)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !962, file: !4, line: 3207, baseType: !1123, size: 64, align: 64, offset: 7808)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !962, file: !4, line: 3214, baseType: !1093, size: 32, align: 32, offset: 7872)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !962, file: !4, line: 3224, baseType: !1154, size: 64, align: 64, offset: 7936)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !962, file: !4, line: 3225, baseType: !900, size: 32, align: 32, offset: 8000)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !962, file: !4, line: 3249, baseType: !1136, size: 64, align: 64, offset: 8064)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !962, file: !4, line: 3256, baseType: !900, size: 32, align: 32, offset: 8128)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !962, file: !4, line: 3271, baseType: !900, size: 32, align: 32, offset: 8160)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !962, file: !4, line: 3279, baseType: !917, size: 64, align: 64, offset: 8192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !962, file: !4, line: 3301, baseType: !1136, size: 64, align: 64, offset: 8256)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !962, file: !4, line: 3310, baseType: !900, size: 32, align: 32, offset: 8320)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !962, file: !4, line: 3337, baseType: !900, size: 32, align: 32, offset: 8352)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !962, file: !4, line: 3351, baseType: !900, size: 32, align: 32, offset: 8384)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !962, file: !4, line: 3359, baseType: !900, size: 32, align: 32, offset: 8416)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !896, file: !4, line: 5269, baseType: !1556, size: 64, align: 64, offset: 320)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{null, !908}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !896, file: !4, line: 5270, baseType: !1560, size: 64, align: 64, offset: 384)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!900, !960, !1450, !900}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !896, file: !4, line: 5271, baseType: !915, size: 64, align: 64, offset: 448)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !918, line: 122, baseType: !1042)
!1565 = !{!1566, !1570}
!1566 = distinct !DIGlobalVariable(name: "av_parser_next_init", scope: !0, file: !1567, line: 73, type: !1568, isLocal: true, isDefinition: true, variable: i32* @av_parser_next_init)
!1567 = !DIFile(filename: "libavcodec/parsers.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_once_t", file: !1569, line: 168, baseType: !900)
!1569 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1570 = distinct !DIGlobalVariable(name: "parser_list", scope: !0, file: !1571, line: 1, type: !1572, isLocal: true, isDefinition: true, variable: [46 x %struct.AVCodecParser*]* @parser_list)
!1571 = !DIFile(filename: "./libavcodec/parser_list.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1573, size: 2944, align: 64, elements: !1576)
!1573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1574)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!1576 = !{!1577}
!1577 = !DISubrange(count: 46)
!1578 = !{i32 2, !"Dwarf Version", i32 4}
!1579 = !{i32 2, !"Debug Info Version", i32 3}
!1580 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1581 = distinct !DISubprogram(name: "av_parser_next", scope: !1567, file: !1567, line: 86, type: !1582, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1584)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!894, !1574}
!1584 = !{}
!1585 = !DILocalVariable(name: "p", arg: 1, scope: !1581, file: !1567, line: 86, type: !1574)
!1586 = !DIExpression()
!1587 = !DILocation(line: 86, column: 52, scope: !1581)
!1588 = !DILocation(line: 88, column: 5, scope: !1581)
!1589 = !DILocation(line: 90, column: 9, scope: !1590)
!1590 = distinct !DILexicalBlock(scope: !1581, file: !1567, line: 90, column: 9)
!1591 = !DILocation(line: 90, column: 9, scope: !1581)
!1592 = !DILocation(line: 91, column: 16, scope: !1590)
!1593 = !DILocation(line: 91, column: 19, scope: !1590)
!1594 = !DILocation(line: 91, column: 9, scope: !1590)
!1595 = !DILocation(line: 93, column: 32, scope: !1590)
!1596 = !DILocation(line: 93, column: 9, scope: !1590)
!1597 = !DILocation(line: 94, column: 1, scope: !1581)
!1598 = distinct !DISubprogram(name: "av_parser_init_next", scope: !1567, file: !1567, line: 75, type: !1599, isLocal: true, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1584)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{null}
!1601 = !DILocalVariable(name: "prev", scope: !1598, file: !1567, line: 77, type: !894)
!1602 = !DILocation(line: 77, column: 20, scope: !1598)
!1603 = !DILocalVariable(name: "p", scope: !1598, file: !1567, line: 77, type: !894)
!1604 = !DILocation(line: 77, column: 33, scope: !1598)
!1605 = !DILocalVariable(name: "i", scope: !1598, file: !1567, line: 78, type: !900)
!1606 = !DILocation(line: 78, column: 9, scope: !1598)
!1607 = !DILocation(line: 79, column: 5, scope: !1598)
!1608 = !DILocation(line: 79, column: 46, scope: !1609)
!1609 = !DILexicalBlockFile(scope: !1598, file: !1567, discriminator: 1)
!1610 = !DILocation(line: 79, column: 33, scope: !1609)
!1611 = !DILocation(line: 79, column: 15, scope: !1609)
!1612 = !DILocation(line: 79, column: 5, scope: !1609)
!1613 = !DILocation(line: 80, column: 13, scope: !1614)
!1614 = distinct !DILexicalBlock(scope: !1615, file: !1567, line: 80, column: 13)
!1615 = distinct !DILexicalBlock(scope: !1598, file: !1567, line: 79, column: 52)
