; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lzwenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lzwenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.LZWEncodeState = type { i32, i32, [16411 x %struct.Code], i32, i32, i32, %struct.PutBitContext, i32, i32, i32, i32, i32, void (%struct.PutBitContext*, i32, i32)* }
%struct.Code = type { i32, i32, i8 }
%struct.PutBitContext = type { i32, i32, i8*, i8*, i8*, i32 }

@ff_lzw_encode_state_size = constant i32 197024, align 4
@.str = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [36 x i8] c"s->maxbits >= 9 && s->maxbits <= 12\00", align 1
@.str.2 = private unnamed_addr constant [20 x i8] c"libavcodec/lzwenc.c\00", align 1

; Function Attrs: nounwind uwtable
define void @ff_lzw_encode_init(%struct.LZWEncodeState* %s, i8* %outbuf, i32 %outsize, i32 %maxbits, i32 %mode, void (%struct.PutBitContext*, i32, i32)* %lzw_put_bits) #0 !dbg !18 {
entry:
  %s.addr = alloca %struct.LZWEncodeState*, align 8
  %outbuf.addr = alloca i8*, align 8
  %outsize.addr = alloca i32, align 4
  %maxbits.addr = alloca i32, align 4
  %mode.addr = alloca i32, align 4
  %lzw_put_bits.addr = alloca void (%struct.PutBitContext*, i32, i32)*, align 8
  store %struct.LZWEncodeState* %s, %struct.LZWEncodeState** %s.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !8, globals: !10)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lzwenc.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FF_LZW_MODES", file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/lzw.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FF_LZW_GIF", value: 0)
!7 = !DIEnumerator(name: "FF_LZW_TIFF", value: 1)
!8 = !{!9}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!10 = !{!11}
!11 = distinct !DIGlobalVariable(name: "ff_lzw_encode_state_size", scope: !0, file: !12, line: 67, type: !13, isLocal: false, isDefinition: true, variable: i32* @ff_lzw_encode_state_size)
!12 = !DIFile(filename: "libavcodec/lzwenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!18 = distinct !DISubprogram(name: "ff_lzw_encode_init", scope: !12, file: !12, line: 202, type: !19, isLocal: false, isDefinition: true, scopeLine: 205, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !67)
!19 = !DISubroutineType(types: !20)
!20 = !{null, !21, !53, !14, !14, !3, !63}
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZWEncodeState", file: !12, line: 64, baseType: !23)
!23 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LZWEncodeState", file: !12, line: 50, size: 1576192, align: 64, elements: !24)
!24 = !{!25, !26, !27, !40, !41, !42, !43, !57, !58, !59, !60, !61, !62}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "clear_code", scope: !23, file: !12, line: 51, baseType: !14, size: 32, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !23, file: !12, line: 52, baseType: !14, size: 32, align: 32, offset: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "tab", scope: !23, file: !12, line: 53, baseType: !28, size: 1575456, align: 32, offset: 64)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 1575456, align: 32, elements: !38)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "Code", file: !12, line: 47, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Code", file: !12, line: 42, size: 96, align: 32, elements: !31)
!31 = !{!32, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "hash_prefix", scope: !30, file: !12, line: 44, baseType: !14, size: 32, align: 32)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !30, file: !12, line: 45, baseType: !14, size: 32, align: 32, offset: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !30, file: !12, line: 46, baseType: !35, size: 8, align: 8, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !36, line: 48, baseType: !37)
!36 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!37 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!38 = !{!39}
!39 = !DISubrange(count: 16411)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "tabsize", scope: !23, file: !12, line: 54, baseType: !14, size: 32, align: 32, offset: 1575520)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !23, file: !12, line: 55, baseType: !14, size: 32, align: 32, offset: 1575552)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "bufsize", scope: !23, file: !12, line: 56, baseType: !14, size: 32, align: 32, offset: 1575584)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !23, file: !12, line: 57, baseType: !44, size: 320, align: 64, offset: 1575616)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !45, line: 40, baseType: !46)
!45 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !45, line: 35, size: 320, align: 64, elements: !47)
!47 = !{!48, !51, !52, !54, !55, !56}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !46, file: !45, line: 36, baseType: !49, size: 32, align: 32)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !36, line: 51, baseType: !50)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !46, file: !45, line: 37, baseType: !14, size: 32, align: 32, offset: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !46, file: !45, line: 38, baseType: !53, size: 64, align: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !46, file: !45, line: 38, baseType: !53, size: 64, align: 64, offset: 128)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !46, file: !45, line: 38, baseType: !53, size: 64, align: 64, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !46, file: !45, line: 39, baseType: !14, size: 32, align: 32, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "maxbits", scope: !23, file: !12, line: 58, baseType: !14, size: 32, align: 32, offset: 1575936)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "maxcode", scope: !23, file: !12, line: 59, baseType: !14, size: 32, align: 32, offset: 1575968)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "output_bytes", scope: !23, file: !12, line: 60, baseType: !14, size: 32, align: 32, offset: 1576000)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "last_code", scope: !23, file: !12, line: 61, baseType: !14, size: 32, align: 32, offset: 1576032)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !23, file: !12, line: 62, baseType: !3, size: 32, align: 32, offset: 1576064)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "put_bits", scope: !23, file: !12, line: 63, baseType: !63, size: 64, align: 64, offset: 1576128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !14, !50}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64, align: 64)
!67 = !{}
!68 = !DILocalVariable(name: "s", arg: 1, scope: !18, file: !12, line: 202, type: !21)
!69 = !DIExpression()
!70 = !DILocation(line: 202, column: 41, scope: !18)
!71 = !DILocalVariable(name: "outbuf", arg: 2, scope: !18, file: !12, line: 202, type: !53)
!72 = !DILocation(line: 202, column: 53, scope: !18)
!73 = !DILocalVariable(name: "outsize", arg: 3, scope: !18, file: !12, line: 202, type: !14)
!74 = !DILocation(line: 202, column: 65, scope: !18)
!75 = !DILocalVariable(name: "maxbits", arg: 4, scope: !18, file: !12, line: 203, type: !14)
!76 = !DILocation(line: 203, column: 29, scope: !18)
!77 = !DILocalVariable(name: "mode", arg: 5, scope: !18, file: !12, line: 203, type: !3)
!78 = !DILocation(line: 203, column: 56, scope: !18)
!79 = !DILocalVariable(name: "lzw_put_bits", arg: 6, scope: !18, file: !12, line: 204, type: !63)
!80 = !DILocation(line: 204, column: 32, scope: !18)
!81 = !DILocation(line: 206, column: 5, scope: !18)
!82 = !DILocation(line: 206, column: 8, scope: !18)
!83 = !DILocation(line: 206, column: 19, scope: !18)
!84 = !DILocation(line: 207, column: 5, scope: !18)
!85 = !DILocation(line: 207, column: 8, scope: !18)
!86 = !DILocation(line: 207, column: 17, scope: !18)
!87 = !DILocation(line: 208, column: 18, scope: !18)
!88 = !DILocation(line: 208, column: 5, scope: !18)
!89 = !DILocation(line: 208, column: 8, scope: !18)
!90 = !DILocation(line: 208, column: 16, scope: !18)
!91 = !DILocation(line: 209, column: 20, scope: !18)
!92 = !DILocation(line: 209, column: 23, scope: !18)
!93 = !DILocation(line: 209, column: 27, scope: !18)
!94 = !DILocation(line: 209, column: 35, scope: !18)
!95 = !DILocation(line: 209, column: 5, scope: !18)
!96 = !DILocation(line: 210, column: 18, scope: !18)
!97 = !DILocation(line: 210, column: 5, scope: !18)
!98 = !DILocation(line: 210, column: 8, scope: !18)
!99 = !DILocation(line: 210, column: 16, scope: !18)
!100 = !DILocation(line: 211, column: 5, scope: !18)
!101 = distinct !{!101, !100}
!102 = !DILocation(line: 211, column: 16, scope: !103)
!103 = !DILexicalBlockFile(scope: !104, file: !12, discriminator: 1)
!104 = distinct !DILexicalBlock(scope: !105, file: !12, line: 211, column: 14)
!105 = distinct !DILexicalBlock(scope: !18, file: !12, line: 211, column: 8)
!106 = !DILocation(line: 211, column: 19, scope: !103)
!107 = !DILocation(line: 211, column: 27, scope: !103)
!108 = !DILocation(line: 211, column: 32, scope: !103)
!109 = !DILocation(line: 211, column: 35, scope: !110)
!110 = !DILexicalBlockFile(scope: !104, file: !12, discriminator: 2)
!111 = !DILocation(line: 211, column: 38, scope: !110)
!112 = !DILocation(line: 211, column: 46, scope: !110)
!113 = !DILocation(line: 211, column: 14, scope: !110)
!114 = !DILocation(line: 211, column: 56, scope: !115)
!115 = !DILexicalBlockFile(scope: !116, file: !12, discriminator: 3)
!116 = distinct !DILexicalBlock(scope: !104, file: !12, line: 211, column: 54)
!117 = !DILocation(line: 211, column: 111, scope: !118)
!118 = !DILexicalBlockFile(scope: !115, file: !12, discriminator: 5)
!119 = !DILocation(line: 211, column: 111, scope: !115)
!120 = !DILocation(line: 211, column: 122, scope: !121)
!121 = !DILexicalBlockFile(scope: !105, file: !12, discriminator: 4)
!122 = !DILocation(line: 212, column: 23, scope: !18)
!123 = !DILocation(line: 212, column: 26, scope: !18)
!124 = !DILocation(line: 212, column: 20, scope: !18)
!125 = !DILocation(line: 212, column: 5, scope: !18)
!126 = !DILocation(line: 212, column: 8, scope: !18)
!127 = !DILocation(line: 212, column: 16, scope: !18)
!128 = !DILocation(line: 213, column: 5, scope: !18)
