; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--tee.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--tee.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!876 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!877 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!878 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !556, line: 538, size: 32, align: 32, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888}
!881 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!882 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!883 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!884 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!885 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!886 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!887 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!888 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 31, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/tee.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942}
!941 = !DIEnumerator(name: "ON_SLAVE_FAILURE_ABORT", value: 1)
!942 = !DIEnumerator(name: "ON_SLAVE_FAILURE_IGNORE", value: 2)
!943 = !{!944, !945}
!944 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!945 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!946 = !{!947, !2194, !2195, !2201, !2202, !2203}
!947 = distinct !DIGlobalVariable(name: "ff_tee_muxer", scope: !0, file: !939, line: 610, type: !948, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_tee_muxer)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !950)
!950 = !{!951, !955, !956, !957, !958, !959, !960, !961, !962, !972, !1055, !1057, !1058, !2159, !2160, !2161, !2165, !2169, !2173, !2174, !2179, !2180, !2181, !2182, !2183, !2184, !2188}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !949, file: !919, line: 498, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !949, file: !919, line: 504, baseType: !952, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !949, file: !919, line: 505, baseType: !952, size: 64, align: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !949, file: !919, line: 506, baseType: !952, size: 64, align: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !949, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !949, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !949, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !949, file: !919, line: 517, baseType: !944, size: 32, align: 32, offset: 352)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !949, file: !919, line: 523, baseType: !963, size: 64, align: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !968, line: 44, size: 64, align: 32, elements: !969)
!968 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !967, file: !968, line: 45, baseType: !3, size: 32, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !967, file: !968, line: 46, baseType: !945, size: 32, align: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !949, file: !919, line: 526, baseType: !973, size: 64, align: 64, offset: 448)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !977)
!977 = !{!978, !979, !984, !1014, !1015, !1016, !1017, !1021, !1027, !1029, !1033}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !976, file: !486, line: 72, baseType: !952, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !976, file: !486, line: 78, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!952, !983}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !976, file: !486, line: 85, baseType: !985, size: 64, align: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !1010, !1011, !1012, !1013}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !987, file: !464, line: 247, baseType: !952, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !987, file: !464, line: 253, baseType: !952, size: 64, align: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !987, file: !464, line: 259, baseType: !944, size: 32, align: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !987, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !987, file: !464, line: 271, baseType: !994, size: 64, align: 64, offset: 192)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !987, file: !464, line: 265, size: 64, align: 64, elements: !995)
!995 = !{!996, !1000, !1002, !1003}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !994, file: !464, line: 266, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !998, line: 40, baseType: !999)
!998 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!999 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !994, file: !464, line: 267, baseType: !1001, size: 64, align: 64)
!1001 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !994, file: !464, line: 268, baseType: !952, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !994, file: !464, line: 270, baseType: !1004, size: 64, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1005, line: 61, baseType: !1006)
!1005 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1005, line: 58, size: 64, align: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1006, file: !1005, line: 59, baseType: !944, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1006, file: !1005, line: 60, baseType: !944, size: 32, align: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !987, file: !464, line: 272, baseType: !1001, size: 64, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !987, file: !464, line: 273, baseType: !1001, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !987, file: !464, line: 275, baseType: !944, size: 32, align: 32, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !987, file: !464, line: 300, baseType: !952, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !976, file: !486, line: 93, baseType: !944, size: 32, align: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !976, file: !486, line: 99, baseType: !944, size: 32, align: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !976, file: !486, line: 108, baseType: !944, size: 32, align: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !976, file: !486, line: 113, baseType: !1018, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!983, !983, !983}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !976, file: !486, line: 123, baseType: !1022, size: 64, align: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1025, !1025}
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !976, file: !486, line: 130, baseType: !1028, size: 32, align: 32, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !976, file: !486, line: 136, baseType: !1030, size: 64, align: 64, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!1028, !983}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !976, file: !486, line: 142, baseType: !1034, size: 64, align: 64, offset: 576)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!944, !1037, !983, !952, !944}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1040)
!1040 = !{!1041, !1053, !1054}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1039, file: !464, line: 360, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1052}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1045, file: !464, line: 307, baseType: !952, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1045, file: !464, line: 313, baseType: !1001, size: 64, align: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1045, file: !464, line: 313, baseType: !1001, size: 64, align: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1045, file: !464, line: 318, baseType: !1001, size: 64, align: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1045, file: !464, line: 318, baseType: !1001, size: 64, align: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1045, file: !464, line: 323, baseType: !944, size: 32, align: 32, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1039, file: !464, line: 364, baseType: !944, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1039, file: !464, line: 368, baseType: !944, size: 32, align: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !919, line: 535, baseType: !1056, size: 64, align: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !949, file: !919, line: 539, baseType: !944, size: 32, align: 32, offset: 576)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !949, file: !919, line: 541, baseType: !1059, size: 64, align: 64, offset: 640)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!944, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1064)
!1064 = !{!1065, !1066, !1164, !1165, !1166, !1232, !1233, !1234, !2013, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2067, !2068, !2069, !2070, !2071, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2122, !2123, !2126, !2127, !2128, !2129, !2130, !2131, !2136, !2137, !2138, !2139, !2147, !2148, !2152, !2156, !2157, !2158}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1063, file: !919, line: 1342, baseType: !973, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1063, file: !919, line: 1349, baseType: !1067, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1094, !1095, !1135, !1136, !1140, !1145, !1146, !1147, !1151, !1157, !1163}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1068, file: !919, line: 638, baseType: !952, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1068, file: !919, line: 645, baseType: !952, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1068, file: !919, line: 652, baseType: !944, size: 32, align: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1068, file: !919, line: 659, baseType: !952, size: 64, align: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1068, file: !919, line: 661, baseType: !963, size: 64, align: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1068, file: !919, line: 663, baseType: !973, size: 64, align: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1068, file: !919, line: 670, baseType: !952, size: 64, align: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1068, file: !919, line: 679, baseType: !1067, size: 64, align: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1068, file: !919, line: 684, baseType: !944, size: 32, align: 32, offset: 512)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1068, file: !919, line: 689, baseType: !944, size: 32, align: 32, offset: 544)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1068, file: !919, line: 696, baseType: !1081, size: 64, align: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!944, !1084}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1092, !1093}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1086, file: !919, line: 449, baseType: !952, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1086, file: !919, line: 450, baseType: !1090, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1086, file: !919, line: 451, baseType: !944, size: 32, align: 32, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1086, file: !919, line: 452, baseType: !952, size: 64, align: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1068, file: !919, line: 703, baseType: !1059, size: 64, align: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1068, file: !919, line: 714, baseType: !1096, size: 64, align: 64, offset: 704)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DISubroutineType(types: !1098)
!1098 = !{!944, !1062, !1099}
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1102)
!1102 = !{!1103, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1131, !1132, !1133, !1134}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1101, file: !4, line: 1451, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1106, line: 94, baseType: !1107)
!1106 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1106, line: 81, size: 192, align: 64, elements: !1108)
!1108 = !{!1109, !1113, !1116}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1107, file: !1106, line: 82, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1106, line: 73, baseType: !1112)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1106, line: 73, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1107, file: !1106, line: 89, baseType: !1114, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !998, line: 48, baseType: !1091)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1107, file: !1106, line: 93, baseType: !944, size: 32, align: 32, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1101, file: !4, line: 1461, baseType: !997, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1101, file: !4, line: 1467, baseType: !997, size: 64, align: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1101, file: !4, line: 1468, baseType: !1114, size: 64, align: 64, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1101, file: !4, line: 1469, baseType: !944, size: 32, align: 32, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1101, file: !4, line: 1470, baseType: !944, size: 32, align: 32, offset: 288)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1101, file: !4, line: 1474, baseType: !944, size: 32, align: 32, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1101, file: !4, line: 1479, baseType: !1124, size: 64, align: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1126)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1126, file: !4, line: 1412, baseType: !1114, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !4, line: 1413, baseType: !944, size: 32, align: 32, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1126, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1101, file: !4, line: 1480, baseType: !944, size: 32, align: 32, offset: 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1101, file: !4, line: 1486, baseType: !997, size: 64, align: 64, offset: 512)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1101, file: !4, line: 1488, baseType: !997, size: 64, align: 64, offset: 576)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1101, file: !4, line: 1497, baseType: !997, size: 64, align: 64, offset: 640)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1068, file: !919, line: 720, baseType: !1059, size: 64, align: 64, offset: 768)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1068, file: !919, line: 730, baseType: !1137, size: 64, align: 64, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DISubroutineType(types: !1139)
!1139 = !{!944, !1062, !944, !997, !944}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1068, file: !919, line: 737, baseType: !1141, size: 64, align: 64, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!997, !1062, !944, !1144, !997}
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1068, file: !919, line: 744, baseType: !1059, size: 64, align: 64, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1068, file: !919, line: 750, baseType: !1059, size: 64, align: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1068, file: !919, line: 758, baseType: !1148, size: 64, align: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!944, !1062, !944, !997, !997, !997, !944}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1068, file: !919, line: 764, baseType: !1152, size: 64, align: 64, offset: 1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!944, !1062, !1155}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1068, file: !919, line: 770, baseType: !1158, size: 64, align: 64, offset: 1216)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!944, !1062, !1161}
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1068, file: !919, line: 776, baseType: !1158, size: 64, align: 64, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1063, file: !919, line: 1356, baseType: !1056, size: 64, align: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1063, file: !919, line: 1365, baseType: !983, size: 64, align: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1063, file: !919, line: 1379, baseType: !1167, size: 64, align: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175, !1176, !1177, !1181, !1182, !1186, !1187, !1188, !1189, !1190, !1192, !1193, !1199, !1200, !1204, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1222, !1223, !1224, !1225, !1229, !1230, !1231}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1169, file: !537, line: 174, baseType: !973, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1169, file: !537, line: 226, baseType: !1090, size: 64, align: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1169, file: !537, line: 227, baseType: !944, size: 32, align: 32, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1169, file: !537, line: 228, baseType: !1090, size: 64, align: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1169, file: !537, line: 229, baseType: !1090, size: 64, align: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1169, file: !537, line: 233, baseType: !983, size: 64, align: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1169, file: !537, line: 235, baseType: !1178, size: 64, align: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!944, !983, !1114, !944}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1169, file: !537, line: 236, baseType: !1178, size: 64, align: 64, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1169, file: !537, line: 237, baseType: !1183, size: 64, align: 64, offset: 512)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!997, !983, !997, !944}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1169, file: !537, line: 238, baseType: !997, size: 64, align: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1169, file: !537, line: 239, baseType: !944, size: 32, align: 32, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1169, file: !537, line: 240, baseType: !944, size: 32, align: 32, offset: 672)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1169, file: !537, line: 241, baseType: !944, size: 32, align: 32, offset: 704)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1169, file: !537, line: 242, baseType: !1191, size: 64, align: 64, offset: 768)
!1191 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1169, file: !537, line: 243, baseType: !1090, size: 64, align: 64, offset: 832)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1169, file: !537, line: 244, baseType: !1194, size: 64, align: 64, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!1191, !1191, !1197, !945}
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1115)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1169, file: !537, line: 245, baseType: !944, size: 32, align: 32, offset: 960)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1169, file: !537, line: 249, baseType: !1201, size: 64, align: 64, offset: 1024)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!944, !983, !944}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1169, file: !537, line: 255, baseType: !1205, size: 64, align: 64, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!997, !983, !944, !997, !944}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1169, file: !537, line: 260, baseType: !944, size: 32, align: 32, offset: 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1169, file: !537, line: 266, baseType: !997, size: 64, align: 64, offset: 1216)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1169, file: !537, line: 273, baseType: !944, size: 32, align: 32, offset: 1280)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1169, file: !537, line: 279, baseType: !997, size: 64, align: 64, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1169, file: !537, line: 285, baseType: !944, size: 32, align: 32, offset: 1408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1169, file: !537, line: 291, baseType: !944, size: 32, align: 32, offset: 1440)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1169, file: !537, line: 298, baseType: !944, size: 32, align: 32, offset: 1472)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1169, file: !537, line: 304, baseType: !944, size: 32, align: 32, offset: 1504)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1169, file: !537, line: 309, baseType: !952, size: 64, align: 64, offset: 1536)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1169, file: !537, line: 314, baseType: !952, size: 64, align: 64, offset: 1600)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1169, file: !537, line: 319, baseType: !1219, size: 64, align: 64, offset: 1664)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DISubroutineType(types: !1221)
!1221 = !{!944, !983, !1114, !944, !536, !997}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1169, file: !537, line: 326, baseType: !944, size: 32, align: 32, offset: 1728)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1169, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1169, file: !537, line: 332, baseType: !997, size: 64, align: 64, offset: 1792)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1169, file: !537, line: 338, baseType: !1226, size: 64, align: 64, offset: 1856)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64, align: 64)
!1227 = !DISubroutineType(types: !1228)
!1228 = !{!944, !983}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1169, file: !537, line: 340, baseType: !997, size: 64, align: 64, offset: 1920)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1169, file: !537, line: 346, baseType: !1090, size: 64, align: 64, offset: 1984)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1169, file: !537, line: 351, baseType: !944, size: 32, align: 32, offset: 2048)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1063, file: !919, line: 1386, baseType: !944, size: 32, align: 32, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1063, file: !919, line: 1393, baseType: !945, size: 32, align: 32, offset: 352)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1063, file: !919, line: 1405, baseType: !1235, size: 64, align: 64, offset: 384)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1799, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1899, !1905, !1906, !1910, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1942, !1943, !1944, !1945, !1946, !1947}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1238, file: !919, line: 866, baseType: !944, size: 32, align: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1238, file: !919, line: 872, baseType: !944, size: 32, align: 32, offset: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1238, file: !919, line: 878, baseType: !1243, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1474, !1475, !1476, !1477, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1503, !1507, !1508, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1687, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1245, file: !4, line: 1561, baseType: !973, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1245, file: !4, line: 1562, baseType: !944, size: 32, align: 32, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1245, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1245, file: !4, line: 1565, baseType: !1251, size: 64, align: 64, offset: 128)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1254)
!1254 = !{!1255, !1256, !1257, !1258, !1259, !1260, !1263, !1266, !1269, !1272, !1276, !1277, !1278, !1286, !1287, !1288, !1290, !1294, !1300, !1305, !1309, !1310, !1358, !1445, !1449, !1450, !1454, !1458, !1463, !1467, !1468, !1469}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1253, file: !4, line: 3475, baseType: !952, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1253, file: !4, line: 3480, baseType: !952, size: 64, align: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1253, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1253, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1253, file: !4, line: 3487, baseType: !944, size: 32, align: 32, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1253, file: !4, line: 3488, baseType: !1261, size: 64, align: 64, offset: 256)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1253, file: !4, line: 3489, baseType: !1264, size: 64, align: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1253, file: !4, line: 3490, baseType: !1267, size: 64, align: 64, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1253, file: !4, line: 3491, baseType: !1270, size: 64, align: 64, offset: 448)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1253, file: !4, line: 3492, baseType: !1273, size: 64, align: 64, offset: 512)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !998, line: 55, baseType: !1191)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1253, file: !4, line: 3493, baseType: !1115, size: 8, align: 8, offset: 576)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1253, file: !4, line: 3494, baseType: !973, size: 64, align: 64, offset: 640)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1253, file: !4, line: 3495, baseType: !1279, size: 64, align: 64, offset: 704)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1281)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1283)
!1283 = !{!1284, !1285}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1282, file: !4, line: 3402, baseType: !944, size: 32, align: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1282, file: !4, line: 3403, baseType: !952, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1253, file: !4, line: 3507, baseType: !952, size: 64, align: 64, offset: 768)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1253, file: !4, line: 3516, baseType: !944, size: 32, align: 32, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !4, line: 3517, baseType: !1289, size: 64, align: 64, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1253, file: !4, line: 3527, baseType: !1291, size: 64, align: 64, offset: 960)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!944, !1243}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1253, file: !4, line: 3535, baseType: !1295, size: 64, align: 64, offset: 1024)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!944, !1243, !1298}
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1244)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1253, file: !4, line: 3541, baseType: !1301, size: 64, align: 64, offset: 1088)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1303)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1304)
!1304 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1253, file: !4, line: 3549, baseType: !1306, size: 64, align: 64, offset: 1152)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !1289}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1253, file: !4, line: 3551, baseType: !1291, size: 64, align: 64, offset: 1216)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1253, file: !4, line: 3552, baseType: !1311, size: 64, align: 64, offset: 1280)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!944, !1243, !1114, !944, !1314}
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1317)
!1317 = !{!1318, !1321, !1323, !1324, !1325, !1357}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1316, file: !4, line: 3921, baseType: !1319, size: 16, align: 16)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !998, line: 49, baseType: !1320)
!1320 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1316, file: !4, line: 3922, baseType: !1322, size: 32, align: 32, offset: 32)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !998, line: 51, baseType: !945)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1316, file: !4, line: 3923, baseType: !1322, size: 32, align: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1316, file: !4, line: 3924, baseType: !945, size: 32, align: 32, offset: 96)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1316, file: !4, line: 3925, baseType: !1326, size: 64, align: 64, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1329)
!1329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1330)
!1330 = !{!1331, !1332, !1333, !1334, !1335, !1336, !1346, !1350, !1352, !1353, !1355, !1356}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1329, file: !4, line: 3886, baseType: !944, size: 32, align: 32)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1329, file: !4, line: 3887, baseType: !944, size: 32, align: 32, offset: 32)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1329, file: !4, line: 3888, baseType: !944, size: 32, align: 32, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1329, file: !4, line: 3889, baseType: !944, size: 32, align: 32, offset: 96)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1329, file: !4, line: 3890, baseType: !944, size: 32, align: 32, offset: 128)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1329, file: !4, line: 3897, baseType: !1337, size: 768, align: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1339)
!1339 = !{!1340, !1344}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1338, file: !4, line: 3855, baseType: !1341, size: 512, align: 64)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 512, align: 64, elements: !1342)
!1342 = !{!1343}
!1343 = !DISubrange(count: 8)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1338, file: !4, line: 3857, baseType: !1345, size: 256, align: 32, offset: 512)
!1345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 32, elements: !1342)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1329, file: !4, line: 3903, baseType: !1347, size: 256, align: 64, offset: 960)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 256, align: 64, elements: !1348)
!1348 = !{!1349}
!1349 = !DISubrange(count: 4)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1329, file: !4, line: 3904, baseType: !1351, size: 128, align: 32, offset: 1216)
!1351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 128, align: 32, elements: !1348)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1329, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1329, file: !4, line: 3908, baseType: !1354, size: 64, align: 64, offset: 1408)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1329, file: !4, line: 3915, baseType: !1354, size: 64, align: 64, offset: 1472)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1329, file: !4, line: 3917, baseType: !944, size: 32, align: 32, offset: 1536)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1316, file: !4, line: 3926, baseType: !997, size: 64, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1253, file: !4, line: 3564, baseType: !1359, size: 64, align: 64, offset: 1344)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!944, !1243, !1099, !1362, !1444}
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1364)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1366)
!1366 = !{!1367, !1368, !1369, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1396, !1398, !1399, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1432, !1433, !1434, !1435, !1436, !1437, !1440, !1441, !1442, !1443}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1365, file: !789, line: 282, baseType: !1341, size: 512, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1365, file: !789, line: 299, baseType: !1345, size: 256, align: 32, offset: 512)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1365, file: !789, line: 315, baseType: !1370, size: 64, align: 64, offset: 768)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1365, file: !789, line: 326, baseType: !944, size: 32, align: 32, offset: 832)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1365, file: !789, line: 326, baseType: !944, size: 32, align: 32, offset: 864)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1365, file: !789, line: 334, baseType: !944, size: 32, align: 32, offset: 896)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1365, file: !789, line: 341, baseType: !944, size: 32, align: 32, offset: 928)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1365, file: !789, line: 346, baseType: !944, size: 32, align: 32, offset: 960)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1365, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1365, file: !789, line: 356, baseType: !1004, size: 64, align: 32, offset: 1024)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1365, file: !789, line: 361, baseType: !997, size: 64, align: 64, offset: 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1365, file: !789, line: 369, baseType: !997, size: 64, align: 64, offset: 1152)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1365, file: !789, line: 377, baseType: !997, size: 64, align: 64, offset: 1216)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1365, file: !789, line: 382, baseType: !944, size: 32, align: 32, offset: 1280)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1365, file: !789, line: 386, baseType: !944, size: 32, align: 32, offset: 1312)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1365, file: !789, line: 391, baseType: !944, size: 32, align: 32, offset: 1344)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1365, file: !789, line: 396, baseType: !983, size: 64, align: 64, offset: 1408)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1365, file: !789, line: 403, baseType: !1386, size: 512, align: 64, offset: 1472)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1275, size: 512, align: 64, elements: !1342)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1365, file: !789, line: 410, baseType: !944, size: 32, align: 32, offset: 1984)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1365, file: !789, line: 415, baseType: !944, size: 32, align: 32, offset: 2016)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1365, file: !789, line: 420, baseType: !944, size: 32, align: 32, offset: 2048)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1365, file: !789, line: 425, baseType: !944, size: 32, align: 32, offset: 2080)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1365, file: !789, line: 435, baseType: !997, size: 64, align: 64, offset: 2112)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1365, file: !789, line: 440, baseType: !944, size: 32, align: 32, offset: 2176)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1365, file: !789, line: 445, baseType: !1275, size: 64, align: 64, offset: 2240)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1365, file: !789, line: 459, baseType: !1395, size: 512, align: 64, offset: 2304)
!1395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1104, size: 512, align: 64, elements: !1342)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1365, file: !789, line: 473, baseType: !1397, size: 64, align: 64, offset: 2816)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1365, file: !789, line: 477, baseType: !944, size: 32, align: 32, offset: 2880)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1365, file: !789, line: 479, baseType: !1400, size: 64, align: 64, offset: 2944)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64, align: 64)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1404)
!1404 = !{!1405, !1406, !1407, !1408, !1413}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1403, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1403, file: !789, line: 203, baseType: !1114, size: 64, align: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1403, file: !789, line: 204, baseType: !944, size: 32, align: 32, offset: 128)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1403, file: !789, line: 205, baseType: !1409, size: 64, align: 64, offset: 192)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1411, line: 86, baseType: !1412)
!1411 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1412 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1411, line: 86, flags: DIFlagFwdDecl)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1403, file: !789, line: 206, baseType: !1104, size: 64, align: 64, offset: 256)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1365, file: !789, line: 480, baseType: !944, size: 32, align: 32, offset: 3008)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1365, file: !789, line: 505, baseType: !944, size: 32, align: 32, offset: 3040)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1365, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1365, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1365, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1365, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1365, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1365, file: !789, line: 532, baseType: !997, size: 64, align: 64, offset: 3264)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1365, file: !789, line: 539, baseType: !997, size: 64, align: 64, offset: 3328)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1365, file: !789, line: 547, baseType: !997, size: 64, align: 64, offset: 3392)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1365, file: !789, line: 554, baseType: !1409, size: 64, align: 64, offset: 3456)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1365, file: !789, line: 563, baseType: !944, size: 32, align: 32, offset: 3520)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1365, file: !789, line: 572, baseType: !944, size: 32, align: 32, offset: 3552)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1365, file: !789, line: 581, baseType: !944, size: 32, align: 32, offset: 3584)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1365, file: !789, line: 588, baseType: !1429, size: 64, align: 64, offset: 3648)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !998, line: 36, baseType: !1431)
!1431 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1365, file: !789, line: 593, baseType: !944, size: 32, align: 32, offset: 3712)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1365, file: !789, line: 596, baseType: !944, size: 32, align: 32, offset: 3744)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1365, file: !789, line: 599, baseType: !1104, size: 64, align: 64, offset: 3776)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1365, file: !789, line: 605, baseType: !1104, size: 64, align: 64, offset: 3840)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1365, file: !789, line: 616, baseType: !1104, size: 64, align: 64, offset: 3904)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1365, file: !789, line: 626, baseType: !1438, size: 64, align: 64, offset: 3968)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1439, line: 216, baseType: !1191)
!1439 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1365, file: !789, line: 627, baseType: !1438, size: 64, align: 64, offset: 4032)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1365, file: !789, line: 628, baseType: !1438, size: 64, align: 64, offset: 4096)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1365, file: !789, line: 629, baseType: !1438, size: 64, align: 64, offset: 4160)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1365, file: !789, line: 645, baseType: !1104, size: 64, align: 64, offset: 4224)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1253, file: !4, line: 3566, baseType: !1446, size: 64, align: 64, offset: 1408)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{!944, !1243, !983, !1444, !1099}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1253, file: !4, line: 3567, baseType: !1291, size: 64, align: 64, offset: 1472)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1253, file: !4, line: 3576, baseType: !1451, size: 64, align: 64, offset: 1536)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{!944, !1243, !1362}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1253, file: !4, line: 3577, baseType: !1455, size: 64, align: 64, offset: 1600)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!944, !1243, !1099}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1253, file: !4, line: 3584, baseType: !1459, size: 64, align: 64, offset: 1664)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!944, !1243, !1462}
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1253, file: !4, line: 3589, baseType: !1464, size: 64, align: 64, offset: 1728)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{null, !1243}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1253, file: !4, line: 3594, baseType: !944, size: 32, align: 32, offset: 1792)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1253, file: !4, line: 3600, baseType: !952, size: 64, align: 64, offset: 1856)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1253, file: !4, line: 3609, baseType: !1470, size: 64, align: 64, offset: 1920)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1473)
!1473 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1245, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1245, file: !4, line: 1581, baseType: !945, size: 32, align: 32, offset: 224)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1245, file: !4, line: 1583, baseType: !983, size: 64, align: 64, offset: 256)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1245, file: !4, line: 1591, baseType: !1478, size: 64, align: 64, offset: 320)
!1478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1479, size: 64, align: 64)
!1479 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1245, file: !4, line: 1598, baseType: !983, size: 64, align: 64, offset: 384)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1245, file: !4, line: 1606, baseType: !997, size: 64, align: 64, offset: 448)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1245, file: !4, line: 1614, baseType: !944, size: 32, align: 32, offset: 512)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1245, file: !4, line: 1622, baseType: !944, size: 32, align: 32, offset: 544)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1245, file: !4, line: 1628, baseType: !944, size: 32, align: 32, offset: 576)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1245, file: !4, line: 1636, baseType: !944, size: 32, align: 32, offset: 608)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1245, file: !4, line: 1643, baseType: !944, size: 32, align: 32, offset: 640)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1245, file: !4, line: 1657, baseType: !1114, size: 64, align: 64, offset: 704)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1245, file: !4, line: 1658, baseType: !944, size: 32, align: 32, offset: 768)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1245, file: !4, line: 1679, baseType: !1004, size: 64, align: 32, offset: 800)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1245, file: !4, line: 1688, baseType: !944, size: 32, align: 32, offset: 864)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1245, file: !4, line: 1712, baseType: !944, size: 32, align: 32, offset: 896)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1245, file: !4, line: 1729, baseType: !944, size: 32, align: 32, offset: 928)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1245, file: !4, line: 1729, baseType: !944, size: 32, align: 32, offset: 960)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1245, file: !4, line: 1744, baseType: !944, size: 32, align: 32, offset: 992)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1245, file: !4, line: 1744, baseType: !944, size: 32, align: 32, offset: 1024)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1245, file: !4, line: 1751, baseType: !944, size: 32, align: 32, offset: 1056)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1245, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1245, file: !4, line: 1791, baseType: !1499, size: 64, align: 64, offset: 1152)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{null, !1502, !1362, !1444, !944, !944, !944}
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1245, file: !4, line: 1808, baseType: !1504, size: 64, align: 64, offset: 1216)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{!555, !1502, !1264}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1245, file: !4, line: 1816, baseType: !944, size: 32, align: 32, offset: 1280)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1245, file: !4, line: 1825, baseType: !1509, size: 32, align: 32, offset: 1312)
!1509 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1245, file: !4, line: 1830, baseType: !944, size: 32, align: 32, offset: 1344)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1245, file: !4, line: 1838, baseType: !1509, size: 32, align: 32, offset: 1376)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1245, file: !4, line: 1846, baseType: !944, size: 32, align: 32, offset: 1408)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1245, file: !4, line: 1851, baseType: !944, size: 32, align: 32, offset: 1440)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1245, file: !4, line: 1861, baseType: !1509, size: 32, align: 32, offset: 1472)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1245, file: !4, line: 1868, baseType: !1509, size: 32, align: 32, offset: 1504)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1245, file: !4, line: 1875, baseType: !1509, size: 32, align: 32, offset: 1536)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1245, file: !4, line: 1882, baseType: !1509, size: 32, align: 32, offset: 1568)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1245, file: !4, line: 1889, baseType: !1509, size: 32, align: 32, offset: 1600)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1245, file: !4, line: 1896, baseType: !1509, size: 32, align: 32, offset: 1632)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1245, file: !4, line: 1903, baseType: !1509, size: 32, align: 32, offset: 1664)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1245, file: !4, line: 1910, baseType: !944, size: 32, align: 32, offset: 1696)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1245, file: !4, line: 1915, baseType: !944, size: 32, align: 32, offset: 1728)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1245, file: !4, line: 1926, baseType: !1444, size: 64, align: 64, offset: 1792)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1245, file: !4, line: 1935, baseType: !1004, size: 64, align: 32, offset: 1856)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1245, file: !4, line: 1942, baseType: !944, size: 32, align: 32, offset: 1920)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1245, file: !4, line: 1948, baseType: !944, size: 32, align: 32, offset: 1952)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1245, file: !4, line: 1954, baseType: !944, size: 32, align: 32, offset: 1984)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1245, file: !4, line: 1960, baseType: !944, size: 32, align: 32, offset: 2016)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1245, file: !4, line: 1984, baseType: !944, size: 32, align: 32, offset: 2048)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1245, file: !4, line: 1991, baseType: !944, size: 32, align: 32, offset: 2080)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1245, file: !4, line: 1996, baseType: !944, size: 32, align: 32, offset: 2112)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1245, file: !4, line: 2004, baseType: !944, size: 32, align: 32, offset: 2144)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1245, file: !4, line: 2011, baseType: !944, size: 32, align: 32, offset: 2176)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1245, file: !4, line: 2018, baseType: !944, size: 32, align: 32, offset: 2208)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1245, file: !4, line: 2027, baseType: !944, size: 32, align: 32, offset: 2240)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1245, file: !4, line: 2034, baseType: !944, size: 32, align: 32, offset: 2272)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1245, file: !4, line: 2044, baseType: !944, size: 32, align: 32, offset: 2304)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1245, file: !4, line: 2054, baseType: !1539, size: 64, align: 64, offset: 2368)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1245, file: !4, line: 2061, baseType: !1539, size: 64, align: 64, offset: 2432)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1245, file: !4, line: 2066, baseType: !944, size: 32, align: 32, offset: 2496)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1245, file: !4, line: 2070, baseType: !944, size: 32, align: 32, offset: 2528)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1245, file: !4, line: 2078, baseType: !944, size: 32, align: 32, offset: 2560)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1245, file: !4, line: 2085, baseType: !944, size: 32, align: 32, offset: 2592)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1245, file: !4, line: 2092, baseType: !944, size: 32, align: 32, offset: 2624)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1245, file: !4, line: 2099, baseType: !944, size: 32, align: 32, offset: 2656)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1245, file: !4, line: 2106, baseType: !944, size: 32, align: 32, offset: 2688)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1245, file: !4, line: 2113, baseType: !944, size: 32, align: 32, offset: 2720)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1245, file: !4, line: 2120, baseType: !944, size: 32, align: 32, offset: 2752)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1245, file: !4, line: 2125, baseType: !944, size: 32, align: 32, offset: 2784)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1245, file: !4, line: 2133, baseType: !944, size: 32, align: 32, offset: 2816)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1245, file: !4, line: 2140, baseType: !944, size: 32, align: 32, offset: 2848)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1245, file: !4, line: 2145, baseType: !944, size: 32, align: 32, offset: 2880)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1245, file: !4, line: 2153, baseType: !944, size: 32, align: 32, offset: 2912)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1245, file: !4, line: 2158, baseType: !944, size: 32, align: 32, offset: 2944)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1245, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1245, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1245, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1245, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1245, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1245, file: !4, line: 2203, baseType: !944, size: 32, align: 32, offset: 3136)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1245, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1245, file: !4, line: 2212, baseType: !944, size: 32, align: 32, offset: 3200)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1245, file: !4, line: 2213, baseType: !944, size: 32, align: 32, offset: 3232)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1245, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1245, file: !4, line: 2232, baseType: !944, size: 32, align: 32, offset: 3296)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1245, file: !4, line: 2243, baseType: !944, size: 32, align: 32, offset: 3328)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1245, file: !4, line: 2249, baseType: !944, size: 32, align: 32, offset: 3360)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1245, file: !4, line: 2256, baseType: !944, size: 32, align: 32, offset: 3392)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1245, file: !4, line: 2263, baseType: !1275, size: 64, align: 64, offset: 3456)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1245, file: !4, line: 2270, baseType: !1275, size: 64, align: 64, offset: 3520)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1245, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1245, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1245, file: !4, line: 2367, baseType: !1575, size: 64, align: 64, offset: 3648)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{!944, !1502, !1462, !944}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1245, file: !4, line: 2383, baseType: !944, size: 32, align: 32, offset: 3712)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1245, file: !4, line: 2386, baseType: !1509, size: 32, align: 32, offset: 3744)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1245, file: !4, line: 2387, baseType: !1509, size: 32, align: 32, offset: 3776)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1245, file: !4, line: 2394, baseType: !944, size: 32, align: 32, offset: 3808)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1245, file: !4, line: 2401, baseType: !944, size: 32, align: 32, offset: 3840)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1245, file: !4, line: 2408, baseType: !944, size: 32, align: 32, offset: 3872)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1245, file: !4, line: 2415, baseType: !944, size: 32, align: 32, offset: 3904)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1245, file: !4, line: 2422, baseType: !944, size: 32, align: 32, offset: 3936)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1245, file: !4, line: 2423, baseType: !1587, size: 64, align: 64, offset: 3968)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1589)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1590)
!1590 = !{!1591, !1592, !1593, !1594}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1589, file: !4, line: 827, baseType: !944, size: 32, align: 32)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1589, file: !4, line: 828, baseType: !944, size: 32, align: 32, offset: 32)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1589, file: !4, line: 829, baseType: !944, size: 32, align: 32, offset: 64)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1589, file: !4, line: 830, baseType: !1509, size: 32, align: 32, offset: 96)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1245, file: !4, line: 2430, baseType: !997, size: 64, align: 64, offset: 4032)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1245, file: !4, line: 2437, baseType: !997, size: 64, align: 64, offset: 4096)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1245, file: !4, line: 2444, baseType: !1509, size: 32, align: 32, offset: 4160)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1245, file: !4, line: 2451, baseType: !1509, size: 32, align: 32, offset: 4192)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1245, file: !4, line: 2458, baseType: !944, size: 32, align: 32, offset: 4224)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1245, file: !4, line: 2469, baseType: !944, size: 32, align: 32, offset: 4256)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1245, file: !4, line: 2475, baseType: !944, size: 32, align: 32, offset: 4288)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1245, file: !4, line: 2481, baseType: !944, size: 32, align: 32, offset: 4320)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1245, file: !4, line: 2485, baseType: !944, size: 32, align: 32, offset: 4352)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1245, file: !4, line: 2489, baseType: !944, size: 32, align: 32, offset: 4384)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1245, file: !4, line: 2493, baseType: !944, size: 32, align: 32, offset: 4416)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1245, file: !4, line: 2501, baseType: !944, size: 32, align: 32, offset: 4448)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1245, file: !4, line: 2506, baseType: !944, size: 32, align: 32, offset: 4480)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1245, file: !4, line: 2510, baseType: !944, size: 32, align: 32, offset: 4512)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1245, file: !4, line: 2514, baseType: !997, size: 64, align: 64, offset: 4544)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1245, file: !4, line: 2528, baseType: !1611, size: 64, align: 64, offset: 4608)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{null, !1502, !983, !944, !944}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1245, file: !4, line: 2534, baseType: !944, size: 32, align: 32, offset: 4672)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1245, file: !4, line: 2545, baseType: !944, size: 32, align: 32, offset: 4704)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1245, file: !4, line: 2547, baseType: !944, size: 32, align: 32, offset: 4736)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1245, file: !4, line: 2549, baseType: !944, size: 32, align: 32, offset: 4768)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1245, file: !4, line: 2551, baseType: !944, size: 32, align: 32, offset: 4800)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1245, file: !4, line: 2553, baseType: !944, size: 32, align: 32, offset: 4832)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1245, file: !4, line: 2555, baseType: !944, size: 32, align: 32, offset: 4864)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1245, file: !4, line: 2557, baseType: !944, size: 32, align: 32, offset: 4896)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1245, file: !4, line: 2559, baseType: !944, size: 32, align: 32, offset: 4928)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1245, file: !4, line: 2563, baseType: !944, size: 32, align: 32, offset: 4960)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1245, file: !4, line: 2571, baseType: !1354, size: 64, align: 64, offset: 4992)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1245, file: !4, line: 2579, baseType: !1354, size: 64, align: 64, offset: 5056)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1245, file: !4, line: 2586, baseType: !944, size: 32, align: 32, offset: 5120)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1245, file: !4, line: 2615, baseType: !944, size: 32, align: 32, offset: 5152)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1245, file: !4, line: 2627, baseType: !944, size: 32, align: 32, offset: 5184)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1245, file: !4, line: 2637, baseType: !944, size: 32, align: 32, offset: 5216)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1245, file: !4, line: 2681, baseType: !944, size: 32, align: 32, offset: 5248)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1245, file: !4, line: 2709, baseType: !997, size: 64, align: 64, offset: 5312)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1245, file: !4, line: 2716, baseType: !1633, size: 64, align: 64, offset: 5376)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1635)
!1635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1636)
!1636 = !{!1637, !1638, !1639, !1640, !1641, !1642, !1643, !1647, !1651, !1652, !1653, !1654, !1660, !1661, !1662, !1663, !1664}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1635, file: !4, line: 3642, baseType: !952, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1635, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1635, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1635, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1635, file: !4, line: 3669, baseType: !944, size: 32, align: 32, offset: 160)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1635, file: !4, line: 3682, baseType: !1459, size: 64, align: 64, offset: 192)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1635, file: !4, line: 3698, baseType: !1644, size: 64, align: 64, offset: 256)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!944, !1243, !1197, !1322}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1635, file: !4, line: 3712, baseType: !1648, size: 64, align: 64, offset: 320)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!944, !1243, !944, !1197, !1322}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1635, file: !4, line: 3726, baseType: !1644, size: 64, align: 64, offset: 384)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1635, file: !4, line: 3737, baseType: !1291, size: 64, align: 64, offset: 448)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1635, file: !4, line: 3746, baseType: !944, size: 32, align: 32, offset: 512)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1635, file: !4, line: 3757, baseType: !1655, size: 64, align: 64, offset: 576)
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1656, size: 64, align: 64)
!1656 = !DISubroutineType(types: !1657)
!1657 = !{null, !1658}
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1635, file: !4, line: 3766, baseType: !1291, size: 64, align: 64, offset: 640)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1635, file: !4, line: 3774, baseType: !1291, size: 64, align: 64, offset: 704)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1635, file: !4, line: 3780, baseType: !944, size: 32, align: 32, offset: 768)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1635, file: !4, line: 3785, baseType: !944, size: 32, align: 32, offset: 800)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1635, file: !4, line: 3795, baseType: !1665, size: 64, align: 64, offset: 832)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!944, !1243, !1104}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1245, file: !4, line: 2728, baseType: !983, size: 64, align: 64, offset: 5440)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1245, file: !4, line: 2735, baseType: !1386, size: 512, align: 64, offset: 5504)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1245, file: !4, line: 2742, baseType: !944, size: 32, align: 32, offset: 6016)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1245, file: !4, line: 2755, baseType: !944, size: 32, align: 32, offset: 6048)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1245, file: !4, line: 2776, baseType: !944, size: 32, align: 32, offset: 6080)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1245, file: !4, line: 2783, baseType: !944, size: 32, align: 32, offset: 6112)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1245, file: !4, line: 2791, baseType: !944, size: 32, align: 32, offset: 6144)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1245, file: !4, line: 2802, baseType: !1462, size: 64, align: 64, offset: 6208)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1245, file: !4, line: 2811, baseType: !944, size: 32, align: 32, offset: 6272)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1245, file: !4, line: 2821, baseType: !944, size: 32, align: 32, offset: 6304)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1245, file: !4, line: 2830, baseType: !944, size: 32, align: 32, offset: 6336)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1245, file: !4, line: 2840, baseType: !944, size: 32, align: 32, offset: 6368)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1245, file: !4, line: 2851, baseType: !1681, size: 64, align: 64, offset: 6400)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!944, !1502, !1684, !983, !1444, !944, !944}
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!944, !1502, !983}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1245, file: !4, line: 2871, baseType: !1688, size: 64, align: 64, offset: 6464)
!1688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1689, size: 64, align: 64)
!1689 = !DISubroutineType(types: !1690)
!1690 = !{!944, !1502, !1691, !983, !1444, !944}
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{!944, !1502, !983, !944, !944}
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1245, file: !4, line: 2878, baseType: !944, size: 32, align: 32, offset: 6528)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1245, file: !4, line: 2885, baseType: !944, size: 32, align: 32, offset: 6560)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1245, file: !4, line: 3005, baseType: !944, size: 32, align: 32, offset: 6592)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1245, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1245, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1245, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1245, file: !4, line: 3037, baseType: !1114, size: 64, align: 64, offset: 6720)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1245, file: !4, line: 3038, baseType: !944, size: 32, align: 32, offset: 6784)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1245, file: !4, line: 3050, baseType: !1275, size: 64, align: 64, offset: 6848)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1245, file: !4, line: 3065, baseType: !944, size: 32, align: 32, offset: 6912)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1245, file: !4, line: 3083, baseType: !944, size: 32, align: 32, offset: 6944)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1245, file: !4, line: 3092, baseType: !1004, size: 64, align: 32, offset: 6976)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1245, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1245, file: !4, line: 3106, baseType: !1004, size: 64, align: 32, offset: 7072)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1245, file: !4, line: 3113, baseType: !1709, size: 64, align: 64, offset: 7168)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1711)
!1711 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1712)
