; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--hscale.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--hscale.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SwsFilterDescriptor = type { %struct.SwsSlice*, %struct.SwsSlice*, i32, i8*, i32 (%struct.SwsContext*, %struct.SwsFilterDescriptor*, i32, i32)* }

!197 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!198 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!199 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!200 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!201 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!202 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 29, size: 32, align: 32, elements: !205)
!204 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!206 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!207 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!208 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!209 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!210 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!211 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!212 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!213 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!214 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!215 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!216 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!217 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!218 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!219 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!220 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!221 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!222 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!223 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsDither", file: !225, line: 65, size: 32, align: 32, elements: !226)
!225 = !DIFile(filename: "libswscale/swscale_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIEnumerator(name: "SWS_DITHER_NONE", value: 0)
!228 = !DIEnumerator(name: "SWS_DITHER_AUTO", value: 1)
!229 = !DIEnumerator(name: "SWS_DITHER_BAYER", value: 2)
!230 = !DIEnumerator(name: "SWS_DITHER_ED", value: 3)
!231 = !DIEnumerator(name: "SWS_DITHER_A_DITHER", value: 4)
!232 = !DIEnumerator(name: "SWS_DITHER_X_DITHER", value: 5)
!233 = !DIEnumerator(name: "NB_SWS_DITHER", value: 6)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsAlphaBlend", file: !225, line: 75, size: 32, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NONE", value: 0)
!237 = !DIEnumerator(name: "SWS_ALPHA_BLEND_UNIFORM", value: 1)
!238 = !DIEnumerator(name: "SWS_ALPHA_BLEND_CHECKERBOARD", value: 2)
!239 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NB", value: 3)
!240 = !{!241, !242, !246, !251}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !244, line: 195, baseType: !245)
!244 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!245 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !249, line: 48, baseType: !250)
!249 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!250 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !249, line: 49, baseType: !253)
!253 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!254 = !{i32 2, !"Dwarf Version", i32 4}
!255 = !{i32 2, !"Debug Info Version", i32 3}
!256 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!257 = distinct !DISubprogram(name: "ff_init_desc_fmt_convert", scope: !258, file: !258, line: 127, type: !259, isLocal: false, isDefinition: true, scopeLine: 128, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!258 = !DIFile(filename: "libswscale/hscale.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!259 = !DISubroutineType(types: !260)
!260 = !{!261, !262, !267, !267, !569}
!261 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFilterDescriptor", file: !225, line: 968, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !265)
!265 = !{!266, !291, !292, !293, !294}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !264, file: !225, line: 960, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !276, !277}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !269, file: !225, line: 945, baseType: !261, size: 32, align: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !269, file: !225, line: 946, baseType: !261, size: 32, align: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !269, file: !225, line: 947, baseType: !261, size: 32, align: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !269, file: !225, line: 948, baseType: !261, size: 32, align: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !269, file: !225, line: 949, baseType: !261, size: 32, align: 32, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !269, file: !225, line: 950, baseType: !3, size: 32, align: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !269, file: !225, line: 951, baseType: !278, size: 1024, align: 64, offset: 192)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 1024, align: 64, elements: !289)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !281)
!281 = !{!282, !283, !284, !285, !288}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !280, file: !225, line: 931, baseType: !261, size: 32, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !280, file: !225, line: 932, baseType: !261, size: 32, align: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !280, file: !225, line: 933, baseType: !261, size: 32, align: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !280, file: !225, line: 934, baseType: !286, size: 64, align: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !280, file: !225, line: 935, baseType: !286, size: 64, align: 64, offset: 192)
!289 = !{!290}
!290 = !DISubrange(count: 4)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !264, file: !225, line: 961, baseType: !267, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !264, file: !225, line: 963, baseType: !261, size: 32, align: 32, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !264, file: !225, line: 964, baseType: !241, size: 64, align: 64, offset: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !264, file: !225, line: 967, baseType: !295, size: 64, align: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{!261, !298, !405, !261, !261}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !301)
!301 = !{!302, !346, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !382, !386, !388, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !401, !402, !404, !406, !412, !413, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !449, !451, !452, !453, !457, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !497, !498, !499, !500, !501, !502, !503, !504, !505, !509, !510, !514, !516, !517, !518, !519, !520, !521, !522, !523, !526, !527, !534, !540, !545, !550, !555, !560, !565, !570, !571, !575, !579, !583, !584, !588, !592, !598, !599, !603, !607, !608, !610}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !300, file: !225, line: 284, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !204, line: 143, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !204, line: 67, size: 640, align: 64, elements: !307)
!307 = !{!308, !312, !316, !320, !321, !322, !323, !327, !333, !335, !339}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !306, file: !204, line: 72, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !306, file: !204, line: 78, baseType: !313, size: 64, align: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64, align: 64)
!314 = !DISubroutineType(types: !315)
!315 = !{!309, !241}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !306, file: !204, line: 85, baseType: !317, size: 64, align: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64, align: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!319 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !204, line: 85, flags: DIFlagFwdDecl)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !306, file: !204, line: 93, baseType: !261, size: 32, align: 32, offset: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !306, file: !204, line: 99, baseType: !261, size: 32, align: 32, offset: 224)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !306, file: !204, line: 108, baseType: !261, size: 32, align: 32, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !306, file: !204, line: 113, baseType: !324, size: 64, align: 64, offset: 320)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!241, !241, !241}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !306, file: !204, line: 123, baseType: !328, size: 64, align: 64, offset: 384)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!331, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !306, file: !204, line: 130, baseType: !334, size: 32, align: 32, offset: 448)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !204, line: 48, baseType: !203)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !306, file: !204, line: 136, baseType: !336, size: 64, align: 64, offset: 512)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = !DISubroutineType(types: !338)
!338 = !{!334, !241}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !306, file: !204, line: 142, baseType: !340, size: 64, align: 64, offset: 576)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = !DISubroutineType(types: !342)
!342 = !{!261, !343, !241, !309, !261}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !204, line: 60, flags: DIFlagFwdDecl)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !300, file: !225, line: 290, baseType: !347, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = !DISubroutineType(types: !350)
!350 = !{!261, !351, !352, !353, !261, !261, !286, !353}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !300, file: !225, line: 291, baseType: !261, size: 32, align: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !300, file: !225, line: 292, baseType: !261, size: 32, align: 32, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !300, file: !225, line: 293, baseType: !261, size: 32, align: 32, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !300, file: !225, line: 294, baseType: !261, size: 32, align: 32, offset: 224)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !300, file: !225, line: 295, baseType: !261, size: 32, align: 32, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !300, file: !225, line: 296, baseType: !261, size: 32, align: 32, offset: 288)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !300, file: !225, line: 297, baseType: !261, size: 32, align: 32, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !300, file: !225, line: 298, baseType: !261, size: 32, align: 32, offset: 352)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !300, file: !225, line: 298, baseType: !261, size: 32, align: 32, offset: 384)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !300, file: !225, line: 299, baseType: !261, size: 32, align: 32, offset: 416)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !300, file: !225, line: 299, baseType: !261, size: 32, align: 32, offset: 448)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !300, file: !225, line: 300, baseType: !3, size: 32, align: 32, offset: 480)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !300, file: !225, line: 301, baseType: !3, size: 32, align: 32, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !300, file: !225, line: 302, baseType: !261, size: 32, align: 32, offset: 544)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !300, file: !225, line: 303, baseType: !261, size: 32, align: 32, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !300, file: !225, line: 304, baseType: !261, size: 32, align: 32, offset: 608)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !300, file: !225, line: 304, baseType: !261, size: 32, align: 32, offset: 640)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !300, file: !225, line: 305, baseType: !261, size: 32, align: 32, offset: 672)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !300, file: !225, line: 306, baseType: !261, size: 32, align: 32, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !300, file: !225, line: 307, baseType: !261, size: 32, align: 32, offset: 736)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !300, file: !225, line: 308, baseType: !261, size: 32, align: 32, offset: 768)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !300, file: !225, line: 309, baseType: !261, size: 32, align: 32, offset: 800)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !300, file: !225, line: 310, baseType: !261, size: 32, align: 32, offset: 832)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !300, file: !225, line: 311, baseType: !378, size: 128, align: 64, offset: 896)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 128, align: 64, elements: !380)
!379 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!380 = !{!381}
!381 = !DISubrange(count: 2)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !300, file: !225, line: 317, baseType: !383, size: 192, align: 64, offset: 1024)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !351, size: 192, align: 64, elements: !384)
!384 = !{!385}
!385 = !DISubrange(count: 3)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !300, file: !225, line: 318, baseType: !387, size: 128, align: 32, offset: 1216)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 128, align: 32, elements: !289)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !300, file: !225, line: 319, baseType: !389, size: 256, align: 64, offset: 1344)
!389 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 256, align: 64, elements: !289)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !300, file: !225, line: 320, baseType: !387, size: 128, align: 32, offset: 1600)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !300, file: !225, line: 321, baseType: !389, size: 256, align: 64, offset: 1728)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !300, file: !225, line: 322, baseType: !261, size: 32, align: 32, offset: 1984)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !300, file: !225, line: 324, baseType: !379, size: 64, align: 64, offset: 2048)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !300, file: !225, line: 325, baseType: !261, size: 32, align: 32, offset: 2112)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !300, file: !225, line: 326, baseType: !261, size: 32, align: 32, offset: 2144)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !300, file: !225, line: 327, baseType: !251, size: 64, align: 64, offset: 2176)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !300, file: !225, line: 328, baseType: !251, size: 64, align: 64, offset: 2240)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !300, file: !225, line: 330, baseType: !261, size: 32, align: 32, offset: 2304)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !300, file: !225, line: 331, baseType: !400, size: 64, align: 32, offset: 2336)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 64, align: 32, elements: !380)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !300, file: !225, line: 332, baseType: !261, size: 32, align: 32, offset: 2400)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !300, file: !225, line: 333, baseType: !403, size: 64, align: 64, offset: 2432)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !300, file: !225, line: 334, baseType: !405, size: 64, align: 64, offset: 2496)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !300, file: !225, line: 336, baseType: !407, size: 8192, align: 32, offset: 2560)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 8192, align: 32, elements: !410)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !249, line: 51, baseType: !409)
!409 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!410 = !{!411}
!411 = !DISubrange(count: 256)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !300, file: !225, line: 337, baseType: !407, size: 8192, align: 32, offset: 10752)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !300, file: !225, line: 339, baseType: !414, size: 8192, align: 32, offset: 18944)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 8192, align: 32, elements: !410)
!415 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !300, file: !225, line: 351, baseType: !261, size: 32, align: 32, offset: 27136)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !300, file: !225, line: 352, baseType: !261, size: 32, align: 32, offset: 27168)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !300, file: !225, line: 353, baseType: !261, size: 32, align: 32, offset: 27200)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !300, file: !225, line: 354, baseType: !261, size: 32, align: 32, offset: 27232)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !300, file: !225, line: 357, baseType: !287, size: 64, align: 64, offset: 27264)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !300, file: !225, line: 358, baseType: !261, size: 32, align: 32, offset: 27328)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !300, file: !225, line: 374, baseType: !242, size: 64, align: 64, offset: 27392)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !300, file: !225, line: 375, baseType: !242, size: 64, align: 64, offset: 27456)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !300, file: !225, line: 376, baseType: !242, size: 64, align: 64, offset: 27520)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !300, file: !225, line: 377, baseType: !242, size: 64, align: 64, offset: 27584)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !300, file: !225, line: 378, baseType: !427, size: 64, align: 64, offset: 27648)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !244, line: 196, baseType: !261)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !300, file: !225, line: 379, baseType: !427, size: 64, align: 64, offset: 27712)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !300, file: !225, line: 380, baseType: !427, size: 64, align: 64, offset: 27776)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !300, file: !225, line: 381, baseType: !427, size: 64, align: 64, offset: 27840)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !300, file: !225, line: 382, baseType: !261, size: 32, align: 32, offset: 27904)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !300, file: !225, line: 383, baseType: !261, size: 32, align: 32, offset: 27936)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !300, file: !225, line: 384, baseType: !261, size: 32, align: 32, offset: 27968)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !300, file: !225, line: 385, baseType: !261, size: 32, align: 32, offset: 28000)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !300, file: !225, line: 388, baseType: !261, size: 32, align: 32, offset: 28032)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !300, file: !225, line: 389, baseType: !261, size: 32, align: 32, offset: 28064)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !300, file: !225, line: 390, baseType: !287, size: 64, align: 64, offset: 28096)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !300, file: !225, line: 391, baseType: !287, size: 64, align: 64, offset: 28160)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !300, file: !225, line: 393, baseType: !261, size: 32, align: 32, offset: 28224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !300, file: !225, line: 394, baseType: !261, size: 32, align: 32, offset: 28256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !300, file: !225, line: 396, baseType: !261, size: 32, align: 32, offset: 28288)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !300, file: !225, line: 397, baseType: !261, size: 32, align: 32, offset: 28320)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !300, file: !225, line: 398, baseType: !241, size: 64, align: 64, offset: 28352)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !300, file: !225, line: 401, baseType: !446, size: 40960, align: 32, offset: 28416)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 40960, align: 32, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 1280)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !300, file: !225, line: 402, baseType: !450, size: 81920, align: 64, offset: 69376)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 81920, align: 64, elements: !447)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !300, file: !225, line: 403, baseType: !450, size: 81920, align: 64, offset: 151296)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !300, file: !225, line: 404, baseType: !450, size: 81920, align: 64, offset: 233216)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !300, file: !225, line: 405, baseType: !454, size: 5632, align: 32, offset: 315136)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 5632, align: 32, elements: !455)
!455 = !{!456}
!456 = !DISubrange(count: 176)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !300, file: !225, line: 417, baseType: !458, size: 256, align: 64, offset: 320768)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 256, align: 64, elements: !289)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !300, file: !225, line: 420, baseType: !261, size: 32, align: 32, offset: 321024)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !300, file: !225, line: 420, baseType: !261, size: 32, align: 32, offset: 321056)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !300, file: !225, line: 420, baseType: !261, size: 32, align: 32, offset: 321088)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !300, file: !225, line: 421, baseType: !387, size: 128, align: 32, offset: 321120)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !300, file: !225, line: 422, baseType: !387, size: 128, align: 32, offset: 321248)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !300, file: !225, line: 423, baseType: !261, size: 32, align: 32, offset: 321376)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !300, file: !225, line: 424, baseType: !261, size: 32, align: 32, offset: 321408)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !300, file: !225, line: 425, baseType: !261, size: 32, align: 32, offset: 321440)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !300, file: !225, line: 426, baseType: !261, size: 32, align: 32, offset: 321472)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !300, file: !225, line: 427, baseType: !261, size: 32, align: 32, offset: 321504)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !300, file: !225, line: 428, baseType: !261, size: 32, align: 32, offset: 321536)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !300, file: !225, line: 429, baseType: !261, size: 32, align: 32, offset: 321568)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !300, file: !225, line: 430, baseType: !261, size: 32, align: 32, offset: 321600)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !300, file: !225, line: 431, baseType: !261, size: 32, align: 32, offset: 321632)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !300, file: !225, line: 432, baseType: !261, size: 32, align: 32, offset: 321664)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !300, file: !225, line: 433, baseType: !261, size: 32, align: 32, offset: 321696)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !300, file: !225, line: 434, baseType: !261, size: 32, align: 32, offset: 321728)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !300, file: !225, line: 435, baseType: !261, size: 32, align: 32, offset: 321760)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !300, file: !225, line: 436, baseType: !261, size: 32, align: 32, offset: 321792)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !300, file: !225, line: 437, baseType: !261, size: 32, align: 32, offset: 321824)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !300, file: !225, line: 438, baseType: !261, size: 32, align: 32, offset: 321856)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !300, file: !225, line: 466, baseType: !481, size: 64, align: 64, offset: 321920)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !249, line: 55, baseType: !482)
!482 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !300, file: !225, line: 467, baseType: !481, size: 64, align: 64, offset: 321984)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !300, file: !225, line: 468, baseType: !481, size: 64, align: 64, offset: 322048)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !300, file: !225, line: 470, baseType: !481, size: 64, align: 64, offset: 322112)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !300, file: !225, line: 471, baseType: !481, size: 64, align: 64, offset: 322176)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !300, file: !225, line: 472, baseType: !481, size: 64, align: 64, offset: 322240)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !300, file: !225, line: 473, baseType: !481, size: 64, align: 64, offset: 322304)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !300, file: !225, line: 474, baseType: !481, size: 64, align: 64, offset: 322368)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !300, file: !225, line: 475, baseType: !481, size: 64, align: 64, offset: 322432)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !300, file: !225, line: 476, baseType: !481, size: 64, align: 64, offset: 322496)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !300, file: !225, line: 477, baseType: !481, size: 64, align: 64, offset: 322560)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !300, file: !225, line: 478, baseType: !494, size: 32768, align: 32, offset: 322624)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !428, size: 32768, align: 32, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 1024)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !300, file: !225, line: 479, baseType: !494, size: 32768, align: 32, offset: 355392)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !300, file: !225, line: 480, baseType: !261, size: 32, align: 32, offset: 388160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !300, file: !225, line: 481, baseType: !481, size: 64, align: 64, offset: 388224)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !300, file: !225, line: 482, baseType: !481, size: 64, align: 64, offset: 388288)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !300, file: !225, line: 483, baseType: !481, size: 64, align: 64, offset: 388352)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !300, file: !225, line: 484, baseType: !481, size: 64, align: 64, offset: 388416)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !300, file: !225, line: 485, baseType: !481, size: 64, align: 64, offset: 388480)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !300, file: !225, line: 486, baseType: !494, size: 32768, align: 32, offset: 388544)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !300, file: !225, line: 490, baseType: !506, size: 64, align: 64, offset: 421312)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !507, line: 149, baseType: !508)
!507 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!508 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !300, file: !225, line: 491, baseType: !506, size: 64, align: 64, offset: 421376)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !300, file: !225, line: 492, baseType: !511, size: 128, align: 16, offset: 421440)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !252, size: 128, align: 16, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !300, file: !225, line: 493, baseType: !515, size: 256, align: 32, offset: 421568)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 256, align: 32, elements: !512)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !300, file: !225, line: 495, baseType: !246, size: 64, align: 64, offset: 421824)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !300, file: !225, line: 495, baseType: !246, size: 64, align: 64, offset: 421888)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !300, file: !225, line: 508, baseType: !261, size: 32, align: 32, offset: 421952)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !300, file: !225, line: 513, baseType: !242, size: 64, align: 64, offset: 422016)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !300, file: !225, line: 514, baseType: !242, size: 64, align: 64, offset: 422080)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !300, file: !225, line: 515, baseType: !242, size: 64, align: 64, offset: 422144)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !300, file: !225, line: 516, baseType: !242, size: 64, align: 64, offset: 422208)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !300, file: !225, line: 517, baseType: !524, size: 192, align: 16, offset: 422272)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !243, size: 192, align: 16, elements: !525)
!525 = !{!385, !290}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !300, file: !225, line: 518, baseType: !524, size: 192, align: 16, offset: 422464)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !300, file: !225, line: 521, baseType: !528, size: 64, align: 64, offset: 422656)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64, align: 64)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532, !287, !261, !246, !261}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64, align: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !300, file: !225, line: 522, baseType: !535, size: 64, align: 64, offset: 422720)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64, align: 64)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !532, !261, !539, !287, !261, !246, !261}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !300, file: !225, line: 523, baseType: !541, size: 64, align: 64, offset: 422784)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !542)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64, align: 64)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !351, !532, !261, !539, !539, !287, !261}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !300, file: !225, line: 524, baseType: !546, size: 64, align: 64, offset: 422848)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64, align: 64)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !351, !532, !539, !539, !532, !287, !261, !261, !261}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !300, file: !225, line: 525, baseType: !551, size: 64, align: 64, offset: 422912)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !552)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64, align: 64)
!553 = !DISubroutineType(types: !554)
!554 = !{null, !351, !539, !539, !539, !539, !287, !261, !261, !261, !261}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !300, file: !225, line: 526, baseType: !556, size: 64, align: 64, offset: 422976)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !557)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64, align: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !351, !532, !539, !261, !532, !539, !539, !261, !539, !287, !261, !261}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !300, file: !225, line: 527, baseType: !561, size: 64, align: 64, offset: 423040)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64, align: 64)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !351, !532, !539, !261, !532, !539, !539, !261, !539, !286, !261, !261}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !300, file: !225, line: 530, baseType: !566, size: 64, align: 64, offset: 423104)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64, align: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !287, !246, !246, !246, !261, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !300, file: !225, line: 533, baseType: !566, size: 64, align: 64, offset: 423168)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !300, file: !225, line: 536, baseType: !572, size: 64, align: 64, offset: 423232)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64, align: 64)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !287, !287, !246, !246, !246, !261, !569}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !300, file: !225, line: 545, baseType: !576, size: 64, align: 64, offset: 423296)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !287, !352, !261, !427}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !300, file: !225, line: 546, baseType: !580, size: 64, align: 64, offset: 423360)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64, align: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !287, !287, !352, !261, !427}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !300, file: !225, line: 548, baseType: !576, size: 64, align: 64, offset: 423424)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !300, file: !225, line: 570, baseType: !585, size: 64, align: 64, offset: 423488)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64, align: 64)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !351, !242, !261, !246, !261, !261}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !300, file: !225, line: 573, baseType: !589, size: 64, align: 64, offset: 423552)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64, align: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !351, !242, !242, !261, !246, !246, !261, !261}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !300, file: !225, line: 610, baseType: !593, size: 64, align: 64, offset: 423616)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64, align: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !351, !242, !261, !246, !532, !596, !261}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !300, file: !225, line: 613, baseType: !593, size: 64, align: 64, offset: 423680)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !300, file: !225, line: 619, baseType: !600, size: 64, align: 64, offset: 423744)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64, align: 64)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !242, !261}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !300, file: !225, line: 621, baseType: !604, size: 64, align: 64, offset: 423808)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64, align: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !242, !242, !261}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !300, file: !225, line: 623, baseType: !261, size: 32, align: 32, offset: 423872)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !300, file: !225, line: 625, baseType: !609, size: 32, align: 32, offset: 423904)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !300, file: !225, line: 627, baseType: !611, size: 32, align: 32, offset: 423936)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!612 = !{}
!613 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !614, file: !225, line: 776, type: !3)
!614 = distinct !DISubprogram(name: "isALPHA", scope: !225, file: !225, line: 776, type: !615, isLocal: true, isDefinition: true, scopeLine: 777, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!615 = !DISubroutineType(types: !616)
!616 = !{!261, !3}
!617 = !DIExpression()
!618 = !DILocation(line: 776, column: 77, scope: !614, inlinedAt: !619)
!619 = distinct !DILocation(line: 135, column: 40, scope: !620)
!620 = !DILexicalBlockFile(scope: !257, file: !258, discriminator: 1)
!621 = !DILocalVariable(name: "desc", scope: !614, file: !225, line: 778, type: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !625, line: 123, baseType: !626)
!625 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !625, line: 81, size: 1280, align: 64, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !646}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !625, line: 82, baseType: !309, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !626, file: !625, line: 83, baseType: !248, size: 8, align: 8, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !626, file: !625, line: 92, baseType: !248, size: 8, align: 8, offset: 72)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !626, file: !625, line: 101, baseType: !248, size: 8, align: 8, offset: 80)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !626, file: !625, line: 106, baseType: !481, size: 64, align: 64, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !626, file: !625, line: 117, baseType: !634, size: 1024, align: 32, offset: 192)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 1024, align: 32, elements: !289)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !625, line: 70, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !625, line: 31, size: 256, align: 32, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !636, file: !625, line: 35, baseType: !261, size: 32, align: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !636, file: !625, line: 41, baseType: !261, size: 32, align: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !636, file: !625, line: 47, baseType: !261, size: 32, align: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !636, file: !625, line: 53, baseType: !261, size: 32, align: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !636, file: !625, line: 58, baseType: !261, size: 32, align: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !636, file: !625, line: 62, baseType: !261, size: 32, align: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !636, file: !625, line: 65, baseType: !261, size: 32, align: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !636, file: !625, line: 68, baseType: !261, size: 32, align: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !626, file: !625, line: 122, baseType: !309, size: 64, align: 64, offset: 1216)
!647 = !DILocation(line: 778, column: 31, scope: !614, inlinedAt: !619)
!648 = !DILocation(line: 776, column: 77, scope: !614, inlinedAt: !649)
!649 = distinct !DILocation(line: 135, column: 19, scope: !257)
!650 = !DILocation(line: 778, column: 31, scope: !614, inlinedAt: !649)
!651 = !DILocalVariable(name: "desc", arg: 1, scope: !257, file: !258, line: 127, type: !262)
!652 = !DILocation(line: 127, column: 51, scope: !257)
!653 = !DILocalVariable(name: "src", arg: 2, scope: !257, file: !258, line: 127, type: !267)
!654 = !DILocation(line: 127, column: 68, scope: !257)
!655 = !DILocalVariable(name: "dst", arg: 3, scope: !257, file: !258, line: 127, type: !267)
!656 = !DILocation(line: 127, column: 83, scope: !257)
!657 = !DILocalVariable(name: "pal", arg: 4, scope: !257, file: !258, line: 127, type: !569)
!658 = !DILocation(line: 127, column: 98, scope: !257)
!659 = !DILocalVariable(name: "li", scope: !257, file: !258, line: 129, type: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "ColorContext", file: !258, line: 36, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ColorContext", file: !258, line: 33, size: 64, align: 64, elements: !663)
!663 = !{!664}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "pal", scope: !662, file: !258, line: 35, baseType: !569, size: 64, align: 64)
!665 = !DILocation(line: 129, column: 20, scope: !257)
!666 = !DILocation(line: 129, column: 25, scope: !257)
!667 = !DILocation(line: 130, column: 10, scope: !668)
!668 = distinct !DILexicalBlock(scope: !257, file: !258, line: 130, column: 9)
!669 = !DILocation(line: 130, column: 9, scope: !257)
!670 = !DILocation(line: 131, column: 9, scope: !668)
!671 = !DILocation(line: 132, column: 15, scope: !257)
!672 = !DILocation(line: 132, column: 5, scope: !257)
!673 = !DILocation(line: 132, column: 9, scope: !257)
!674 = !DILocation(line: 132, column: 13, scope: !257)
!675 = !DILocation(line: 133, column: 22, scope: !257)
!676 = !DILocation(line: 133, column: 5, scope: !257)
!677 = !DILocation(line: 133, column: 11, scope: !257)
!678 = !DILocation(line: 133, column: 20, scope: !257)
!679 = !DILocation(line: 135, column: 27, scope: !257)
!680 = !DILocation(line: 135, column: 32, scope: !257)
!681 = !DILocation(line: 135, column: 19, scope: !257)
!682 = !DILocation(line: 778, column: 58, scope: !614, inlinedAt: !649)
!683 = !DILocation(line: 778, column: 38, scope: !614, inlinedAt: !649)
!684 = !DILocation(line: 779, column: 16, scope: !685, inlinedAt: !649)
!685 = !DILexicalBlockFile(scope: !686, file: !225, discriminator: 1)
!686 = distinct !DILexicalBlock(scope: !687, file: !225, line: 779, column: 14)
!687 = distinct !DILexicalBlock(scope: !614, file: !225, line: 779, column: 8)
!688 = !DILocation(line: 779, column: 15, scope: !685, inlinedAt: !649)
!689 = !DILocation(line: 779, column: 14, scope: !685, inlinedAt: !649)
!690 = !DILocation(line: 779, column: 25, scope: !691, inlinedAt: !649)
!691 = !DILexicalBlockFile(scope: !692, file: !225, discriminator: 2)
!692 = distinct !DILexicalBlock(scope: !686, file: !225, line: 779, column: 23)
!693 = !DILocation(line: 779, column: 90, scope: !694, inlinedAt: !649)
!694 = !DILexicalBlockFile(scope: !691, file: !225, discriminator: 4)
!695 = !DILocation(line: 779, column: 90, scope: !691, inlinedAt: !649)
!696 = !DILocation(line: 780, column: 9, scope: !697, inlinedAt: !649)
!697 = distinct !DILexicalBlock(scope: !614, file: !225, line: 780, column: 9)
!698 = !DILocation(line: 780, column: 17, scope: !697, inlinedAt: !649)
!699 = !DILocation(line: 780, column: 9, scope: !614, inlinedAt: !649)
!700 = !DILocation(line: 781, column: 9, scope: !697, inlinedAt: !649)
!701 = !DILocation(line: 782, column: 12, scope: !614, inlinedAt: !649)
!702 = !DILocation(line: 782, column: 18, scope: !614, inlinedAt: !649)
!703 = !DILocation(line: 782, column: 24, scope: !614, inlinedAt: !649)
!704 = !DILocation(line: 782, column: 5, scope: !614, inlinedAt: !649)
!705 = !DILocation(line: 783, column: 1, scope: !614, inlinedAt: !649)
!706 = !DILocation(line: 135, column: 37, scope: !257)
!707 = !DILocation(line: 135, column: 48, scope: !620)
!708 = !DILocation(line: 135, column: 53, scope: !620)
!709 = !DILocation(line: 135, column: 40, scope: !620)
!710 = !DILocation(line: 778, column: 58, scope: !614, inlinedAt: !619)
!711 = !DILocation(line: 778, column: 38, scope: !614, inlinedAt: !619)
!712 = !DILocation(line: 779, column: 16, scope: !685, inlinedAt: !619)
!713 = !DILocation(line: 779, column: 15, scope: !685, inlinedAt: !619)
!714 = !DILocation(line: 779, column: 14, scope: !685, inlinedAt: !619)
!715 = !DILocation(line: 779, column: 25, scope: !691, inlinedAt: !619)
!716 = !DILocation(line: 779, column: 90, scope: !694, inlinedAt: !619)
!717 = !DILocation(line: 779, column: 90, scope: !691, inlinedAt: !619)
!718 = !DILocation(line: 780, column: 9, scope: !697, inlinedAt: !619)
!719 = !DILocation(line: 780, column: 17, scope: !697, inlinedAt: !619)
!720 = !DILocation(line: 780, column: 9, scope: !614, inlinedAt: !619)
!721 = !DILocation(line: 781, column: 9, scope: !697, inlinedAt: !619)
!722 = !DILocation(line: 782, column: 12, scope: !614, inlinedAt: !619)
!723 = !DILocation(line: 782, column: 18, scope: !614, inlinedAt: !619)
!724 = !DILocation(line: 782, column: 24, scope: !614, inlinedAt: !619)
!725 = !DILocation(line: 782, column: 5, scope: !614, inlinedAt: !619)
!726 = !DILocation(line: 783, column: 1, scope: !614, inlinedAt: !619)
!727 = !DILocation(line: 135, column: 37, scope: !620)
!728 = !DILocation(line: 135, column: 37, scope: !729)
!729 = !DILexicalBlockFile(scope: !257, file: !258, discriminator: 2)
!730 = !DILocation(line: 135, column: 5, scope: !729)
!731 = !DILocation(line: 135, column: 11, scope: !729)
!732 = !DILocation(line: 135, column: 17, scope: !729)
!733 = !DILocation(line: 136, column: 16, scope: !257)
!734 = !DILocation(line: 136, column: 5, scope: !257)
!735 = !DILocation(line: 136, column: 11, scope: !257)
!736 = !DILocation(line: 136, column: 15, scope: !257)
!737 = !DILocation(line: 137, column: 17, scope: !257)
!738 = !DILocation(line: 137, column: 5, scope: !257)
!739 = !DILocation(line: 137, column: 11, scope: !257)
!740 = !DILocation(line: 137, column: 15, scope: !257)
!741 = !DILocation(line: 138, column: 5, scope: !257)
!742 = !DILocation(line: 138, column: 11, scope: !257)
!743 = !DILocation(line: 138, column: 19, scope: !257)
!744 = !DILocation(line: 140, column: 5, scope: !257)
!745 = !DILocation(line: 141, column: 1, scope: !257)
!746 = distinct !DISubprogram(name: "lum_convert", scope: !258, file: !258, line: 86, type: !747, isLocal: true, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!747 = !DISubroutineType(types: !748)
!748 = !{!261, !298, !262, !261, !261}
!749 = !DILocalVariable(name: "c", arg: 1, scope: !746, file: !258, line: 86, type: !298)
!750 = !DILocation(line: 86, column: 36, scope: !746)
!751 = !DILocalVariable(name: "desc", arg: 2, scope: !746, file: !258, line: 86, type: !262)
!752 = !DILocation(line: 86, column: 60, scope: !746)
!753 = !DILocalVariable(name: "sliceY", arg: 3, scope: !746, file: !258, line: 86, type: !261)
!754 = !DILocation(line: 86, column: 70, scope: !746)
!755 = !DILocalVariable(name: "sliceH", arg: 4, scope: !746, file: !258, line: 86, type: !261)
!756 = !DILocation(line: 86, column: 82, scope: !746)
!757 = !DILocalVariable(name: "srcW", scope: !746, file: !258, line: 88, type: !261)
!758 = !DILocation(line: 88, column: 9, scope: !746)
!759 = !DILocation(line: 88, column: 16, scope: !746)
!760 = !DILocation(line: 88, column: 22, scope: !746)
!761 = !DILocation(line: 88, column: 27, scope: !746)
!762 = !DILocalVariable(name: "instance", scope: !746, file: !258, line: 89, type: !660)
!763 = !DILocation(line: 89, column: 20, scope: !746)
!764 = !DILocation(line: 89, column: 31, scope: !746)
!765 = !DILocation(line: 89, column: 37, scope: !746)
!766 = !DILocalVariable(name: "pal", scope: !746, file: !258, line: 90, type: !569)
!767 = !DILocation(line: 90, column: 16, scope: !746)
!768 = !DILocation(line: 90, column: 22, scope: !746)
!769 = !DILocation(line: 90, column: 32, scope: !746)
!770 = !DILocalVariable(name: "i", scope: !746, file: !258, line: 91, type: !261)
!771 = !DILocation(line: 91, column: 9, scope: !746)
!772 = !DILocation(line: 93, column: 34, scope: !746)
!773 = !DILocation(line: 93, column: 5, scope: !746)
!774 = !DILocation(line: 93, column: 11, scope: !746)
!775 = !DILocation(line: 93, column: 16, scope: !746)
!776 = !DILocation(line: 93, column: 25, scope: !746)
!777 = !DILocation(line: 93, column: 32, scope: !746)
!778 = !DILocation(line: 94, column: 34, scope: !746)
!779 = !DILocation(line: 94, column: 5, scope: !746)
!780 = !DILocation(line: 94, column: 11, scope: !746)
!781 = !DILocation(line: 94, column: 16, scope: !746)
!782 = !DILocation(line: 94, column: 25, scope: !746)
!783 = !DILocation(line: 94, column: 32, scope: !746)
!784 = !DILocation(line: 95, column: 34, scope: !746)
!785 = !DILocation(line: 95, column: 5, scope: !746)
!786 = !DILocation(line: 95, column: 11, scope: !746)
!787 = !DILocation(line: 95, column: 16, scope: !746)
!788 = !DILocation(line: 95, column: 25, scope: !746)
!789 = !DILocation(line: 95, column: 32, scope: !746)
!790 = !DILocation(line: 96, column: 34, scope: !746)
!791 = !DILocation(line: 96, column: 5, scope: !746)
!792 = !DILocation(line: 96, column: 11, scope: !746)
!793 = !DILocation(line: 96, column: 16, scope: !746)
!794 = !DILocation(line: 96, column: 25, scope: !746)
!795 = !DILocation(line: 96, column: 32, scope: !746)
!796 = !DILocation(line: 98, column: 12, scope: !797)
!797 = distinct !DILexicalBlock(scope: !746, file: !258, line: 98, column: 5)
!798 = !DILocation(line: 98, column: 10, scope: !797)
!799 = !DILocation(line: 98, column: 17, scope: !800)
!800 = !DILexicalBlockFile(scope: !801, file: !258, discriminator: 1)
!801 = distinct !DILexicalBlock(scope: !797, file: !258, line: 98, column: 5)
!802 = !DILocation(line: 98, column: 21, scope: !800)
!803 = !DILocation(line: 98, column: 19, scope: !800)
!804 = !DILocation(line: 98, column: 5, scope: !800)
!805 = !DILocalVariable(name: "sp0", scope: !806, file: !258, line: 99, type: !261)
!806 = distinct !DILexicalBlock(scope: !801, file: !258, line: 98, column: 34)
!807 = !DILocation(line: 99, column: 13, scope: !806)
!808 = !DILocation(line: 99, column: 19, scope: !806)
!809 = !DILocation(line: 99, column: 26, scope: !806)
!810 = !DILocation(line: 99, column: 25, scope: !806)
!811 = !DILocation(line: 99, column: 30, scope: !806)
!812 = !DILocation(line: 99, column: 36, scope: !806)
!813 = !DILocation(line: 99, column: 41, scope: !806)
!814 = !DILocation(line: 99, column: 50, scope: !806)
!815 = !DILocation(line: 99, column: 28, scope: !806)
!816 = !DILocalVariable(name: "sp1", scope: !806, file: !258, line: 100, type: !261)
!817 = !DILocation(line: 100, column: 13, scope: !806)
!818 = !DILocation(line: 100, column: 21, scope: !806)
!819 = !DILocation(line: 100, column: 28, scope: !806)
!820 = !DILocation(line: 100, column: 27, scope: !806)
!821 = !DILocation(line: 100, column: 34, scope: !806)
!822 = !DILocation(line: 100, column: 40, scope: !806)
!823 = !DILocation(line: 100, column: 45, scope: !806)
!824 = !DILocation(line: 100, column: 31, scope: !806)
!825 = !DILocation(line: 100, column: 65, scope: !806)
!826 = !DILocation(line: 100, column: 71, scope: !806)
!827 = !DILocation(line: 100, column: 76, scope: !806)
!828 = !DILocation(line: 100, column: 85, scope: !806)
!829 = !DILocation(line: 100, column: 63, scope: !806)
!830 = !DILocalVariable(name: "src", scope: !806, file: !258, line: 101, type: !831)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 256, align: 64, elements: !289)
!832 = !DILocation(line: 101, column: 25, scope: !806)
!833 = !DILocation(line: 101, column: 34, scope: !806)
!834 = !DILocation(line: 101, column: 61, scope: !806)
!835 = !DILocation(line: 101, column: 36, scope: !806)
!836 = !DILocation(line: 101, column: 42, scope: !806)
!837 = !DILocation(line: 101, column: 47, scope: !806)
!838 = !DILocation(line: 101, column: 56, scope: !806)
!839 = !DILocation(line: 102, column: 50, scope: !806)
!840 = !DILocation(line: 102, column: 25, scope: !806)
!841 = !DILocation(line: 102, column: 31, scope: !806)
!842 = !DILocation(line: 102, column: 36, scope: !806)
!843 = !DILocation(line: 102, column: 45, scope: !806)
!844 = !DILocation(line: 103, column: 50, scope: !806)
!845 = !DILocation(line: 103, column: 25, scope: !806)
!846 = !DILocation(line: 103, column: 31, scope: !806)
!847 = !DILocation(line: 103, column: 36, scope: !806)
!848 = !DILocation(line: 103, column: 45, scope: !806)
!849 = !DILocation(line: 104, column: 50, scope: !806)
!850 = !DILocation(line: 104, column: 25, scope: !806)
!851 = !DILocation(line: 104, column: 31, scope: !806)
!852 = !DILocation(line: 104, column: 36, scope: !806)
!853 = !DILocation(line: 104, column: 45, scope: !806)
!854 = !DILocalVariable(name: "dst", scope: !806, file: !258, line: 105, type: !287)
!855 = !DILocation(line: 105, column: 19, scope: !806)
!856 = !DILocation(line: 105, column: 50, scope: !806)
!857 = !DILocation(line: 105, column: 25, scope: !806)
!858 = !DILocation(line: 105, column: 31, scope: !806)
!859 = !DILocation(line: 105, column: 36, scope: !806)
!860 = !DILocation(line: 105, column: 45, scope: !806)
!861 = !DILocation(line: 107, column: 13, scope: !862)
!862 = distinct !DILexicalBlock(scope: !806, file: !258, line: 107, column: 13)
!863 = !DILocation(line: 107, column: 16, scope: !862)
!864 = !DILocation(line: 107, column: 13, scope: !806)
!865 = !DILocation(line: 108, column: 13, scope: !866)
!866 = distinct !DILexicalBlock(scope: !862, file: !258, line: 107, column: 27)
!867 = !DILocation(line: 108, column: 16, scope: !866)
!868 = !DILocation(line: 108, column: 26, scope: !866)
!869 = !DILocation(line: 108, column: 31, scope: !866)
!870 = !DILocation(line: 108, column: 39, scope: !866)
!871 = !DILocation(line: 108, column: 47, scope: !866)
!872 = !DILocation(line: 108, column: 55, scope: !866)
!873 = !DILocation(line: 108, column: 61, scope: !866)
!874 = !DILocation(line: 109, column: 9, scope: !866)
!875 = !DILocation(line: 109, column: 20, scope: !876)
!876 = !DILexicalBlockFile(scope: !877, file: !258, discriminator: 1)
!877 = distinct !DILexicalBlock(scope: !862, file: !258, line: 109, column: 20)
!878 = !DILocation(line: 109, column: 23, scope: !876)
!879 = !DILocation(line: 110, column: 13, scope: !880)
!880 = distinct !DILexicalBlock(scope: !877, file: !258, line: 109, column: 38)
!881 = !DILocation(line: 110, column: 16, scope: !880)
!882 = !DILocation(line: 110, column: 30, scope: !880)
!883 = !DILocation(line: 110, column: 35, scope: !880)
!884 = !DILocation(line: 110, column: 40, scope: !880)
!885 = !DILocation(line: 110, column: 46, scope: !880)
!886 = !DILocation(line: 110, column: 49, scope: !880)
!887 = !DILocation(line: 111, column: 9, scope: !880)
!888 = !DILocation(line: 114, column: 13, scope: !889)
!889 = distinct !DILexicalBlock(scope: !806, file: !258, line: 114, column: 13)
!890 = !DILocation(line: 114, column: 19, scope: !889)
!891 = !DILocation(line: 114, column: 13, scope: !806)
!892 = !DILocation(line: 115, column: 44, scope: !893)
!893 = distinct !DILexicalBlock(scope: !889, file: !258, line: 114, column: 26)
!894 = !DILocation(line: 115, column: 19, scope: !893)
!895 = !DILocation(line: 115, column: 25, scope: !893)
!896 = !DILocation(line: 115, column: 30, scope: !893)
!897 = !DILocation(line: 115, column: 39, scope: !893)
!898 = !DILocation(line: 115, column: 17, scope: !893)
!899 = !DILocation(line: 116, column: 17, scope: !900)
!900 = distinct !DILexicalBlock(scope: !893, file: !258, line: 116, column: 17)
!901 = !DILocation(line: 116, column: 20, scope: !900)
!902 = !DILocation(line: 116, column: 17, scope: !893)
!903 = !DILocation(line: 117, column: 17, scope: !904)
!904 = distinct !DILexicalBlock(scope: !900, file: !258, line: 116, column: 31)
!905 = !DILocation(line: 117, column: 20, scope: !904)
!906 = !DILocation(line: 117, column: 30, scope: !904)
!907 = !DILocation(line: 117, column: 35, scope: !904)
!908 = !DILocation(line: 117, column: 43, scope: !904)
!909 = !DILocation(line: 117, column: 51, scope: !904)
!910 = !DILocation(line: 117, column: 59, scope: !904)
!911 = !DILocation(line: 117, column: 65, scope: !904)
!912 = !DILocation(line: 118, column: 13, scope: !904)
!913 = !DILocation(line: 118, column: 24, scope: !914)
!914 = !DILexicalBlockFile(scope: !915, file: !258, discriminator: 1)
!915 = distinct !DILexicalBlock(scope: !900, file: !258, line: 118, column: 24)
!916 = !DILocation(line: 118, column: 27, scope: !914)
!917 = !DILocation(line: 119, column: 17, scope: !918)
!918 = distinct !DILexicalBlock(scope: !915, file: !258, line: 118, column: 42)
!919 = !DILocation(line: 119, column: 20, scope: !918)
!920 = !DILocation(line: 119, column: 34, scope: !918)
!921 = !DILocation(line: 119, column: 39, scope: !918)
!922 = !DILocation(line: 119, column: 44, scope: !918)
!923 = !DILocation(line: 120, column: 13, scope: !918)
!924 = !DILocation(line: 121, column: 9, scope: !893)
!925 = !DILocation(line: 122, column: 5, scope: !806)
!926 = !DILocation(line: 98, column: 29, scope: !927)
!927 = !DILexicalBlockFile(scope: !801, file: !258, discriminator: 2)
!928 = !DILocation(line: 98, column: 5, scope: !927)
!929 = distinct !{!929, !930}
!930 = !DILocation(line: 98, column: 5, scope: !746)
!931 = !DILocation(line: 124, column: 12, scope: !746)
!932 = !DILocation(line: 124, column: 5, scope: !746)
!933 = distinct !DISubprogram(name: "ff_init_desc_hscale", scope: !258, file: !258, line: 144, type: !934, isLocal: false, isDefinition: true, scopeLine: 145, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !612)
!934 = !DISubroutineType(types: !935)
!935 = !{!261, !262, !267, !267, !251, !353, !261, !261}
!936 = !DILocation(line: 776, column: 77, scope: !614, inlinedAt: !937)
!937 = distinct !DILocation(line: 157, column: 40, scope: !938)
!938 = !DILexicalBlockFile(scope: !933, file: !258, discriminator: 1)
!939 = !DILocation(line: 778, column: 31, scope: !614, inlinedAt: !937)
!940 = !DILocation(line: 776, column: 77, scope: !614, inlinedAt: !941)
!941 = distinct !DILocation(line: 157, column: 19, scope: !933)
!942 = !DILocation(line: 778, column: 31, scope: !614, inlinedAt: !941)
!943 = !DILocalVariable(name: "desc", arg: 1, scope: !933, file: !258, line: 144, type: !262)
!944 = !DILocation(line: 144, column: 46, scope: !933)
!945 = !DILocalVariable(name: "src", arg: 2, scope: !933, file: !258, line: 144, type: !267)
!946 = !DILocation(line: 144, column: 62, scope: !933)
!947 = !DILocalVariable(name: "dst", arg: 3, scope: !933, file: !258, line: 144, type: !267)
!948 = !DILocation(line: 144, column: 77, scope: !933)
!949 = !DILocalVariable(name: "filter", arg: 4, scope: !933, file: !258, line: 144, type: !251)
!950 = !DILocation(line: 144, column: 92, scope: !933)
!951 = !DILocalVariable(name: "filter_pos", arg: 5, scope: !933, file: !258, line: 144, type: !353)
!952 = !DILocation(line: 144, column: 106, scope: !933)
!953 = !DILocalVariable(name: "filter_size", arg: 6, scope: !933, file: !258, line: 144, type: !261)
!954 = !DILocation(line: 144, column: 122, scope: !933)
!955 = !DILocalVariable(name: "xInc", arg: 7, scope: !933, file: !258, line: 144, type: !261)
!956 = !DILocation(line: 144, column: 139, scope: !933)
!957 = !DILocalVariable(name: "li", scope: !933, file: !258, line: 146, type: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "FilterContext", file: !258, line: 30, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FilterContext", file: !258, line: 24, size: 192, align: 64, elements: !961)
!961 = !{!962, !963, !964, !965}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !960, file: !258, line: 26, baseType: !251, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "filter_pos", scope: !960, file: !258, line: 27, baseType: !353, size: 64, align: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "filter_size", scope: !960, file: !258, line: 28, baseType: !261, size: 32, align: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "xInc", scope: !960, file: !258, line: 29, baseType: !261, size: 32, align: 32, offset: 160)
!966 = !DILocation(line: 146, column: 20, scope: !933)
!967 = !DILocation(line: 146, column: 25, scope: !933)
!968 = !DILocation(line: 147, column: 10, scope: !969)
!969 = distinct !DILexicalBlock(scope: !933, file: !258, line: 147, column: 9)
!970 = !DILocation(line: 147, column: 9, scope: !933)
!971 = !DILocation(line: 148, column: 9, scope: !969)
!972 = !DILocation(line: 150, column: 18, scope: !933)
!973 = !DILocation(line: 150, column: 5, scope: !933)
!974 = !DILocation(line: 150, column: 9, scope: !933)
!975 = !DILocation(line: 150, column: 16, scope: !933)
!976 = !DILocation(line: 151, column: 22, scope: !933)
!977 = !DILocation(line: 151, column: 5, scope: !933)
!978 = !DILocation(line: 151, column: 9, scope: !933)
!979 = !DILocation(line: 151, column: 20, scope: !933)
!980 = !DILocation(line: 152, column: 23, scope: !933)
!981 = !DILocation(line: 152, column: 5, scope: !933)
!982 = !DILocation(line: 152, column: 9, scope: !933)
!983 = !DILocation(line: 152, column: 21, scope: !933)
!984 = !DILocation(line: 153, column: 16, scope: !933)
!985 = !DILocation(line: 153, column: 5, scope: !933)
!986 = !DILocation(line: 153, column: 9, scope: !933)
!987 = !DILocation(line: 153, column: 14, scope: !933)
!988 = !DILocation(line: 155, column: 22, scope: !933)
!989 = !DILocation(line: 155, column: 5, scope: !933)
!990 = !DILocation(line: 155, column: 11, scope: !933)
!991 = !DILocation(line: 155, column: 20, scope: !933)
!992 = !DILocation(line: 157, column: 27, scope: !933)
!993 = !DILocation(line: 157, column: 32, scope: !933)
!994 = !DILocation(line: 157, column: 19, scope: !933)
!995 = !DILocation(line: 778, column: 58, scope: !614, inlinedAt: !941)
!996 = !DILocation(line: 778, column: 38, scope: !614, inlinedAt: !941)
!997 = !DILocation(line: 779, column: 16, scope: !685, inlinedAt: !941)
!998 = !DILocation(line: 779, column: 15, scope: !685, inlinedAt: !941)
!999 = !DILocation(line: 779, column: 14, scope: !685, inlinedAt: !941)
!1000 = !DILocation(line: 779, column: 25, scope: !691, inlinedAt: !941)
!1001 = !DILocation(line: 779, column: 90, scope: !694, inlinedAt: !941)
!1002 = !DILocation(line: 779, column: 90, scope: !691, inlinedAt: !941)
!1003 = !DILocation(line: 780, column: 9, scope: !697, inlinedAt: !941)
!1004 = !DILocation(line: 780, column: 17, scope: !697, inlinedAt: !941)
!1005 = !DILocation(line: 780, column: 9, scope: !614, inlinedAt: !941)
!1006 = !DILocation(line: 781, column: 9, scope: !697, inlinedAt: !941)
!1007 = !DILocation(line: 782, column: 12, scope: !614, inlinedAt: !941)
!1008 = !DILocation(line: 782, column: 18, scope: !614, inlinedAt: !941)
!1009 = !DILocation(line: 782, column: 24, scope: !614, inlinedAt: !941)
!1010 = !DILocation(line: 782, column: 5, scope: !614, inlinedAt: !941)
!1011 = !DILocation(line: 783, column: 1, scope: !614, inlinedAt: !941)
!1012 = !DILocation(line: 157, column: 37, scope: !933)
!1013 = !DILocation(line: 157, column: 48, scope: !938)
!1014 = !DILocation(line: 157, column: 53, scope: !938)
!1015 = !DILocation(line: 157, column: 40, scope: !938)
!1016 = !DILocation(line: 778, column: 58, scope: !614, inlinedAt: !937)
!1017 = !DILocation(line: 778, column: 38, scope: !614, inlinedAt: !937)
!1018 = !DILocation(line: 779, column: 16, scope: !685, inlinedAt: !937)
!1019 = !DILocation(line: 779, column: 15, scope: !685, inlinedAt: !937)
!1020 = !DILocation(line: 779, column: 14, scope: !685, inlinedAt: !937)
!1021 = !DILocation(line: 779, column: 25, scope: !691, inlinedAt: !937)
!1022 = !DILocation(line: 779, column: 90, scope: !694, inlinedAt: !937)
!1023 = !DILocation(line: 779, column: 90, scope: !691, inlinedAt: !937)
!1024 = !DILocation(line: 780, column: 9, scope: !697, inlinedAt: !937)
!1025 = !DILocation(line: 780, column: 17, scope: !697, inlinedAt: !937)
!1026 = !DILocation(line: 780, column: 9, scope: !614, inlinedAt: !937)
