; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--slice.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libswscale--slice.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SwsSlice = type { i32, i32, i32, i32, i32, i32, [4 x %struct.SwsPlane] }
%struct.SwsPlane = type { i32, i32, i32, i8**, i8** }

!189 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!190 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!191 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!192 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!193 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!194 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!195 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!196 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!197 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!198 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!199 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!200 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!201 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!202 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 29, size: 32, align: 32, elements: !205)
!204 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!206 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!207 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!208 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!209 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!210 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!211 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!212 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!213 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!214 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!215 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!216 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!217 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!218 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!219 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!220 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!221 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!222 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!223 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsDither", file: !225, line: 65, size: 32, align: 32, elements: !226)
!225 = !DIFile(filename: "libswscale/swscale_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!226 = !{!227, !228, !229, !230, !231, !232, !233}
!227 = !DIEnumerator(name: "SWS_DITHER_NONE", value: 0)
!228 = !DIEnumerator(name: "SWS_DITHER_AUTO", value: 1)
!229 = !DIEnumerator(name: "SWS_DITHER_BAYER", value: 2)
!230 = !DIEnumerator(name: "SWS_DITHER_ED", value: 3)
!231 = !DIEnumerator(name: "SWS_DITHER_A_DITHER", value: 4)
!232 = !DIEnumerator(name: "SWS_DITHER_X_DITHER", value: 5)
!233 = !DIEnumerator(name: "NB_SWS_DITHER", value: 6)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "SwsAlphaBlend", file: !225, line: 75, size: 32, align: 32, elements: !235)
!235 = !{!236, !237, !238, !239}
!236 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NONE", value: 0)
!237 = !DIEnumerator(name: "SWS_ALPHA_BLEND_UNIFORM", value: 1)
!238 = !DIEnumerator(name: "SWS_ALPHA_BLEND_CHECKERBOARD", value: 2)
!239 = !DIEnumerator(name: "SWS_ALPHA_BLEND_NB", value: 3)
!240 = !{!241, !245, !246, !249, !252}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !243, line: 51, baseType: !244)
!243 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!244 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !247, line: 197, baseType: !248)
!247 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!248 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !247, line: 196, baseType: !251)
!251 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !247, line: 195, baseType: !254)
!254 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!255 = !{i32 2, !"Dwarf Version", i32 4}
!256 = !{i32 2, !"Debug Info Version", i32 3}
!257 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!258 = distinct !DISubprogram(name: "ff_rotate_slice", scope: !259, file: !259, line: 119, type: !260, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !288)
!259 = !DIFile(filename: "libswscale/slice.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!260 = !DISubroutineType(types: !261)
!261 = !{!251, !262, !251, !251}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsSlice", file: !225, line: 952, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsSlice", file: !225, line: 943, size: 1216, align: 64, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !271, !272}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !264, file: !225, line: 945, baseType: !251, size: 32, align: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "h_chr_sub_sample", scope: !264, file: !225, line: 946, baseType: !251, size: 32, align: 32, offset: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "v_chr_sub_sample", scope: !264, file: !225, line: 947, baseType: !251, size: 32, align: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "is_ring", scope: !264, file: !225, line: 948, baseType: !251, size: 32, align: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "should_free_lines", scope: !264, file: !225, line: 949, baseType: !251, size: 32, align: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !264, file: !225, line: 950, baseType: !3, size: 32, align: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !264, file: !225, line: 951, baseType: !273, size: 1024, align: 64, offset: 192)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1024, align: 64, elements: !286)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsPlane", file: !225, line: 936, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsPlane", file: !225, line: 929, size: 256, align: 64, elements: !276)
!276 = !{!277, !278, !279, !280, !285}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "available_lines", scope: !275, file: !225, line: 931, baseType: !251, size: 32, align: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "sliceY", scope: !275, file: !225, line: 932, baseType: !251, size: 32, align: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "sliceH", scope: !275, file: !225, line: 933, baseType: !251, size: 32, align: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !275, file: !225, line: 934, baseType: !281, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !243, line: 48, baseType: !284)
!284 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !275, file: !225, line: 935, baseType: !281, size: 64, align: 64, offset: 192)
!286 = !{!287}
!287 = !DISubrange(count: 4)
!288 = !{}
!289 = !DILocalVariable(name: "s", arg: 1, scope: !258, file: !259, line: 119, type: !262)
!290 = !DIExpression()
!291 = !DILocation(line: 119, column: 31, scope: !258)
!292 = !DILocalVariable(name: "lum", arg: 2, scope: !258, file: !259, line: 119, type: !251)
!293 = !DILocation(line: 119, column: 38, scope: !258)
!294 = !DILocalVariable(name: "chr", arg: 3, scope: !258, file: !259, line: 119, type: !251)
!295 = !DILocation(line: 119, column: 47, scope: !258)
!296 = !DILocalVariable(name: "i", scope: !258, file: !259, line: 121, type: !251)
!297 = !DILocation(line: 121, column: 9, scope: !258)
!298 = !DILocation(line: 122, column: 9, scope: !299)
!299 = distinct !DILexicalBlock(scope: !258, file: !259, line: 122, column: 9)
!300 = !DILocation(line: 122, column: 9, scope: !258)
!301 = !DILocation(line: 123, column: 16, scope: !302)
!302 = distinct !DILexicalBlock(scope: !303, file: !259, line: 123, column: 9)
!303 = distinct !DILexicalBlock(scope: !299, file: !259, line: 122, column: 14)
!304 = !DILocation(line: 123, column: 14, scope: !302)
!305 = !DILocation(line: 123, column: 21, scope: !306)
!306 = !DILexicalBlockFile(scope: !307, file: !259, discriminator: 1)
!307 = distinct !DILexicalBlock(scope: !302, file: !259, line: 123, column: 9)
!308 = !DILocation(line: 123, column: 23, scope: !306)
!309 = !DILocation(line: 123, column: 9, scope: !306)
!310 = !DILocalVariable(name: "n", scope: !311, file: !259, line: 124, type: !251)
!311 = distinct !DILexicalBlock(scope: !307, file: !259, line: 123, column: 34)
!312 = !DILocation(line: 124, column: 17, scope: !311)
!313 = !DILocation(line: 124, column: 30, scope: !311)
!314 = !DILocation(line: 124, column: 21, scope: !311)
!315 = !DILocation(line: 124, column: 24, scope: !311)
!316 = !DILocation(line: 124, column: 33, scope: !311)
!317 = !DILocalVariable(name: "l", scope: !311, file: !259, line: 125, type: !251)
!318 = !DILocation(line: 125, column: 17, scope: !311)
!319 = !DILocation(line: 125, column: 21, scope: !311)
!320 = !DILocation(line: 125, column: 36, scope: !311)
!321 = !DILocation(line: 125, column: 27, scope: !311)
!322 = !DILocation(line: 125, column: 30, scope: !311)
!323 = !DILocation(line: 125, column: 39, scope: !311)
!324 = !DILocation(line: 125, column: 25, scope: !311)
!325 = !DILocation(line: 127, column: 17, scope: !326)
!326 = distinct !DILexicalBlock(scope: !311, file: !259, line: 127, column: 17)
!327 = !DILocation(line: 127, column: 22, scope: !326)
!328 = !DILocation(line: 127, column: 24, scope: !326)
!329 = !DILocation(line: 127, column: 19, scope: !326)
!330 = !DILocation(line: 127, column: 17, scope: !311)
!331 = !DILocation(line: 128, column: 39, scope: !332)
!332 = distinct !DILexicalBlock(scope: !326, file: !259, line: 127, column: 29)
!333 = !DILocation(line: 128, column: 26, scope: !332)
!334 = !DILocation(line: 128, column: 17, scope: !332)
!335 = !DILocation(line: 128, column: 20, scope: !332)
!336 = !DILocation(line: 128, column: 29, scope: !332)
!337 = !DILocation(line: 128, column: 36, scope: !332)
!338 = !DILocation(line: 129, column: 39, scope: !332)
!339 = !DILocation(line: 129, column: 26, scope: !332)
!340 = !DILocation(line: 129, column: 17, scope: !332)
!341 = !DILocation(line: 129, column: 20, scope: !332)
!342 = !DILocation(line: 129, column: 29, scope: !332)
!343 = !DILocation(line: 129, column: 36, scope: !332)
!344 = !DILocation(line: 130, column: 13, scope: !332)
!345 = !DILocation(line: 131, column: 9, scope: !311)
!346 = !DILocation(line: 123, column: 29, scope: !347)
!347 = !DILexicalBlockFile(scope: !307, file: !259, discriminator: 2)
!348 = !DILocation(line: 123, column: 9, scope: !347)
!349 = distinct !{!349, !350}
!350 = !DILocation(line: 123, column: 9, scope: !303)
!351 = !DILocation(line: 132, column: 5, scope: !303)
!352 = !DILocation(line: 133, column: 9, scope: !353)
!353 = distinct !DILexicalBlock(scope: !258, file: !259, line: 133, column: 9)
!354 = !DILocation(line: 133, column: 9, scope: !258)
!355 = !DILocation(line: 134, column: 16, scope: !356)
!356 = distinct !DILexicalBlock(scope: !357, file: !259, line: 134, column: 9)
!357 = distinct !DILexicalBlock(scope: !353, file: !259, line: 133, column: 14)
!358 = !DILocation(line: 134, column: 14, scope: !356)
!359 = !DILocation(line: 134, column: 21, scope: !360)
!360 = !DILexicalBlockFile(scope: !361, file: !259, discriminator: 1)
!361 = distinct !DILexicalBlock(scope: !356, file: !259, line: 134, column: 9)
!362 = !DILocation(line: 134, column: 23, scope: !360)
!363 = !DILocation(line: 134, column: 9, scope: !360)
!364 = !DILocalVariable(name: "n", scope: !365, file: !259, line: 135, type: !251)
!365 = distinct !DILexicalBlock(scope: !361, file: !259, line: 134, column: 33)
!366 = !DILocation(line: 135, column: 17, scope: !365)
!367 = !DILocation(line: 135, column: 30, scope: !365)
!368 = !DILocation(line: 135, column: 21, scope: !365)
!369 = !DILocation(line: 135, column: 24, scope: !365)
!370 = !DILocation(line: 135, column: 33, scope: !365)
!371 = !DILocalVariable(name: "l", scope: !365, file: !259, line: 136, type: !251)
!372 = !DILocation(line: 136, column: 17, scope: !365)
!373 = !DILocation(line: 136, column: 21, scope: !365)
!374 = !DILocation(line: 136, column: 36, scope: !365)
!375 = !DILocation(line: 136, column: 27, scope: !365)
!376 = !DILocation(line: 136, column: 30, scope: !365)
!377 = !DILocation(line: 136, column: 39, scope: !365)
!378 = !DILocation(line: 136, column: 25, scope: !365)
!379 = !DILocation(line: 138, column: 17, scope: !380)
!380 = distinct !DILexicalBlock(scope: !365, file: !259, line: 138, column: 17)
!381 = !DILocation(line: 138, column: 22, scope: !380)
!382 = !DILocation(line: 138, column: 24, scope: !380)
!383 = !DILocation(line: 138, column: 19, scope: !380)
!384 = !DILocation(line: 138, column: 17, scope: !365)
!385 = !DILocation(line: 139, column: 39, scope: !386)
!386 = distinct !DILexicalBlock(scope: !380, file: !259, line: 138, column: 29)
!387 = !DILocation(line: 139, column: 26, scope: !386)
!388 = !DILocation(line: 139, column: 17, scope: !386)
!389 = !DILocation(line: 139, column: 20, scope: !386)
!390 = !DILocation(line: 139, column: 29, scope: !386)
!391 = !DILocation(line: 139, column: 36, scope: !386)
!392 = !DILocation(line: 140, column: 39, scope: !386)
!393 = !DILocation(line: 140, column: 26, scope: !386)
!394 = !DILocation(line: 140, column: 17, scope: !386)
!395 = !DILocation(line: 140, column: 20, scope: !386)
!396 = !DILocation(line: 140, column: 29, scope: !386)
!397 = !DILocation(line: 140, column: 36, scope: !386)
!398 = !DILocation(line: 141, column: 13, scope: !386)
!399 = !DILocation(line: 142, column: 9, scope: !365)
!400 = !DILocation(line: 134, column: 28, scope: !401)
!401 = !DILexicalBlockFile(scope: !361, file: !259, discriminator: 2)
!402 = !DILocation(line: 134, column: 9, scope: !401)
!403 = distinct !{!403, !404}
!404 = !DILocation(line: 134, column: 9, scope: !357)
!405 = !DILocation(line: 143, column: 5, scope: !357)
!406 = !DILocation(line: 144, column: 5, scope: !258)
!407 = distinct !DISubprogram(name: "ff_init_slice_from_src", scope: !259, file: !259, line: 147, type: !408, isLocal: false, isDefinition: true, scopeLine: 148, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !288)
!408 = !DISubroutineType(types: !409)
!409 = !{!251, !262, !281, !410, !251, !251, !251, !251, !251, !251}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64, align: 64)
!411 = !DILocalVariable(name: "s", arg: 1, scope: !407, file: !259, line: 147, type: !262)
!412 = !DILocation(line: 147, column: 39, scope: !407)
!413 = !DILocalVariable(name: "src", arg: 2, scope: !407, file: !259, line: 147, type: !281)
!414 = !DILocation(line: 147, column: 51, scope: !407)
!415 = !DILocalVariable(name: "stride", arg: 3, scope: !407, file: !259, line: 147, type: !410)
!416 = !DILocation(line: 147, column: 63, scope: !407)
!417 = !DILocalVariable(name: "srcW", arg: 4, scope: !407, file: !259, line: 147, type: !251)
!418 = !DILocation(line: 147, column: 78, scope: !407)
!419 = !DILocalVariable(name: "lumY", arg: 5, scope: !407, file: !259, line: 147, type: !251)
!420 = !DILocation(line: 147, column: 88, scope: !407)
!421 = !DILocalVariable(name: "lumH", arg: 6, scope: !407, file: !259, line: 147, type: !251)
!422 = !DILocation(line: 147, column: 98, scope: !407)
!423 = !DILocalVariable(name: "chrY", arg: 7, scope: !407, file: !259, line: 147, type: !251)
!424 = !DILocation(line: 147, column: 108, scope: !407)
!425 = !DILocalVariable(name: "chrH", arg: 8, scope: !407, file: !259, line: 147, type: !251)
!426 = !DILocation(line: 147, column: 118, scope: !407)
!427 = !DILocalVariable(name: "relative", arg: 9, scope: !407, file: !259, line: 147, type: !251)
!428 = !DILocation(line: 147, column: 128, scope: !407)
!429 = !DILocalVariable(name: "i", scope: !407, file: !259, line: 149, type: !251)
!430 = !DILocation(line: 149, column: 9, scope: !407)
!431 = !DILocalVariable(name: "start", scope: !407, file: !259, line: 151, type: !432)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 128, align: 32, elements: !286)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!434 = !DILocation(line: 151, column: 15, scope: !407)
!435 = !DILocation(line: 151, column: 26, scope: !407)
!436 = !DILocation(line: 151, column: 27, scope: !407)
!437 = !DILocation(line: 152, column: 27, scope: !407)
!438 = !DILocation(line: 153, column: 27, scope: !407)
!439 = !DILocation(line: 154, column: 27, scope: !407)
!440 = !DILocalVariable(name: "end", scope: !407, file: !259, line: 156, type: !432)
!441 = !DILocation(line: 156, column: 15, scope: !407)
!442 = !DILocation(line: 156, column: 24, scope: !407)
!443 = !DILocation(line: 156, column: 25, scope: !407)
!444 = !DILocation(line: 156, column: 31, scope: !407)
!445 = !DILocation(line: 156, column: 30, scope: !407)
!446 = !DILocation(line: 157, column: 25, scope: !407)
!447 = !DILocation(line: 157, column: 32, scope: !407)
!448 = !DILocation(line: 157, column: 30, scope: !407)
!449 = !DILocation(line: 158, column: 25, scope: !407)
!450 = !DILocation(line: 158, column: 32, scope: !407)
!451 = !DILocation(line: 158, column: 30, scope: !407)
!452 = !DILocation(line: 159, column: 25, scope: !407)
!453 = !DILocation(line: 159, column: 32, scope: !407)
!454 = !DILocation(line: 159, column: 30, scope: !407)
!455 = !DILocalVariable(name: "src_", scope: !407, file: !259, line: 161, type: !456)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 256, align: 64, elements: !286)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!458 = !DILocation(line: 161, column: 20, scope: !407)
!459 = !DILocation(line: 161, column: 30, scope: !407)
!460 = !DILocation(line: 161, column: 31, scope: !407)
!461 = !DILocation(line: 161, column: 41, scope: !407)
!462 = !DILocation(line: 161, column: 41, scope: !463)
!463 = !DILexicalBlockFile(scope: !407, file: !259, discriminator: 1)
!464 = !DILocation(line: 161, column: 56, scope: !465)
!465 = !DILexicalBlockFile(scope: !407, file: !259, discriminator: 2)
!466 = !DILocation(line: 161, column: 41, scope: !465)
!467 = !DILocation(line: 161, column: 41, scope: !468)
!468 = !DILexicalBlockFile(scope: !407, file: !259, discriminator: 3)
!469 = !DILocation(line: 161, column: 68, scope: !468)
!470 = !DILocation(line: 161, column: 66, scope: !468)
!471 = !DILocation(line: 161, column: 38, scope: !468)
!472 = !DILocation(line: 161, column: 30, scope: !468)
!473 = !DILocation(line: 162, column: 31, scope: !407)
!474 = !DILocation(line: 162, column: 41, scope: !407)
!475 = !DILocation(line: 162, column: 41, scope: !463)
!476 = !DILocation(line: 162, column: 56, scope: !465)
!477 = !DILocation(line: 162, column: 41, scope: !465)
!478 = !DILocation(line: 162, column: 41, scope: !468)
!479 = !DILocation(line: 162, column: 68, scope: !468)
!480 = !DILocation(line: 162, column: 66, scope: !468)
!481 = !DILocation(line: 162, column: 38, scope: !468)
!482 = !DILocation(line: 161, column: 30, scope: !483)
!483 = !DILexicalBlockFile(scope: !407, file: !259, discriminator: 4)
!484 = !DILocation(line: 163, column: 31, scope: !407)
!485 = !DILocation(line: 163, column: 41, scope: !407)
!486 = !DILocation(line: 163, column: 41, scope: !463)
!487 = !DILocation(line: 163, column: 56, scope: !465)
!488 = !DILocation(line: 163, column: 41, scope: !465)
!489 = !DILocation(line: 163, column: 41, scope: !468)
!490 = !DILocation(line: 163, column: 68, scope: !468)
!491 = !DILocation(line: 163, column: 66, scope: !468)
!492 = !DILocation(line: 163, column: 38, scope: !468)
!493 = !DILocation(line: 161, column: 30, scope: !494)
!494 = !DILexicalBlockFile(scope: !407, file: !259, discriminator: 5)
!495 = !DILocation(line: 164, column: 31, scope: !407)
!496 = !DILocation(line: 164, column: 41, scope: !407)
!497 = !DILocation(line: 164, column: 41, scope: !463)
!498 = !DILocation(line: 164, column: 56, scope: !465)
!499 = !DILocation(line: 164, column: 41, scope: !465)
!500 = !DILocation(line: 164, column: 41, scope: !468)
!501 = !DILocation(line: 164, column: 68, scope: !468)
!502 = !DILocation(line: 164, column: 66, scope: !468)
!503 = !DILocation(line: 164, column: 38, scope: !468)
!504 = !DILocation(line: 161, column: 30, scope: !505)
!505 = !DILexicalBlockFile(scope: !407, file: !259, discriminator: 6)
!506 = !DILocation(line: 166, column: 16, scope: !407)
!507 = !DILocation(line: 166, column: 5, scope: !407)
!508 = !DILocation(line: 166, column: 8, scope: !407)
!509 = !DILocation(line: 166, column: 14, scope: !407)
!510 = !DILocation(line: 168, column: 12, scope: !511)
!511 = distinct !DILexicalBlock(scope: !407, file: !259, line: 168, column: 5)
!512 = !DILocation(line: 168, column: 10, scope: !511)
!513 = !DILocation(line: 168, column: 17, scope: !514)
!514 = !DILexicalBlockFile(scope: !515, file: !259, discriminator: 1)
!515 = distinct !DILexicalBlock(scope: !511, file: !259, line: 168, column: 5)
!516 = !DILocation(line: 168, column: 19, scope: !514)
!517 = !DILocation(line: 168, column: 5, scope: !514)
!518 = !DILocalVariable(name: "j", scope: !519, file: !259, line: 169, type: !251)
!519 = distinct !DILexicalBlock(scope: !515, file: !259, line: 168, column: 29)
!520 = !DILocation(line: 169, column: 13, scope: !519)
!521 = !DILocalVariable(name: "first", scope: !519, file: !259, line: 170, type: !251)
!522 = !DILocation(line: 170, column: 13, scope: !519)
!523 = !DILocation(line: 170, column: 30, scope: !519)
!524 = !DILocation(line: 170, column: 21, scope: !519)
!525 = !DILocation(line: 170, column: 24, scope: !519)
!526 = !DILocation(line: 170, column: 33, scope: !519)
!527 = !DILocalVariable(name: "n", scope: !519, file: !259, line: 171, type: !251)
!528 = !DILocation(line: 171, column: 13, scope: !519)
!529 = !DILocation(line: 171, column: 26, scope: !519)
!530 = !DILocation(line: 171, column: 17, scope: !519)
!531 = !DILocation(line: 171, column: 20, scope: !519)
!532 = !DILocation(line: 171, column: 29, scope: !519)
!533 = !DILocalVariable(name: "lines", scope: !519, file: !259, line: 172, type: !251)
!534 = !DILocation(line: 172, column: 13, scope: !519)
!535 = !DILocation(line: 172, column: 25, scope: !519)
!536 = !DILocation(line: 172, column: 21, scope: !519)
!537 = !DILocation(line: 172, column: 36, scope: !519)
!538 = !DILocation(line: 172, column: 30, scope: !519)
!539 = !DILocation(line: 172, column: 28, scope: !519)
!540 = !DILocalVariable(name: "tot_lines", scope: !519, file: !259, line: 173, type: !251)
!541 = !DILocation(line: 173, column: 13, scope: !519)
!542 = !DILocation(line: 173, column: 29, scope: !519)
!543 = !DILocation(line: 173, column: 25, scope: !519)
!544 = !DILocation(line: 173, column: 34, scope: !519)
!545 = !DILocation(line: 173, column: 32, scope: !519)
!546 = !DILocation(line: 175, column: 19, scope: !547)
!547 = distinct !DILexicalBlock(scope: !519, file: !259, line: 175, column: 13)
!548 = !DILocation(line: 175, column: 13, scope: !547)
!549 = !DILocation(line: 175, column: 25, scope: !547)
!550 = !DILocation(line: 175, column: 22, scope: !547)
!551 = !DILocation(line: 175, column: 31, scope: !547)
!552 = !DILocation(line: 175, column: 34, scope: !553)
!553 = !DILexicalBlockFile(scope: !547, file: !259, discriminator: 1)
!554 = !DILocation(line: 175, column: 39, scope: !553)
!555 = !DILocation(line: 175, column: 36, scope: !553)
!556 = !DILocation(line: 175, column: 13, scope: !553)
!557 = !DILocation(line: 176, column: 36, scope: !558)
!558 = distinct !DILexicalBlock(scope: !547, file: !259, line: 175, column: 50)
!559 = !DILocation(line: 176, column: 59, scope: !558)
!560 = !DILocation(line: 176, column: 50, scope: !558)
!561 = !DILocation(line: 176, column: 53, scope: !558)
!562 = !DILocation(line: 176, column: 62, scope: !558)
!563 = !DILocation(line: 176, column: 47, scope: !558)
!564 = !DILocation(line: 176, column: 35, scope: !558)
!565 = !DILocation(line: 176, column: 73, scope: !566)
!566 = !DILexicalBlockFile(scope: !558, file: !259, discriminator: 1)
!567 = !DILocation(line: 176, column: 35, scope: !566)
!568 = !DILocation(line: 176, column: 96, scope: !569)
!569 = !DILexicalBlockFile(scope: !558, file: !259, discriminator: 2)
!570 = !DILocation(line: 176, column: 87, scope: !569)
!571 = !DILocation(line: 176, column: 90, scope: !569)
!572 = !DILocation(line: 176, column: 99, scope: !569)
!573 = !DILocation(line: 176, column: 35, scope: !569)
!574 = !DILocation(line: 176, column: 35, scope: !575)
!575 = !DILexicalBlockFile(scope: !558, file: !259, discriminator: 3)
!576 = !DILocation(line: 176, column: 22, scope: !575)
!577 = !DILocation(line: 176, column: 13, scope: !575)
!578 = !DILocation(line: 176, column: 16, scope: !575)
!579 = !DILocation(line: 176, column: 25, scope: !575)
!580 = !DILocation(line: 176, column: 32, scope: !575)
!581 = !DILocation(line: 177, column: 20, scope: !582)
!582 = distinct !DILexicalBlock(scope: !558, file: !259, line: 177, column: 13)
!583 = !DILocation(line: 177, column: 18, scope: !582)
!584 = !DILocation(line: 177, column: 25, scope: !585)
!585 = !DILexicalBlockFile(scope: !586, file: !259, discriminator: 1)
!586 = distinct !DILexicalBlock(scope: !582, file: !259, line: 177, column: 13)
!587 = !DILocation(line: 177, column: 29, scope: !585)
!588 = !DILocation(line: 177, column: 27, scope: !585)
!589 = !DILocation(line: 177, column: 13, scope: !585)
!590 = !DILocation(line: 178, column: 63, scope: !586)
!591 = !DILocation(line: 178, column: 58, scope: !586)
!592 = !DILocation(line: 178, column: 68, scope: !586)
!593 = !DILocation(line: 178, column: 79, scope: !586)
!594 = !DILocation(line: 178, column: 72, scope: !586)
!595 = !DILocation(line: 178, column: 70, scope: !586)
!596 = !DILocation(line: 178, column: 66, scope: !586)
!597 = !DILocation(line: 178, column: 40, scope: !586)
!598 = !DILocation(line: 178, column: 34, scope: !586)
!599 = !DILocation(line: 178, column: 45, scope: !586)
!600 = !DILocation(line: 178, column: 43, scope: !586)
!601 = !DILocation(line: 178, column: 53, scope: !586)
!602 = !DILocation(line: 178, column: 51, scope: !586)
!603 = !DILocation(line: 178, column: 17, scope: !586)
!604 = !DILocation(line: 178, column: 26, scope: !586)
!605 = !DILocation(line: 178, column: 20, scope: !586)
!606 = !DILocation(line: 178, column: 29, scope: !586)
!607 = !DILocation(line: 178, column: 56, scope: !586)
!608 = !DILocation(line: 177, column: 37, scope: !609)
!609 = !DILexicalBlockFile(scope: !586, file: !259, discriminator: 2)
!610 = !DILocation(line: 177, column: 13, scope: !609)
!611 = distinct !{!611, !612}
!612 = !DILocation(line: 177, column: 13, scope: !558)
!613 = !DILocation(line: 179, column: 9, scope: !558)
!614 = !DILocation(line: 180, column: 40, scope: !615)
!615 = distinct !DILexicalBlock(scope: !547, file: !259, line: 179, column: 16)
!616 = !DILocation(line: 180, column: 34, scope: !615)
!617 = !DILocation(line: 180, column: 22, scope: !615)
!618 = !DILocation(line: 180, column: 13, scope: !615)
!619 = !DILocation(line: 180, column: 16, scope: !615)
!620 = !DILocation(line: 180, column: 25, scope: !615)
!621 = !DILocation(line: 180, column: 32, scope: !615)
!622 = !DILocation(line: 181, column: 21, scope: !615)
!623 = !DILocation(line: 181, column: 29, scope: !615)
!624 = !DILocation(line: 181, column: 27, scope: !615)
!625 = !DILocation(line: 181, column: 33, scope: !626)
!626 = !DILexicalBlockFile(scope: !615, file: !259, discriminator: 1)
!627 = !DILocation(line: 181, column: 21, scope: !626)
!628 = !DILocation(line: 181, column: 37, scope: !629)
!629 = !DILexicalBlockFile(scope: !615, file: !259, discriminator: 2)
!630 = !DILocation(line: 181, column: 21, scope: !629)
!631 = !DILocation(line: 181, column: 21, scope: !632)
!632 = !DILexicalBlockFile(scope: !615, file: !259, discriminator: 3)
!633 = !DILocation(line: 181, column: 19, scope: !632)
!634 = !DILocation(line: 182, column: 34, scope: !615)
!635 = !DILocation(line: 182, column: 22, scope: !615)
!636 = !DILocation(line: 182, column: 13, scope: !615)
!637 = !DILocation(line: 182, column: 16, scope: !615)
!638 = !DILocation(line: 182, column: 25, scope: !615)
!639 = !DILocation(line: 182, column: 32, scope: !615)
!640 = !DILocation(line: 183, column: 20, scope: !641)
!641 = distinct !DILexicalBlock(scope: !615, file: !259, line: 183, column: 13)
!642 = !DILocation(line: 183, column: 18, scope: !641)
!643 = !DILocation(line: 183, column: 25, scope: !644)
!644 = !DILexicalBlockFile(scope: !645, file: !259, discriminator: 1)
!645 = distinct !DILexicalBlock(scope: !641, file: !259, line: 183, column: 13)
!646 = !DILocation(line: 183, column: 29, scope: !644)
!647 = !DILocation(line: 183, column: 27, scope: !644)
!648 = !DILocation(line: 183, column: 13, scope: !644)
!649 = !DILocation(line: 184, column: 44, scope: !645)
!650 = !DILocation(line: 184, column: 39, scope: !645)
!651 = !DILocation(line: 184, column: 49, scope: !645)
!652 = !DILocation(line: 184, column: 60, scope: !645)
!653 = !DILocation(line: 184, column: 53, scope: !645)
!654 = !DILocation(line: 184, column: 51, scope: !645)
!655 = !DILocation(line: 184, column: 47, scope: !645)
!656 = !DILocation(line: 184, column: 34, scope: !645)
!657 = !DILocation(line: 184, column: 17, scope: !645)
!658 = !DILocation(line: 184, column: 26, scope: !645)
!659 = !DILocation(line: 184, column: 20, scope: !645)
!660 = !DILocation(line: 184, column: 29, scope: !645)
!661 = !DILocation(line: 184, column: 37, scope: !645)
!662 = !DILocation(line: 183, column: 37, scope: !663)
!663 = !DILexicalBlockFile(scope: !645, file: !259, discriminator: 2)
!664 = !DILocation(line: 183, column: 13, scope: !663)
!665 = distinct !{!665, !666}
!666 = !DILocation(line: 183, column: 13, scope: !615)
!667 = !DILocation(line: 187, column: 5, scope: !519)
!668 = !DILocation(line: 168, column: 24, scope: !669)
!669 = !DILexicalBlockFile(scope: !515, file: !259, discriminator: 2)
!670 = !DILocation(line: 168, column: 5, scope: !669)
!671 = distinct !{!671, !672}
!672 = !DILocation(line: 168, column: 5, scope: !407)
!673 = !DILocation(line: 189, column: 5, scope: !407)
!674 = distinct !DISubprogram(name: "ff_init_filters", scope: !259, file: !259, line: 249, type: !675, isLocal: false, isDefinition: true, scopeLine: 250, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !288)
!675 = !DISubroutineType(types: !676)
!676 = !{!251, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsContext", file: !225, line: 628, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsContext", file: !225, line: 280, size: 424064, align: 128, elements: !680)
!680 = !{!681, !725, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !762, !766, !768, !770, !771, !772, !773, !774, !775, !776, !780, !781, !782, !784, !785, !787, !799, !803, !804, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !838, !840, !841, !842, !846, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !886, !887, !888, !889, !890, !891, !892, !893, !894, !897, !898, !902, !904, !905, !906, !907, !908, !909, !910, !911, !914, !915, !922, !928, !933, !938, !943, !948, !953, !957, !958, !962, !966, !970, !971, !975, !979, !985, !986, !990, !994, !995, !997}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !679, file: !225, line: 284, baseType: !682, size: 64, align: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !204, line: 143, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !204, line: 67, size: 640, align: 64, elements: !686)
!686 = !{!687, !691, !695, !699, !700, !701, !702, !706, !712, !714, !718}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !685, file: !204, line: 72, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !685, file: !204, line: 78, baseType: !692, size: 64, align: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64, align: 64)
!693 = !DISubroutineType(types: !694)
!694 = !{!688, !245}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !685, file: !204, line: 85, baseType: !696, size: 64, align: 64, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !698)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !204, line: 85, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !685, file: !204, line: 93, baseType: !251, size: 32, align: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !685, file: !204, line: 99, baseType: !251, size: 32, align: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !685, file: !204, line: 108, baseType: !251, size: 32, align: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !685, file: !204, line: 113, baseType: !703, size: 64, align: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64, align: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{!245, !245, !245}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !685, file: !204, line: 123, baseType: !707, size: 64, align: 64, offset: 384)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64, align: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!710, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !685, file: !204, line: 130, baseType: !713, size: 32, align: 32, offset: 448)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !204, line: 48, baseType: !203)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !685, file: !204, line: 136, baseType: !715, size: 64, align: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64, align: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{!713, !245}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !685, file: !204, line: 142, baseType: !719, size: 64, align: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64, align: 64)
!720 = !DISubroutineType(types: !721)
!721 = !{!251, !722, !245, !688, !251}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64, align: 64)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !204, line: 60, flags: DIFlagFwdDecl)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "swscale", scope: !679, file: !225, line: 290, baseType: !726, size: 64, align: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsFunc", file: !225, line: 82, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64, align: 64)
!728 = !DISubroutineType(types: !729)
!729 = !{!251, !730, !731, !410, !251, !251, !281, !410}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "srcW", scope: !679, file: !225, line: 291, baseType: !251, size: 32, align: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "srcH", scope: !679, file: !225, line: 292, baseType: !251, size: 32, align: 32, offset: 160)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "dstH", scope: !679, file: !225, line: 293, baseType: !251, size: 32, align: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcW", scope: !679, file: !225, line: 294, baseType: !251, size: 32, align: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcH", scope: !679, file: !225, line: 295, baseType: !251, size: 32, align: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstW", scope: !679, file: !225, line: 296, baseType: !251, size: 32, align: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstH", scope: !679, file: !225, line: 297, baseType: !251, size: 32, align: 32, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lumXInc", scope: !679, file: !225, line: 298, baseType: !251, size: 32, align: 32, offset: 352)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chrXInc", scope: !679, file: !225, line: 298, baseType: !251, size: 32, align: 32, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lumYInc", scope: !679, file: !225, line: 299, baseType: !251, size: 32, align: 32, offset: 416)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "chrYInc", scope: !679, file: !225, line: 299, baseType: !251, size: 32, align: 32, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormat", scope: !679, file: !225, line: 300, baseType: !3, size: 32, align: 32, offset: 480)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormat", scope: !679, file: !225, line: 301, baseType: !3, size: 32, align: 32, offset: 512)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "dstFormatBpp", scope: !679, file: !225, line: 302, baseType: !251, size: 32, align: 32, offset: 544)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "srcFormatBpp", scope: !679, file: !225, line: 303, baseType: !251, size: 32, align: 32, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "dstBpc", scope: !679, file: !225, line: 304, baseType: !251, size: 32, align: 32, offset: 608)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "srcBpc", scope: !679, file: !225, line: 304, baseType: !251, size: 32, align: 32, offset: 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcHSubSample", scope: !679, file: !225, line: 305, baseType: !251, size: 32, align: 32, offset: 672)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "chrSrcVSubSample", scope: !679, file: !225, line: 306, baseType: !251, size: 32, align: 32, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstHSubSample", scope: !679, file: !225, line: 307, baseType: !251, size: 32, align: 32, offset: 736)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chrDstVSubSample", scope: !679, file: !225, line: 308, baseType: !251, size: 32, align: 32, offset: 768)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "vChrDrop", scope: !679, file: !225, line: 309, baseType: !251, size: 32, align: 32, offset: 800)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "sliceDir", scope: !679, file: !225, line: 310, baseType: !251, size: 32, align: 32, offset: 832)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !679, file: !225, line: 311, baseType: !758, size: 128, align: 64, offset: 896)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 128, align: 64, elements: !760)
!759 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!760 = !{!761}
!761 = !DISubrange(count: 2)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_context", scope: !679, file: !225, line: 317, baseType: !763, size: 192, align: 64, offset: 1024)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 192, align: 64, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 3)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmpStride", scope: !679, file: !225, line: 318, baseType: !767, size: 128, align: 32, offset: 1216)
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 128, align: 32, elements: !286)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_tmp", scope: !679, file: !225, line: 319, baseType: !769, size: 256, align: 64, offset: 1344)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 256, align: 64, elements: !286)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmpStride", scope: !679, file: !225, line: 320, baseType: !767, size: 128, align: 32, offset: 1600)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded1_tmp", scope: !679, file: !225, line: 321, baseType: !769, size: 256, align: 64, offset: 1728)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "cascaded_mainindex", scope: !679, file: !225, line: 322, baseType: !251, size: 32, align: 32, offset: 1984)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_value", scope: !679, file: !225, line: 324, baseType: !759, size: 64, align: 64, offset: 2048)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_flag", scope: !679, file: !225, line: 325, baseType: !251, size: 32, align: 32, offset: 2112)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "is_internal_gamma", scope: !679, file: !225, line: 326, baseType: !251, size: 32, align: 32, offset: 2144)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !679, file: !225, line: 327, baseType: !777, size: 64, align: 64, offset: 2176)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !243, line: 49, baseType: !779)
!779 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "inv_gamma", scope: !679, file: !225, line: 328, baseType: !777, size: 64, align: 64, offset: 2240)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "numDesc", scope: !679, file: !225, line: 330, baseType: !251, size: 32, align: 32, offset: 2304)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "descIndex", scope: !679, file: !225, line: 331, baseType: !783, size: 64, align: 32, offset: 2336)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 64, align: 32, elements: !760)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "numSlice", scope: !679, file: !225, line: 332, baseType: !251, size: 32, align: 32, offset: 2400)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "slice", scope: !679, file: !225, line: 333, baseType: !786, size: 64, align: 64, offset: 2432)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64, align: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !679, file: !225, line: 334, baseType: !788, size: 64, align: 64, offset: 2496)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64, align: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SwsFilterDescriptor", file: !225, line: 958, size: 320, align: 64, elements: !790)
!790 = !{!791, !792, !793, !794, !795}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !789, file: !225, line: 960, baseType: !262, size: 64, align: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !789, file: !225, line: 961, baseType: !262, size: 64, align: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !789, file: !225, line: 963, baseType: !251, size: 32, align: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "instance", scope: !789, file: !225, line: 964, baseType: !245, size: 64, align: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !789, file: !225, line: 967, baseType: !796, size: 64, align: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DISubroutineType(types: !798)
!798 = !{!251, !677, !788, !251, !251}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "pal_yuv", scope: !679, file: !225, line: 336, baseType: !800, size: 8192, align: 32, offset: 2560)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 8192, align: 32, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 256)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pal_rgb", scope: !679, file: !225, line: 337, baseType: !800, size: 8192, align: 32, offset: 10752)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "uint2float_lut", scope: !679, file: !225, line: 339, baseType: !805, size: 8192, align: 32, offset: 18944)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 8192, align: 32, elements: !801)
!806 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lastInLumBuf", scope: !679, file: !225, line: 351, baseType: !251, size: 32, align: 32, offset: 27136)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lastInChrBuf", scope: !679, file: !225, line: 352, baseType: !251, size: 32, align: 32, offset: 27168)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lumBufIndex", scope: !679, file: !225, line: 353, baseType: !251, size: 32, align: 32, offset: 27200)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "chrBufIndex", scope: !679, file: !225, line: 354, baseType: !251, size: 32, align: 32, offset: 27232)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "formatConvBuffer", scope: !679, file: !225, line: 357, baseType: !282, size: 64, align: 64, offset: 27264)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "needAlpha", scope: !679, file: !225, line: 358, baseType: !251, size: 32, align: 32, offset: 27328)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilter", scope: !679, file: !225, line: 374, baseType: !252, size: 64, align: 64, offset: 27392)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilter", scope: !679, file: !225, line: 375, baseType: !252, size: 64, align: 64, offset: 27456)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilter", scope: !679, file: !225, line: 376, baseType: !252, size: 64, align: 64, offset: 27520)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilter", scope: !679, file: !225, line: 377, baseType: !252, size: 64, align: 64, offset: 27584)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterPos", scope: !679, file: !225, line: 378, baseType: !249, size: 64, align: 64, offset: 27648)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterPos", scope: !679, file: !225, line: 379, baseType: !249, size: 64, align: 64, offset: 27712)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterPos", scope: !679, file: !225, line: 380, baseType: !249, size: 64, align: 64, offset: 27776)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterPos", scope: !679, file: !225, line: 381, baseType: !249, size: 64, align: 64, offset: 27840)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "hLumFilterSize", scope: !679, file: !225, line: 382, baseType: !251, size: 32, align: 32, offset: 27904)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "hChrFilterSize", scope: !679, file: !225, line: 383, baseType: !251, size: 32, align: 32, offset: 27936)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "vLumFilterSize", scope: !679, file: !225, line: 384, baseType: !251, size: 32, align: 32, offset: 27968)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "vChrFilterSize", scope: !679, file: !225, line: 385, baseType: !251, size: 32, align: 32, offset: 28000)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCodeSize", scope: !679, file: !225, line: 388, baseType: !251, size: 32, align: 32, offset: 28032)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCodeSize", scope: !679, file: !225, line: 389, baseType: !251, size: 32, align: 32, offset: 28064)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxextFilterCode", scope: !679, file: !225, line: 390, baseType: !282, size: 64, align: 64, offset: 28096)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxextFilterCode", scope: !679, file: !225, line: 391, baseType: !282, size: 64, align: 64, offset: 28160)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "canMMXEXTBeUsed", scope: !679, file: !225, line: 393, baseType: !251, size: 32, align: 32, offset: 28224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "warned_unuseable_bilinear", scope: !679, file: !225, line: 394, baseType: !251, size: 32, align: 32, offset: 28256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "dstY", scope: !679, file: !225, line: 396, baseType: !251, size: 32, align: 32, offset: 28288)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !679, file: !225, line: 397, baseType: !251, size: 32, align: 32, offset: 28320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "yuvTable", scope: !679, file: !225, line: 398, baseType: !245, size: 64, align: 64, offset: 28352)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "table_gV", scope: !679, file: !225, line: 401, baseType: !835, size: 40960, align: 32, offset: 28416)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, size: 40960, align: 32, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 1280)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "table_rV", scope: !679, file: !225, line: 402, baseType: !839, size: 81920, align: 64, offset: 69376)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 81920, align: 64, elements: !836)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "table_gU", scope: !679, file: !225, line: 403, baseType: !839, size: 81920, align: 64, offset: 151296)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "table_bU", scope: !679, file: !225, line: 404, baseType: !839, size: 81920, align: 64, offset: 233216)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "input_rgb2yuv_table", scope: !679, file: !225, line: 405, baseType: !843, size: 5632, align: 32, offset: 315136)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 5632, align: 32, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 176)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dither_error", scope: !679, file: !225, line: 417, baseType: !847, size: 256, align: 64, offset: 320768)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 256, align: 64, elements: !286)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "contrast", scope: !679, file: !225, line: 420, baseType: !251, size: 32, align: 32, offset: 321024)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "brightness", scope: !679, file: !225, line: 420, baseType: !251, size: 32, align: 32, offset: 321056)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "saturation", scope: !679, file: !225, line: 420, baseType: !251, size: 32, align: 32, offset: 321088)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "srcColorspaceTable", scope: !679, file: !225, line: 421, baseType: !767, size: 128, align: 32, offset: 321120)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "dstColorspaceTable", scope: !679, file: !225, line: 422, baseType: !767, size: 128, align: 32, offset: 321248)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "srcRange", scope: !679, file: !225, line: 423, baseType: !251, size: 32, align: 32, offset: 321376)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dstRange", scope: !679, file: !225, line: 424, baseType: !251, size: 32, align: 32, offset: 321408)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "src0Alpha", scope: !679, file: !225, line: 425, baseType: !251, size: 32, align: 32, offset: 321440)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dst0Alpha", scope: !679, file: !225, line: 426, baseType: !251, size: 32, align: 32, offset: 321472)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "srcXYZ", scope: !679, file: !225, line: 427, baseType: !251, size: 32, align: 32, offset: 321504)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "dstXYZ", scope: !679, file: !225, line: 428, baseType: !251, size: 32, align: 32, offset: 321536)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "src_h_chr_pos", scope: !679, file: !225, line: 429, baseType: !251, size: 32, align: 32, offset: 321568)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dst_h_chr_pos", scope: !679, file: !225, line: 430, baseType: !251, size: 32, align: 32, offset: 321600)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "src_v_chr_pos", scope: !679, file: !225, line: 431, baseType: !251, size: 32, align: 32, offset: 321632)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dst_v_chr_pos", scope: !679, file: !225, line: 432, baseType: !251, size: 32, align: 32, offset: 321664)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_offset", scope: !679, file: !225, line: 433, baseType: !251, size: 32, align: 32, offset: 321696)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_y_coeff", scope: !679, file: !225, line: 434, baseType: !251, size: 32, align: 32, offset: 321728)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2r_coeff", scope: !679, file: !225, line: 435, baseType: !251, size: 32, align: 32, offset: 321760)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_v2g_coeff", scope: !679, file: !225, line: 436, baseType: !251, size: 32, align: 32, offset: 321792)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2g_coeff", scope: !679, file: !225, line: 437, baseType: !251, size: 32, align: 32, offset: 321824)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2rgb_u2b_coeff", scope: !679, file: !225, line: 438, baseType: !251, size: 32, align: 32, offset: 321856)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "redDither", scope: !679, file: !225, line: 466, baseType: !870, size: 64, align: 64, offset: 321920)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !243, line: 55, baseType: !871)
!871 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "greenDither", scope: !679, file: !225, line: 467, baseType: !870, size: 64, align: 64, offset: 321984)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "blueDither", scope: !679, file: !225, line: 468, baseType: !870, size: 64, align: 64, offset: 322048)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "yCoeff", scope: !679, file: !225, line: 470, baseType: !870, size: 64, align: 64, offset: 322112)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vrCoeff", scope: !679, file: !225, line: 471, baseType: !870, size: 64, align: 64, offset: 322176)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ubCoeff", scope: !679, file: !225, line: 472, baseType: !870, size: 64, align: 64, offset: 322240)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "vgCoeff", scope: !679, file: !225, line: 473, baseType: !870, size: 64, align: 64, offset: 322304)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ugCoeff", scope: !679, file: !225, line: 474, baseType: !870, size: 64, align: 64, offset: 322368)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "yOffset", scope: !679, file: !225, line: 475, baseType: !870, size: 64, align: 64, offset: 322432)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "uOffset", scope: !679, file: !225, line: 476, baseType: !870, size: 64, align: 64, offset: 322496)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "vOffset", scope: !679, file: !225, line: 477, baseType: !870, size: 64, align: 64, offset: 322560)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lumMmxFilter", scope: !679, file: !225, line: 478, baseType: !883, size: 32768, align: 32, offset: 322624)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 32768, align: 32, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 1024)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "chrMmxFilter", scope: !679, file: !225, line: 479, baseType: !883, size: 32768, align: 32, offset: 355392)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "dstW", scope: !679, file: !225, line: 480, baseType: !251, size: 32, align: 32, offset: 388160)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "esp", scope: !679, file: !225, line: 481, baseType: !870, size: 64, align: 64, offset: 388224)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "vRounder", scope: !679, file: !225, line: 482, baseType: !870, size: 64, align: 64, offset: 388288)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "u_temp", scope: !679, file: !225, line: 483, baseType: !870, size: 64, align: 64, offset: 388352)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "v_temp", scope: !679, file: !225, line: 484, baseType: !870, size: 64, align: 64, offset: 388416)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "y_temp", scope: !679, file: !225, line: 485, baseType: !870, size: 64, align: 64, offset: 388480)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "alpMmxFilter", scope: !679, file: !225, line: 486, baseType: !883, size: 32768, align: 32, offset: 388544)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "uv_off", scope: !679, file: !225, line: 490, baseType: !895, size: 64, align: 64, offset: 421312)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !896, line: 149, baseType: !248)
!896 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!897 = !DIDerivedType(tag: DW_TAG_member, name: "uv_offx2", scope: !679, file: !225, line: 491, baseType: !895, size: 64, align: 64, offset: 421376)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "dither16", scope: !679, file: !225, line: 492, baseType: !899, size: 128, align: 16, offset: 421440)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !778, size: 128, align: 16, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 8)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "dither32", scope: !679, file: !225, line: 493, baseType: !903, size: 256, align: 32, offset: 421568)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 256, align: 32, elements: !900)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "chrDither8", scope: !679, file: !225, line: 495, baseType: !732, size: 64, align: 64, offset: 421824)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lumDither8", scope: !679, file: !225, line: 495, baseType: !732, size: 64, align: 64, offset: 421888)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "use_mmx_vfilter", scope: !679, file: !225, line: 508, baseType: !251, size: 32, align: 32, offset: 421952)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgamma", scope: !679, file: !225, line: 513, baseType: !252, size: 64, align: 64, offset: 422016)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgamma", scope: !679, file: !225, line: 514, baseType: !252, size: 64, align: 64, offset: 422080)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "xyzgammainv", scope: !679, file: !225, line: 515, baseType: !252, size: 64, align: 64, offset: 422144)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rgbgammainv", scope: !679, file: !225, line: 516, baseType: !252, size: 64, align: 64, offset: 422208)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "xyz2rgb_matrix", scope: !679, file: !225, line: 517, baseType: !912, size: 192, align: 16, offset: 422272)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 192, align: 16, elements: !913)
!913 = !{!765, !287}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rgb2xyz_matrix", scope: !679, file: !225, line: 518, baseType: !912, size: 192, align: 16, offset: 422464)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2plane1", scope: !679, file: !225, line: 521, baseType: !916, size: 64, align: 64, offset: 422656)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planar1_fn", file: !225, line: 98, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !920, !282, !251, !732, !251}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2planeX", scope: !679, file: !225, line: 522, baseType: !923, size: 64, align: 64, offset: 422720)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2planarX_fn", file: !225, line: 114, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !920, !251, !927, !282, !251, !732, !251}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2nv12cX", scope: !679, file: !225, line: 523, baseType: !929, size: 64, align: 64, offset: 422784)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2interleavedX_fn", file: !225, line: 133, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !730, !920, !251, !927, !927, !282, !251}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed1", scope: !679, file: !225, line: 524, baseType: !934, size: 64, align: 64, offset: 422848)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed1_fn", file: !225, line: 169, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !730, !920, !927, !927, !920, !282, !251, !251, !251}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packed2", scope: !679, file: !225, line: 525, baseType: !939, size: 64, align: 64, offset: 422912)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packed2_fn", file: !225, line: 202, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !730, !927, !927, !927, !927, !282, !251, !251, !251, !251}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2packedX", scope: !679, file: !225, line: 526, baseType: !944, size: 64, align: 64, offset: 422976)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2packedX_fn", file: !225, line: 234, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{null, !730, !920, !927, !251, !920, !927, !927, !251, !927, !282, !251, !251}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "yuv2anyX", scope: !679, file: !225, line: 527, baseType: !949, size: 64, align: 64, offset: 423040)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "yuv2anyX_fn", file: !225, line: 268, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{null, !730, !920, !927, !251, !920, !927, !927, !251, !927, !281, !251, !251}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lumToYV12", scope: !679, file: !225, line: 530, baseType: !954, size: 64, align: 64, offset: 423104)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DISubroutineType(types: !956)
!956 = !{null, !282, !732, !732, !732, !251, !241}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "alpToYV12", scope: !679, file: !225, line: 533, baseType: !954, size: 64, align: 64, offset: 423168)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "chrToYV12", scope: !679, file: !225, line: 536, baseType: !959, size: 64, align: 64, offset: 423232)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !282, !282, !732, !732, !732, !251, !241}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "readLumPlanar", scope: !679, file: !225, line: 545, baseType: !963, size: 64, align: 64, offset: 423296)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !282, !731, !251, !249}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "readChrPlanar", scope: !679, file: !225, line: 546, baseType: !967, size: 64, align: 64, offset: 423360)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !282, !282, !731, !251, !249}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "readAlpPlanar", scope: !679, file: !225, line: 548, baseType: !963, size: 64, align: 64, offset: 423424)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "hyscale_fast", scope: !679, file: !225, line: 570, baseType: !972, size: 64, align: 64, offset: 423488)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{null, !730, !252, !251, !732, !251, !251}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "hcscale_fast", scope: !679, file: !225, line: 573, baseType: !976, size: 64, align: 64, offset: 423552)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !730, !252, !252, !251, !732, !732, !251, !251}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "hyScale", scope: !679, file: !225, line: 610, baseType: !980, size: 64, align: 64, offset: 423616)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{null, !730, !252, !251, !732, !920, !983, !251}
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "hcScale", scope: !679, file: !225, line: 613, baseType: !980, size: 64, align: 64, offset: 423680)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lumConvertRange", scope: !679, file: !225, line: 619, baseType: !987, size: 64, align: 64, offset: 423744)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DISubroutineType(types: !989)
!989 = !{null, !252, !251}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "chrConvertRange", scope: !679, file: !225, line: 621, baseType: !991, size: 64, align: 64, offset: 423808)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !252, !252, !251}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "needs_hcscale", scope: !679, file: !225, line: 623, baseType: !251, size: 32, align: 32, offset: 423872)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "dither", scope: !679, file: !225, line: 625, baseType: !996, size: 32, align: 32, offset: 423904)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsDither", file: !225, line: 73, baseType: !224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "alphablend", scope: !679, file: !225, line: 627, baseType: !998, size: 32, align: 32, offset: 423936)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwsAlphaBlend", file: !225, line: 80, baseType: !234)
!999 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !1000, file: !225, line: 816, type: !3)
!1000 = distinct !DISubprogram(name: "usePal", scope: !225, file: !225, line: 816, type: !1001, isLocal: true, isDefinition: true, scopeLine: 817, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !288)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!251, !3}
!1003 = !DILocation(line: 816, column: 76, scope: !1000, inlinedAt: !1004)
!1004 = distinct !DILocation(line: 262, column: 22, scope: !674)
!1005 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !1006, file: !225, line: 699, type: !3)
!1006 = distinct !DISubprogram(name: "isGray", scope: !225, file: !225, line: 699, type: !1001, isLocal: true, isDefinition: true, scopeLine: 700, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !288)
!1007 = !DILocation(line: 699, column: 76, scope: !1006, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 255, column: 51, scope: !1009)
!1009 = !DILexicalBlockFile(scope: !674, file: !259, discriminator: 1)
!1010 = !DILocalVariable(name: "desc", scope: !1006, file: !225, line: 701, type: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !1014, line: 123, baseType: !1015)
!1014 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !1014, line: 81, size: 1280, align: 64, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021, !1022, !1035}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1015, file: !1014, line: 82, baseType: !688, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1015, file: !1014, line: 83, baseType: !283, size: 8, align: 8, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !1015, file: !1014, line: 92, baseType: !283, size: 8, align: 8, offset: 72)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !1015, file: !1014, line: 101, baseType: !283, size: 8, align: 8, offset: 80)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1015, file: !1014, line: 106, baseType: !870, size: 64, align: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !1015, file: !1014, line: 117, baseType: !1023, size: 1024, align: 32, offset: 192)
!1023 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 1024, align: 32, elements: !286)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !1014, line: 70, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !1014, line: 31, size: 256, align: 32, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !1025, file: !1014, line: 35, baseType: !251, size: 32, align: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !1025, file: !1014, line: 41, baseType: !251, size: 32, align: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1025, file: !1014, line: 47, baseType: !251, size: 32, align: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !1025, file: !1014, line: 53, baseType: !251, size: 32, align: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !1025, file: !1014, line: 58, baseType: !251, size: 32, align: 32, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !1025, file: !1014, line: 62, baseType: !251, size: 32, align: 32, offset: 160)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !1025, file: !1014, line: 65, baseType: !251, size: 32, align: 32, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !1025, file: !1014, line: 68, baseType: !251, size: 32, align: 32, offset: 224)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1015, file: !1014, line: 122, baseType: !688, size: 64, align: 64, offset: 1216)
!1036 = !DILocation(line: 701, column: 31, scope: !1006, inlinedAt: !1008)
!1037 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !1038, file: !225, line: 667, type: !3)
!1038 = distinct !DISubprogram(name: "isYUV", scope: !225, file: !225, line: 667, type: !1001, isLocal: true, isDefinition: true, scopeLine: 668, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !288)
!1039 = !DILocation(line: 667, column: 75, scope: !1038, inlinedAt: !1040)
!1040 = distinct !DILocation(line: 678, column: 41, scope: !1041, inlinedAt: !1043)
!1041 = !DILexicalBlockFile(scope: !1042, file: !225, discriminator: 1)
!1042 = distinct !DISubprogram(name: "isPlanarYUV", scope: !225, file: !225, line: 674, type: !1001, isLocal: true, isDefinition: true, scopeLine: 675, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !288)
!1043 = distinct !DILocation(line: 255, column: 21, scope: !674)
!1044 = !DILocalVariable(name: "desc", scope: !1038, file: !225, line: 669, type: !1011)
!1045 = !DILocation(line: 669, column: 31, scope: !1038, inlinedAt: !1040)
!1046 = !DILocalVariable(name: "pix_fmt", arg: 1, scope: !1042, file: !225, line: 674, type: !3)
!1047 = !DILocation(line: 674, column: 81, scope: !1042, inlinedAt: !1043)
!1048 = !DILocalVariable(name: "desc", scope: !1042, file: !225, line: 676, type: !1011)
!1049 = !DILocation(line: 676, column: 31, scope: !1042, inlinedAt: !1043)
!1050 = !DILocalVariable(name: "c", arg: 1, scope: !674, file: !259, line: 249, type: !677)
!1051 = !DILocation(line: 249, column: 34, scope: !674)
!1052 = !DILocalVariable(name: "i", scope: !674, file: !259, line: 251, type: !251)
!1053 = !DILocation(line: 251, column: 9, scope: !674)
!1054 = !DILocalVariable(name: "index", scope: !674, file: !259, line: 252, type: !251)
!1055 = !DILocation(line: 252, column: 9, scope: !674)
!1056 = !DILocalVariable(name: "num_ydesc", scope: !674, file: !259, line: 253, type: !251)
!1057 = !DILocation(line: 253, column: 9, scope: !674)
!1058 = !DILocalVariable(name: "num_cdesc", scope: !674, file: !259, line: 254, type: !251)
!1059 = !DILocation(line: 254, column: 9, scope: !674)
!1060 = !DILocalVariable(name: "num_vdesc", scope: !674, file: !259, line: 255, type: !251)
!1061 = !DILocation(line: 255, column: 9, scope: !674)
!1062 = !DILocation(line: 255, column: 33, scope: !674)
!1063 = !DILocation(line: 255, column: 36, scope: !674)
!1064 = !DILocation(line: 255, column: 21, scope: !674)
!1065 = !DILocation(line: 676, column: 58, scope: !1042, inlinedAt: !1043)
!1066 = !DILocation(line: 676, column: 38, scope: !1042, inlinedAt: !1043)
!1067 = !DILocation(line: 677, column: 16, scope: !1068, inlinedAt: !1043)
!1068 = !DILexicalBlockFile(scope: !1069, file: !225, discriminator: 1)
!1069 = distinct !DILexicalBlock(scope: !1070, file: !225, line: 677, column: 14)
!1070 = distinct !DILexicalBlock(scope: !1042, file: !225, line: 677, column: 8)
!1071 = !DILocation(line: 677, column: 15, scope: !1068, inlinedAt: !1043)
!1072 = !DILocation(line: 677, column: 14, scope: !1068, inlinedAt: !1043)
!1073 = !DILocation(line: 677, column: 25, scope: !1074, inlinedAt: !1043)
!1074 = !DILexicalBlockFile(scope: !1075, file: !225, discriminator: 2)
!1075 = distinct !DILexicalBlock(scope: !1069, file: !225, line: 677, column: 23)
!1076 = !DILocation(line: 677, column: 90, scope: !1077, inlinedAt: !1043)
!1077 = !DILexicalBlockFile(scope: !1074, file: !225, discriminator: 4)
!1078 = !DILocation(line: 677, column: 90, scope: !1074, inlinedAt: !1043)
!1079 = !DILocation(line: 678, column: 14, scope: !1042, inlinedAt: !1043)
!1080 = !DILocation(line: 678, column: 20, scope: !1042, inlinedAt: !1043)
!1081 = !DILocation(line: 678, column: 26, scope: !1042, inlinedAt: !1043)
!1082 = !DILocation(line: 678, column: 38, scope: !1042, inlinedAt: !1043)
