; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--f_ebur128.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--f_ebur128.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!114 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !576)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !537, !538, !539, !540, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !437, !438, !440, !442, !444, !445, !446, !447, !448, !488, !489, !495, !504, !505, !506, !508, !509, !510, !511, !512}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 197, baseType: !208)
!207 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !405, !406, !407, !408, !412, !413, !418, !422, !423, !424, !425, !427, !432, !436}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!278 = !{!279, !280, !281, !389, !393, !397, !401, !402, !403, !404}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !387, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !297, !299, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !319, !320, !321, !322, !323, !324, !325, !326, !339, !341, !342, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !375, !376, !377, !378, !379, !380, !383, !384, !385, !386}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !295)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !293, line: 48, baseType: !294)
!293 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!294 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!295 = !{!296}
!296 = !DISubrange(count: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !298, size: 256, align: 32, offset: 512)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !295)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !300, size: 64, align: 64, offset: 768)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !316, size: 512, align: 64, offset: 1472)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 512, align: 64, elements: !295)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !293, line: 55, baseType: !318)
!318 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !317, size: 64, align: 64, offset: 2240)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !327, size: 512, align: 64, offset: 2304)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 512, align: 64, elements: !295)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !330, line: 94, baseType: !331)
!330 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !330, line: 81, size: 192, align: 64, elements: !332)
!332 = !{!333, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !331, file: !330, line: 82, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !330, line: 73, baseType: !336)
!336 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !330, line: 73, flags: DIFlagFwdDecl)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !331, file: !330, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !331, file: !330, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !340, size: 64, align: 64, offset: 2816)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !343, size: 64, align: 64, offset: 2944)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64, align: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !347)
!347 = !{!348, !349, !350, !351, !356}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !346, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !346, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !346, file: !24, line: 205, baseType: !352, size: 64, align: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !354, line: 86, baseType: !355)
!354 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !354, line: 86, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !346, file: !24, line: 206, baseType: !328, size: 64, align: 64, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !352, size: 64, align: 64, offset: 3456)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !372, size: 64, align: 64, offset: 3648)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64, align: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 194, baseType: !374)
!374 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !328, size: 64, align: 64, offset: 3776)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !328, size: 64, align: 64, offset: 3840)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !328, size: 64, align: 64, offset: 3904)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !381, size: 64, align: 64, offset: 3968)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !382, line: 216, baseType: !318)
!382 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !381, size: 64, align: 64, offset: 4032)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !381, size: 64, align: 64, offset: 4096)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !381, size: 64, align: 64, offset: 4160)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !328, size: 64, align: 64, offset: 4224)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !390, size: 64, align: 64, offset: 192)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64, align: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!285, !387, !200}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !394, size: 64, align: 64, offset: 256)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64, align: 64)
!395 = !DISubroutineType(types: !396)
!396 = !{!200, !387, !285}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !398, size: 64, align: 64, offset: 320)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = !DISubroutineType(types: !400)
!400 = !{!200, !387}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !398, size: 64, align: 64, offset: 384)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !398, size: 64, align: 64, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !409, size: 64, align: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!200, !173}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !409, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !414, size: 64, align: 64, offset: 512)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64, align: 64)
!415 = !DISubroutineType(types: !416)
!416 = !{!200, !173, !417}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !419, size: 64, align: 64, offset: 576)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !173}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !409, size: 64, align: 64, offset: 640)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !426, size: 64, align: 64, offset: 768)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !428, size: 64, align: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DISubroutineType(types: !430)
!430 = !{!200, !173, !184, !184, !431, !200, !200}
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !433, size: 64, align: 64, offset: 896)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DISubroutineType(types: !435)
!435 = !{!200, !173, !191}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !409, size: 64, align: 64, offset: 960)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !431, size: 64, align: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !439, size: 64, align: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !441, size: 64, align: 64, offset: 256)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !443, size: 32, align: 32, offset: 320)
!443 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !439, size: 64, align: 64, offset: 384)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !441, size: 64, align: 64, offset: 448)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !443, size: 32, align: 32, offset: 512)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !449, size: 64, align: 64, offset: 640)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !451)
!451 = !{!452, !453, !455, !456, !457, !458, !459, !460, !482, !483, !484, !485, !486, !487}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !450, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !450, file: !169, line: 842, baseType: !454, size: 64, align: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !450, file: !169, line: 843, baseType: !443, size: 32, align: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !450, file: !169, line: 845, baseType: !431, size: 64, align: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !450, file: !169, line: 847, baseType: !431, size: 64, align: 64, offset: 256)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !450, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !450, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !450, file: !169, line: 874, baseType: !461, size: 64, align: 64, offset: 384)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !464)
!464 = !{!465, !466, !476}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !463, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !463, file: !277, line: 150, baseType: !467, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !469)
!469 = !DISubroutineType(types: !470)
!470 = !{!200, !173, !471, !191, !475, !200}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !473)
!473 = !DISubroutineType(types: !474)
!474 = !{!200, !173, !191, !200, !200}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !463, file: !277, line: 151, baseType: !477, size: 8, align: 8, offset: 128)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !478, line: 48, baseType: !479)
!478 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !478, line: 46, size: 8, align: 8, elements: !480)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !479, file: !478, line: 47, baseType: !186, size: 8, align: 8)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !450, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !450, file: !169, line: 895, baseType: !467, size: 64, align: 64, offset: 512)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !450, file: !169, line: 897, baseType: !431, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !450, file: !169, line: 906, baseType: !441, size: 64, align: 64, offset: 640)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !450, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !450, file: !169, line: 909, baseType: !443, size: 32, align: 32, offset: 736)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !490, size: 64, align: 64, offset: 768)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64, align: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !492, file: !277, line: 155, baseType: !467, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !496, size: 64, align: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64, align: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !498)
!498 = !{!499, !500, !501, !502, !503}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !497, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !497, file: !277, line: 40, baseType: !431, size: 64, align: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !497, file: !277, line: 41, baseType: !431, size: 64, align: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !497, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !497, file: !277, line: 43, baseType: !496, size: 64, align: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !431, size: 64, align: 64, offset: 896)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !507, size: 64, align: 64, offset: 1024)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !328, size: 64, align: 64, offset: 1152)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !443, size: 32, align: 32, offset: 1248)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !439, size: 64, align: 64, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !439, size: 64, align: 64, offset: 192)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !317, size: 64, align: 64, offset: 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !525, size: 64, align: 64, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !528, line: 64, size: 256, align: 64, elements: !529)
!528 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!529 = !{!530, !531, !532, !533}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !527, file: !528, line: 65, baseType: !443, size: 32, align: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !527, file: !528, line: 66, baseType: !475, size: 64, align: 64, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !527, file: !528, line: 68, baseType: !443, size: 32, align: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !527, file: !528, line: 69, baseType: !534, size: 64, align: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !525, size: 64, align: 64, offset: 704)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !525, size: 64, align: 64, offset: 768)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !525, size: 64, align: 64, offset: 832)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !541, size: 64, align: 64, offset: 896)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64, align: 64)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !528, line: 85, size: 256, align: 64, elements: !543)
!543 = !{!544, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !542, file: !528, line: 86, baseType: !545, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !542, file: !528, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !542, file: !528, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !542, file: !528, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !542, file: !528, line: 91, baseType: !443, size: 32, align: 32, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !542, file: !528, line: 92, baseType: !551, size: 64, align: 64, offset: 192)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !541, size: 64, align: 64, offset: 960)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !449, size: 64, align: 64, offset: 1088)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !443, size: 32, align: 32, offset: 1600)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !328, size: 64, align: 64, offset: 1920)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !573, size: 491520, align: 8, offset: 1984)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 61440)
!576 = !{!577, !578, !579}
!577 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!578 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!579 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 152, size: 32, align: 32, elements: !582)
!581 = !DIFile(filename: "libavfilter/f_ebur128.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!582 = !{!583, !584, !585}
!583 = !DIEnumerator(name: "PEAK_MODE_NONE", value: 0)
!584 = !DIEnumerator(name: "PEAK_MODE_SAMPLES_PEAKS", value: 2)
!585 = !DIEnumerator(name: "PEAK_MODE_TRUE_PEAKS", value: 4)
!586 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 158, size: 32, align: 32, elements: !587)
!587 = !{!588, !589}
!588 = !DIEnumerator(name: "GAUGE_TYPE_MOMENTARY", value: 0)
!589 = !DIEnumerator(name: "GAUGE_TYPE_SHORTTERM", value: 1)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !581, line: 163, size: 32, align: 32, elements: !591)
!591 = !{!592, !593}
!592 = !DIEnumerator(name: "SCALE_TYPE_ABSOLUTE", value: 0)
!593 = !DIEnumerator(name: "SCALE_TYPE_RELATIVE", value: 1)
!594 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !595, line: 58, size: 32, align: 32, elements: !596)
!595 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!597 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!598 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!599 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!600 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!601 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!602 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!603 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!604 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!605 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!606 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!607 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!608 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!609 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!610 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPixelFormat", file: !48, line: 64, size: 32, align: 32, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!613 = !DIEnumerator(name: "AV_PIX_FMT_NONE", value: -1)
!614 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P", value: 0)
!615 = !DIEnumerator(name: "AV_PIX_FMT_YUYV422", value: 1)
!616 = !DIEnumerator(name: "AV_PIX_FMT_RGB24", value: 2)
!617 = !DIEnumerator(name: "AV_PIX_FMT_BGR24", value: 3)
!618 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P", value: 4)
!619 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P", value: 5)
!620 = !DIEnumerator(name: "AV_PIX_FMT_YUV410P", value: 6)
!621 = !DIEnumerator(name: "AV_PIX_FMT_YUV411P", value: 7)
!622 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8", value: 8)
!623 = !DIEnumerator(name: "AV_PIX_FMT_MONOWHITE", value: 9)
!624 = !DIEnumerator(name: "AV_PIX_FMT_MONOBLACK", value: 10)
!625 = !DIEnumerator(name: "AV_PIX_FMT_PAL8", value: 11)
!626 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ420P", value: 12)
!627 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ422P", value: 13)
!628 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ444P", value: 14)
!629 = !DIEnumerator(name: "AV_PIX_FMT_UYVY422", value: 15)
!630 = !DIEnumerator(name: "AV_PIX_FMT_UYYVYY411", value: 16)
!631 = !DIEnumerator(name: "AV_PIX_FMT_BGR8", value: 17)
!632 = !DIEnumerator(name: "AV_PIX_FMT_BGR4", value: 18)
!633 = !DIEnumerator(name: "AV_PIX_FMT_BGR4_BYTE", value: 19)
!634 = !DIEnumerator(name: "AV_PIX_FMT_RGB8", value: 20)
!635 = !DIEnumerator(name: "AV_PIX_FMT_RGB4", value: 21)
!636 = !DIEnumerator(name: "AV_PIX_FMT_RGB4_BYTE", value: 22)
!637 = !DIEnumerator(name: "AV_PIX_FMT_NV12", value: 23)
!638 = !DIEnumerator(name: "AV_PIX_FMT_NV21", value: 24)
!639 = !DIEnumerator(name: "AV_PIX_FMT_ARGB", value: 25)
!640 = !DIEnumerator(name: "AV_PIX_FMT_RGBA", value: 26)
!641 = !DIEnumerator(name: "AV_PIX_FMT_ABGR", value: 27)
!642 = !DIEnumerator(name: "AV_PIX_FMT_BGRA", value: 28)
!643 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16BE", value: 29)
!644 = !DIEnumerator(name: "AV_PIX_FMT_GRAY16LE", value: 30)
!645 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P", value: 31)
!646 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ440P", value: 32)
!647 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P", value: 33)
!648 = !DIEnumerator(name: "AV_PIX_FMT_RGB48BE", value: 34)
!649 = !DIEnumerator(name: "AV_PIX_FMT_RGB48LE", value: 35)
!650 = !DIEnumerator(name: "AV_PIX_FMT_RGB565BE", value: 36)
!651 = !DIEnumerator(name: "AV_PIX_FMT_RGB565LE", value: 37)
!652 = !DIEnumerator(name: "AV_PIX_FMT_RGB555BE", value: 38)
!653 = !DIEnumerator(name: "AV_PIX_FMT_RGB555LE", value: 39)
!654 = !DIEnumerator(name: "AV_PIX_FMT_BGR565BE", value: 40)
!655 = !DIEnumerator(name: "AV_PIX_FMT_BGR565LE", value: 41)
!656 = !DIEnumerator(name: "AV_PIX_FMT_BGR555BE", value: 42)
!657 = !DIEnumerator(name: "AV_PIX_FMT_BGR555LE", value: 43)
!658 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_MOCO", value: 44)
!659 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_IDCT", value: 45)
!660 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI_VLD", value: 46)
!661 = !DIEnumerator(name: "AV_PIX_FMT_VAAPI", value: 46)
!662 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16LE", value: 47)
!663 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P16BE", value: 48)
!664 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16LE", value: 49)
!665 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P16BE", value: 50)
!666 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16LE", value: 51)
!667 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P16BE", value: 52)
!668 = !DIEnumerator(name: "AV_PIX_FMT_DXVA2_VLD", value: 53)
!669 = !DIEnumerator(name: "AV_PIX_FMT_RGB444LE", value: 54)
!670 = !DIEnumerator(name: "AV_PIX_FMT_RGB444BE", value: 55)
!671 = !DIEnumerator(name: "AV_PIX_FMT_BGR444LE", value: 56)
!672 = !DIEnumerator(name: "AV_PIX_FMT_BGR444BE", value: 57)
!673 = !DIEnumerator(name: "AV_PIX_FMT_YA8", value: 58)
!674 = !DIEnumerator(name: "AV_PIX_FMT_Y400A", value: 58)
!675 = !DIEnumerator(name: "AV_PIX_FMT_GRAY8A", value: 58)
!676 = !DIEnumerator(name: "AV_PIX_FMT_BGR48BE", value: 59)
!677 = !DIEnumerator(name: "AV_PIX_FMT_BGR48LE", value: 60)
!678 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9BE", value: 61)
!679 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P9LE", value: 62)
!680 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10BE", value: 63)
!681 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P10LE", value: 64)
!682 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10BE", value: 65)
!683 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P10LE", value: 66)
!684 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9BE", value: 67)
!685 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P9LE", value: 68)
!686 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10BE", value: 69)
!687 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P10LE", value: 70)
!688 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9BE", value: 71)
!689 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P9LE", value: 72)
!690 = !DIEnumerator(name: "AV_PIX_FMT_GBRP", value: 73)
!691 = !DIEnumerator(name: "AV_PIX_FMT_GBR24P", value: 73)
!692 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9BE", value: 74)
!693 = !DIEnumerator(name: "AV_PIX_FMT_GBRP9LE", value: 75)
!694 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10BE", value: 76)
!695 = !DIEnumerator(name: "AV_PIX_FMT_GBRP10LE", value: 77)
!696 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16BE", value: 78)
!697 = !DIEnumerator(name: "AV_PIX_FMT_GBRP16LE", value: 79)
!698 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P", value: 80)
!699 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P", value: 81)
!700 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9BE", value: 82)
!701 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P9LE", value: 83)
!702 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9BE", value: 84)
!703 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P9LE", value: 85)
!704 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9BE", value: 86)
!705 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P9LE", value: 87)
!706 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10BE", value: 88)
!707 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P10LE", value: 89)
!708 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10BE", value: 90)
!709 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P10LE", value: 91)
!710 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10BE", value: 92)
!711 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P10LE", value: 93)
!712 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16BE", value: 94)
!713 = !DIEnumerator(name: "AV_PIX_FMT_YUVA420P16LE", value: 95)
!714 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16BE", value: 96)
!715 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P16LE", value: 97)
!716 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16BE", value: 98)
!717 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P16LE", value: 99)
!718 = !DIEnumerator(name: "AV_PIX_FMT_VDPAU", value: 100)
!719 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12LE", value: 101)
!720 = !DIEnumerator(name: "AV_PIX_FMT_XYZ12BE", value: 102)
!721 = !DIEnumerator(name: "AV_PIX_FMT_NV16", value: 103)
!722 = !DIEnumerator(name: "AV_PIX_FMT_NV20LE", value: 104)
!723 = !DIEnumerator(name: "AV_PIX_FMT_NV20BE", value: 105)
!724 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64BE", value: 106)
!725 = !DIEnumerator(name: "AV_PIX_FMT_RGBA64LE", value: 107)
!726 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64BE", value: 108)
!727 = !DIEnumerator(name: "AV_PIX_FMT_BGRA64LE", value: 109)
!728 = !DIEnumerator(name: "AV_PIX_FMT_YVYU422", value: 110)
!729 = !DIEnumerator(name: "AV_PIX_FMT_YA16BE", value: 111)
!730 = !DIEnumerator(name: "AV_PIX_FMT_YA16LE", value: 112)
!731 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP", value: 113)
!732 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16BE", value: 114)
!733 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP16LE", value: 115)
!734 = !DIEnumerator(name: "AV_PIX_FMT_QSV", value: 116)
!735 = !DIEnumerator(name: "AV_PIX_FMT_MMAL", value: 117)
!736 = !DIEnumerator(name: "AV_PIX_FMT_D3D11VA_VLD", value: 118)
!737 = !DIEnumerator(name: "AV_PIX_FMT_CUDA", value: 119)
!738 = !DIEnumerator(name: "AV_PIX_FMT_0RGB", value: 120)
!739 = !DIEnumerator(name: "AV_PIX_FMT_RGB0", value: 121)
!740 = !DIEnumerator(name: "AV_PIX_FMT_0BGR", value: 122)
!741 = !DIEnumerator(name: "AV_PIX_FMT_BGR0", value: 123)
!742 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12BE", value: 124)
!743 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P12LE", value: 125)
!744 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14BE", value: 126)
!745 = !DIEnumerator(name: "AV_PIX_FMT_YUV420P14LE", value: 127)
!746 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12BE", value: 128)
!747 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P12LE", value: 129)
!748 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14BE", value: 130)
!749 = !DIEnumerator(name: "AV_PIX_FMT_YUV422P14LE", value: 131)
!750 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12BE", value: 132)
!751 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P12LE", value: 133)
!752 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14BE", value: 134)
!753 = !DIEnumerator(name: "AV_PIX_FMT_YUV444P14LE", value: 135)
!754 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12BE", value: 136)
!755 = !DIEnumerator(name: "AV_PIX_FMT_GBRP12LE", value: 137)
!756 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14BE", value: 138)
!757 = !DIEnumerator(name: "AV_PIX_FMT_GBRP14LE", value: 139)
!758 = !DIEnumerator(name: "AV_PIX_FMT_YUVJ411P", value: 140)
!759 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR8", value: 141)
!760 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB8", value: 142)
!761 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG8", value: 143)
!762 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG8", value: 144)
!763 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16LE", value: 145)
!764 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_BGGR16BE", value: 146)
!765 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16LE", value: 147)
!766 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_RGGB16BE", value: 148)
!767 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16LE", value: 149)
!768 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GBRG16BE", value: 150)
!769 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16LE", value: 151)
!770 = !DIEnumerator(name: "AV_PIX_FMT_BAYER_GRBG16BE", value: 152)
!771 = !DIEnumerator(name: "AV_PIX_FMT_XVMC", value: 153)
!772 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10LE", value: 154)
!773 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P10BE", value: 155)
!774 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12LE", value: 156)
!775 = !DIEnumerator(name: "AV_PIX_FMT_YUV440P12BE", value: 157)
!776 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64LE", value: 158)
!777 = !DIEnumerator(name: "AV_PIX_FMT_AYUV64BE", value: 159)
!778 = !DIEnumerator(name: "AV_PIX_FMT_VIDEOTOOLBOX", value: 160)
!779 = !DIEnumerator(name: "AV_PIX_FMT_P010LE", value: 161)
!780 = !DIEnumerator(name: "AV_PIX_FMT_P010BE", value: 162)
!781 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12BE", value: 163)
!782 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP12LE", value: 164)
!783 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10BE", value: 165)
!784 = !DIEnumerator(name: "AV_PIX_FMT_GBRAP10LE", value: 166)
!785 = !DIEnumerator(name: "AV_PIX_FMT_MEDIACODEC", value: 167)
!786 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12BE", value: 168)
!787 = !DIEnumerator(name: "AV_PIX_FMT_GRAY12LE", value: 169)
!788 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10BE", value: 170)
!789 = !DIEnumerator(name: "AV_PIX_FMT_GRAY10LE", value: 171)
!790 = !DIEnumerator(name: "AV_PIX_FMT_P016LE", value: 172)
!791 = !DIEnumerator(name: "AV_PIX_FMT_P016BE", value: 173)
!792 = !DIEnumerator(name: "AV_PIX_FMT_D3D11", value: 174)
!793 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9BE", value: 175)
!794 = !DIEnumerator(name: "AV_PIX_FMT_GRAY9LE", value: 176)
!795 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32BE", value: 177)
!796 = !DIEnumerator(name: "AV_PIX_FMT_GBRPF32LE", value: 178)
!797 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32BE", value: 179)
!798 = !DIEnumerator(name: "AV_PIX_FMT_GBRAPF32LE", value: 180)
!799 = !DIEnumerator(name: "AV_PIX_FMT_DRM_PRIME", value: 181)
!800 = !DIEnumerator(name: "AV_PIX_FMT_OPENCL", value: 182)
!801 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14BE", value: 183)
!802 = !DIEnumerator(name: "AV_PIX_FMT_GRAY14LE", value: 184)
!803 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32BE", value: 185)
!804 = !DIEnumerator(name: "AV_PIX_FMT_GRAYF32LE", value: 186)
!805 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12BE", value: 187)
!806 = !DIEnumerator(name: "AV_PIX_FMT_YUVA422P12LE", value: 188)
!807 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12BE", value: 189)
!808 = !DIEnumerator(name: "AV_PIX_FMT_YUVA444P12LE", value: 190)
!809 = !DIEnumerator(name: "AV_PIX_FMT_NB", value: 191)
!810 = !{!507, !300, !811, !200, !206, !210, !191}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 64, align: 64)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!814 = !{!815, !816, !820, !824, !828, !829, !835, !840, !843}
!815 = distinct !DIGlobalVariable(name: "ff_af_ebur128", scope: !0, file: !581, line: 1008, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_ebur128)
!816 = distinct !DIGlobalVariable(name: "ebur128_inputs", scope: !0, file: !581, line: 998, type: !817, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @ebur128_inputs)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !818)
!818 = !{!819}
!819 = !DISubrange(count: 2)
!820 = distinct !DIGlobalVariable(name: "graph_colors", scope: !0, file: !581, line: 202, type: !821, isLocal: true, isDefinition: true, variable: [48 x i8]* @graph_colors)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 384, align: 8, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 48)
!824 = distinct !DIGlobalVariable(name: "font_colors", scope: !0, file: !581, line: 242, type: !825, isLocal: true, isDefinition: true, variable: [6 x i8]* @font_colors)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !813, size: 48, align: 8, elements: !826)
!826 = !{!827}
!827 = !DISubrange(count: 6)
!828 = distinct !DIGlobalVariable(name: "ebur128_class", scope: !0, file: !581, line: 200, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @ebur128_class)
!829 = distinct !DIGlobalVariable(name: "ebur128_options", scope: !0, file: !581, line: 172, type: !830, isLocal: true, isDefinition: true, variable: <{ %struct.AVOption, { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @ebur128_options)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 12800, align: 64, elements: !833)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !126, line: 301, baseType: !195)
!833 = !{!834}
!834 = !DISubrange(count: 25)
!835 = distinct !DIGlobalVariable(name: "sample_fmts", scope: !836, file: !581, line: 902, type: !838, isLocal: true, isDefinition: true, variable: [2 x i32]* @query_formats.sample_fmts)
!836 = distinct !DISubprogram(name: "query_formats", scope: !581, file: !581, line: 893, type: !410, isLocal: true, isDefinition: true, scopeLine: 894, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !837)
!837 = !{}
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 64, align: 32, elements: !818)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!840 = distinct !DIGlobalVariable(name: "input_srate", scope: !836, file: !581, line: 903, type: !841, isLocal: true, isDefinition: true, variable: [2 x i32]* @query_formats.input_srate)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 64, align: 32, elements: !818)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!843 = distinct !DIGlobalVariable(name: "pix_fmts", scope: !836, file: !581, line: 904, type: !844, isLocal: true, isDefinition: true, variable: [2 x i32]* @query_formats.pix_fmts)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !845, size: 64, align: 32, elements: !818)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!846 = !{i32 2, !"Dwarf Version", i32 4}
!847 = !{i32 2, !"Debug Info Version", i32 3}
!848 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!849 = distinct !DISubprogram(name: "init", scope: !581, file: !581, line: 495, type: !410, isLocal: true, isDefinition: true, scopeLine: 496, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !837)
!850 = !DILocalVariable(name: "ctx", arg: 1, scope: !849, file: !581, line: 495, type: !173)
!851 = !DIExpression()
!852 = !DILocation(line: 495, column: 56, scope: !849)
!853 = !DILocalVariable(name: "ebur128", scope: !849, file: !581, line: 497, type: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64, align: 64)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "EBUR128Context", file: !581, line: 150, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EBUR128Context", file: !581, line: 93, size: 55232, align: 64, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !868, !869, !870, !871, !872, !873, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !896, !897, !898, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !856, file: !581, line: 94, baseType: !178, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "peak_mode", scope: !856, file: !581, line: 97, baseType: !200, size: 32, align: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "true_peaks", scope: !856, file: !581, line: 98, baseType: !507, size: 64, align: 64, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "sample_peaks", scope: !856, file: !581, line: 99, baseType: !507, size: 64, align: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "true_peaks_per_frame", scope: !856, file: !581, line: 100, baseType: !507, size: 64, align: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "swr_ctx", scope: !856, file: !581, line: 102, baseType: !864, size: 64, align: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64, align: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "SwrContext", file: !866, line: 182, baseType: !867)
!866 = !DIFile(filename: "./libswresample/swresample.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "SwrContext", file: !866, line: 182, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "swr_buf", scope: !856, file: !581, line: 103, baseType: !507, size: 64, align: 64, offset: 384)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "swr_linesize", scope: !856, file: !581, line: 104, baseType: !200, size: 32, align: 32, offset: 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "do_video", scope: !856, file: !581, line: 108, baseType: !200, size: 32, align: 32, offset: 480)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !856, file: !581, line: 109, baseType: !200, size: 32, align: 32, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !856, file: !581, line: 109, baseType: !200, size: 32, align: 32, offset: 544)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !856, file: !581, line: 110, baseType: !874, size: 128, align: 32, offset: 576)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rect", file: !581, line: 91, size: 128, align: 32, elements: !875)
!875 = !{!876, !877, !878, !879}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !874, file: !581, line: 91, baseType: !200, size: 32, align: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !874, file: !581, line: 91, baseType: !200, size: 32, align: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !874, file: !581, line: 91, baseType: !200, size: 32, align: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !874, file: !581, line: 91, baseType: !200, size: 32, align: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !856, file: !581, line: 111, baseType: !874, size: 128, align: 32, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gauge", scope: !856, file: !581, line: 112, baseType: !874, size: 128, align: 32, offset: 832)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "outpicref", scope: !856, file: !581, line: 113, baseType: !285, size: 64, align: 64, offset: 960)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "meter", scope: !856, file: !581, line: 114, baseType: !200, size: 32, align: 32, offset: 1024)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "scale_range", scope: !856, file: !581, line: 115, baseType: !200, size: 32, align: 32, offset: 1056)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "y_zero_lu", scope: !856, file: !581, line: 116, baseType: !200, size: 32, align: 32, offset: 1088)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "y_opt_max", scope: !856, file: !581, line: 117, baseType: !200, size: 32, align: 32, offset: 1120)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "y_opt_min", scope: !856, file: !581, line: 118, baseType: !200, size: 32, align: 32, offset: 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "y_line_ref", scope: !856, file: !581, line: 119, baseType: !475, size: 64, align: 64, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channels", scope: !856, file: !581, line: 122, baseType: !200, size: 32, align: 32, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ch_weighting", scope: !856, file: !581, line: 123, baseType: !507, size: 64, align: 64, offset: 1344)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "sample_count", scope: !856, file: !581, line: 124, baseType: !200, size: 32, align: 32, offset: 1408)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !856, file: !581, line: 128, baseType: !893, size: 12096, align: 64, offset: 1472)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 12096, align: 64, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 189)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !856, file: !581, line: 129, baseType: !893, size: 12096, align: 64, offset: 13568)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !856, file: !581, line: 130, baseType: !893, size: 12096, align: 64, offset: 25664)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "i400", scope: !856, file: !581, line: 134, baseType: !899, size: 8448, align: 64, offset: 37760)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "integrator", file: !581, line: 80, size: 8448, align: 64, elements: !900)
!900 = !{!901, !905, !906, !908, !909, !910, !911, !912}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cache", scope: !899, file: !581, line: 81, baseType: !902, size: 4032, align: 64)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 4032, align: 64, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 63)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "cache_pos", scope: !899, file: !581, line: 82, baseType: !200, size: 32, align: 32, offset: 4032)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "sum", scope: !899, file: !581, line: 83, baseType: !907, size: 4032, align: 64, offset: 4096)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 4032, align: 64, elements: !903)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "filled", scope: !899, file: !581, line: 84, baseType: !200, size: 32, align: 32, offset: 8128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "rel_threshold", scope: !899, file: !581, line: 85, baseType: !210, size: 64, align: 64, offset: 8192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "sum_kept_powers", scope: !899, file: !581, line: 86, baseType: !210, size: 64, align: 64, offset: 8256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "nb_kept_powers", scope: !899, file: !581, line: 87, baseType: !200, size: 32, align: 32, offset: 8320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "histogram", scope: !899, file: !581, line: 88, baseType: !913, size: 64, align: 64, offset: 8384)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hist_entry", file: !581, line: 74, size: 192, align: 64, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !914, file: !581, line: 75, baseType: !200, size: 32, align: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !914, file: !581, line: 76, baseType: !210, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "loudness", scope: !914, file: !581, line: 77, baseType: !210, size: 64, align: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "i3000", scope: !856, file: !581, line: 135, baseType: !899, size: 8448, align: 64, offset: 46208)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "integrated_loudness", scope: !856, file: !581, line: 138, baseType: !210, size: 64, align: 64, offset: 54656)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "loudness_range", scope: !856, file: !581, line: 139, baseType: !210, size: 64, align: 64, offset: 54720)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lra_low", scope: !856, file: !581, line: 140, baseType: !210, size: 64, align: 64, offset: 54784)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lra_high", scope: !856, file: !581, line: 140, baseType: !210, size: 64, align: 64, offset: 54848)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "loglevel", scope: !856, file: !581, line: 143, baseType: !200, size: 32, align: 32, offset: 54912)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !856, file: !581, line: 144, baseType: !200, size: 32, align: 32, offset: 54944)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "dual_mono", scope: !856, file: !581, line: 145, baseType: !200, size: 32, align: 32, offset: 54976)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pan_law", scope: !856, file: !581, line: 146, baseType: !210, size: 64, align: 64, offset: 55040)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !856, file: !581, line: 147, baseType: !200, size: 32, align: 32, offset: 55104)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gauge_type", scope: !856, file: !581, line: 148, baseType: !200, size: 32, align: 32, offset: 55136)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !856, file: !581, line: 149, baseType: !200, size: 32, align: 32, offset: 55168)
!931 = !DILocation(line: 497, column: 21, scope: !849)
!932 = !DILocation(line: 497, column: 31, scope: !849)
!933 = !DILocation(line: 497, column: 36, scope: !849)
!934 = !DILocalVariable(name: "pad", scope: !849, file: !581, line: 498, type: !275)
!935 = !DILocation(line: 498, column: 17, scope: !849)
!936 = !DILocalVariable(name: "ret", scope: !849, file: !581, line: 499, type: !200)
!937 = !DILocation(line: 499, column: 9, scope: !849)
!938 = !DILocation(line: 501, column: 9, scope: !939)
!939 = distinct !DILexicalBlock(scope: !849, file: !581, line: 501, column: 9)
!940 = !DILocation(line: 501, column: 18, scope: !939)
!941 = !DILocation(line: 501, column: 27, scope: !939)
!942 = !DILocation(line: 501, column: 33, scope: !939)
!943 = !DILocation(line: 502, column: 9, scope: !939)
!944 = !DILocation(line: 502, column: 18, scope: !939)
!945 = !DILocation(line: 502, column: 27, scope: !939)
!946 = !DILocation(line: 501, column: 9, scope: !947)
!947 = !DILexicalBlockFile(scope: !849, file: !581, discriminator: 1)
!948 = !DILocation(line: 503, column: 13, scope: !949)
!949 = distinct !DILexicalBlock(scope: !950, file: !581, line: 503, column: 13)
!950 = distinct !DILexicalBlock(scope: !939, file: !581, line: 502, column: 34)
!951 = !DILocation(line: 503, column: 22, scope: !949)
!952 = !DILocation(line: 503, column: 31, scope: !949)
!953 = !DILocation(line: 503, column: 34, scope: !954)
!954 = !DILexicalBlockFile(scope: !949, file: !581, discriminator: 1)
!955 = !DILocation(line: 503, column: 43, scope: !954)
!956 = !DILocation(line: 503, column: 13, scope: !954)
!957 = !DILocation(line: 504, column: 13, scope: !949)
!958 = !DILocation(line: 504, column: 22, scope: !949)
!959 = !DILocation(line: 504, column: 31, scope: !949)
!960 = !DILocation(line: 506, column: 13, scope: !949)
!961 = !DILocation(line: 506, column: 22, scope: !949)
!962 = !DILocation(line: 506, column: 31, scope: !949)
!963 = !DILocation(line: 507, column: 5, scope: !950)
!964 = !DILocation(line: 517, column: 32, scope: !849)
!965 = !DILocation(line: 517, column: 41, scope: !849)
!966 = !DILocation(line: 517, column: 30, scope: !849)
!967 = !DILocation(line: 517, column: 5, scope: !849)
!968 = !DILocation(line: 517, column: 14, scope: !849)
!969 = !DILocation(line: 517, column: 26, scope: !849)
!970 = !DILocation(line: 519, column: 31, scope: !849)
!971 = !DILocation(line: 519, column: 5, scope: !849)
!972 = !DILocation(line: 519, column: 14, scope: !849)
!973 = !DILocation(line: 519, column: 19, scope: !849)
!974 = !DILocation(line: 519, column: 29, scope: !849)
!975 = !DILocation(line: 520, column: 32, scope: !849)
!976 = !DILocation(line: 520, column: 5, scope: !849)
!977 = !DILocation(line: 520, column: 14, scope: !849)
!978 = !DILocation(line: 520, column: 20, scope: !849)
!979 = !DILocation(line: 520, column: 30, scope: !849)
!980 = !DILocation(line: 521, column: 10, scope: !981)
!981 = distinct !DILexicalBlock(scope: !849, file: !581, line: 521, column: 9)
!982 = !DILocation(line: 521, column: 19, scope: !981)
!983 = !DILocation(line: 521, column: 24, scope: !981)
!984 = !DILocation(line: 521, column: 34, scope: !981)
!985 = !DILocation(line: 521, column: 38, scope: !986)
!986 = !DILexicalBlockFile(scope: !981, file: !581, discriminator: 1)
!987 = !DILocation(line: 521, column: 47, scope: !986)
!988 = !DILocation(line: 521, column: 53, scope: !986)
!989 = !DILocation(line: 521, column: 9, scope: !986)
!990 = !DILocation(line: 522, column: 9, scope: !981)
!991 = !DILocation(line: 524, column: 5, scope: !849)
!992 = !DILocation(line: 524, column: 14, scope: !849)
!993 = !DILocation(line: 524, column: 34, scope: !849)
!994 = !DILocation(line: 525, column: 5, scope: !849)
!995 = !DILocation(line: 525, column: 14, scope: !849)
!996 = !DILocation(line: 525, column: 29, scope: !849)
!997 = !DILocation(line: 528, column: 9, scope: !998)
!998 = distinct !DILexicalBlock(scope: !849, file: !581, line: 528, column: 9)
!999 = !DILocation(line: 528, column: 18, scope: !998)
!1000 = !DILocation(line: 528, column: 9, scope: !849)
!1001 = !DILocation(line: 529, column: 28, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !998, file: !581, line: 528, column: 28)
!1003 = !DILocation(line: 530, column: 21, scope: !1002)
!1004 = !DILocation(line: 529, column: 15, scope: !1002)
!1005 = !DILocation(line: 534, column: 18, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1002, file: !581, line: 534, column: 13)
!1007 = !DILocation(line: 534, column: 14, scope: !1006)
!1008 = !DILocation(line: 534, column: 13, scope: !1002)
!1009 = !DILocation(line: 535, column: 13, scope: !1006)
!1010 = !DILocation(line: 536, column: 32, scope: !1002)
!1011 = !DILocation(line: 536, column: 15, scope: !1002)
!1012 = !DILocation(line: 536, column: 13, scope: !1002)
!1013 = !DILocation(line: 537, column: 13, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1002, file: !581, line: 537, column: 13)
!1015 = !DILocation(line: 537, column: 17, scope: !1014)
!1016 = !DILocation(line: 537, column: 13, scope: !1002)
!1017 = !DILocation(line: 538, column: 27, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1014, file: !581, line: 537, column: 22)
!1019 = !DILocation(line: 538, column: 22, scope: !1018)
!1020 = !DILocation(line: 538, column: 13, scope: !1018)
!1021 = !DILocation(line: 539, column: 20, scope: !1018)
!1022 = !DILocation(line: 539, column: 13, scope: !1018)
!1023 = !DILocation(line: 541, column: 5, scope: !1002)
!1024 = !DILocation(line: 542, column: 24, scope: !849)
!1025 = !DILocation(line: 543, column: 38, scope: !849)
!1026 = !DILocation(line: 543, column: 47, scope: !849)
!1027 = !DILocation(line: 543, column: 17, scope: !849)
!1028 = !DILocation(line: 542, column: 11, scope: !849)
!1029 = !DILocation(line: 547, column: 14, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !849, file: !581, line: 547, column: 9)
!1031 = !DILocation(line: 547, column: 10, scope: !1030)
!1032 = !DILocation(line: 547, column: 9, scope: !849)
!1033 = !DILocation(line: 548, column: 9, scope: !1030)
!1034 = !DILocation(line: 549, column: 28, scope: !849)
!1035 = !DILocation(line: 549, column: 33, scope: !849)
!1036 = !DILocation(line: 549, column: 42, scope: !849)
!1037 = !DILocation(line: 549, column: 11, scope: !849)
!1038 = !DILocation(line: 549, column: 9, scope: !849)
!1039 = !DILocation(line: 550, column: 9, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !849, file: !581, line: 550, column: 9)
!1041 = !DILocation(line: 550, column: 13, scope: !1040)
!1042 = !DILocation(line: 550, column: 9, scope: !849)
!1043 = !DILocation(line: 551, column: 23, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1040, file: !581, line: 550, column: 18)
!1045 = !DILocation(line: 551, column: 18, scope: !1044)
!1046 = !DILocation(line: 551, column: 9, scope: !1044)
!1047 = !DILocation(line: 552, column: 16, scope: !1044)
!1048 = !DILocation(line: 552, column: 9, scope: !1044)
!1049 = !DILocation(line: 556, column: 12, scope: !849)
!1050 = !DILocation(line: 556, column: 40, scope: !849)
!1051 = !DILocation(line: 556, column: 49, scope: !849)
!1052 = !DILocation(line: 556, column: 5, scope: !849)
!1053 = !DILocation(line: 558, column: 5, scope: !849)
!1054 = !DILocation(line: 559, column: 1, scope: !849)
!1055 = distinct !DISubprogram(name: "uninit", scope: !581, file: !581, line: 935, type: !420, isLocal: true, isDefinition: true, scopeLine: 936, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !837)
!1056 = !DILocalVariable(name: "ctx", arg: 1, scope: !1055, file: !581, line: 935, type: !173)
!1057 = !DILocation(line: 935, column: 59, scope: !1055)
!1058 = !DILocalVariable(name: "i", scope: !1055, file: !581, line: 937, type: !200)
!1059 = !DILocation(line: 937, column: 9, scope: !1055)
!1060 = !DILocalVariable(name: "ebur128", scope: !1055, file: !581, line: 938, type: !854)
!1061 = !DILocation(line: 938, column: 21, scope: !1055)
!1062 = !DILocation(line: 938, column: 31, scope: !1055)
!1063 = !DILocation(line: 938, column: 36, scope: !1055)
!1064 = !DILocation(line: 941, column: 9, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1055, file: !581, line: 941, column: 9)
!1066 = !DILocation(line: 941, column: 18, scope: !1065)
!1067 = !DILocation(line: 941, column: 30, scope: !1065)
!1068 = !DILocation(line: 941, column: 35, scope: !1065)
!1069 = !DILocation(line: 941, column: 38, scope: !1070)
!1070 = !DILexicalBlockFile(scope: !1065, file: !581, discriminator: 1)
!1071 = !DILocation(line: 941, column: 47, scope: !1070)
!1072 = !DILocation(line: 941, column: 9, scope: !1070)
!1073 = !DILocation(line: 942, column: 40, scope: !1074)
!1074 = distinct !DILexicalBlock(scope: !1065, file: !581, line: 941, column: 58)
!1075 = !DILocation(line: 942, column: 49, scope: !1074)
!1076 = !DILocation(line: 942, column: 9, scope: !1074)
!1077 = !DILocation(line: 942, column: 18, scope: !1074)
!1078 = !DILocation(line: 942, column: 23, scope: !1074)
!1079 = !DILocation(line: 942, column: 37, scope: !1074)
!1080 = !DILocation(line: 943, column: 41, scope: !1074)
!1081 = !DILocation(line: 943, column: 50, scope: !1074)
!1082 = !DILocation(line: 943, column: 9, scope: !1074)
!1083 = !DILocation(line: 943, column: 18, scope: !1074)
!1084 = !DILocation(line: 943, column: 24, scope: !1074)
!1085 = !DILocation(line: 943, column: 38, scope: !1074)
!1086 = !DILocation(line: 944, column: 29, scope: !1074)
!1087 = !DILocation(line: 944, column: 38, scope: !1074)
!1088 = !DILocation(line: 944, column: 9, scope: !1074)
!1089 = !DILocation(line: 944, column: 18, scope: !1074)
!1090 = !DILocation(line: 944, column: 26, scope: !1074)
!1091 = !DILocation(line: 945, column: 30, scope: !1074)
!1092 = !DILocation(line: 945, column: 39, scope: !1074)
!1093 = !DILocation(line: 945, column: 9, scope: !1074)
!1094 = !DILocation(line: 945, column: 18, scope: !1074)
!1095 = !DILocation(line: 945, column: 27, scope: !1074)
!1096 = !DILocation(line: 946, column: 5, scope: !1074)
!1097 = !DILocation(line: 948, column: 12, scope: !1055)
!1098 = !DILocation(line: 957, column: 12, scope: !1055)
!1099 = !DILocation(line: 957, column: 21, scope: !1055)
!1100 = !DILocation(line: 957, column: 42, scope: !1055)
!1101 = !DILocation(line: 957, column: 51, scope: !1055)
!1102 = !DILocation(line: 957, column: 56, scope: !1055)
!1103 = !DILocation(line: 958, column: 12, scope: !1055)
!1104 = !DILocation(line: 958, column: 21, scope: !1055)
!1105 = !DILocation(line: 958, column: 37, scope: !1055)
!1106 = !DILocation(line: 958, column: 46, scope: !1055)
!1107 = !DILocation(line: 958, column: 52, scope: !1055)
!1108 = !DILocation(line: 959, column: 12, scope: !1055)
!1109 = !DILocation(line: 959, column: 21, scope: !1055)
!1110 = !DILocation(line: 959, column: 30, scope: !1055)
!1111 = !DILocation(line: 959, column: 39, scope: !1055)
!1112 = !DILocation(line: 948, column: 5, scope: !1055)
!1113 = !DILocation(line: 974, column: 5, scope: !1055)
!1114 = distinct !{!1114, !1113}
!1115 = !DILocalVariable(name: "ch", scope: !1116, file: !581, line: 974, type: !200)
!1116 = distinct !DILexicalBlock(scope: !1055, file: !581, line: 974, column: 8)
!1117 = !DILocation(line: 974, column: 14, scope: !1116)
!1118 = !DILocalVariable(name: "maxpeak", scope: !1116, file: !581, line: 974, type: !210)
!1119 = !DILocation(line: 974, column: 25, scope: !1116)
!1120 = !DILocation(line: 974, column: 42, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1116, file: !581, discriminator: 1)
!1122 = !DILocation(line: 974, column: 53, scope: !1121)
!1123 = !DILocation(line: 974, column: 62, scope: !1121)
!1124 = !DILocation(line: 974, column: 72, scope: !1121)
!1125 = !DILocation(line: 974, column: 109, scope: !1126)
!1126 = !DILexicalBlockFile(scope: !1127, file: !581, discriminator: 2)
!1127 = distinct !DILexicalBlock(scope: !1128, file: !581, line: 974, column: 101)
!1128 = distinct !DILexicalBlock(scope: !1129, file: !581, line: 974, column: 99)
!1129 = distinct !DILexicalBlock(scope: !1116, file: !581, line: 974, column: 53)
!1130 = !DILocation(line: 974, column: 106, scope: !1126)
!1131 = !DILocation(line: 974, column: 114, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1133, file: !581, discriminator: 3)
!1133 = distinct !DILexicalBlock(scope: !1127, file: !581, line: 974, column: 101)
!1134 = !DILocation(line: 974, column: 119, scope: !1132)
!1135 = !DILocation(line: 974, column: 128, scope: !1132)
!1136 = !DILocation(line: 974, column: 117, scope: !1132)
!1137 = !DILocation(line: 974, column: 101, scope: !1132)
!1138 = !DILocation(line: 974, column: 159, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !1133, file: !581, discriminator: 4)
!1140 = !DILocation(line: 974, column: 193, scope: !1139)
!1141 = !DILocation(line: 974, column: 171, scope: !1139)
!1142 = !DILocation(line: 974, column: 180, scope: !1139)
!1143 = !DILocation(line: 974, column: 168, scope: !1139)
!1144 = !DILocation(line: 974, column: 158, scope: !1139)
!1145 = !DILocation(line: 974, column: 201, scope: !1146)
!1146 = !DILexicalBlockFile(scope: !1133, file: !581, discriminator: 5)
!1147 = !DILocation(line: 974, column: 158, scope: !1146)
!1148 = !DILocation(line: 974, column: 235, scope: !1149)
!1149 = !DILexicalBlockFile(scope: !1133, file: !581, discriminator: 6)
!1150 = !DILocation(line: 974, column: 213, scope: !1149)
!1151 = !DILocation(line: 974, column: 222, scope: !1149)
!1152 = !DILocation(line: 974, column: 158, scope: !1149)
!1153 = !DILocation(line: 974, column: 158, scope: !1154)
!1154 = !DILexicalBlockFile(scope: !1133, file: !581, discriminator: 7)
!1155 = !DILocation(line: 974, column: 155, scope: !1154)
!1156 = !DILocation(line: 974, column: 147, scope: !1154)
!1157 = !DILocation(line: 974, column: 143, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1133, file: !581, discriminator: 8)
!1159 = !DILocation(line: 974, column: 101, scope: !1158)
!1160 = distinct !{!1160, !1161}
!1161 = !DILocation(line: 974, column: 101, scope: !1128)
!1162 = !DILocation(line: 974, column: 249, scope: !1163)
!1163 = !DILexicalBlockFile(scope: !1128, file: !581, discriminator: 9)
!1164 = !DILocation(line: 974, column: 328, scope: !1163)
!1165 = !DILocation(line: 974, column: 322, scope: !1163)
!1166 = !DILocation(line: 974, column: 320, scope: !1163)
!1167 = !DILocation(line: 974, column: 242, scope: !1168)
!1168 = !DILexicalBlockFile(scope: !1163, file: !581, discriminator: 11)
!1169 = !DILocation(line: 974, column: 340, scope: !1163)
!1170 = !DILocation(line: 974, column: 342, scope: !1171)
!1171 = !DILexicalBlockFile(scope: !1116, file: !581, discriminator: 10)
!1172 = !DILocation(line: 975, column: 5, scope: !1055)
!1173 = distinct !{!1173, !1172}
!1174 = !DILocalVariable(name: "ch", scope: !1175, file: !581, line: 975, type: !200)
!1175 = distinct !DILexicalBlock(scope: !1055, file: !581, line: 975, column: 8)
!1176 = !DILocation(line: 975, column: 14, scope: !1175)
!1177 = !DILocalVariable(name: "maxpeak", scope: !1175, file: !581, line: 975, type: !210)
!1178 = !DILocation(line: 975, column: 25, scope: !1175)
!1179 = !DILocation(line: 975, column: 42, scope: !1180)
!1180 = !DILexicalBlockFile(scope: !1175, file: !581, discriminator: 1)
!1181 = !DILocation(line: 975, column: 53, scope: !1180)
!1182 = !DILocation(line: 975, column: 62, scope: !1180)
!1183 = !DILocation(line: 975, column: 72, scope: !1180)
!1184 = !DILocation(line: 975, column: 106, scope: !1185)
!1185 = !DILexicalBlockFile(scope: !1186, file: !581, discriminator: 2)
!1186 = distinct !DILexicalBlock(scope: !1187, file: !581, line: 975, column: 98)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !581, line: 975, column: 96)
!1188 = distinct !DILexicalBlock(scope: !1175, file: !581, line: 975, column: 53)
!1189 = !DILocation(line: 975, column: 103, scope: !1185)
!1190 = !DILocation(line: 975, column: 111, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1192, file: !581, discriminator: 3)
!1192 = distinct !DILexicalBlock(scope: !1186, file: !581, line: 975, column: 98)
!1193 = !DILocation(line: 975, column: 116, scope: !1191)
!1194 = !DILocation(line: 975, column: 125, scope: !1191)
!1195 = !DILocation(line: 975, column: 114, scope: !1191)
!1196 = !DILocation(line: 975, column: 98, scope: !1191)
!1197 = !DILocation(line: 975, column: 156, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !1192, file: !581, discriminator: 4)
!1199 = !DILocation(line: 975, column: 188, scope: !1198)
!1200 = !DILocation(line: 975, column: 168, scope: !1198)
!1201 = !DILocation(line: 975, column: 177, scope: !1198)
