; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--au.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--au.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecTag = type { i32, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProbeData = type { i8*, i8*, i32, i8* }

!866 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !918, file: !917, line: 79, size: 32, align: 32, elements: !2140)
!917 = !DIFile(filename: "libavformat/au.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = distinct !DISubprogram(name: "au_read_annotation", scope: !917, file: !917, line: 69, type: !919, isLocal: true, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2139)
!919 = !DISubroutineType(types: !920)
!920 = !{!921, !922, !921}
!921 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !925)
!925 = !{!926, !971, !1086, !1234, !1235, !1300, !1301, !1302, !1996, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2050, !2051, !2052, !2053, !2054, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2105, !2106, !2109, !2110, !2111, !2112, !2113, !2114, !2116, !2117, !2118, !2119, !2127, !2128, !2132, !2136, !2137, !2138}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !924, file: !897, line: 1342, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !931)
!931 = !{!932, !936, !941, !945, !946, !947, !948, !952, !958, !960, !964}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !930, file: !464, line: 72, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !930, file: !464, line: 78, baseType: !937, size: 64, align: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!933, !940}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !930, file: !464, line: 85, baseType: !942, size: 64, align: 64, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !930, file: !464, line: 93, baseType: !921, size: 32, align: 32, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !930, file: !464, line: 99, baseType: !921, size: 32, align: 32, offset: 224)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !930, file: !464, line: 108, baseType: !921, size: 32, align: 32, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !930, file: !464, line: 113, baseType: !949, size: 64, align: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DISubroutineType(types: !951)
!951 = !{!940, !940, !940}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !930, file: !464, line: 123, baseType: !953, size: 64, align: 64, offset: 384)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DISubroutineType(types: !955)
!955 = !{!956, !956}
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !930, file: !464, line: 130, baseType: !959, size: 32, align: 32, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !930, file: !464, line: 136, baseType: !961, size: 64, align: 64, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DISubroutineType(types: !963)
!963 = !{!959, !940}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !930, file: !464, line: 142, baseType: !965, size: 64, align: 64, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!921, !968, !940, !933, !921}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !924, file: !897, line: 1349, baseType: !972, size: 64, align: 64, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !990, !991, !992, !993, !994, !995, !1009, !1014, !1057, !1058, !1062, !1067, !1068, !1069, !1073, !1079, !1085}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !973, file: !897, line: 638, baseType: !933, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !973, file: !897, line: 645, baseType: !933, size: 64, align: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !973, file: !897, line: 652, baseType: !921, size: 32, align: 32, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !973, file: !897, line: 659, baseType: !933, size: 64, align: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !973, file: !897, line: 661, baseType: !980, size: 64, align: 64, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !985, line: 44, size: 64, align: 32, elements: !986)
!985 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !984, file: !985, line: 45, baseType: !3, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !984, file: !985, line: 46, baseType: !989, size: 32, align: 32, offset: 32)
!989 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !973, file: !897, line: 663, baseType: !927, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !973, file: !897, line: 670, baseType: !933, size: 64, align: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !973, file: !897, line: 679, baseType: !972, size: 64, align: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !973, file: !897, line: 684, baseType: !921, size: 32, align: 32, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !973, file: !897, line: 689, baseType: !921, size: 32, align: 32, offset: 544)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !973, file: !897, line: 696, baseType: !996, size: 64, align: 64, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!921, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1002)
!1002 = !{!1003, !1004, !1007, !1008}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1001, file: !897, line: 449, baseType: !933, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1001, file: !897, line: 450, baseType: !1005, size: 64, align: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1001, file: !897, line: 451, baseType: !921, size: 32, align: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1001, file: !897, line: 452, baseType: !933, size: 64, align: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !973, file: !897, line: 703, baseType: !1010, size: 64, align: 64, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!921, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !973, file: !897, line: 714, baseType: !1015, size: 64, align: 64, offset: 704)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!921, !1013, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1021)
!1021 = !{!1022, !1037, !1040, !1041, !1042, !1043, !1044, !1045, !1053, !1054, !1055, !1056}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1020, file: !4, line: 1451, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1025, line: 94, baseType: !1026)
!1025 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1025, line: 81, size: 192, align: 64, elements: !1027)
!1027 = !{!1028, !1032, !1036}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1026, file: !1025, line: 82, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1025, line: 73, baseType: !1031)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1025, line: 73, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1026, file: !1025, line: 89, baseType: !1033, size: 64, align: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1035, line: 48, baseType: !1006)
!1035 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1026, file: !1025, line: 93, baseType: !921, size: 32, align: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1020, file: !4, line: 1461, baseType: !1038, size: 64, align: 64, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1035, line: 40, baseType: !1039)
!1039 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1020, file: !4, line: 1467, baseType: !1038, size: 64, align: 64, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1020, file: !4, line: 1468, baseType: !1033, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1020, file: !4, line: 1469, baseType: !921, size: 32, align: 32, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1020, file: !4, line: 1470, baseType: !921, size: 32, align: 32, offset: 288)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !4, line: 1474, baseType: !921, size: 32, align: 32, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1020, file: !4, line: 1479, baseType: !1046, size: 64, align: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1049)
!1049 = !{!1050, !1051, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1048, file: !4, line: 1412, baseType: !1033, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1048, file: !4, line: 1413, baseType: !921, size: 32, align: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1048, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1020, file: !4, line: 1480, baseType: !921, size: 32, align: 32, offset: 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1020, file: !4, line: 1486, baseType: !1038, size: 64, align: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1020, file: !4, line: 1488, baseType: !1038, size: 64, align: 64, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1020, file: !4, line: 1497, baseType: !1038, size: 64, align: 64, offset: 640)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !973, file: !897, line: 720, baseType: !1010, size: 64, align: 64, offset: 768)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !973, file: !897, line: 730, baseType: !1059, size: 64, align: 64, offset: 832)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!921, !1013, !921, !1038, !921}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !973, file: !897, line: 737, baseType: !1063, size: 64, align: 64, offset: 896)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!1038, !1013, !921, !1066, !1038}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !973, file: !897, line: 744, baseType: !1010, size: 64, align: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !973, file: !897, line: 750, baseType: !1010, size: 64, align: 64, offset: 1024)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !973, file: !897, line: 758, baseType: !1070, size: 64, align: 64, offset: 1088)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!921, !1013, !921, !1038, !1038, !1038, !921}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !973, file: !897, line: 764, baseType: !1074, size: 64, align: 64, offset: 1152)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!921, !1013, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !973, file: !897, line: 770, baseType: !1080, size: 64, align: 64, offset: 1216)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!921, !1013, !1083}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !973, file: !897, line: 776, baseType: !1080, size: 64, align: 64, offset: 1280)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !924, file: !897, line: 1356, baseType: !1087, size: 64, align: 64, offset: 128)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1089)
!1089 = !{!1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1109, !1113, !1117, !1124, !1219, !1220, !1221, !1222, !1223, !1224, !1228}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1088, file: !897, line: 498, baseType: !933, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1088, file: !897, line: 504, baseType: !933, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1088, file: !897, line: 505, baseType: !933, size: 64, align: 64, offset: 128)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1088, file: !897, line: 506, baseType: !933, size: 64, align: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1088, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1088, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1088, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1088, file: !897, line: 517, baseType: !921, size: 32, align: 32, offset: 352)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1088, file: !897, line: 523, baseType: !980, size: 64, align: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1088, file: !897, line: 526, baseType: !927, size: 64, align: 64, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1088, file: !897, line: 535, baseType: !1087, size: 64, align: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1088, file: !897, line: 539, baseType: !921, size: 32, align: 32, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1088, file: !897, line: 541, baseType: !1010, size: 64, align: 64, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1088, file: !897, line: 549, baseType: !1015, size: 64, align: 64, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1088, file: !897, line: 550, baseType: !1010, size: 64, align: 64, offset: 768)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1088, file: !897, line: 554, baseType: !1106, size: 64, align: 64, offset: 832)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!921, !1013, !1018, !1018, !921}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1088, file: !897, line: 563, baseType: !1110, size: 64, align: 64, offset: 896)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DISubroutineType(types: !1112)
!1112 = !{!921, !3, !921}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1088, file: !897, line: 565, baseType: !1114, size: 64, align: 64, offset: 960)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !1013, !921, !1066, !1066}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1088, file: !897, line: 570, baseType: !1118, size: 64, align: 64, offset: 1024)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!921, !1013, !921, !940, !1121}
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1122, line: 216, baseType: !1123)
!1122 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1123 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1088, file: !897, line: 581, baseType: !1125, size: 64, align: 64, offset: 1088)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!921, !1013, !921, !1128, !989}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1132)
!1132 = !{!1133, !1137, !1139, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1173, !1175, !1176, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1131, file: !526, line: 282, baseType: !1134, size: 512, align: 64)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 512, align: 64, elements: !1135)
!1135 = !{!1136}
!1136 = !DISubrange(count: 8)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1131, file: !526, line: 299, baseType: !1138, size: 256, align: 32, offset: 512)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 256, align: 32, elements: !1135)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1131, file: !526, line: 315, baseType: !1140, size: 64, align: 64, offset: 768)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1131, file: !526, line: 326, baseType: !921, size: 32, align: 32, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1131, file: !526, line: 326, baseType: !921, size: 32, align: 32, offset: 864)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1131, file: !526, line: 334, baseType: !921, size: 32, align: 32, offset: 896)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1131, file: !526, line: 341, baseType: !921, size: 32, align: 32, offset: 928)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1131, file: !526, line: 346, baseType: !921, size: 32, align: 32, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1131, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1131, file: !526, line: 356, baseType: !1148, size: 64, align: 32, offset: 1024)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1149, line: 61, baseType: !1150)
!1149 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1149, line: 58, size: 64, align: 32, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1150, file: !1149, line: 59, baseType: !921, size: 32, align: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1150, file: !1149, line: 60, baseType: !921, size: 32, align: 32, offset: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1131, file: !526, line: 361, baseType: !1038, size: 64, align: 64, offset: 1088)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1131, file: !526, line: 369, baseType: !1038, size: 64, align: 64, offset: 1152)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1131, file: !526, line: 377, baseType: !1038, size: 64, align: 64, offset: 1216)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1131, file: !526, line: 382, baseType: !921, size: 32, align: 32, offset: 1280)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1131, file: !526, line: 386, baseType: !921, size: 32, align: 32, offset: 1312)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1131, file: !526, line: 391, baseType: !921, size: 32, align: 32, offset: 1344)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1131, file: !526, line: 396, baseType: !940, size: 64, align: 64, offset: 1408)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1131, file: !526, line: 403, baseType: !1162, size: 512, align: 64, offset: 1472)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 512, align: 64, elements: !1135)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1035, line: 55, baseType: !1123)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1131, file: !526, line: 410, baseType: !921, size: 32, align: 32, offset: 1984)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1131, file: !526, line: 415, baseType: !921, size: 32, align: 32, offset: 2016)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1131, file: !526, line: 420, baseType: !921, size: 32, align: 32, offset: 2048)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1131, file: !526, line: 425, baseType: !921, size: 32, align: 32, offset: 2080)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1131, file: !526, line: 435, baseType: !1038, size: 64, align: 64, offset: 2112)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1131, file: !526, line: 440, baseType: !921, size: 32, align: 32, offset: 2176)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1131, file: !526, line: 445, baseType: !1163, size: 64, align: 64, offset: 2240)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1131, file: !526, line: 459, baseType: !1172, size: 512, align: 64, offset: 2304)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1023, size: 512, align: 64, elements: !1135)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1131, file: !526, line: 473, baseType: !1174, size: 64, align: 64, offset: 2816)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1131, file: !526, line: 477, baseType: !921, size: 32, align: 32, offset: 2880)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1131, file: !526, line: 479, baseType: !1177, size: 64, align: 64, offset: 2944)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1190}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1180, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1180, file: !526, line: 203, baseType: !1033, size: 64, align: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1180, file: !526, line: 204, baseType: !921, size: 32, align: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1180, file: !526, line: 205, baseType: !1186, size: 64, align: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1188, line: 86, baseType: !1189)
!1188 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1188, line: 86, flags: DIFlagFwdDecl)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1180, file: !526, line: 206, baseType: !1023, size: 64, align: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1131, file: !526, line: 480, baseType: !921, size: 32, align: 32, offset: 3008)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1131, file: !526, line: 505, baseType: !921, size: 32, align: 32, offset: 3040)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1131, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1131, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1131, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1131, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1131, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1131, file: !526, line: 532, baseType: !1038, size: 64, align: 64, offset: 3264)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1131, file: !526, line: 539, baseType: !1038, size: 64, align: 64, offset: 3328)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1131, file: !526, line: 547, baseType: !1038, size: 64, align: 64, offset: 3392)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1131, file: !526, line: 554, baseType: !1186, size: 64, align: 64, offset: 3456)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1131, file: !526, line: 563, baseType: !921, size: 32, align: 32, offset: 3520)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1131, file: !526, line: 572, baseType: !921, size: 32, align: 32, offset: 3552)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1131, file: !526, line: 581, baseType: !921, size: 32, align: 32, offset: 3584)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1131, file: !526, line: 588, baseType: !1206, size: 64, align: 64, offset: 3648)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1035, line: 36, baseType: !1208)
!1208 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1131, file: !526, line: 593, baseType: !921, size: 32, align: 32, offset: 3712)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1131, file: !526, line: 596, baseType: !921, size: 32, align: 32, offset: 3744)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1131, file: !526, line: 599, baseType: !1023, size: 64, align: 64, offset: 3776)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1131, file: !526, line: 605, baseType: !1023, size: 64, align: 64, offset: 3840)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1131, file: !526, line: 616, baseType: !1023, size: 64, align: 64, offset: 3904)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1131, file: !526, line: 626, baseType: !1121, size: 64, align: 64, offset: 3968)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1131, file: !526, line: 627, baseType: !1121, size: 64, align: 64, offset: 4032)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1131, file: !526, line: 628, baseType: !1121, size: 64, align: 64, offset: 4096)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1131, file: !526, line: 629, baseType: !1121, size: 64, align: 64, offset: 4160)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1131, file: !526, line: 645, baseType: !1023, size: 64, align: 64, offset: 4224)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1088, file: !897, line: 587, baseType: !1074, size: 64, align: 64, offset: 1152)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1088, file: !897, line: 592, baseType: !1080, size: 64, align: 64, offset: 1216)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1088, file: !897, line: 597, baseType: !1080, size: 64, align: 64, offset: 1280)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1088, file: !897, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1088, file: !897, line: 608, baseType: !1010, size: 64, align: 64, offset: 1408)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1088, file: !897, line: 617, baseType: !1225, size: 64, align: 64, offset: 1472)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{null, !1013}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1088, file: !897, line: 623, baseType: !1229, size: 64, align: 64, offset: 1536)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!921, !1013, !1232}
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !924, file: !897, line: 1365, baseType: !940, size: 64, align: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !924, file: !897, line: 1379, baseType: !1236, size: 64, align: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1267, !1268, !1272, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1290, !1291, !1292, !1293, !1297, !1298, !1299}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1238, file: !628, line: 174, baseType: !927, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1238, file: !628, line: 226, baseType: !1005, size: 64, align: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1238, file: !628, line: 227, baseType: !921, size: 32, align: 32, offset: 128)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1238, file: !628, line: 228, baseType: !1005, size: 64, align: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1238, file: !628, line: 229, baseType: !1005, size: 64, align: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1238, file: !628, line: 233, baseType: !940, size: 64, align: 64, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1238, file: !628, line: 235, baseType: !1247, size: 64, align: 64, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!921, !940, !1033, !921}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1238, file: !628, line: 236, baseType: !1247, size: 64, align: 64, offset: 448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1238, file: !628, line: 237, baseType: !1252, size: 64, align: 64, offset: 512)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!1038, !940, !1038, !921}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1238, file: !628, line: 238, baseType: !1038, size: 64, align: 64, offset: 576)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1238, file: !628, line: 239, baseType: !921, size: 32, align: 32, offset: 640)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1238, file: !628, line: 240, baseType: !921, size: 32, align: 32, offset: 672)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1238, file: !628, line: 241, baseType: !921, size: 32, align: 32, offset: 704)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1238, file: !628, line: 242, baseType: !1123, size: 64, align: 64, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1238, file: !628, line: 243, baseType: !1005, size: 64, align: 64, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1238, file: !628, line: 244, baseType: !1262, size: 64, align: 64, offset: 896)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!1123, !1123, !1265, !989}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1238, file: !628, line: 245, baseType: !921, size: 32, align: 32, offset: 960)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1238, file: !628, line: 249, baseType: !1269, size: 64, align: 64, offset: 1024)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!921, !940, !921}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1238, file: !628, line: 255, baseType: !1273, size: 64, align: 64, offset: 1088)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!1038, !940, !921, !1038, !921}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1238, file: !628, line: 260, baseType: !921, size: 32, align: 32, offset: 1152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1238, file: !628, line: 266, baseType: !1038, size: 64, align: 64, offset: 1216)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1238, file: !628, line: 273, baseType: !921, size: 32, align: 32, offset: 1280)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1238, file: !628, line: 279, baseType: !1038, size: 64, align: 64, offset: 1344)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1238, file: !628, line: 285, baseType: !921, size: 32, align: 32, offset: 1408)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1238, file: !628, line: 291, baseType: !921, size: 32, align: 32, offset: 1440)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1238, file: !628, line: 298, baseType: !921, size: 32, align: 32, offset: 1472)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1238, file: !628, line: 304, baseType: !921, size: 32, align: 32, offset: 1504)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1238, file: !628, line: 309, baseType: !933, size: 64, align: 64, offset: 1536)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1238, file: !628, line: 314, baseType: !933, size: 64, align: 64, offset: 1600)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1238, file: !628, line: 319, baseType: !1287, size: 64, align: 64, offset: 1664)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!921, !940, !1033, !921, !627, !1038}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1238, file: !628, line: 326, baseType: !921, size: 32, align: 32, offset: 1728)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1238, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1238, file: !628, line: 332, baseType: !1038, size: 64, align: 64, offset: 1792)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1238, file: !628, line: 338, baseType: !1294, size: 64, align: 64, offset: 1856)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!921, !940}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1238, file: !628, line: 340, baseType: !1038, size: 64, align: 64, offset: 1920)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1238, file: !628, line: 346, baseType: !1005, size: 64, align: 64, offset: 1984)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1238, file: !628, line: 351, baseType: !921, size: 32, align: 32, offset: 2048)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !924, file: !897, line: 1386, baseType: !921, size: 32, align: 32, offset: 320)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !924, file: !897, line: 1393, baseType: !989, size: 32, align: 32, offset: 352)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !924, file: !897, line: 1405, baseType: !1303, size: 64, align: 64, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1781, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1882, !1888, !1889, !1893, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1925, !1926, !1927, !1928, !1929, !1930}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1306, file: !897, line: 866, baseType: !921, size: 32, align: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1306, file: !897, line: 872, baseType: !921, size: 32, align: 32, offset: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1306, file: !897, line: 878, baseType: !1311, size: 64, align: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1456, !1457, !1458, !1459, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1485, !1489, !1490, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1669, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1313, file: !4, line: 1561, baseType: !927, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1313, file: !4, line: 1562, baseType: !921, size: 32, align: 32, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1313, file: !4, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1313, file: !4, line: 1565, baseType: !1319, size: 64, align: 64, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1322)
!1322 = !{!1323, !1324, !1325, !1326, !1327, !1328, !1331, !1334, !1337, !1340, !1343, !1344, !1345, !1353, !1354, !1355, !1357, !1361, !1367, !1372, !1376, !1377, !1421, !1428, !1432, !1433, !1437, !1441, !1445, !1449, !1450, !1451}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1321, file: !4, line: 3475, baseType: !933, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1321, file: !4, line: 3480, baseType: !933, size: 64, align: 64, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1321, file: !4, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1321, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1321, file: !4, line: 3487, baseType: !921, size: 32, align: 32, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1321, file: !4, line: 3488, baseType: !1329, size: 64, align: 64, offset: 256)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1148)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1321, file: !4, line: 3489, baseType: !1332, size: 64, align: 64, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1321, file: !4, line: 3490, baseType: !1335, size: 64, align: 64, offset: 384)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1321, file: !4, line: 3491, baseType: !1338, size: 64, align: 64, offset: 448)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1321, file: !4, line: 3492, baseType: !1341, size: 64, align: 64, offset: 512)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1321, file: !4, line: 3493, baseType: !1034, size: 8, align: 8, offset: 576)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1321, file: !4, line: 3494, baseType: !927, size: 64, align: 64, offset: 640)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1321, file: !4, line: 3495, baseType: !1346, size: 64, align: 64, offset: 704)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1348)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1350)
!1350 = !{!1351, !1352}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1349, file: !4, line: 3402, baseType: !921, size: 32, align: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1349, file: !4, line: 3403, baseType: !933, size: 64, align: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1321, file: !4, line: 3507, baseType: !933, size: 64, align: 64, offset: 768)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1321, file: !4, line: 3516, baseType: !921, size: 32, align: 32, offset: 832)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1321, file: !4, line: 3517, baseType: !1356, size: 64, align: 64, offset: 896)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1321, file: !4, line: 3527, baseType: !1358, size: 64, align: 64, offset: 960)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!921, !1311}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1321, file: !4, line: 3535, baseType: !1362, size: 64, align: 64, offset: 1024)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!921, !1311, !1365}
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1312)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1321, file: !4, line: 3541, baseType: !1368, size: 64, align: 64, offset: 1088)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1371)
!1371 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1321, file: !4, line: 3549, baseType: !1373, size: 64, align: 64, offset: 1152)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{null, !1356}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1321, file: !4, line: 3551, baseType: !1358, size: 64, align: 64, offset: 1216)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1321, file: !4, line: 3552, baseType: !1378, size: 64, align: 64, offset: 1280)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DISubroutineType(types: !1380)
!1380 = !{!921, !1311, !1033, !921, !1381}
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1383)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1384)
!1384 = !{!1385, !1388, !1390, !1391, !1392, !1420}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1383, file: !4, line: 3921, baseType: !1386, size: 16, align: 16)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1035, line: 49, baseType: !1387)
!1387 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1383, file: !4, line: 3922, baseType: !1389, size: 32, align: 32, offset: 32)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1035, line: 51, baseType: !989)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1383, file: !4, line: 3923, baseType: !1389, size: 32, align: 32, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1383, file: !4, line: 3924, baseType: !989, size: 32, align: 32, offset: 96)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1383, file: !4, line: 3925, baseType: !1393, size: 64, align: 64, offset: 128)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1397)
!1397 = !{!1398, !1399, !1400, !1401, !1402, !1403, !1409, !1413, !1415, !1416, !1418, !1419}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1396, file: !4, line: 3886, baseType: !921, size: 32, align: 32)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1396, file: !4, line: 3887, baseType: !921, size: 32, align: 32, offset: 32)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1396, file: !4, line: 3888, baseType: !921, size: 32, align: 32, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1396, file: !4, line: 3889, baseType: !921, size: 32, align: 32, offset: 96)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1396, file: !4, line: 3890, baseType: !921, size: 32, align: 32, offset: 128)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1396, file: !4, line: 3897, baseType: !1404, size: 768, align: 64, offset: 192)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1406)
!1406 = !{!1407, !1408}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1405, file: !4, line: 3855, baseType: !1134, size: 512, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1405, file: !4, line: 3857, baseType: !1138, size: 256, align: 32, offset: 512)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1396, file: !4, line: 3903, baseType: !1410, size: 256, align: 64, offset: 960)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 256, align: 64, elements: !1411)
!1411 = !{!1412}
!1412 = !DISubrange(count: 4)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1396, file: !4, line: 3904, baseType: !1414, size: 128, align: 32, offset: 1216)
!1414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 128, align: 32, elements: !1411)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1396, file: !4, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1396, file: !4, line: 3908, baseType: !1417, size: 64, align: 64, offset: 1408)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1396, file: !4, line: 3915, baseType: !1417, size: 64, align: 64, offset: 1472)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1396, file: !4, line: 3917, baseType: !921, size: 32, align: 32, offset: 1536)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1383, file: !4, line: 3926, baseType: !1038, size: 64, align: 64, offset: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1321, file: !4, line: 3564, baseType: !1422, size: 64, align: 64, offset: 1344)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DISubroutineType(types: !1424)
!1424 = !{!921, !1311, !1018, !1425, !1427}
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1321, file: !4, line: 3566, baseType: !1429, size: 64, align: 64, offset: 1408)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!921, !1311, !940, !1427, !1018}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1321, file: !4, line: 3567, baseType: !1358, size: 64, align: 64, offset: 1472)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1321, file: !4, line: 3576, baseType: !1434, size: 64, align: 64, offset: 1536)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!921, !1311, !1425}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1321, file: !4, line: 3577, baseType: !1438, size: 64, align: 64, offset: 1600)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DISubroutineType(types: !1440)
!1440 = !{!921, !1311, !1018}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1321, file: !4, line: 3584, baseType: !1442, size: 64, align: 64, offset: 1664)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!921, !1311, !1129}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1321, file: !4, line: 3589, baseType: !1446, size: 64, align: 64, offset: 1728)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{null, !1311}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1321, file: !4, line: 3594, baseType: !921, size: 32, align: 32, offset: 1792)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1321, file: !4, line: 3600, baseType: !933, size: 64, align: 64, offset: 1856)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1321, file: !4, line: 3609, baseType: !1452, size: 64, align: 64, offset: 1920)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1455)
!1455 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1313, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1313, file: !4, line: 1581, baseType: !989, size: 32, align: 32, offset: 224)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1313, file: !4, line: 1583, baseType: !940, size: 64, align: 64, offset: 256)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1313, file: !4, line: 1591, baseType: !1460, size: 64, align: 64, offset: 320)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1313, file: !4, line: 1598, baseType: !940, size: 64, align: 64, offset: 384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1313, file: !4, line: 1606, baseType: !1038, size: 64, align: 64, offset: 448)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1313, file: !4, line: 1614, baseType: !921, size: 32, align: 32, offset: 512)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1313, file: !4, line: 1622, baseType: !921, size: 32, align: 32, offset: 544)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1313, file: !4, line: 1628, baseType: !921, size: 32, align: 32, offset: 576)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1313, file: !4, line: 1636, baseType: !921, size: 32, align: 32, offset: 608)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1313, file: !4, line: 1643, baseType: !921, size: 32, align: 32, offset: 640)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1313, file: !4, line: 1657, baseType: !1033, size: 64, align: 64, offset: 704)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1313, file: !4, line: 1658, baseType: !921, size: 32, align: 32, offset: 768)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1313, file: !4, line: 1679, baseType: !1148, size: 64, align: 32, offset: 800)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1313, file: !4, line: 1688, baseType: !921, size: 32, align: 32, offset: 864)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1313, file: !4, line: 1712, baseType: !921, size: 32, align: 32, offset: 896)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1313, file: !4, line: 1729, baseType: !921, size: 32, align: 32, offset: 928)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1313, file: !4, line: 1729, baseType: !921, size: 32, align: 32, offset: 960)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1313, file: !4, line: 1744, baseType: !921, size: 32, align: 32, offset: 992)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1313, file: !4, line: 1744, baseType: !921, size: 32, align: 32, offset: 1024)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1313, file: !4, line: 1751, baseType: !921, size: 32, align: 32, offset: 1056)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1313, file: !4, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1313, file: !4, line: 1791, baseType: !1481, size: 64, align: 64, offset: 1152)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{null, !1484, !1425, !1427, !921, !921, !921}
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1313, file: !4, line: 1808, baseType: !1486, size: 64, align: 64, offset: 1216)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!645, !1484, !1332}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1313, file: !4, line: 1816, baseType: !921, size: 32, align: 32, offset: 1280)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1313, file: !4, line: 1825, baseType: !1491, size: 32, align: 32, offset: 1312)
!1491 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1313, file: !4, line: 1830, baseType: !921, size: 32, align: 32, offset: 1344)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1313, file: !4, line: 1838, baseType: !1491, size: 32, align: 32, offset: 1376)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1313, file: !4, line: 1846, baseType: !921, size: 32, align: 32, offset: 1408)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1313, file: !4, line: 1851, baseType: !921, size: 32, align: 32, offset: 1440)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1313, file: !4, line: 1861, baseType: !1491, size: 32, align: 32, offset: 1472)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1313, file: !4, line: 1868, baseType: !1491, size: 32, align: 32, offset: 1504)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1313, file: !4, line: 1875, baseType: !1491, size: 32, align: 32, offset: 1536)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1313, file: !4, line: 1882, baseType: !1491, size: 32, align: 32, offset: 1568)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1313, file: !4, line: 1889, baseType: !1491, size: 32, align: 32, offset: 1600)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1313, file: !4, line: 1896, baseType: !1491, size: 32, align: 32, offset: 1632)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1313, file: !4, line: 1903, baseType: !1491, size: 32, align: 32, offset: 1664)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1313, file: !4, line: 1910, baseType: !921, size: 32, align: 32, offset: 1696)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1313, file: !4, line: 1915, baseType: !921, size: 32, align: 32, offset: 1728)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1313, file: !4, line: 1926, baseType: !1427, size: 64, align: 64, offset: 1792)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1313, file: !4, line: 1935, baseType: !1148, size: 64, align: 32, offset: 1856)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1313, file: !4, line: 1942, baseType: !921, size: 32, align: 32, offset: 1920)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1313, file: !4, line: 1948, baseType: !921, size: 32, align: 32, offset: 1952)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1313, file: !4, line: 1954, baseType: !921, size: 32, align: 32, offset: 1984)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1313, file: !4, line: 1960, baseType: !921, size: 32, align: 32, offset: 2016)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1313, file: !4, line: 1984, baseType: !921, size: 32, align: 32, offset: 2048)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1313, file: !4, line: 1991, baseType: !921, size: 32, align: 32, offset: 2080)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1313, file: !4, line: 1996, baseType: !921, size: 32, align: 32, offset: 2112)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1313, file: !4, line: 2004, baseType: !921, size: 32, align: 32, offset: 2144)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1313, file: !4, line: 2011, baseType: !921, size: 32, align: 32, offset: 2176)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1313, file: !4, line: 2018, baseType: !921, size: 32, align: 32, offset: 2208)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1313, file: !4, line: 2027, baseType: !921, size: 32, align: 32, offset: 2240)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1313, file: !4, line: 2034, baseType: !921, size: 32, align: 32, offset: 2272)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1313, file: !4, line: 2044, baseType: !921, size: 32, align: 32, offset: 2304)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1313, file: !4, line: 2054, baseType: !1521, size: 64, align: 64, offset: 2368)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1313, file: !4, line: 2061, baseType: !1521, size: 64, align: 64, offset: 2432)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1313, file: !4, line: 2066, baseType: !921, size: 32, align: 32, offset: 2496)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1313, file: !4, line: 2070, baseType: !921, size: 32, align: 32, offset: 2528)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1313, file: !4, line: 2078, baseType: !921, size: 32, align: 32, offset: 2560)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1313, file: !4, line: 2085, baseType: !921, size: 32, align: 32, offset: 2592)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1313, file: !4, line: 2092, baseType: !921, size: 32, align: 32, offset: 2624)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1313, file: !4, line: 2099, baseType: !921, size: 32, align: 32, offset: 2656)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1313, file: !4, line: 2106, baseType: !921, size: 32, align: 32, offset: 2688)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1313, file: !4, line: 2113, baseType: !921, size: 32, align: 32, offset: 2720)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1313, file: !4, line: 2120, baseType: !921, size: 32, align: 32, offset: 2752)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1313, file: !4, line: 2125, baseType: !921, size: 32, align: 32, offset: 2784)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1313, file: !4, line: 2133, baseType: !921, size: 32, align: 32, offset: 2816)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1313, file: !4, line: 2140, baseType: !921, size: 32, align: 32, offset: 2848)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1313, file: !4, line: 2145, baseType: !921, size: 32, align: 32, offset: 2880)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1313, file: !4, line: 2153, baseType: !921, size: 32, align: 32, offset: 2912)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1313, file: !4, line: 2158, baseType: !921, size: 32, align: 32, offset: 2944)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1313, file: !4, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1313, file: !4, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1313, file: !4, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1313, file: !4, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1313, file: !4, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1313, file: !4, line: 2203, baseType: !921, size: 32, align: 32, offset: 3136)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1313, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1313, file: !4, line: 2212, baseType: !921, size: 32, align: 32, offset: 3200)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1313, file: !4, line: 2213, baseType: !921, size: 32, align: 32, offset: 3232)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1313, file: !4, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1313, file: !4, line: 2232, baseType: !921, size: 32, align: 32, offset: 3296)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1313, file: !4, line: 2243, baseType: !921, size: 32, align: 32, offset: 3328)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1313, file: !4, line: 2249, baseType: !921, size: 32, align: 32, offset: 3360)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1313, file: !4, line: 2256, baseType: !921, size: 32, align: 32, offset: 3392)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1313, file: !4, line: 2263, baseType: !1163, size: 64, align: 64, offset: 3456)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1313, file: !4, line: 2270, baseType: !1163, size: 64, align: 64, offset: 3520)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1313, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1313, file: !4, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1313, file: !4, line: 2367, baseType: !1557, size: 64, align: 64, offset: 3648)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!921, !1484, !1129, !921}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1313, file: !4, line: 2383, baseType: !921, size: 32, align: 32, offset: 3712)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1313, file: !4, line: 2386, baseType: !1491, size: 32, align: 32, offset: 3744)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1313, file: !4, line: 2387, baseType: !1491, size: 32, align: 32, offset: 3776)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1313, file: !4, line: 2394, baseType: !921, size: 32, align: 32, offset: 3808)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1313, file: !4, line: 2401, baseType: !921, size: 32, align: 32, offset: 3840)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1313, file: !4, line: 2408, baseType: !921, size: 32, align: 32, offset: 3872)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1313, file: !4, line: 2415, baseType: !921, size: 32, align: 32, offset: 3904)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1313, file: !4, line: 2422, baseType: !921, size: 32, align: 32, offset: 3936)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1313, file: !4, line: 2423, baseType: !1569, size: 64, align: 64, offset: 3968)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1576}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1571, file: !4, line: 827, baseType: !921, size: 32, align: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1571, file: !4, line: 828, baseType: !921, size: 32, align: 32, offset: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1571, file: !4, line: 829, baseType: !921, size: 32, align: 32, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1571, file: !4, line: 830, baseType: !1491, size: 32, align: 32, offset: 96)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1313, file: !4, line: 2430, baseType: !1038, size: 64, align: 64, offset: 4032)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1313, file: !4, line: 2437, baseType: !1038, size: 64, align: 64, offset: 4096)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1313, file: !4, line: 2444, baseType: !1491, size: 32, align: 32, offset: 4160)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1313, file: !4, line: 2451, baseType: !1491, size: 32, align: 32, offset: 4192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1313, file: !4, line: 2458, baseType: !921, size: 32, align: 32, offset: 4224)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1313, file: !4, line: 2469, baseType: !921, size: 32, align: 32, offset: 4256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1313, file: !4, line: 2475, baseType: !921, size: 32, align: 32, offset: 4288)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1313, file: !4, line: 2481, baseType: !921, size: 32, align: 32, offset: 4320)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1313, file: !4, line: 2485, baseType: !921, size: 32, align: 32, offset: 4352)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1313, file: !4, line: 2489, baseType: !921, size: 32, align: 32, offset: 4384)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1313, file: !4, line: 2493, baseType: !921, size: 32, align: 32, offset: 4416)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1313, file: !4, line: 2501, baseType: !921, size: 32, align: 32, offset: 4448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1313, file: !4, line: 2506, baseType: !921, size: 32, align: 32, offset: 4480)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1313, file: !4, line: 2510, baseType: !921, size: 32, align: 32, offset: 4512)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1313, file: !4, line: 2514, baseType: !1038, size: 64, align: 64, offset: 4544)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1313, file: !4, line: 2528, baseType: !1593, size: 64, align: 64, offset: 4608)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1484, !940, !921, !921}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1313, file: !4, line: 2534, baseType: !921, size: 32, align: 32, offset: 4672)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1313, file: !4, line: 2545, baseType: !921, size: 32, align: 32, offset: 4704)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1313, file: !4, line: 2547, baseType: !921, size: 32, align: 32, offset: 4736)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1313, file: !4, line: 2549, baseType: !921, size: 32, align: 32, offset: 4768)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1313, file: !4, line: 2551, baseType: !921, size: 32, align: 32, offset: 4800)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1313, file: !4, line: 2553, baseType: !921, size: 32, align: 32, offset: 4832)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1313, file: !4, line: 2555, baseType: !921, size: 32, align: 32, offset: 4864)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1313, file: !4, line: 2557, baseType: !921, size: 32, align: 32, offset: 4896)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1313, file: !4, line: 2559, baseType: !921, size: 32, align: 32, offset: 4928)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1313, file: !4, line: 2563, baseType: !921, size: 32, align: 32, offset: 4960)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1313, file: !4, line: 2571, baseType: !1417, size: 64, align: 64, offset: 4992)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1313, file: !4, line: 2579, baseType: !1417, size: 64, align: 64, offset: 5056)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1313, file: !4, line: 2586, baseType: !921, size: 32, align: 32, offset: 5120)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1313, file: !4, line: 2615, baseType: !921, size: 32, align: 32, offset: 5152)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1313, file: !4, line: 2627, baseType: !921, size: 32, align: 32, offset: 5184)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1313, file: !4, line: 2637, baseType: !921, size: 32, align: 32, offset: 5216)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1313, file: !4, line: 2681, baseType: !921, size: 32, align: 32, offset: 5248)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1313, file: !4, line: 2709, baseType: !1038, size: 64, align: 64, offset: 5312)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1313, file: !4, line: 2716, baseType: !1615, size: 64, align: 64, offset: 5376)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1618)
!1618 = !{!1619, !1620, !1621, !1622, !1623, !1624, !1625, !1629, !1633, !1634, !1635, !1636, !1642, !1643, !1644, !1645, !1646}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1617, file: !4, line: 3642, baseType: !933, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1617, file: !4, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1617, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1617, file: !4, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1617, file: !4, line: 3669, baseType: !921, size: 32, align: 32, offset: 160)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1617, file: !4, line: 3682, baseType: !1442, size: 64, align: 64, offset: 192)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1617, file: !4, line: 3698, baseType: !1626, size: 64, align: 64, offset: 256)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!921, !1311, !1265, !1389}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1617, file: !4, line: 3712, baseType: !1630, size: 64, align: 64, offset: 320)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!921, !1311, !921, !1265, !1389}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1617, file: !4, line: 3726, baseType: !1626, size: 64, align: 64, offset: 384)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1617, file: !4, line: 3737, baseType: !1358, size: 64, align: 64, offset: 448)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1617, file: !4, line: 3746, baseType: !921, size: 32, align: 32, offset: 512)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1617, file: !4, line: 3757, baseType: !1637, size: 64, align: 64, offset: 576)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !1640}
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1617, file: !4, line: 3766, baseType: !1358, size: 64, align: 64, offset: 640)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1617, file: !4, line: 3774, baseType: !1358, size: 64, align: 64, offset: 704)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1617, file: !4, line: 3780, baseType: !921, size: 32, align: 32, offset: 768)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1617, file: !4, line: 3785, baseType: !921, size: 32, align: 32, offset: 800)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1617, file: !4, line: 3795, baseType: !1647, size: 64, align: 64, offset: 832)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!921, !1311, !1023}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1313, file: !4, line: 2728, baseType: !940, size: 64, align: 64, offset: 5440)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1313, file: !4, line: 2735, baseType: !1162, size: 512, align: 64, offset: 5504)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1313, file: !4, line: 2742, baseType: !921, size: 32, align: 32, offset: 6016)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1313, file: !4, line: 2755, baseType: !921, size: 32, align: 32, offset: 6048)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1313, file: !4, line: 2776, baseType: !921, size: 32, align: 32, offset: 6080)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1313, file: !4, line: 2783, baseType: !921, size: 32, align: 32, offset: 6112)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1313, file: !4, line: 2791, baseType: !921, size: 32, align: 32, offset: 6144)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1313, file: !4, line: 2802, baseType: !1129, size: 64, align: 64, offset: 6208)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1313, file: !4, line: 2811, baseType: !921, size: 32, align: 32, offset: 6272)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1313, file: !4, line: 2821, baseType: !921, size: 32, align: 32, offset: 6304)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1313, file: !4, line: 2830, baseType: !921, size: 32, align: 32, offset: 6336)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1313, file: !4, line: 2840, baseType: !921, size: 32, align: 32, offset: 6368)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1313, file: !4, line: 2851, baseType: !1663, size: 64, align: 64, offset: 6400)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64, align: 64)
!1664 = !DISubroutineType(types: !1665)
!1665 = !{!921, !1484, !1666, !940, !1427, !921, !921}
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{!921, !1484, !940}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1313, file: !4, line: 2871, baseType: !1670, size: 64, align: 64, offset: 6464)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{!921, !1484, !1673, !940, !1427, !921}
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!921, !1484, !940, !921, !921}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1313, file: !4, line: 2878, baseType: !921, size: 32, align: 32, offset: 6528)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1313, file: !4, line: 2885, baseType: !921, size: 32, align: 32, offset: 6560)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1313, file: !4, line: 3005, baseType: !921, size: 32, align: 32, offset: 6592)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1313, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1313, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1313, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1313, file: !4, line: 3037, baseType: !1033, size: 64, align: 64, offset: 6720)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1313, file: !4, line: 3038, baseType: !921, size: 32, align: 32, offset: 6784)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1313, file: !4, line: 3050, baseType: !1163, size: 64, align: 64, offset: 6848)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1313, file: !4, line: 3065, baseType: !921, size: 32, align: 32, offset: 6912)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1313, file: !4, line: 3083, baseType: !921, size: 32, align: 32, offset: 6944)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1313, file: !4, line: 3092, baseType: !1148, size: 64, align: 32, offset: 6976)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1313, file: !4, line: 3099, baseType: !645, size: 32, align: 32, offset: 7040)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1313, file: !4, line: 3106, baseType: !1148, size: 64, align: 32, offset: 7072)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1313, file: !4, line: 3113, baseType: !1691, size: 64, align: 64, offset: 7168)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1693)
!1693 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1694)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1695)
!1695 = !{!1696, !1697, !1698, !1699, !1700, !1701, !1704}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1694, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1694, file: !4, line: 714, baseType: !636, size: 32, align: 32, offset: 32)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1694, file: !4, line: 720, baseType: !933, size: 64, align: 64, offset: 64)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1694, file: !4, line: 724, baseType: !933, size: 64, align: 64, offset: 128)
