; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--x86--vf_threshold_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--x86--vf_threshold_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ThresholdContext = type { %struct.AVClass*, i32, i32, i32, i32, [4 x i32], [4 x i32], void (i8*, i8*, i8*, i8*, i8*, i64, i64, i64, i64, i64, i32, i32)*, [4 x %struct.AVFrame*], %struct.FFFrameSync }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque

!86 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!87 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!88 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!89 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!90 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!91 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!92 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!93 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!94 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!95 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!96 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!97 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!98 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!99 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!100 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!101 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!102 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!103 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!104 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!105 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!106 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!107 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!108 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !60, line: 493, size: 32, align: 32, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126}
!110 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!111 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!112 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!113 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!114 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!115 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!116 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!117 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!118 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!119 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!120 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!121 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!122 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!123 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!124 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!125 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!126 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !60, line: 538, size: 32, align: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136}
!129 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!130 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!131 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!132 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!133 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!134 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!135 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!136 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!137 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMediaType", file: !25, line: 199, size: 32, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145}
!139 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!140 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!141 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!142 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!143 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!144 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!145 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !148, file: !147, line: 503, size: 32, align: 32, elements: !462)
!147 = !DIFile(filename: "./libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !147, line: 439, size: 493504, align: 64, elements: !149)
!149 = !{!150, !327, !328, !329, !330, !331, !332, !333, !340, !343, !344, !345, !346, !350, !351, !352, !353, !356, !357, !358, !359, !360, !363, !364, !365, !366, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !148, file: !147, line: 440, baseType: !151, size: 64, align: 64)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !147, line: 67, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !147, line: 338, size: 1344, align: 64, elements: !154)
!154 = !{!155, !201, !250, !251, !253, !257, !259, !260, !261, !262, !263, !294, !295, !299, !302, !303, !304, !307, !308, !324, !325, !326}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !153, file: !147, line: 339, baseType: !156, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64, align: 64)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !160)
!160 = !{!161, !165, !170, !174, !176, !177, !178, !182, !188, !190, !194}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !159, file: !4, line: 72, baseType: !162, size: 64, align: 64)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !159, file: !4, line: 78, baseType: !166, size: 64, align: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64, align: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!162, !169}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !159, file: !4, line: 85, baseType: !171, size: 64, align: 64, offset: 128)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !159, file: !4, line: 93, baseType: !175, size: 32, align: 32, offset: 192)
!175 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !159, file: !4, line: 99, baseType: !175, size: 32, align: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !159, file: !4, line: 108, baseType: !175, size: 32, align: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !159, file: !4, line: 113, baseType: !179, size: 64, align: 64, offset: 320)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DISubroutineType(types: !181)
!181 = !{!169, !169, !169}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !159, file: !4, line: 123, baseType: !183, size: 64, align: 64, offset: 384)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !159, file: !4, line: 130, baseType: !189, size: 32, align: 32, offset: 448)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !159, file: !4, line: 136, baseType: !191, size: 64, align: 64, offset: 512)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!189, !169}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !159, file: !4, line: 142, baseType: !195, size: 64, align: 64, offset: 576)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!175, !198, !169, !162, !175}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !153, file: !147, line: 341, baseType: !202, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !147, line: 328, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !147, line: 144, size: 1024, align: 64, elements: !206)
!206 = !{!207, !208, !209, !214, !215, !216, !217, !221, !222, !231, !235, !236, !237, !238, !240, !245, !249}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !147, line: 148, baseType: !162, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !205, file: !147, line: 155, baseType: !162, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !205, file: !147, line: 164, baseType: !210, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !147, line: 69, baseType: !213)
!213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !147, line: 69, flags: DIFlagFwdDecl)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !205, file: !147, line: 172, baseType: !210, size: 64, align: 64, offset: 192)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !205, file: !147, line: 182, baseType: !156, size: 64, align: 64, offset: 256)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !205, file: !147, line: 187, baseType: !175, size: 32, align: 32, offset: 320)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !205, file: !147, line: 210, baseType: !218, size: 64, align: 64, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DISubroutineType(types: !220)
!220 = !{!175, !151}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !205, file: !147, line: 233, baseType: !218, size: 64, align: 64, offset: 448)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !205, file: !147, line: 246, baseType: !223, size: 64, align: 64, offset: 512)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64, align: 64)
!224 = !DISubroutineType(types: !225)
!225 = !{!175, !151, !226}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !229, line: 86, baseType: !230)
!229 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !229, line: 86, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !205, file: !147, line: 258, baseType: !232, size: 64, align: 64, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64, align: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !151}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !205, file: !147, line: 282, baseType: !218, size: 64, align: 64, offset: 640)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !205, file: !147, line: 284, baseType: !175, size: 32, align: 32, offset: 704)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !205, file: !147, line: 286, baseType: !175, size: 32, align: 32, offset: 736)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !147, line: 292, baseType: !239, size: 64, align: 64, offset: 768)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !205, file: !147, line: 306, baseType: !241, size: 64, align: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64, align: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!175, !151, !162, !162, !244, !175, !175}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !205, file: !147, line: 313, baseType: !246, size: 64, align: 64, offset: 896)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!175, !151, !169}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !205, file: !147, line: 327, baseType: !218, size: 64, align: 64, offset: 960)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !147, line: 343, baseType: !244, size: 64, align: 64, offset: 128)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !153, file: !147, line: 345, baseType: !252, size: 64, align: 64, offset: 192)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !153, file: !147, line: 346, baseType: !254, size: 64, align: 64, offset: 256)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !147, line: 68, baseType: !148)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !153, file: !147, line: 347, baseType: !258, size: 32, align: 32, offset: 320)
!258 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !153, file: !147, line: 349, baseType: !252, size: 64, align: 64, offset: 384)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !153, file: !147, line: 350, baseType: !254, size: 64, align: 64, offset: 448)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !153, file: !147, line: 351, baseType: !258, size: 32, align: 32, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !153, file: !147, line: 353, baseType: !169, size: 64, align: 64, offset: 576)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !153, file: !147, line: 355, baseType: !264, size: 64, align: 64, offset: 640)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64, align: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !147, line: 840, size: 768, align: 64, elements: !266)
!266 = !{!267, !268, !270, !271, !272, !273, !274, !275, !279, !280, !290, !291, !292, !293}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !265, file: !147, line: 841, baseType: !156, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !265, file: !147, line: 842, baseType: !269, size: 64, align: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !265, file: !147, line: 843, baseType: !258, size: 32, align: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !265, file: !147, line: 845, baseType: !244, size: 64, align: 64, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !265, file: !147, line: 847, baseType: !244, size: 64, align: 64, offset: 256)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !265, file: !147, line: 862, baseType: !175, size: 32, align: 32, offset: 320)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !265, file: !147, line: 869, baseType: !175, size: 32, align: 32, offset: 352)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !265, file: !147, line: 874, baseType: !276, size: 64, align: 64, offset: 384)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !147, line: 809, baseType: !278)
!278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !147, line: 809, flags: DIFlagFwdDecl)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !265, file: !147, line: 881, baseType: !169, size: 64, align: 64, offset: 448)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !265, file: !147, line: 895, baseType: !281, size: 64, align: 64, offset: 512)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !147, line: 837, baseType: !283)
!283 = !DISubroutineType(types: !284)
!284 = !{!175, !151, !285, !169, !289, !175}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !147, line: 823, baseType: !287)
!287 = !DISubroutineType(types: !288)
!288 = !{!175, !151, !169, !175, !175}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !265, file: !147, line: 897, baseType: !244, size: 64, align: 64, offset: 576)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !265, file: !147, line: 906, baseType: !254, size: 64, align: 64, offset: 640)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !265, file: !147, line: 907, baseType: !175, size: 32, align: 32, offset: 704)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !265, file: !147, line: 909, baseType: !258, size: 32, align: 32, offset: 736)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !153, file: !147, line: 373, baseType: !175, size: 32, align: 32, offset: 704)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !153, file: !147, line: 378, baseType: !296, size: 64, align: 64, offset: 768)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !147, line: 335, baseType: !298)
!298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !147, line: 335, flags: DIFlagFwdDecl)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !153, file: !147, line: 380, baseType: !300, size: 64, align: 64, offset: 832)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64, align: 64)
!301 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !147, line: 380, flags: DIFlagFwdDecl)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !153, file: !147, line: 382, baseType: !244, size: 64, align: 64, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !153, file: !147, line: 383, baseType: !169, size: 64, align: 64, offset: 960)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !153, file: !147, line: 384, baseType: !305, size: 64, align: 64, offset: 1024)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64, align: 64)
!306 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !153, file: !147, line: 385, baseType: !175, size: 32, align: 32, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !153, file: !147, line: 394, baseType: !309, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !311, line: 94, baseType: !312)
!311 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !311, line: 81, size: 192, align: 64, elements: !313)
!313 = !{!314, !318, !323}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !312, file: !311, line: 82, baseType: !315, size: 64, align: 64)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !311, line: 73, baseType: !317)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !311, line: 73, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !311, line: 89, baseType: !319, size: 64, align: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !321, line: 48, baseType: !322)
!321 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!322 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !312, file: !311, line: 93, baseType: !175, size: 32, align: 32, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !153, file: !147, line: 401, baseType: !175, size: 32, align: 32, offset: 1216)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !153, file: !147, line: 408, baseType: !258, size: 32, align: 32, offset: 1248)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !153, file: !147, line: 424, baseType: !175, size: 32, align: 32, offset: 1280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !148, file: !147, line: 441, baseType: !252, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !148, file: !147, line: 443, baseType: !151, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !148, file: !147, line: 444, baseType: !252, size: 64, align: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !148, file: !147, line: 446, baseType: !137, size: 32, align: 32, offset: 256)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !148, file: !147, line: 449, baseType: !175, size: 32, align: 32, offset: 288)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !148, file: !147, line: 450, baseType: !175, size: 32, align: 32, offset: 320)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !148, file: !147, line: 451, baseType: !334, size: 64, align: 32, offset: 352)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !335, line: 61, baseType: !336)
!335 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !335, line: 58, size: 64, align: 32, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !336, file: !335, line: 59, baseType: !175, size: 32, align: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !336, file: !335, line: 60, baseType: !175, size: 32, align: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !148, file: !147, line: 453, baseType: !341, size: 64, align: 64, offset: 448)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !321, line: 55, baseType: !342)
!342 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !148, file: !147, line: 454, baseType: !175, size: 32, align: 32, offset: 512)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !148, file: !147, line: 456, baseType: !175, size: 32, align: 32, offset: 544)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !148, file: !147, line: 465, baseType: !334, size: 64, align: 32, offset: 576)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !148, file: !147, line: 481, baseType: !347, size: 64, align: 64, offset: 640)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !147, line: 70, baseType: !349)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !147, line: 70, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !148, file: !147, line: 482, baseType: !347, size: 64, align: 64, offset: 704)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !148, file: !147, line: 488, baseType: !347, size: 64, align: 64, offset: 768)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !148, file: !147, line: 489, baseType: !347, size: 64, align: 64, offset: 832)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !148, file: !147, line: 490, baseType: !354, size: 64, align: 64, offset: 896)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !147, line: 490, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !148, file: !147, line: 491, baseType: !354, size: 64, align: 64, offset: 960)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !148, file: !147, line: 500, baseType: !175, size: 32, align: 32, offset: 1024)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !148, file: !147, line: 507, baseType: !146, size: 32, align: 32, offset: 1056)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !148, file: !147, line: 512, baseType: !264, size: 64, align: 64, offset: 1088)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !148, file: !147, line: 518, baseType: !361, size: 64, align: 64, offset: 1152)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !321, line: 40, baseType: !362)
!362 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !148, file: !147, line: 524, baseType: !361, size: 64, align: 64, offset: 1216)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !148, file: !147, line: 529, baseType: !175, size: 32, align: 32, offset: 1280)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !148, file: !147, line: 542, baseType: !334, size: 64, align: 32, offset: 1312)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !148, file: !147, line: 547, baseType: !367, size: 64, align: 64, offset: 1408)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !36, line: 646, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !36, line: 268, size: 4288, align: 64, elements: !370)
!370 = !{!371, !375, !377, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !395, !396, !397, !398, !399, !400, !401, !402, !404, !406, !407, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !436, !437, !438, !439, !440, !441, !444, !445, !446, !447}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !369, file: !36, line: 282, baseType: !372, size: 512, align: 64)
!372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 512, align: 64, elements: !373)
!373 = !{!374}
!374 = !DISubrange(count: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !369, file: !36, line: 299, baseType: !376, size: 256, align: 32, offset: 512)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 256, align: 32, elements: !373)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !369, file: !36, line: 315, baseType: !378, size: 64, align: 64, offset: 768)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64, align: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !369, file: !36, line: 326, baseType: !175, size: 32, align: 32, offset: 832)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !369, file: !36, line: 326, baseType: !175, size: 32, align: 32, offset: 864)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !369, file: !36, line: 334, baseType: !175, size: 32, align: 32, offset: 896)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !369, file: !36, line: 341, baseType: !175, size: 32, align: 32, offset: 928)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !369, file: !36, line: 346, baseType: !175, size: 32, align: 32, offset: 960)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !369, file: !36, line: 351, baseType: !24, size: 32, align: 32, offset: 992)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !369, file: !36, line: 356, baseType: !334, size: 64, align: 32, offset: 1024)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !369, file: !36, line: 361, baseType: !361, size: 64, align: 64, offset: 1088)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !369, file: !36, line: 369, baseType: !361, size: 64, align: 64, offset: 1152)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !369, file: !36, line: 377, baseType: !361, size: 64, align: 64, offset: 1216)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !369, file: !36, line: 382, baseType: !175, size: 32, align: 32, offset: 1280)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !369, file: !36, line: 386, baseType: !175, size: 32, align: 32, offset: 1312)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !369, file: !36, line: 391, baseType: !175, size: 32, align: 32, offset: 1344)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !369, file: !36, line: 396, baseType: !169, size: 64, align: 64, offset: 1408)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !369, file: !36, line: 403, baseType: !394, size: 512, align: 64, offset: 1472)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, size: 512, align: 64, elements: !373)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !369, file: !36, line: 410, baseType: !175, size: 32, align: 32, offset: 1984)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !369, file: !36, line: 415, baseType: !175, size: 32, align: 32, offset: 2016)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !369, file: !36, line: 420, baseType: !175, size: 32, align: 32, offset: 2048)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !369, file: !36, line: 425, baseType: !175, size: 32, align: 32, offset: 2080)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !369, file: !36, line: 435, baseType: !361, size: 64, align: 64, offset: 2112)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !369, file: !36, line: 440, baseType: !175, size: 32, align: 32, offset: 2176)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !369, file: !36, line: 445, baseType: !341, size: 64, align: 64, offset: 2240)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !369, file: !36, line: 459, baseType: !403, size: 512, align: 64, offset: 2304)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 512, align: 64, elements: !373)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !369, file: !36, line: 473, baseType: !405, size: 64, align: 64, offset: 2816)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !369, file: !36, line: 477, baseType: !175, size: 32, align: 32, offset: 2880)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !369, file: !36, line: 479, baseType: !408, size: 64, align: 64, offset: 2944)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !36, line: 207, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !36, line: 201, size: 320, align: 64, elements: !412)
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !411, file: !36, line: 202, baseType: !35, size: 32, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !411, file: !36, line: 203, baseType: !319, size: 64, align: 64, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !411, file: !36, line: 204, baseType: !175, size: 32, align: 32, offset: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !411, file: !36, line: 205, baseType: !227, size: 64, align: 64, offset: 192)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !411, file: !36, line: 206, baseType: !309, size: 64, align: 64, offset: 256)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !369, file: !36, line: 480, baseType: !175, size: 32, align: 32, offset: 3008)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !369, file: !36, line: 505, baseType: !175, size: 32, align: 32, offset: 3040)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !369, file: !36, line: 512, baseType: !59, size: 32, align: 32, offset: 3072)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !369, file: !36, line: 514, baseType: !66, size: 32, align: 32, offset: 3104)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !369, file: !36, line: 516, baseType: !84, size: 32, align: 32, offset: 3136)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !369, file: !36, line: 523, baseType: !108, size: 32, align: 32, offset: 3168)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !369, file: !36, line: 525, baseType: !127, size: 32, align: 32, offset: 3200)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !369, file: !36, line: 532, baseType: !361, size: 64, align: 64, offset: 3264)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !369, file: !36, line: 539, baseType: !361, size: 64, align: 64, offset: 3328)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !369, file: !36, line: 547, baseType: !361, size: 64, align: 64, offset: 3392)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !369, file: !36, line: 554, baseType: !227, size: 64, align: 64, offset: 3456)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !369, file: !36, line: 563, baseType: !175, size: 32, align: 32, offset: 3520)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !369, file: !36, line: 572, baseType: !175, size: 32, align: 32, offset: 3552)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !369, file: !36, line: 581, baseType: !175, size: 32, align: 32, offset: 3584)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !369, file: !36, line: 588, baseType: !433, size: 64, align: 64, offset: 3648)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !321, line: 36, baseType: !435)
!435 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !369, file: !36, line: 593, baseType: !175, size: 32, align: 32, offset: 3712)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !369, file: !36, line: 596, baseType: !175, size: 32, align: 32, offset: 3744)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !369, file: !36, line: 599, baseType: !309, size: 64, align: 64, offset: 3776)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !369, file: !36, line: 605, baseType: !309, size: 64, align: 64, offset: 3840)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !369, file: !36, line: 616, baseType: !309, size: 64, align: 64, offset: 3904)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !369, file: !36, line: 626, baseType: !442, size: 64, align: 64, offset: 3968)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !443, line: 216, baseType: !342)
!443 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !369, file: !36, line: 627, baseType: !442, size: 64, align: 64, offset: 4032)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !369, file: !36, line: 628, baseType: !442, size: 64, align: 64, offset: 4096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !369, file: !36, line: 629, baseType: !442, size: 64, align: 64, offset: 4160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !369, file: !36, line: 645, baseType: !309, size: 64, align: 64, offset: 4224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !148, file: !147, line: 553, baseType: !175, size: 32, align: 32, offset: 1472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !148, file: !147, line: 562, baseType: !175, size: 32, align: 32, offset: 1504)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !148, file: !147, line: 568, baseType: !175, size: 32, align: 32, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !148, file: !147, line: 573, baseType: !175, size: 32, align: 32, offset: 1568)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !148, file: !147, line: 578, baseType: !258, size: 32, align: 32, offset: 1600)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !148, file: !147, line: 583, baseType: !361, size: 64, align: 64, offset: 1664)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !148, file: !147, line: 583, baseType: !361, size: 64, align: 64, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !148, file: !147, line: 588, baseType: !169, size: 64, align: 64, offset: 1792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !148, file: !147, line: 595, baseType: !175, size: 32, align: 32, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !148, file: !147, line: 601, baseType: !309, size: 64, align: 64, offset: 1920)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !148, file: !147, line: 610, baseType: !459, size: 491520, align: 8, offset: 1984)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 491520, align: 8, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 61440)
!462 = !{!463, !464, !465}
!463 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!464 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!465 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FFFrameSyncExtMode", file: !467, line: 60, size: 32, align: 32, elements: !468)
!467 = !DIFile(filename: "./libavfilter/framesync.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!468 = !{!469, !470, !471}
!469 = !DIEnumerator(name: "EXT_STOP", value: 0)
!470 = !DIEnumerator(name: "EXT_NULL", value: 1)
!471 = !DIEnumerator(name: "EXT_INFINITY", value: 2)
!472 = !{i32 2, !"Dwarf Version", i32 4}
!473 = !{i32 2, !"Debug Info Version", i32 3}
!474 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!475 = distinct !DISubprogram(name: "ff_threshold_init_x86", scope: !476, file: !476, line: 40, type: !477, isLocal: false, isDefinition: true, scopeLine: 41, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !540)
!476 = !DIFile(filename: "libavfilter/x86/vf_threshold_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!477 = !DISubroutineType(types: !478)
!478 = !{null, !479}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64, align: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThresholdContext", file: !481, line: 47, baseType: !482)
!481 = !DIFile(filename: "./libavfilter/threshold.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThresholdContext", file: !481, line: 27, size: 1536, align: 64, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !493, !494, !501, !503}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !482, file: !481, line: 28, baseType: !156, size: 64, align: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !482, file: !481, line: 30, baseType: !175, size: 32, align: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !482, file: !481, line: 31, baseType: !175, size: 32, align: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bpc", scope: !482, file: !481, line: 32, baseType: !175, size: 32, align: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nb_planes", scope: !482, file: !481, line: 34, baseType: !175, size: 32, align: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !482, file: !481, line: 35, baseType: !490, size: 128, align: 32, offset: 192)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 128, align: 32, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 4)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !482, file: !481, line: 35, baseType: !490, size: 128, align: 32, offset: 320)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "threshold", scope: !482, file: !481, line: 37, baseType: !495, size: 64, align: 64, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !498, !498, !498, !498, !319, !500, !500, !500, !500, !500, !175, !175}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !443, line: 149, baseType: !362)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "frames", scope: !482, file: !481, line: 45, baseType: !502, size: 256, align: 64, offset: 512)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !367, size: 256, align: 64, elements: !491)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "fs", scope: !482, file: !481, line: 46, baseType: !504, size: 768, align: 64, offset: 768)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameSync", file: !467, line: 209, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameSync", file: !467, line: 146, size: 768, align: 64, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512, !517, !518, !519, !520, !521, !522, !537, !538, !539}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !505, file: !467, line: 147, baseType: !156, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !505, file: !467, line: 152, baseType: !151, size: 64, align: 64, offset: 64)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_in", scope: !505, file: !467, line: 157, baseType: !258, size: 32, align: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !505, file: !467, line: 162, baseType: !334, size: 64, align: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !505, file: !467, line: 167, baseType: !361, size: 64, align: 64, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "on_event", scope: !505, file: !467, line: 172, baseType: !513, size: 64, align: 64, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!175, !516}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !505, file: !467, line: 177, baseType: !169, size: 64, align: 64, offset: 384)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "in_request", scope: !505, file: !467, line: 182, baseType: !258, size: 32, align: 32, offset: 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "sync_level", scope: !505, file: !467, line: 188, baseType: !258, size: 32, align: 32, offset: 480)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_ready", scope: !505, file: !467, line: 193, baseType: !320, size: 8, align: 8, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !505, file: !467, line: 198, baseType: !320, size: 8, align: 8, offset: 520)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !505, file: !467, line: 203, baseType: !523, size: 64, align: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64, align: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameSyncIn", file: !467, line: 141, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameSyncIn", file: !467, line: 81, size: 448, align: 64, elements: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !525, file: !467, line: 86, baseType: !466, size: 32, align: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !525, file: !467, line: 91, baseType: !466, size: 32, align: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !525, file: !467, line: 96, baseType: !334, size: 64, align: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !525, file: !467, line: 101, baseType: !367, size: 64, align: 64, offset: 128)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "frame_next", scope: !525, file: !467, line: 106, baseType: !367, size: 64, align: 64, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !525, file: !467, line: 111, baseType: !361, size: 64, align: 64, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pts_next", scope: !525, file: !467, line: 116, baseType: !361, size: 64, align: 64, offset: 320)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "have_next", scope: !525, file: !467, line: 121, baseType: !320, size: 8, align: 8, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !525, file: !467, line: 126, baseType: !320, size: 8, align: 8, offset: 392)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "sync", scope: !525, file: !467, line: 139, baseType: !258, size: 32, align: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "opt_repeatlast", scope: !505, file: !467, line: 205, baseType: !175, size: 32, align: 32, offset: 640)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "opt_shortest", scope: !505, file: !467, line: 206, baseType: !175, size: 32, align: 32, offset: 672)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "opt_eof_action", scope: !505, file: !467, line: 207, baseType: !175, size: 32, align: 32, offset: 704)
!540 = !{}
!541 = !DILocalVariable(name: "s", arg: 1, scope: !475, file: !476, line: 40, type: !479)
!542 = !DIExpression()
!543 = !DILocation(line: 40, column: 68, scope: !475)
!544 = !DILocalVariable(name: "cpu_flags", scope: !475, file: !476, line: 42, type: !175)
!545 = !DILocation(line: 42, column: 9, scope: !475)
!546 = !DILocation(line: 42, column: 21, scope: !475)
!547 = !DILocation(line: 44, column: 9, scope: !548)
!548 = distinct !DILexicalBlock(scope: !475, file: !476, line: 44, column: 9)
!549 = !DILocation(line: 44, column: 12, scope: !548)
!550 = !DILocation(line: 44, column: 18, scope: !548)
!551 = !DILocation(line: 44, column: 9, scope: !475)
!552 = !DILocation(line: 51, column: 5, scope: !553)
!553 = distinct !DILexicalBlock(scope: !548, file: !476, line: 44, column: 24)
!554 = !DILocation(line: 51, column: 16, scope: !555)
!555 = !DILexicalBlockFile(scope: !556, file: !476, discriminator: 1)
!556 = distinct !DILexicalBlock(scope: !548, file: !476, line: 51, column: 16)
!557 = !DILocation(line: 51, column: 19, scope: !555)
!558 = !DILocation(line: 51, column: 25, scope: !555)
!559 = !DILocation(line: 58, column: 5, scope: !560)
!560 = distinct !DILexicalBlock(scope: !556, file: !476, line: 51, column: 32)
!561 = !DILocation(line: 59, column: 1, scope: !475)
