; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--network.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--network.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.pollfd = type { i32, i16, i16 }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.sockaddr_in6 = type { i16, i16, i32, %struct.in6_addr, i32 }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [16 x i8] }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon.0, double, double, i32, i8* }
%union.anon.0 = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !58)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--network.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !15, !37}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "__socket_type", file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket_type.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "SOCK_STREAM", value: 1)
!7 = !DIEnumerator(name: "SOCK_DGRAM", value: 2)
!8 = !DIEnumerator(name: "SOCK_RAW", value: 3)
!9 = !DIEnumerator(name: "SOCK_RDM", value: 4)
!10 = !DIEnumerator(name: "SOCK_SEQPACKET", value: 5)
!11 = !DIEnumerator(name: "SOCK_DCCP", value: 6)
!12 = !DIEnumerator(name: "SOCK_PACKET", value: 10)
!13 = !DIEnumerator(name: "SOCK_CLOEXEC", value: 524288)
!14 = !DIEnumerator(name: "SOCK_NONBLOCK", value: 2048)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !16, line: 221, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!18 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!25 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!26 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!27 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!28 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!29 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!30 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!31 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!32 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!33 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!34 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!35 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!36 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !38, line: 29, size: 32, align: 32, elements: !39)
!38 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!46 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!47 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!48 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!49 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!50 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!51 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!52 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!53 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!54 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!55 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!56 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!57 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!58 = !{!59, !60, !61, !65, !84, !87, !104}
!59 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!60 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !62, line: 30, baseType: !63)
!62 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !64, line: 51, baseType: !60)
!64 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !62, line: 239, size: 128, align: 32, elements: !67)
!67 = !{!68, !72, !75, !79}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !66, file: !62, line: 241, baseType: !69, size: 16, align: 16)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !70, line: 28, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/sockaddr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!71 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !66, file: !62, line: 242, baseType: !73, size: 16, align: 16, offset: 16)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !62, line: 119, baseType: !74)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !64, line: 49, baseType: !71)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !66, file: !62, line: 243, baseType: !76, size: 32, align: 32, offset: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !62, line: 31, size: 32, align: 32, elements: !77)
!77 = !{!78}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !76, file: !62, line: 33, baseType: !61, size: 32, align: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !66, file: !62, line: 246, baseType: !80, size: 64, align: 8, offset: 64)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 64, align: 8, elements: !82)
!81 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!82 = !{!83}
!83 = !DISubrange(count: 8)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64, align: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !64, line: 48, baseType: !81)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", file: !62, line: 254, size: 224, align: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !103}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !88, file: !62, line: 256, baseType: !69, size: 16, align: 16)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !88, file: !62, line: 257, baseType: !73, size: 16, align: 16, offset: 16)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !88, file: !62, line: 258, baseType: !63, size: 32, align: 32, offset: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !88, file: !62, line: 259, baseType: !94, size: 128, align: 8, offset: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !62, line: 211, size: 128, align: 8, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "__in6_u", scope: !94, file: !62, line: 220, baseType: !97, size: 128, align: 8)
!97 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !94, file: !62, line: 213, size: 128, align: 8, elements: !98)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__u6_addr8", scope: !97, file: !62, line: 215, baseType: !100, size: 128, align: 8)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 128, align: 8, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 16)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !88, file: !62, line: 260, baseType: !63, size: 32, align: 32, offset: 192)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!105 = !{i32 2, !"Dwarf Version", i32 4}
!106 = !{i32 2, !"Debug Info Version", i32 3}
!107 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!108 = distinct !DISubprogram(name: "ff_tls_init", scope: !109, file: !109, line: 31, type: !110, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!109 = !DIFile(filename: "libavformat/network.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!110 = !DISubroutineType(types: !111)
!111 = !{!59}
!112 = !{}
!113 = !DILocation(line: 43, column: 5, scope: !108)
!114 = distinct !DISubprogram(name: "ff_tls_deinit", scope: !109, file: !109, line: 46, type: !115, isLocal: false, isDefinition: true, scopeLine: 47, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!115 = !DISubroutineType(types: !116)
!116 = !{null}
!117 = !DILocation(line: 56, column: 1, scope: !114)
!118 = distinct !DISubprogram(name: "ff_network_init", scope: !109, file: !109, line: 58, type: !110, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!119 = !DILocation(line: 66, column: 5, scope: !118)
!120 = distinct !DISubprogram(name: "ff_network_wait_fd", scope: !109, file: !109, line: 69, type: !121, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!121 = !DISubroutineType(types: !122)
!122 = !{!59, !59, !59}
!123 = !DILocalVariable(name: "fd", arg: 1, scope: !120, file: !109, line: 69, type: !59)
!124 = !DIExpression()
!125 = !DILocation(line: 69, column: 28, scope: !120)
!126 = !DILocalVariable(name: "write", arg: 2, scope: !120, file: !109, line: 69, type: !59)
!127 = !DILocation(line: 69, column: 36, scope: !120)
!128 = !DILocalVariable(name: "ev", scope: !120, file: !109, line: 71, type: !59)
!129 = !DILocation(line: 71, column: 9, scope: !120)
!130 = !DILocation(line: 71, column: 14, scope: !120)
!131 = !DILocalVariable(name: "p", scope: !120, file: !109, line: 72, type: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", file: !133, line: 39, size: 64, align: 32, elements: !134)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/poll.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!134 = !{!135, !136, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !132, file: !133, line: 41, baseType: !59, size: 32, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !132, file: !133, line: 42, baseType: !137, size: 16, align: 16, offset: 32)
!137 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !132, file: !133, line: 43, baseType: !137, size: 16, align: 16, offset: 48)
!139 = !DILocation(line: 72, column: 19, scope: !120)
!140 = !DILocation(line: 72, column: 23, scope: !120)
!141 = !DILocation(line: 72, column: 31, scope: !120)
!142 = !DILocation(line: 72, column: 45, scope: !120)
!143 = !DILocalVariable(name: "ret", scope: !120, file: !109, line: 73, type: !59)
!144 = !DILocation(line: 73, column: 9, scope: !120)
!145 = !DILocation(line: 74, column: 11, scope: !120)
!146 = !DILocation(line: 74, column: 9, scope: !120)
!147 = !DILocation(line: 75, column: 12, scope: !120)
!148 = !DILocation(line: 75, column: 16, scope: !120)
!149 = !DILocation(line: 75, column: 23, scope: !150)
!150 = !DILexicalBlockFile(scope: !120, file: !109, discriminator: 1)
!151 = !DILocation(line: 75, column: 22, scope: !150)
!152 = !DILocation(line: 75, column: 12, scope: !150)
!153 = !DILocation(line: 75, column: 28, scope: !154)
!154 = !DILexicalBlockFile(scope: !120, file: !109, discriminator: 2)
!155 = !DILocation(line: 75, column: 26, scope: !154)
!156 = !DILocation(line: 75, column: 39, scope: !154)
!157 = !DILocation(line: 75, column: 42, scope: !154)
!158 = !DILocation(line: 75, column: 63, scope: !154)
!159 = !DILocation(line: 75, column: 36, scope: !154)
!160 = !DILocation(line: 75, column: 12, scope: !154)
!161 = !DILocation(line: 75, column: 12, scope: !162)
!162 = !DILexicalBlockFile(scope: !120, file: !109, discriminator: 3)
!163 = !DILocation(line: 75, column: 5, scope: !162)
!164 = distinct !DISubprogram(name: "ff_network_wait_fd_timeout", scope: !109, file: !109, line: 78, type: !165, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!165 = !DISubroutineType(types: !166)
!166 = !{!59, !59, !59, !167, !169}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !64, line: 40, baseType: !168)
!168 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !171, line: 61, baseType: !172)
!171 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !171, line: 58, size: 128, align: 64, elements: !173)
!173 = !{!174, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !172, file: !171, line: 59, baseType: !175, size: 64, align: 64)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!59, !104}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !172, file: !171, line: 60, baseType: !104, size: 64, align: 64, offset: 64)
!179 = !DILocalVariable(name: "fd", arg: 1, scope: !164, file: !109, line: 78, type: !59)
!180 = !DILocation(line: 78, column: 36, scope: !164)
!181 = !DILocalVariable(name: "write", arg: 2, scope: !164, file: !109, line: 78, type: !59)
!182 = !DILocation(line: 78, column: 44, scope: !164)
!183 = !DILocalVariable(name: "timeout", arg: 3, scope: !164, file: !109, line: 78, type: !167)
!184 = !DILocation(line: 78, column: 59, scope: !164)
!185 = !DILocalVariable(name: "int_cb", arg: 4, scope: !164, file: !109, line: 78, type: !169)
!186 = !DILocation(line: 78, column: 85, scope: !164)
!187 = !DILocalVariable(name: "ret", scope: !164, file: !109, line: 80, type: !59)
!188 = !DILocation(line: 80, column: 9, scope: !164)
!189 = !DILocalVariable(name: "wait_start", scope: !164, file: !109, line: 81, type: !167)
!190 = !DILocation(line: 81, column: 13, scope: !164)
!191 = !DILocation(line: 83, column: 5, scope: !164)
!192 = !DILocation(line: 84, column: 32, scope: !193)
!193 = distinct !DILexicalBlock(scope: !194, file: !109, line: 84, column: 13)
!194 = distinct !DILexicalBlock(scope: !164, file: !109, line: 83, column: 15)
!195 = !DILocation(line: 84, column: 13, scope: !193)
!196 = !DILocation(line: 84, column: 13, scope: !194)
!197 = !DILocation(line: 85, column: 13, scope: !193)
!198 = !DILocation(line: 86, column: 34, scope: !194)
!199 = !DILocation(line: 86, column: 38, scope: !194)
!200 = !DILocation(line: 86, column: 15, scope: !194)
!201 = !DILocation(line: 86, column: 13, scope: !194)
!202 = !DILocation(line: 87, column: 13, scope: !203)
!203 = distinct !DILexicalBlock(scope: !194, file: !109, line: 87, column: 13)
!204 = !DILocation(line: 87, column: 17, scope: !203)
!205 = !DILocation(line: 87, column: 13, scope: !194)
!206 = !DILocation(line: 88, column: 20, scope: !203)
!207 = !DILocation(line: 88, column: 13, scope: !203)
!208 = !DILocation(line: 89, column: 13, scope: !209)
!209 = distinct !DILexicalBlock(scope: !194, file: !109, line: 89, column: 13)
!210 = !DILocation(line: 89, column: 21, scope: !209)
!211 = !DILocation(line: 89, column: 13, scope: !194)
!212 = !DILocation(line: 90, column: 18, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !109, line: 90, column: 17)
!214 = distinct !DILexicalBlock(scope: !209, file: !109, line: 89, column: 26)
!215 = !DILocation(line: 90, column: 17, scope: !214)
!216 = !DILocation(line: 91, column: 30, scope: !213)
!217 = !DILocation(line: 91, column: 28, scope: !213)
!218 = !DILocation(line: 91, column: 17, scope: !213)
!219 = !DILocation(line: 92, column: 22, scope: !220)
!220 = distinct !DILexicalBlock(scope: !213, file: !109, line: 92, column: 22)
!221 = !DILocation(line: 92, column: 46, scope: !220)
!222 = !DILocation(line: 92, column: 44, scope: !220)
!223 = !DILocation(line: 92, column: 59, scope: !220)
!224 = !DILocation(line: 92, column: 57, scope: !220)
!225 = !DILocation(line: 92, column: 22, scope: !213)
!226 = !DILocation(line: 93, column: 17, scope: !220)
!227 = !DILocation(line: 94, column: 9, scope: !214)
!228 = !DILocation(line: 83, column: 5, scope: !229)
!229 = !DILexicalBlockFile(scope: !164, file: !109, discriminator: 1)
!230 = distinct !{!230, !191}
!231 = !DILocation(line: 96, column: 1, scope: !164)
!232 = distinct !DISubprogram(name: "ff_network_sleep_interruptible", scope: !109, file: !109, line: 98, type: !233, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!233 = !DISubroutineType(types: !234)
!234 = !{!59, !167, !169}
!235 = !DILocalVariable(name: "timeout", arg: 1, scope: !232, file: !109, line: 98, type: !167)
!236 = !DILocation(line: 98, column: 44, scope: !232)
!237 = !DILocalVariable(name: "int_cb", arg: 2, scope: !232, file: !109, line: 98, type: !169)
!238 = !DILocation(line: 98, column: 70, scope: !232)
!239 = !DILocalVariable(name: "wait_start", scope: !232, file: !109, line: 100, type: !167)
!240 = !DILocation(line: 100, column: 13, scope: !232)
!241 = !DILocation(line: 100, column: 26, scope: !232)
!242 = !DILocation(line: 102, column: 5, scope: !232)
!243 = !DILocalVariable(name: "time_left", scope: !244, file: !109, line: 103, type: !167)
!244 = distinct !DILexicalBlock(scope: !232, file: !109, line: 102, column: 15)
!245 = !DILocation(line: 103, column: 17, scope: !244)
!246 = !DILocation(line: 105, column: 32, scope: !247)
!247 = distinct !DILexicalBlock(scope: !244, file: !109, line: 105, column: 13)
!248 = !DILocation(line: 105, column: 13, scope: !247)
!249 = !DILocation(line: 105, column: 13, scope: !244)
!250 = !DILocation(line: 106, column: 13, scope: !247)
!251 = !DILocation(line: 108, column: 21, scope: !244)
!252 = !DILocation(line: 108, column: 32, scope: !244)
!253 = !DILocation(line: 108, column: 56, scope: !244)
!254 = !DILocation(line: 108, column: 54, scope: !244)
!255 = !DILocation(line: 108, column: 29, scope: !244)
!256 = !DILocation(line: 108, column: 19, scope: !244)
!257 = !DILocation(line: 109, column: 13, scope: !258)
!258 = distinct !DILexicalBlock(scope: !244, file: !109, line: 109, column: 13)
!259 = !DILocation(line: 109, column: 23, scope: !258)
!260 = !DILocation(line: 109, column: 13, scope: !244)
!261 = !DILocation(line: 110, column: 13, scope: !258)
!262 = !DILocation(line: 112, column: 21, scope: !244)
!263 = !DILocation(line: 112, column: 32, scope: !244)
!264 = !DILocation(line: 112, column: 20, scope: !244)
!265 = !DILocation(line: 112, column: 20, scope: !266)
!266 = !DILexicalBlockFile(scope: !244, file: !109, discriminator: 1)
!267 = !DILocation(line: 112, column: 65, scope: !268)
!268 = !DILexicalBlockFile(scope: !244, file: !109, discriminator: 2)
!269 = !DILocation(line: 112, column: 20, scope: !268)
!270 = !DILocation(line: 112, column: 20, scope: !271)
!271 = !DILexicalBlockFile(scope: !244, file: !109, discriminator: 3)
!272 = !DILocation(line: 112, column: 19, scope: !271)
!273 = !DILocation(line: 112, column: 9, scope: !271)
!274 = !DILocation(line: 102, column: 5, scope: !275)
!275 = !DILexicalBlockFile(scope: !232, file: !109, discriminator: 1)
!276 = distinct !{!276, !242}
!277 = !DILocation(line: 114, column: 1, scope: !232)
!278 = distinct !DISubprogram(name: "ff_network_close", scope: !109, file: !109, line: 116, type: !115, isLocal: false, isDefinition: true, scopeLine: 117, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!279 = !DILocation(line: 121, column: 1, scope: !278)
!280 = distinct !DISubprogram(name: "ff_is_multicast_address", scope: !109, file: !109, line: 145, type: !281, isLocal: false, isDefinition: true, scopeLine: 146, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!281 = !DISubroutineType(types: !282)
!282 = !{!59, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !285, line: 153, size: 128, align: 16, elements: !286)
!285 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/socket.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !284, file: !285, line: 155, baseType: !69, size: 16, align: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !284, file: !285, line: 156, baseType: !289, size: 112, align: 8, offset: 16)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 112, align: 8, elements: !291)
!290 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!291 = !{!292}
!292 = !DISubrange(count: 14)
!293 = !DILocalVariable(name: "addr", arg: 1, scope: !280, file: !109, line: 145, type: !283)
!294 = !DILocation(line: 145, column: 46, scope: !280)
!295 = !DILocation(line: 147, column: 9, scope: !296)
!296 = distinct !DILexicalBlock(scope: !280, file: !109, line: 147, column: 9)
!297 = !DILocation(line: 147, column: 15, scope: !296)
!298 = !DILocation(line: 147, column: 25, scope: !296)
!299 = !DILocation(line: 147, column: 9, scope: !280)
!300 = !DILocation(line: 148, column: 44, scope: !301)
!301 = distinct !DILexicalBlock(scope: !296, file: !109, line: 147, column: 36)
!302 = !DILocation(line: 148, column: 51, scope: !301)
!303 = !DILocation(line: 148, column: 60, scope: !301)
!304 = !DILocation(line: 148, column: 15, scope: !301)
!305 = !DILocation(line: 148, column: 18, scope: !301)
!306 = !DILocation(line: 148, column: 32, scope: !301)
!307 = !DILocation(line: 148, column: 9, scope: !301)
!308 = !DILocation(line: 151, column: 9, scope: !309)
!309 = distinct !DILexicalBlock(scope: !280, file: !109, line: 151, column: 9)
!310 = !DILocation(line: 151, column: 15, scope: !309)
!311 = !DILocation(line: 151, column: 25, scope: !309)
!312 = !DILocation(line: 151, column: 9, scope: !280)
!313 = !DILocation(line: 152, column: 40, scope: !314)
!314 = distinct !DILexicalBlock(scope: !309, file: !109, line: 151, column: 37)
!315 = !DILocation(line: 152, column: 47, scope: !314)
!316 = !DILocation(line: 152, column: 16, scope: !314)
!317 = !DILocation(line: 152, column: 21, scope: !314)
!318 = !DILocation(line: 152, column: 9, scope: !314)
!319 = !DILocation(line: 156, column: 5, scope: !280)
!320 = !DILocation(line: 157, column: 1, scope: !280)
!321 = distinct !DISubprogram(name: "ff_socket", scope: !109, file: !109, line: 183, type: !322, isLocal: false, isDefinition: true, scopeLine: 184, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!322 = !DISubroutineType(types: !323)
!323 = !{!59, !59, !59, !59}
!324 = !DILocalVariable(name: "af", arg: 1, scope: !321, file: !109, line: 183, type: !59)
!325 = !DILocation(line: 183, column: 19, scope: !321)
!326 = !DILocalVariable(name: "type", arg: 2, scope: !321, file: !109, line: 183, type: !59)
!327 = !DILocation(line: 183, column: 27, scope: !321)
!328 = !DILocalVariable(name: "proto", arg: 3, scope: !321, file: !109, line: 183, type: !59)
!329 = !DILocation(line: 183, column: 37, scope: !321)
!330 = !DILocalVariable(name: "fd", scope: !321, file: !109, line: 185, type: !59)
!331 = !DILocation(line: 185, column: 9, scope: !321)
!332 = !DILocation(line: 188, column: 17, scope: !321)
!333 = !DILocation(line: 188, column: 21, scope: !321)
!334 = !DILocation(line: 188, column: 26, scope: !321)
!335 = !DILocation(line: 188, column: 41, scope: !321)
!336 = !DILocation(line: 188, column: 10, scope: !321)
!337 = !DILocation(line: 188, column: 8, scope: !321)
!338 = !DILocation(line: 189, column: 9, scope: !339)
!339 = distinct !DILexicalBlock(scope: !321, file: !109, line: 189, column: 9)
!340 = !DILocation(line: 189, column: 12, scope: !339)
!341 = !DILocation(line: 189, column: 18, scope: !339)
!342 = !DILocation(line: 189, column: 22, scope: !343)
!343 = !DILexicalBlockFile(scope: !339, file: !109, discriminator: 1)
!344 = !DILocation(line: 189, column: 21, scope: !343)
!345 = !DILocation(line: 189, column: 26, scope: !343)
!346 = !DILocation(line: 189, column: 9, scope: !343)
!347 = !DILocation(line: 192, column: 21, scope: !348)
!348 = distinct !DILexicalBlock(scope: !339, file: !109, line: 191, column: 5)
!349 = !DILocation(line: 192, column: 25, scope: !348)
!350 = !DILocation(line: 192, column: 31, scope: !348)
!351 = !DILocation(line: 192, column: 14, scope: !348)
!352 = !DILocation(line: 192, column: 12, scope: !348)
!353 = !DILocation(line: 194, column: 13, scope: !354)
!354 = distinct !DILexicalBlock(scope: !348, file: !109, line: 194, column: 13)
!355 = !DILocation(line: 194, column: 16, scope: !354)
!356 = !DILocation(line: 194, column: 13, scope: !348)
!357 = !DILocation(line: 195, column: 23, scope: !358)
!358 = distinct !DILexicalBlock(scope: !359, file: !109, line: 195, column: 17)
!359 = distinct !DILexicalBlock(scope: !354, file: !109, line: 194, column: 23)
!360 = !DILocation(line: 195, column: 17, scope: !358)
!361 = !DILocation(line: 195, column: 47, scope: !358)
!362 = !DILocation(line: 195, column: 17, scope: !359)
!363 = !DILocation(line: 196, column: 17, scope: !358)
!364 = !DILocation(line: 197, column: 9, scope: !359)
!365 = !DILocation(line: 199, column: 5, scope: !348)
!366 = !DILocation(line: 207, column: 12, scope: !321)
!367 = !DILocation(line: 207, column: 5, scope: !321)
!368 = distinct !DISubprogram(name: "ff_listen", scope: !109, file: !109, line: 210, type: !369, isLocal: false, isDefinition: true, scopeLine: 212, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!369 = !DISubroutineType(types: !370)
!370 = !{!59, !59, !371, !373}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "socklen_t", file: !285, line: 33, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__socklen_t", file: !375, line: 189, baseType: !60)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!376 = !DILocalVariable(name: "fd", arg: 1, scope: !368, file: !109, line: 210, type: !59)
!377 = !DILocation(line: 210, column: 19, scope: !368)
!378 = !DILocalVariable(name: "addr", arg: 2, scope: !368, file: !109, line: 210, type: !371)
!379 = !DILocation(line: 210, column: 46, scope: !368)
!380 = !DILocalVariable(name: "addrlen", arg: 3, scope: !368, file: !109, line: 211, type: !373)
!381 = !DILocation(line: 211, column: 25, scope: !368)
!382 = !DILocalVariable(name: "ret", scope: !368, file: !109, line: 213, type: !59)
!383 = !DILocation(line: 213, column: 9, scope: !368)
!384 = !DILocalVariable(name: "reuse", scope: !368, file: !109, line: 214, type: !59)
!385 = !DILocation(line: 214, column: 9, scope: !368)
!386 = !DILocation(line: 215, column: 20, scope: !387)
!387 = distinct !DILexicalBlock(scope: !368, file: !109, line: 215, column: 9)
!388 = !DILocation(line: 215, column: 49, scope: !387)
!389 = !DILocation(line: 215, column: 9, scope: !387)
!390 = !DILocation(line: 215, column: 9, scope: !368)
!391 = !DILocation(line: 216, column: 9, scope: !392)
!392 = distinct !DILexicalBlock(scope: !387, file: !109, line: 215, column: 73)
!393 = !DILocation(line: 217, column: 5, scope: !392)
!394 = !DILocation(line: 218, column: 16, scope: !368)
!395 = !DILocation(line: 218, column: 20, scope: !368)
!396 = !DILocation(line: 218, column: 26, scope: !368)
!397 = !DILocation(line: 218, column: 11, scope: !368)
!398 = !DILocation(line: 218, column: 9, scope: !368)
!399 = !DILocation(line: 219, column: 9, scope: !400)
!400 = distinct !DILexicalBlock(scope: !368, file: !109, line: 219, column: 9)
!401 = !DILocation(line: 219, column: 9, scope: !368)
!402 = !DILocation(line: 220, column: 17, scope: !400)
!403 = !DILocation(line: 220, column: 16, scope: !400)
!404 = !DILocation(line: 220, column: 9, scope: !400)
!405 = !DILocation(line: 222, column: 18, scope: !368)
!406 = !DILocation(line: 222, column: 11, scope: !368)
!407 = !DILocation(line: 222, column: 9, scope: !368)
!408 = !DILocation(line: 223, column: 9, scope: !409)
!409 = distinct !DILexicalBlock(scope: !368, file: !109, line: 223, column: 9)
!410 = !DILocation(line: 223, column: 9, scope: !368)
!411 = !DILocation(line: 224, column: 17, scope: !409)
!412 = !DILocation(line: 224, column: 16, scope: !409)
!413 = !DILocation(line: 224, column: 9, scope: !409)
!414 = !DILocation(line: 225, column: 12, scope: !368)
!415 = !DILocation(line: 225, column: 5, scope: !368)
!416 = !DILocation(line: 226, column: 1, scope: !368)
!417 = distinct !DISubprogram(name: "ff_accept", scope: !109, file: !109, line: 228, type: !418, isLocal: false, isDefinition: true, scopeLine: 229, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!418 = !DISubroutineType(types: !419)
!419 = !{!59, !59, !59, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !422, line: 52, baseType: !423)
!422 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !422, line: 38, size: 768, align: 64, elements: !424)
!424 = !{!425, !506, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !423, file: !422, line: 39, baseType: !426, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !38, line: 143, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !38, line: 67, size: 640, align: 64, elements: !430)
!430 = !{!431, !434, !438, !465, !466, !467, !468, !472, !478, !480, !484}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !429, file: !38, line: 72, baseType: !432, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !429, file: !38, line: 78, baseType: !435, size: 64, align: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64, align: 64)
!436 = !DISubroutineType(types: !437)
!437 = !{!432, !104}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !429, file: !38, line: 85, baseType: !439, size: 64, align: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !16, line: 246, size: 512, align: 64, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !461, !462, !463, !464}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !441, file: !16, line: 247, baseType: !432, size: 64, align: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !441, file: !16, line: 253, baseType: !432, size: 64, align: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !441, file: !16, line: 259, baseType: !59, size: 32, align: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !441, file: !16, line: 260, baseType: !15, size: 32, align: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !441, file: !16, line: 271, baseType: !448, size: 64, align: 64, offset: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !16, line: 265, size: 64, align: 64, elements: !449)
!449 = !{!450, !451, !453, !454}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !448, file: !16, line: 266, baseType: !167, size: 64, align: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !448, file: !16, line: 267, baseType: !452, size: 64, align: 64)
!452 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !448, file: !16, line: 268, baseType: !432, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !448, file: !16, line: 270, baseType: !455, size: 64, align: 32)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !456, line: 61, baseType: !457)
!456 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !456, line: 58, size: 64, align: 32, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !457, file: !456, line: 59, baseType: !59, size: 32, align: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !457, file: !456, line: 60, baseType: !59, size: 32, align: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !441, file: !16, line: 272, baseType: !452, size: 64, align: 64, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !441, file: !16, line: 273, baseType: !452, size: 64, align: 64, offset: 320)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !441, file: !16, line: 275, baseType: !59, size: 32, align: 32, offset: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !441, file: !16, line: 300, baseType: !432, size: 64, align: 64, offset: 448)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !429, file: !38, line: 93, baseType: !59, size: 32, align: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !429, file: !38, line: 99, baseType: !59, size: 32, align: 32, offset: 224)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !429, file: !38, line: 108, baseType: !59, size: 32, align: 32, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !429, file: !38, line: 113, baseType: !469, size: 64, align: 64, offset: 320)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64, align: 64)
!470 = !DISubroutineType(types: !471)
!471 = !{!104, !104, !104}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !429, file: !38, line: 123, baseType: !473, size: 64, align: 64, offset: 384)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64, align: 64)
!474 = !DISubroutineType(types: !475)
!475 = !{!476, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64, align: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !429)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !429, file: !38, line: 130, baseType: !479, size: 32, align: 32, offset: 448)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !38, line: 48, baseType: !37)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !429, file: !38, line: 136, baseType: !481, size: 64, align: 64, offset: 512)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DISubroutineType(types: !483)
!483 = !{!479, !104}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !429, file: !38, line: 142, baseType: !485, size: 64, align: 64, offset: 576)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64, align: 64)
!486 = !DISubroutineType(types: !487)
!487 = !{!59, !488, !104, !432, !59}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !16, line: 329, size: 128, align: 64, elements: !491)
!491 = !{!492, !504, !505}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !490, file: !16, line: 360, baseType: !493, size: 64, align: 64)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !16, line: 324, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !16, line: 306, size: 384, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !496, file: !16, line: 307, baseType: !432, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !496, file: !16, line: 313, baseType: !452, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !496, file: !16, line: 313, baseType: !452, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !496, file: !16, line: 318, baseType: !452, size: 64, align: 64, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !496, file: !16, line: 318, baseType: !452, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !496, file: !16, line: 323, baseType: !59, size: 32, align: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !490, file: !16, line: 364, baseType: !59, size: 32, align: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !490, file: !16, line: 368, baseType: !59, size: 32, align: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !423, file: !422, line: 40, baseType: !507, size: 64, align: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64, align: 64)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !422, line: 54, size: 1600, align: 64, elements: !510)
!510 = !{!511, !512, !516, !525, !530, !534, !539, !545, !549, !550, !554, !558, !559, !565, !566, !567, !568, !569, !570, !571, !572, !592, !593, !594, !598}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !422, line: 55, baseType: !432, size: 64, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !509, file: !422, line: 56, baseType: !513, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64, align: 64)
!514 = !DISubroutineType(types: !515)
!515 = !{!59, !420, !432, !59}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !509, file: !422, line: 62, baseType: !517, size: 64, align: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64, align: 64)
!518 = !DISubroutineType(types: !519)
!519 = !{!59, !420, !432, !59, !520}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64, align: 64)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64, align: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !523, line: 86, baseType: !524)
!523 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!524 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !523, line: 86, flags: DIFlagFwdDecl)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !509, file: !422, line: 63, baseType: !526, size: 64, align: 64, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{!59, !420, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !509, file: !422, line: 64, baseType: !531, size: 64, align: 64, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64, align: 64)
!532 = !DISubroutineType(types: !533)
!533 = !{!59, !420}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !509, file: !422, line: 78, baseType: !535, size: 64, align: 64, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64, align: 64)
!536 = !DISubroutineType(types: !537)
!537 = !{!59, !420, !538, !59}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !509, file: !422, line: 79, baseType: !540, size: 64, align: 64, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = !DISubroutineType(types: !542)
!542 = !{!59, !420, !543, !59}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !509, file: !422, line: 80, baseType: !546, size: 64, align: 64, offset: 448)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64, align: 64)
!547 = !DISubroutineType(types: !548)
!548 = !{!167, !420, !167, !59}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !509, file: !422, line: 81, baseType: !531, size: 64, align: 64, offset: 512)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !509, file: !422, line: 82, baseType: !551, size: 64, align: 64, offset: 576)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64, align: 64)
!552 = !DISubroutineType(types: !553)
!553 = !{!59, !420, !59}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !509, file: !422, line: 83, baseType: !555, size: 64, align: 64, offset: 640)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64, align: 64)
!556 = !DISubroutineType(types: !557)
!557 = !{!167, !420, !59, !167, !59}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !509, file: !422, line: 85, baseType: !531, size: 64, align: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !509, file: !422, line: 86, baseType: !560, size: 64, align: 64, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64)
!561 = !DISubroutineType(types: !562)
!562 = !{!59, !420, !563, !564}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64, align: 64)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !509, file: !422, line: 88, baseType: !531, size: 64, align: 64, offset: 832)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !509, file: !422, line: 89, baseType: !551, size: 64, align: 64, offset: 896)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !509, file: !422, line: 90, baseType: !59, size: 32, align: 32, offset: 960)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !509, file: !422, line: 91, baseType: !426, size: 64, align: 64, offset: 1024)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !509, file: !422, line: 92, baseType: !59, size: 32, align: 32, offset: 1088)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !509, file: !422, line: 93, baseType: !551, size: 64, align: 64, offset: 1152)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !509, file: !422, line: 94, baseType: !531, size: 64, align: 64, offset: 1216)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !509, file: !422, line: 95, baseType: !573, size: 64, align: 64, offset: 1280)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64, align: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!59, !420, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64, align: 64)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !171, line: 101, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !171, line: 86, size: 576, align: 64, elements: !580)
!580 = !{!581, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !171, line: 87, baseType: !582, size: 64, align: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !579, file: !171, line: 88, baseType: !59, size: 32, align: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !579, file: !171, line: 89, baseType: !59, size: 32, align: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !171, line: 91, baseType: !167, size: 64, align: 64, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !579, file: !171, line: 92, baseType: !167, size: 64, align: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !579, file: !171, line: 94, baseType: !167, size: 64, align: 64, offset: 256)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !579, file: !171, line: 96, baseType: !167, size: 64, align: 64, offset: 320)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !579, file: !171, line: 98, baseType: !167, size: 64, align: 64, offset: 384)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !579, file: !171, line: 99, baseType: !167, size: 64, align: 64, offset: 448)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !579, file: !171, line: 100, baseType: !167, size: 64, align: 64, offset: 512)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !509, file: !422, line: 96, baseType: !531, size: 64, align: 64, offset: 1344)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !509, file: !422, line: 97, baseType: !531, size: 64, align: 64, offset: 1408)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !509, file: !422, line: 98, baseType: !595, size: 64, align: 64, offset: 1472)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64, align: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!59, !420, !420}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !509, file: !422, line: 99, baseType: !432, size: 64, align: 64, offset: 1536)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !423, file: !422, line: 41, baseType: !104, size: 64, align: 64, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !423, file: !422, line: 42, baseType: !582, size: 64, align: 64, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !423, file: !422, line: 43, baseType: !59, size: 32, align: 32, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !423, file: !422, line: 44, baseType: !59, size: 32, align: 32, offset: 288)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !423, file: !422, line: 45, baseType: !59, size: 32, align: 32, offset: 320)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !423, file: !422, line: 46, baseType: !59, size: 32, align: 32, offset: 352)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !423, file: !422, line: 47, baseType: !170, size: 128, align: 64, offset: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !423, file: !422, line: 48, baseType: !167, size: 64, align: 64, offset: 512)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !423, file: !422, line: 49, baseType: !432, size: 64, align: 64, offset: 576)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !423, file: !422, line: 50, baseType: !432, size: 64, align: 64, offset: 640)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !423, file: !422, line: 51, baseType: !59, size: 32, align: 32, offset: 704)
!610 = !DILocalVariable(name: "fd", arg: 1, scope: !417, file: !109, line: 228, type: !59)
!611 = !DILocation(line: 228, column: 19, scope: !417)
!612 = !DILocalVariable(name: "timeout", arg: 2, scope: !417, file: !109, line: 228, type: !59)
!613 = !DILocation(line: 228, column: 27, scope: !417)
!614 = !DILocalVariable(name: "h", arg: 3, scope: !417, file: !109, line: 228, type: !420)
!615 = !DILocation(line: 228, column: 48, scope: !417)
!616 = !DILocalVariable(name: "ret", scope: !417, file: !109, line: 230, type: !59)
!617 = !DILocation(line: 230, column: 9, scope: !417)
!618 = !DILocalVariable(name: "lp", scope: !417, file: !109, line: 231, type: !132)
!619 = !DILocation(line: 231, column: 19, scope: !417)
!620 = !DILocation(line: 231, column: 24, scope: !417)
!621 = !DILocation(line: 231, column: 26, scope: !417)
!622 = !DILocation(line: 233, column: 37, scope: !417)
!623 = !DILocation(line: 233, column: 47, scope: !417)
!624 = !DILocation(line: 233, column: 50, scope: !417)
!625 = !DILocation(line: 233, column: 11, scope: !417)
!626 = !DILocation(line: 233, column: 9, scope: !417)
!627 = !DILocation(line: 234, column: 9, scope: !628)
!628 = distinct !DILexicalBlock(scope: !417, file: !109, line: 234, column: 9)
!629 = !DILocation(line: 234, column: 13, scope: !628)
!630 = !DILocation(line: 234, column: 9, scope: !417)
!631 = !DILocation(line: 235, column: 16, scope: !628)
!632 = !DILocation(line: 235, column: 9, scope: !628)
!633 = !DILocation(line: 237, column: 18, scope: !417)
!634 = !DILocation(line: 237, column: 11, scope: !417)
!635 = !DILocation(line: 237, column: 9, scope: !417)
!636 = !DILocation(line: 238, column: 9, scope: !637)
!637 = distinct !DILexicalBlock(scope: !417, file: !109, line: 238, column: 9)
!638 = !DILocation(line: 238, column: 13, scope: !637)
!639 = !DILocation(line: 238, column: 9, scope: !417)
!640 = !DILocation(line: 239, column: 17, scope: !637)
!641 = !DILocation(line: 239, column: 16, scope: !637)
!642 = !DILocation(line: 239, column: 9, scope: !637)
!643 = !DILocation(line: 240, column: 28, scope: !644)
!644 = distinct !DILexicalBlock(scope: !417, file: !109, line: 240, column: 9)
!645 = !DILocation(line: 240, column: 9, scope: !644)
!646 = !DILocation(line: 240, column: 36, scope: !644)
!647 = !DILocation(line: 240, column: 9, scope: !417)
!648 = !DILocation(line: 241, column: 9, scope: !644)
!649 = !DILocation(line: 243, column: 12, scope: !417)
!650 = !DILocation(line: 243, column: 5, scope: !417)
!651 = !DILocation(line: 244, column: 1, scope: !417)
!652 = distinct !DISubprogram(name: "ff_poll_interrupt", scope: !109, file: !109, line: 159, type: !653, isLocal: true, isDefinition: true, scopeLine: 161, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!653 = !DISubroutineType(types: !654)
!654 = !{!59, !655, !656, !59, !169}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "nfds_t", file: !133, line: 36, baseType: !657)
!657 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!658 = !DILocalVariable(name: "p", arg: 1, scope: !652, file: !109, line: 159, type: !655)
!659 = !DILocation(line: 159, column: 45, scope: !652)
!660 = !DILocalVariable(name: "nfds", arg: 2, scope: !652, file: !109, line: 159, type: !656)
!661 = !DILocation(line: 159, column: 55, scope: !652)
!662 = !DILocalVariable(name: "timeout", arg: 3, scope: !652, file: !109, line: 159, type: !59)
!663 = !DILocation(line: 159, column: 65, scope: !652)
!664 = !DILocalVariable(name: "cb", arg: 4, scope: !652, file: !109, line: 160, type: !169)
!665 = !DILocation(line: 160, column: 47, scope: !652)
!666 = !DILocalVariable(name: "runs", scope: !652, file: !109, line: 162, type: !59)
!667 = !DILocation(line: 162, column: 9, scope: !652)
!668 = !DILocation(line: 162, column: 16, scope: !652)
!669 = !DILocation(line: 162, column: 24, scope: !652)
!670 = !DILocalVariable(name: "ret", scope: !652, file: !109, line: 163, type: !59)
!671 = !DILocation(line: 163, column: 9, scope: !652)
!672 = !DILocation(line: 165, column: 5, scope: !652)
!673 = distinct !{!673, !672}
!674 = !DILocation(line: 166, column: 32, scope: !675)
!675 = distinct !DILexicalBlock(scope: !676, file: !109, line: 166, column: 13)
!676 = distinct !DILexicalBlock(scope: !652, file: !109, line: 165, column: 8)
!677 = !DILocation(line: 166, column: 13, scope: !675)
!678 = !DILocation(line: 166, column: 13, scope: !676)
!679 = !DILocation(line: 167, column: 13, scope: !675)
!680 = !DILocation(line: 168, column: 20, scope: !676)
!681 = !DILocation(line: 168, column: 23, scope: !676)
!682 = !DILocation(line: 168, column: 15, scope: !676)
!683 = !DILocation(line: 168, column: 13, scope: !676)
!684 = !DILocation(line: 169, column: 13, scope: !685)
!685 = distinct !DILexicalBlock(scope: !676, file: !109, line: 169, column: 13)
!686 = !DILocation(line: 169, column: 17, scope: !685)
!687 = !DILocation(line: 169, column: 13, scope: !676)
!688 = !DILocation(line: 170, column: 17, scope: !689)
!689 = distinct !DILexicalBlock(scope: !690, file: !109, line: 170, column: 17)
!690 = distinct !DILexicalBlock(scope: !685, file: !109, line: 169, column: 23)
!691 = !DILocation(line: 170, column: 21, scope: !689)
!692 = !DILocation(line: 170, column: 17, scope: !690)
!693 = !DILocation(line: 171, column: 24, scope: !689)
!694 = !DILocation(line: 171, column: 23, scope: !689)
!695 = !DILocation(line: 171, column: 21, scope: !689)
!696 = !DILocation(line: 171, column: 17, scope: !689)
!697 = !DILocation(line: 172, column: 17, scope: !698)
!698 = distinct !DILexicalBlock(scope: !690, file: !109, line: 172, column: 17)
!699 = !DILocation(line: 172, column: 21, scope: !698)
!700 = !DILocation(line: 172, column: 17, scope: !690)
!701 = !DILocation(line: 173, column: 17, scope: !698)
!702 = !DILocation(line: 174, column: 13, scope: !690)
!703 = !DILocation(line: 176, column: 5, scope: !676)
!704 = !DILocation(line: 176, column: 14, scope: !705)
!705 = !DILexicalBlockFile(scope: !652, file: !109, discriminator: 1)
!706 = !DILocation(line: 176, column: 22, scope: !705)
!707 = !DILocation(line: 176, column: 27, scope: !705)
!708 = !DILocation(line: 176, column: 34, scope: !709)
!709 = !DILexicalBlockFile(scope: !652, file: !109, discriminator: 2)
!710 = !DILocation(line: 176, column: 37, scope: !709)
!711 = !DILocation(line: 176, column: 27, scope: !709)
!712 = !DILocation(line: 176, column: 5, scope: !713)
!713 = !DILexicalBlockFile(scope: !676, file: !109, discriminator: 3)
!714 = !DILocation(line: 178, column: 10, scope: !715)
!715 = distinct !DILexicalBlock(scope: !652, file: !109, line: 178, column: 9)
!716 = !DILocation(line: 178, column: 9, scope: !652)
!717 = !DILocation(line: 179, column: 9, scope: !715)
!718 = !DILocation(line: 180, column: 12, scope: !652)
!719 = !DILocation(line: 180, column: 5, scope: !652)
!720 = !DILocation(line: 181, column: 1, scope: !652)
!721 = distinct !DISubprogram(name: "ff_listen_bind", scope: !109, file: !109, line: 246, type: !722, isLocal: false, isDefinition: true, scopeLine: 248, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!722 = !DISubroutineType(types: !723)
!723 = !{!59, !59, !371, !373, !59, !420}
!724 = !DILocalVariable(name: "fd", arg: 1, scope: !721, file: !109, line: 246, type: !59)
!725 = !DILocation(line: 246, column: 24, scope: !721)
!726 = !DILocalVariable(name: "addr", arg: 2, scope: !721, file: !109, line: 246, type: !371)
!727 = !DILocation(line: 246, column: 51, scope: !721)
!728 = !DILocalVariable(name: "addrlen", arg: 3, scope: !721, file: !109, line: 247, type: !373)
!729 = !DILocation(line: 247, column: 30, scope: !721)
!730 = !DILocalVariable(name: "timeout", arg: 4, scope: !721, file: !109, line: 247, type: !59)
!731 = !DILocation(line: 247, column: 43, scope: !721)
!732 = !DILocalVariable(name: "h", arg: 5, scope: !721, file: !109, line: 247, type: !420)
!733 = !DILocation(line: 247, column: 64, scope: !721)
!734 = !DILocalVariable(name: "ret", scope: !721, file: !109, line: 249, type: !59)
!735 = !DILocation(line: 249, column: 9, scope: !721)
!736 = !DILocation(line: 250, column: 26, scope: !737)
!737 = distinct !DILexicalBlock(scope: !721, file: !109, line: 250, column: 9)
!738 = !DILocation(line: 250, column: 30, scope: !737)
!739 = !DILocation(line: 250, column: 36, scope: !737)
!740 = !DILocation(line: 250, column: 16, scope: !737)
!741 = !DILocation(line: 250, column: 14, scope: !737)
!742 = !DILocation(line: 250, column: 46, scope: !737)
!743 = !DILocation(line: 250, column: 9, scope: !721)
!744 = !DILocation(line: 251, column: 16, scope: !737)
!745 = !DILocation(line: 251, column: 9, scope: !737)
!746 = !DILocation(line: 252, column: 26, scope: !747)
!747 = distinct !DILexicalBlock(scope: !721, file: !109, line: 252, column: 9)
!748 = !DILocation(line: 252, column: 30, scope: !747)
!749 = !DILocation(line: 252, column: 39, scope: !747)
!750 = !DILocation(line: 252, column: 16, scope: !747)
!751 = !DILocation(line: 252, column: 14, scope: !747)
!752 = !DILocation(line: 252, column: 43, scope: !747)
!753 = !DILocation(line: 252, column: 9, scope: !721)
!754 = !DILocation(line: 253, column: 16, scope: !747)
!755 = !DILocation(line: 253, column: 9, scope: !747)
!756 = !DILocation(line: 254, column: 11, scope: !721)
!757 = !DILocation(line: 254, column: 5, scope: !721)
!758 = !DILocation(line: 255, column: 12, scope: !721)
!759 = !DILocation(line: 255, column: 5, scope: !721)
!760 = !DILocation(line: 256, column: 1, scope: !721)
!761 = distinct !DISubprogram(name: "ff_listen_connect", scope: !109, file: !109, line: 258, type: !762, isLocal: false, isDefinition: true, scopeLine: 261, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!762 = !DISubroutineType(types: !763)
!763 = !{!59, !59, !371, !373, !59, !420, !59}
!764 = !DILocalVariable(name: "fd", arg: 1, scope: !761, file: !109, line: 258, type: !59)
!765 = !DILocation(line: 258, column: 27, scope: !761)
!766 = !DILocalVariable(name: "addr", arg: 2, scope: !761, file: !109, line: 258, type: !371)
!767 = !DILocation(line: 258, column: 54, scope: !761)
!768 = !DILocalVariable(name: "addrlen", arg: 3, scope: !761, file: !109, line: 259, type: !373)
!769 = !DILocation(line: 259, column: 33, scope: !761)
!770 = !DILocalVariable(name: "timeout", arg: 4, scope: !761, file: !109, line: 259, type: !59)
!771 = !DILocation(line: 259, column: 46, scope: !761)
!772 = !DILocalVariable(name: "h", arg: 5, scope: !761, file: !109, line: 259, type: !420)
!773 = !DILocation(line: 259, column: 67, scope: !761)
!774 = !DILocalVariable(name: "will_try_next", arg: 6, scope: !761, file: !109, line: 260, type: !59)
!775 = !DILocation(line: 260, column: 27, scope: !761)
!776 = !DILocalVariable(name: "p", scope: !761, file: !109, line: 262, type: !132)
!777 = !DILocation(line: 262, column: 19, scope: !761)
!778 = !DILocation(line: 262, column: 23, scope: !761)
!779 = !DILocation(line: 262, column: 24, scope: !761)
!780 = !DILocalVariable(name: "ret", scope: !761, file: !109, line: 263, type: !59)
!781 = !DILocation(line: 263, column: 9, scope: !761)
!782 = !DILocalVariable(name: "optlen", scope: !761, file: !109, line: 264, type: !373)
!783 = !DILocation(line: 264, column: 15, scope: !761)
!784 = !DILocation(line: 266, column: 28, scope: !785)
!785 = distinct !DILexicalBlock(scope: !761, file: !109, line: 266, column: 9)
!786 = !DILocation(line: 266, column: 9, scope: !785)
!787 = !DILocation(line: 266, column: 35, scope: !785)
!788 = !DILocation(line: 266, column: 9, scope: !761)
!789 = !DILocation(line: 267, column: 9, scope: !785)
!790 = !DILocation(line: 269, column: 5, scope: !761)
!791 = !DILocation(line: 269, column: 27, scope: !792)
!792 = !DILexicalBlockFile(scope: !761, file: !109, discriminator: 1)
!793 = !DILocation(line: 269, column: 31, scope: !792)
!794 = !DILocation(line: 269, column: 37, scope: !792)
!795 = !DILocation(line: 269, column: 19, scope: !792)
!796 = !DILocation(line: 269, column: 17, scope: !792)
!797 = !DILocation(line: 269, column: 5, scope: !792)
!798 = !DILocation(line: 270, column: 16, scope: !799)
!799 = distinct !DILexicalBlock(scope: !761, file: !109, line: 269, column: 48)
!800 = !DILocation(line: 270, column: 15, scope: !799)
!801 = !DILocation(line: 270, column: 13, scope: !799)
!802 = !DILocation(line: 271, column: 17, scope: !799)
!803 = !DILocation(line: 271, column: 9, scope: !799)
!804 = !DILocation(line: 273, column: 37, scope: !805)
!805 = distinct !DILexicalBlock(scope: !806, file: !109, line: 273, column: 17)
!806 = distinct !DILexicalBlock(scope: !799, file: !109, line: 271, column: 22)
!807 = !DILocation(line: 273, column: 40, scope: !805)
!808 = !DILocation(line: 273, column: 17, scope: !805)
!809 = !DILocation(line: 273, column: 17, scope: !806)
!810 = !DILocation(line: 274, column: 17, scope: !805)
!811 = !DILocation(line: 275, column: 13, scope: !806)
!812 = distinct !{!812, !790}
!813 = !DILocation(line: 278, column: 44, scope: !806)
!814 = !DILocation(line: 278, column: 54, scope: !806)
!815 = !DILocation(line: 278, column: 57, scope: !806)
!816 = !DILocation(line: 278, column: 19, scope: !806)
!817 = !DILocation(line: 278, column: 17, scope: !806)
!818 = !DILocation(line: 279, column: 17, scope: !819)
!819 = distinct !DILexicalBlock(scope: !806, file: !109, line: 279, column: 17)
!820 = !DILocation(line: 279, column: 21, scope: !819)
!821 = !DILocation(line: 279, column: 17, scope: !806)
!822 = !DILocation(line: 280, column: 24, scope: !819)
!823 = !DILocation(line: 280, column: 17, scope: !819)
!824 = !DILocation(line: 281, column: 20, scope: !806)
!825 = !DILocation(line: 282, column: 29, scope: !826)
!826 = distinct !DILexicalBlock(scope: !806, file: !109, line: 282, column: 17)
!827 = !DILocation(line: 282, column: 54, scope: !826)
!828 = !DILocation(line: 282, column: 17, scope: !826)
!829 = !DILocation(line: 282, column: 17, scope: !806)
!830 = !DILocation(line: 283, column: 24, scope: !826)
!831 = !DILocation(line: 283, column: 23, scope: !826)
!832 = !DILocation(line: 283, column: 27, scope: !826)
!833 = !DILocation(line: 283, column: 21, scope: !826)
!834 = !DILocation(line: 283, column: 17, scope: !826)
!835 = !DILocation(line: 284, column: 17, scope: !836)
!836 = distinct !DILexicalBlock(scope: !806, file: !109, line: 284, column: 17)
!837 = !DILocation(line: 284, column: 21, scope: !836)
!838 = !DILocation(line: 284, column: 17, scope: !806)
!839 = !DILocalVariable(name: "errbuf", scope: !840, file: !109, line: 285, type: !841)
!840 = distinct !DILexicalBlock(scope: !836, file: !109, line: 284, column: 27)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 800, align: 8, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 100)
!844 = !DILocation(line: 285, column: 22, scope: !840)
!845 = !DILocation(line: 286, column: 26, scope: !840)
!846 = !DILocation(line: 286, column: 24, scope: !840)
!847 = !DILocation(line: 286, column: 21, scope: !840)
!848 = !DILocation(line: 287, column: 29, scope: !840)
!849 = !DILocation(line: 287, column: 34, scope: !840)
!850 = !DILocation(line: 287, column: 17, scope: !840)
!851 = !DILocation(line: 288, column: 21, scope: !852)
!852 = distinct !DILexicalBlock(scope: !840, file: !109, line: 288, column: 21)
!853 = !DILocation(line: 288, column: 21, scope: !840)
!854 = !DILocation(line: 289, column: 28, scope: !852)
!855 = !DILocation(line: 291, column: 28, scope: !852)
!856 = !DILocation(line: 291, column: 31, scope: !852)
!857 = !DILocation(line: 291, column: 41, scope: !852)
!858 = !DILocation(line: 289, column: 21, scope: !852)
!859 = !DILocation(line: 293, column: 28, scope: !852)
!860 = !DILocation(line: 294, column: 28, scope: !852)
!861 = !DILocation(line: 294, column: 31, scope: !852)
!862 = !DILocation(line: 294, column: 41, scope: !852)
!863 = !DILocation(line: 293, column: 21, scope: !852)
!864 = !DILocation(line: 295, column: 13, scope: !840)
!865 = !DILocation(line: 284, column: 24, scope: !866)
!866 = !DILexicalBlockFile(scope: !836, file: !109, discriminator: 1)
!867 = !DILocation(line: 297, column: 20, scope: !806)
!868 = !DILocation(line: 297, column: 13, scope: !806)
!869 = !DILocation(line: 300, column: 12, scope: !761)
!870 = !DILocation(line: 300, column: 5, scope: !761)
!871 = !DILocation(line: 301, column: 1, scope: !761)
!872 = distinct !DISubprogram(name: "ff_connect_parallel", scope: !109, file: !109, line: 403, type: !873, isLocal: false, isDefinition: true, scopeLine: 406, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !112)
!873 = !DISubroutineType(types: !874)
!874 = !{!59, !875, !59, !59, !420, !564, !887, !104}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64, align: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", file: !877, line: 567, size: 384, align: 64, elements: !878)
!877 = !DIFile(filename: "/usr/include/netdb.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !876, file: !877, line: 569, baseType: !59, size: 32, align: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !876, file: !877, line: 570, baseType: !59, size: 32, align: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !876, file: !877, line: 571, baseType: !59, size: 32, align: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !876, file: !877, line: 572, baseType: !59, size: 32, align: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !876, file: !877, line: 573, baseType: !373, size: 32, align: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !876, file: !877, line: 574, baseType: !283, size: 64, align: 64, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !876, file: !877, line: 575, baseType: !582, size: 64, align: 64, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !876, file: !877, line: 576, baseType: !875, size: 64, align: 64, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!888 = !DISubroutineType(types: !889)
!889 = !{null, !104, !59}
!890 = !DILocalVariable(name: "addrs", arg: 1, scope: !872, file: !109, line: 403, type: !875)
!891 = !DILocation(line: 403, column: 42, scope: !872)
!892 = !DILocalVariable(name: "timeout_ms_per_address", arg: 2, scope: !872, file: !109, line: 403, type: !59)
!893 = !DILocation(line: 403, column: 53, scope: !872)
!894 = !DILocalVariable(name: "parallel", arg: 3, scope: !872, file: !109, line: 404, type: !59)
!895 = !DILocation(line: 404, column: 29, scope: !872)
!896 = !DILocalVariable(name: "h", arg: 4, scope: !872, file: !109, line: 404, type: !420)
!897 = !DILocation(line: 404, column: 51, scope: !872)
!898 = !DILocalVariable(name: "fd", arg: 5, scope: !872, file: !109, line: 404, type: !564)
!899 = !DILocation(line: 404, column: 59, scope: !872)
!900 = !DILocalVariable(name: "customize_fd", arg: 6, scope: !872, file: !109, line: 405, type: !887)
!901 = !DILocation(line: 405, column: 32, scope: !872)
!902 = !DILocalVariable(name: "customize_ctx", arg: 7, scope: !872, file: !109, line: 405, type: !104)
!903 = !DILocation(line: 405, column: 66, scope: !872)
!904 = !DILocalVariable(name: "attempts", scope: !872, file: !109, line: 407, type: !905)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 576, align: 64, elements: !911)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionAttempt", file: !109, line: 348, size: 192, align: 64, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !906, file: !109, line: 349, baseType: !59, size: 32, align: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "deadline_us", scope: !906, file: !109, line: 350, baseType: !167, size: 64, align: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !906, file: !109, line: 351, baseType: !875, size: 64, align: 64, offset: 128)
!911 = !{!912}
!912 = !DISubrange(count: 3)
!913 = !DILocation(line: 407, column: 30, scope: !872)
!914 = !DILocalVariable(name: "pfd", scope: !872, file: !109, line: 408, type: !915)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 192, align: 32, elements: !911)
!916 = !DILocation(line: 408, column: 19, scope: !872)
!917 = !DILocalVariable(name: "nb_attempts", scope: !872, file: !109, line: 409, type: !59)
!918 = !DILocation(line: 409, column: 9, scope: !872)
!919 = !DILocalVariable(name: "i", scope: !872, file: !109, line: 409, type: !59)
!920 = !DILocation(line: 409, column: 26, scope: !872)
!921 = !DILocalVariable(name: "j", scope: !872, file: !109, line: 409, type: !59)
!922 = !DILocation(line: 409, column: 29, scope: !872)
!923 = !DILocalVariable(name: "next_attempt_us", scope: !872, file: !109, line: 410, type: !167)
!924 = !DILocation(line: 410, column: 13, scope: !872)
!925 = !DILocation(line: 410, column: 31, scope: !872)
!926 = !DILocalVariable(name: "next_deadline_us", scope: !872, file: !109, line: 410, type: !167)
!927 = !DILocation(line: 410, column: 54, scope: !872)
!928 = !DILocalVariable(name: "last_err", scope: !872, file: !109, line: 411, type: !59)
!929 = !DILocation(line: 411, column: 9, scope: !872)
!930 = !DILocalVariable(name: "optlen", scope: !872, file: !109, line: 412, type: !373)
!931 = !DILocation(line: 412, column: 15, scope: !872)
!932 = !DILocalVariable(name: "errbuf", scope: !872, file: !109, line: 413, type: !841)
!933 = !DILocation(line: 413, column: 10, scope: !872)
!934 = !DILocalVariable(name: "hostbuf", scope: !872, file: !109, line: 413, type: !841)
!935 = !DILocation(line: 413, column: 23, scope: !872)
!936 = !DILocalVariable(name: "portbuf", scope: !872, file: !109, line: 413, type: !937)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 160, align: 8, elements: !938)
!938 = !{!939}
!939 = !DISubrange(count: 20)
!940 = !DILocation(line: 413, column: 37, scope: !872)
!941 = !DILocation(line: 415, column: 9, scope: !942)
!942 = distinct !DILexicalBlock(scope: !872, file: !109, line: 415, column: 9)
!943 = !DILocation(line: 415, column: 18, scope: !942)
!944 = !DILocation(line: 415, column: 9, scope: !872)
!945 = !DILocation(line: 416, column: 18, scope: !942)
!946 = !DILocation(line: 416, column: 9, scope: !942)
!947 = !DILocation(line: 418, column: 24, scope: !872)
!948 = !DILocation(line: 418, column: 27, scope: !872)
!949 = !DILocation(line: 418, column: 5, scope: !872)
!950 = !DILocation(line: 422, column: 25, scope: !872)
!951 = !DILocation(line: 422, column: 5, scope: !872)
!952 = !DILocation(line: 423, column: 24, scope: !872)
!953 = !DILocation(line: 423, column: 27, scope: !872)
!954 = !DILocation(line: 423, column: 5, scope: !872)
!955 = !DILocation(line: 425, column: 5, scope: !872)
!956 = !DILocation(line: 425, column: 12, scope: !957)
!957 = !DILexicalBlockFile(scope: !872, file: !109, discriminator: 1)
!958 = !DILocation(line: 425, column: 24, scope: !957)
!959 = !DILocation(line: 425, column: 28, scope: !957)
!960 = !DILocation(line: 425, column: 31, scope: !961)
!961 = !DILexicalBlockFile(scope: !872, file: !109, discriminator: 2)
!962 = !DILocation(line: 425, column: 28, scope: !961)
!963 = !DILocation(line: 425, column: 5, scope: !964)
!964 = !DILexicalBlockFile(scope: !872, file: !109, discriminator: 3)
!965 = !DILocation(line: 427, column: 13, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !109, line: 427, column: 13)
!967 = distinct !DILexicalBlock(scope: !872, file: !109, line: 425, column: 38)
!968 = !DILocation(line: 427, column: 27, scope: !966)
!969 = !DILocation(line: 427, column: 25, scope: !966)
!970 = !DILocation(line: 427, column: 36, scope: !966)
!971 = !DILocation(line: 427, column: 39, scope: !972)
!972 = !DILexicalBlockFile(scope: !966, file: !109, discriminator: 1)
