; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_parse.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--hevc_parse.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HEVCParamSets = type { [16 x %struct.AVBufferRef*], [16 x %struct.AVBufferRef*], [64 x %struct.AVBufferRef*], %struct.HEVCVPS*, %struct.HEVCSPS*, %struct.HEVCPPS* }
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque
%struct.HEVCVPS = type { i8, i32, i32, %struct.PTL, i32, [7 x i32], [7 x i32], [7 x i32], i32, i32, i8, i32, i32, i8, i32, i32, [4096 x i8], i32 }
%struct.PTL = type { %struct.PTLCommon, [7 x %struct.PTLCommon], [7 x i8], [7 x i8] }
%struct.PTLCommon = type { i8, i8, i8, [32 x i8], i8, i8, i8, i8, i8 }
%struct.HEVCSPS = type { i32, i32, i8, %struct.HEVCWindow, %struct.HEVCWindow, i32, i32, i32, i32, i32, i32, i32, [7 x %struct.anon], i8, %struct.VUI, %struct.PTL, i8, %struct.ScalingList, i32, [64 x %struct.ShortTermRPS], i8, i8, i8, [32 x i16], [32 x i8], i8, %struct.anon.0, i8, i8, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [3 x i32], [3 x i32], i32, [4096 x i8], i32 }
%struct.HEVCWindow = type { i32, i32, i32, i32 }
%struct.anon = type { i32, i32, i32 }

!627 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_PGS_SUBTITLE", value: 94214)
!628 = !DIEnumerator(name: "AV_CODEC_ID_DVB_TELETEXT", value: 94215)
!629 = !DIEnumerator(name: "AV_CODEC_ID_SRT", value: 94216)
!630 = !DIEnumerator(name: "AV_CODEC_ID_MICRODVD", value: 96256)
!631 = !DIEnumerator(name: "AV_CODEC_ID_EIA_608", value: 96257)
!632 = !DIEnumerator(name: "AV_CODEC_ID_JACOSUB", value: 96258)
!633 = !DIEnumerator(name: "AV_CODEC_ID_SAMI", value: 96259)
!634 = !DIEnumerator(name: "AV_CODEC_ID_REALTEXT", value: 96260)
!635 = !DIEnumerator(name: "AV_CODEC_ID_STL", value: 96261)
!636 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER1", value: 96262)
!637 = !DIEnumerator(name: "AV_CODEC_ID_SUBVIEWER", value: 96263)
!638 = !DIEnumerator(name: "AV_CODEC_ID_SUBRIP", value: 96264)
!639 = !DIEnumerator(name: "AV_CODEC_ID_WEBVTT", value: 96265)
!640 = !DIEnumerator(name: "AV_CODEC_ID_MPL2", value: 96266)
!641 = !DIEnumerator(name: "AV_CODEC_ID_VPLAYER", value: 96267)
!642 = !DIEnumerator(name: "AV_CODEC_ID_PJS", value: 96268)
!643 = !DIEnumerator(name: "AV_CODEC_ID_ASS", value: 96269)
!644 = !DIEnumerator(name: "AV_CODEC_ID_HDMV_TEXT_SUBTITLE", value: 96270)
!645 = !DIEnumerator(name: "AV_CODEC_ID_TTML", value: 96271)
!646 = !DIEnumerator(name: "AV_CODEC_ID_ARIB_CAPTION", value: 96272)
!647 = !DIEnumerator(name: "AV_CODEC_ID_FIRST_UNKNOWN", value: 98304)
!648 = !DIEnumerator(name: "AV_CODEC_ID_TTF", value: 98304)
!649 = !DIEnumerator(name: "AV_CODEC_ID_SCTE_35", value: 98305)
!650 = !DIEnumerator(name: "AV_CODEC_ID_BINTEXT", value: 100352)
!651 = !DIEnumerator(name: "AV_CODEC_ID_XBIN", value: 100353)
!652 = !DIEnumerator(name: "AV_CODEC_ID_IDF", value: 100354)
!653 = !DIEnumerator(name: "AV_CODEC_ID_OTF", value: 100355)
!654 = !DIEnumerator(name: "AV_CODEC_ID_SMPTE_KLV", value: 100356)
!655 = !DIEnumerator(name: "AV_CODEC_ID_DVD_NAV", value: 100357)
!656 = !DIEnumerator(name: "AV_CODEC_ID_TIMED_ID3", value: 100358)
!657 = !DIEnumerator(name: "AV_CODEC_ID_BIN_DATA", value: 100359)
!658 = !DIEnumerator(name: "AV_CODEC_ID_PROBE", value: 102400)
!659 = !DIEnumerator(name: "AV_CODEC_ID_MPEG2TS", value: 131072)
!660 = !DIEnumerator(name: "AV_CODEC_ID_MPEG4SYSTEMS", value: 131073)
!661 = !DIEnumerator(name: "AV_CODEC_ID_FFMETADATA", value: 135168)
!662 = !DIEnumerator(name: "AV_CODEC_ID_WRAPPED_AVFRAME", value: 135169)
!663 = !{!664, !665, !666, !667, !672}
!664 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!665 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64, align: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !670, line: 48, baseType: !671)
!670 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!671 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !675, line: 222, size: 16, align: 8, elements: !676)
!675 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !674, file: !675, line: 222, baseType: !678, size: 16, align: 16)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !670, line: 49, baseType: !679)
!679 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!680 = !{i32 2, !"Dwarf Version", i32 4}
!681 = !{i32 2, !"Debug Info Version", i32 3}
!682 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!683 = distinct !DISubprogram(name: "ff_hevc_decode_extradata", scope: !684, file: !684, line: 78, type: !685, isLocal: false, isDefinition: true, scopeLine: 81, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!684 = !DIFile(filename: "libavcodec/hevc_parse.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!685 = !DISubroutineType(types: !686)
!686 = !{!664, !667, !664, !687, !998, !989, !989, !664, !664, !666}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCParamSets", file: !689, line: 408, baseType: !690)
!689 = !DIFile(filename: "libavcodec/hevc_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCParamSets", file: !689, line: 399, size: 6336, align: 64, elements: !691)
!691 = !{!692, !708, !709, !713, !768, !927}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "vps_list", scope: !690, file: !689, line: 400, baseType: !693, size: 1024, align: 64)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 1024, align: 64, elements: !706)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !696, line: 94, baseType: !697)
!696 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !696, line: 81, size: 192, align: 64, elements: !698)
!698 = !{!699, !703, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !697, file: !696, line: 82, baseType: !700, size: 64, align: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !696, line: 73, baseType: !702)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !696, line: 73, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !697, file: !696, line: 89, baseType: !704, size: 64, align: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64, align: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !697, file: !696, line: 93, baseType: !664, size: 32, align: 32, offset: 128)
!706 = !{!707}
!707 = !DISubrange(count: 16)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "sps_list", scope: !690, file: !689, line: 401, baseType: !693, size: 1024, align: 64, offset: 1024)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "pps_list", scope: !690, file: !689, line: 402, baseType: !710, size: 4096, align: 64, offset: 2048)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !694, size: 4096, align: 64, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vps", scope: !690, file: !689, line: 405, baseType: !714, size: 64, align: 64, offset: 6144)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCVPS", file: !689, line: 216, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCVPS", file: !689, line: 195, size: 36544, align: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !749, !750, !752, !753, !754, !755, !756, !757, !759, !760, !761, !762, !763, !767}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vps_temporal_id_nesting_flag", scope: !717, file: !689, line: 196, baseType: !669, size: 8, align: 8)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layers", scope: !717, file: !689, line: 197, baseType: !664, size: 32, align: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_sub_layers", scope: !717, file: !689, line: 198, baseType: !664, size: 32, align: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !717, file: !689, line: 200, baseType: !723, size: 2672, align: 8, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTL", file: !689, line: 193, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTL", file: !689, line: 187, size: 2672, align: 8, elements: !725)
!725 = !{!726, !742, !746, !748}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "general_ptl", scope: !724, file: !689, line: 188, baseType: !727, size: 320, align: 8)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "PTLCommon", file: !689, line: 185, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PTLCommon", file: !689, line: 175, size: 320, align: 8, elements: !729)
!729 = !{!730, !731, !732, !733, !737, !738, !739, !740, !741}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "profile_space", scope: !728, file: !689, line: 176, baseType: !669, size: 8, align: 8)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tier_flag", scope: !728, file: !689, line: 177, baseType: !669, size: 8, align: 8, offset: 8)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !728, file: !689, line: 178, baseType: !669, size: 8, align: 8, offset: 16)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "profile_compatibility_flag", scope: !728, file: !689, line: 179, baseType: !734, size: 256, align: 8, offset: 24)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 256, align: 8, elements: !735)
!735 = !{!736}
!736 = !DISubrange(count: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !728, file: !689, line: 180, baseType: !669, size: 8, align: 8, offset: 280)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "progressive_source_flag", scope: !728, file: !689, line: 181, baseType: !669, size: 8, align: 8, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_source_flag", scope: !728, file: !689, line: 182, baseType: !669, size: 8, align: 8, offset: 296)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "non_packed_constraint_flag", scope: !728, file: !689, line: 183, baseType: !669, size: 8, align: 8, offset: 304)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "frame_only_constraint_flag", scope: !728, file: !689, line: 184, baseType: !669, size: 8, align: 8, offset: 312)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_ptl", scope: !724, file: !689, line: 189, baseType: !743, size: 2240, align: 8, offset: 320)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 2240, align: 8, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 7)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_profile_present_flag", scope: !724, file: !689, line: 191, baseType: !747, size: 56, align: 8, offset: 2560)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 56, align: 8, elements: !744)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sub_layer_level_present_flag", scope: !724, file: !689, line: 192, baseType: !747, size: 56, align: 8, offset: 2616)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "vps_sub_layer_ordering_info_present_flag", scope: !717, file: !689, line: 201, baseType: !664, size: 32, align: 32, offset: 2784)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_dec_pic_buffering", scope: !717, file: !689, line: 202, baseType: !751, size: 224, align: 32, offset: 2816)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 224, align: 32, elements: !744)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_reorder_pics", scope: !717, file: !689, line: 203, baseType: !751, size: 224, align: 32, offset: 3040)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_latency_increase", scope: !717, file: !689, line: 204, baseType: !751, size: 224, align: 32, offset: 3264)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "vps_max_layer_id", scope: !717, file: !689, line: 205, baseType: !664, size: 32, align: 32, offset: 3488)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_layer_sets", scope: !717, file: !689, line: 206, baseType: !664, size: 32, align: 32, offset: 3520)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "vps_timing_info_present_flag", scope: !717, file: !689, line: 207, baseType: !669, size: 8, align: 8, offset: 3552)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_units_in_tick", scope: !717, file: !689, line: 208, baseType: !758, size: 32, align: 32, offset: 3584)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !670, line: 51, baseType: !665)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "vps_time_scale", scope: !717, file: !689, line: 209, baseType: !758, size: 32, align: 32, offset: 3616)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vps_poc_proportional_to_timing_flag", scope: !717, file: !689, line: 210, baseType: !669, size: 8, align: 8, offset: 3648)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_ticks_poc_diff_one", scope: !717, file: !689, line: 211, baseType: !664, size: 32, align: 32, offset: 3680)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "vps_num_hrd_parameters", scope: !717, file: !689, line: 212, baseType: !664, size: 32, align: 32, offset: 3712)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !717, file: !689, line: 214, baseType: !764, size: 32768, align: 8, offset: 3744)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 32768, align: 8, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 4096)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !717, file: !689, line: 215, baseType: !664, size: 32, align: 32, offset: 36512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sps", scope: !690, file: !689, line: 406, baseType: !769, size: 64, align: 64, offset: 6208)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64, align: 64)
!770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSPS", file: !689, line: 319, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSPS", file: !689, line: 225, size: 140544, align: 32, elements: !773)
!773 = !{!774, !775, !776, !777, !785, !786, !787, !788, !789, !790, !791, !792, !793, !800, !801, !844, !845, !846, !859, !860, !872, !873, !874, !875, !877, !878, !879, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !923, !924, !925, !926}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "vps_id", scope: !772, file: !689, line: 226, baseType: !665, size: 32, align: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !772, file: !689, line: 227, baseType: !664, size: 32, align: 32, offset: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "separate_colour_plane_flag", scope: !772, file: !689, line: 228, baseType: !669, size: 8, align: 8, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "output_window", scope: !772, file: !689, line: 230, baseType: !778, size: 128, align: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCWindow", file: !689, line: 130, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCWindow", file: !689, line: 125, size: 128, align: 32, elements: !780)
!780 = !{!781, !782, !783, !784}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "left_offset", scope: !779, file: !689, line: 126, baseType: !665, size: 32, align: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "right_offset", scope: !779, file: !689, line: 127, baseType: !665, size: 32, align: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "top_offset", scope: !779, file: !689, line: 128, baseType: !665, size: 32, align: 32, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bottom_offset", scope: !779, file: !689, line: 129, baseType: !665, size: 32, align: 32, offset: 96)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "pic_conf_win", scope: !772, file: !689, line: 232, baseType: !778, size: 128, align: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !772, file: !689, line: 234, baseType: !664, size: 32, align: 32, offset: 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !772, file: !689, line: 235, baseType: !664, size: 32, align: 32, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_shift", scope: !772, file: !689, line: 236, baseType: !664, size: 32, align: 32, offset: 416)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !772, file: !689, line: 237, baseType: !3, size: 32, align: 32, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !772, file: !689, line: 239, baseType: !665, size: 32, align: 32, offset: 480)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pcm_enabled_flag", scope: !772, file: !689, line: 240, baseType: !664, size: 32, align: 32, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "max_sub_layers", scope: !772, file: !689, line: 242, baseType: !664, size: 32, align: 32, offset: 544)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_layer", scope: !772, file: !689, line: 247, baseType: !794, size: 672, align: 32, offset: 576)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 672, align: 32, elements: !744)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !689, line: 243, size: 96, align: 32, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "max_dec_pic_buffering", scope: !795, file: !689, line: 244, baseType: !664, size: 32, align: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_pics", scope: !795, file: !689, line: 245, baseType: !664, size: 32, align: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "max_latency_increase", scope: !795, file: !689, line: 246, baseType: !664, size: 32, align: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id_nesting_flag", scope: !772, file: !689, line: 248, baseType: !669, size: 8, align: 8, offset: 1248)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vui", scope: !772, file: !689, line: 250, baseType: !802, size: 1120, align: 32, offset: 1280)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "VUI", file: !689, line: 173, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VUI", file: !689, line: 132, size: 1120, align: 32, elements: !804)
!804 = !{!805, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !803, file: !689, line: 133, baseType: !806, size: 64, align: 32)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !807, line: 61, baseType: !808)
!807 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !807, line: 58, size: 64, align: 32, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !808, file: !807, line: 59, baseType: !664, size: 32, align: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !808, file: !807, line: 60, baseType: !664, size: 32, align: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_info_present_flag", scope: !803, file: !689, line: 135, baseType: !664, size: 32, align: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "overscan_appropriate_flag", scope: !803, file: !689, line: 136, baseType: !664, size: 32, align: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !803, file: !689, line: 138, baseType: !664, size: 32, align: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "video_format", scope: !803, file: !689, line: 139, baseType: !664, size: 32, align: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "video_full_range_flag", scope: !803, file: !689, line: 140, baseType: !664, size: 32, align: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !803, file: !689, line: 141, baseType: !664, size: 32, align: 32, offset: 224)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "colour_primaries", scope: !803, file: !689, line: 142, baseType: !669, size: 8, align: 8, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_characteristic", scope: !803, file: !689, line: 143, baseType: !669, size: 8, align: 8, offset: 264)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "matrix_coeffs", scope: !803, file: !689, line: 144, baseType: !669, size: 8, align: 8, offset: 272)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_loc_info_present_flag", scope: !803, file: !689, line: 146, baseType: !664, size: 32, align: 32, offset: 288)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_top_field", scope: !803, file: !689, line: 147, baseType: !664, size: 32, align: 32, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_loc_type_bottom_field", scope: !803, file: !689, line: 148, baseType: !664, size: 32, align: 32, offset: 352)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "neutra_chroma_indication_flag", scope: !803, file: !689, line: 149, baseType: !664, size: 32, align: 32, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "field_seq_flag", scope: !803, file: !689, line: 151, baseType: !664, size: 32, align: 32, offset: 416)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "frame_field_info_present_flag", scope: !803, file: !689, line: 152, baseType: !664, size: 32, align: 32, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "default_display_window_flag", scope: !803, file: !689, line: 154, baseType: !664, size: 32, align: 32, offset: 480)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "def_disp_win", scope: !803, file: !689, line: 155, baseType: !778, size: 128, align: 32, offset: 512)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "vui_timing_info_present_flag", scope: !803, file: !689, line: 157, baseType: !664, size: 32, align: 32, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_units_in_tick", scope: !803, file: !689, line: 158, baseType: !758, size: 32, align: 32, offset: 672)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "vui_time_scale", scope: !803, file: !689, line: 159, baseType: !758, size: 32, align: 32, offset: 704)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "vui_poc_proportional_to_timing_flag", scope: !803, file: !689, line: 160, baseType: !664, size: 32, align: 32, offset: 736)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "vui_num_ticks_poc_diff_one_minus1", scope: !803, file: !689, line: 161, baseType: !664, size: 32, align: 32, offset: 768)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "vui_hrd_parameters_present_flag", scope: !803, file: !689, line: 162, baseType: !664, size: 32, align: 32, offset: 800)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !803, file: !689, line: 164, baseType: !664, size: 32, align: 32, offset: 832)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_fixed_structure_flag", scope: !803, file: !689, line: 165, baseType: !664, size: 32, align: 32, offset: 864)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "motion_vectors_over_pic_boundaries_flag", scope: !803, file: !689, line: 166, baseType: !664, size: 32, align: 32, offset: 896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "restricted_ref_pic_lists_flag", scope: !803, file: !689, line: 167, baseType: !664, size: 32, align: 32, offset: 928)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "min_spatial_segmentation_idc", scope: !803, file: !689, line: 168, baseType: !664, size: 32, align: 32, offset: 960)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "max_bytes_per_pic_denom", scope: !803, file: !689, line: 169, baseType: !664, size: 32, align: 32, offset: 992)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "max_bits_per_min_cu_denom", scope: !803, file: !689, line: 170, baseType: !664, size: 32, align: 32, offset: 1024)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_horizontal", scope: !803, file: !689, line: 171, baseType: !664, size: 32, align: 32, offset: 1056)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_mv_length_vertical", scope: !803, file: !689, line: 172, baseType: !664, size: 32, align: 32, offset: 1088)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ptl", scope: !772, file: !689, line: 251, baseType: !723, size: 2672, align: 8, offset: 2400)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_enable_flag", scope: !772, file: !689, line: 253, baseType: !669, size: 8, align: 8, offset: 5072)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !772, file: !689, line: 254, baseType: !847, size: 12384, align: 8, offset: 5080)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScalingList", file: !689, line: 223, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScalingList", file: !689, line: 218, size: 12384, align: 8, elements: !849)
!849 = !{!850, !855}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sl", scope: !848, file: !689, line: 221, baseType: !851, size: 12288, align: 8)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 12288, align: 8, elements: !852)
!852 = !{!853, !854, !712}
!853 = !DISubrange(count: 4)
!854 = !DISubrange(count: 6)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sl_dc", scope: !848, file: !689, line: 222, baseType: !856, size: 96, align: 8, offset: 12288)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 96, align: 8, elements: !857)
!857 = !{!858, !854}
!858 = !DISubrange(count: 2)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nb_st_rps", scope: !772, file: !689, line: 256, baseType: !665, size: 32, align: 32, offset: 17472)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "st_rps", scope: !772, file: !689, line: 257, baseType: !861, size: 88064, align: 32, offset: 17504)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 88064, align: 32, elements: !711)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "ShortTermRPS", file: !689, line: 40, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShortTermRPS", file: !689, line: 34, size: 1376, align: 32, elements: !864)
!864 = !{!865, !866, !867, !868, !871}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "num_negative_pics", scope: !863, file: !689, line: 35, baseType: !665, size: 32, align: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "num_delta_pocs", scope: !863, file: !689, line: 36, baseType: !664, size: 32, align: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rps_idx_num_delta_pocs", scope: !863, file: !689, line: 37, baseType: !664, size: 32, align: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "delta_poc", scope: !863, file: !689, line: 38, baseType: !869, size: 1024, align: 32, offset: 96)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 1024, align: 32, elements: !735)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !670, line: 38, baseType: !664)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !863, file: !689, line: 39, baseType: !734, size: 256, align: 8, offset: 1120)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "amp_enabled_flag", scope: !772, file: !689, line: 259, baseType: !669, size: 8, align: 8, offset: 105568)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "sao_enabled", scope: !772, file: !689, line: 260, baseType: !669, size: 8, align: 8, offset: 105576)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "long_term_ref_pics_present_flag", scope: !772, file: !689, line: 262, baseType: !669, size: 8, align: 8, offset: 105584)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lt_ref_pic_poc_lsb_sps", scope: !772, file: !689, line: 263, baseType: !876, size: 512, align: 16, offset: 105600)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 512, align: 16, elements: !735)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "used_by_curr_pic_lt_sps_flag", scope: !772, file: !689, line: 264, baseType: !734, size: 256, align: 8, offset: 106112)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "num_long_term_ref_pics_sps", scope: !772, file: !689, line: 265, baseType: !669, size: 8, align: 8, offset: 106368)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pcm", scope: !772, file: !689, line: 273, baseType: !880, size: 128, align: 32, offset: 106400)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !689, line: 267, size: 128, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !880, file: !689, line: 268, baseType: !669, size: 8, align: 8)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !880, file: !689, line: 269, baseType: !669, size: 8, align: 8, offset: 8)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pcm_cb_size", scope: !880, file: !689, line: 270, baseType: !665, size: 32, align: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_pcm_cb_size", scope: !880, file: !689, line: 271, baseType: !665, size: 32, align: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_disable_flag", scope: !880, file: !689, line: 272, baseType: !669, size: 8, align: 8, offset: 96)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "sps_temporal_mvp_enabled_flag", scope: !772, file: !689, line: 274, baseType: !669, size: 8, align: 8, offset: 106528)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "sps_strong_intra_smoothing_enable_flag", scope: !772, file: !689, line: 275, baseType: !669, size: 8, align: 8, offset: 106536)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_cb_size", scope: !772, file: !689, line: 277, baseType: !665, size: 32, align: 32, offset: 106560)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "log2_diff_max_min_coding_block_size", scope: !772, file: !689, line: 278, baseType: !665, size: 32, align: 32, offset: 106592)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_tb_size", scope: !772, file: !689, line: 279, baseType: !665, size: 32, align: 32, offset: 106624)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_trafo_size", scope: !772, file: !689, line: 280, baseType: !665, size: 32, align: 32, offset: 106656)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "log2_ctb_size", scope: !772, file: !689, line: 281, baseType: !665, size: 32, align: 32, offset: 106688)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "log2_min_pu_size", scope: !772, file: !689, line: 282, baseType: !665, size: 32, align: 32, offset: 106720)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_inter", scope: !772, file: !689, line: 284, baseType: !664, size: 32, align: 32, offset: 106752)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "max_transform_hierarchy_depth_intra", scope: !772, file: !689, line: 285, baseType: !664, size: 32, align: 32, offset: 106784)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "sps_range_extension_flag", scope: !772, file: !689, line: 287, baseType: !664, size: 32, align: 32, offset: 106816)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_rotation_enabled_flag", scope: !772, file: !689, line: 288, baseType: !664, size: 32, align: 32, offset: 106848)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_context_enabled_flag", scope: !772, file: !689, line: 289, baseType: !664, size: 32, align: 32, offset: 106880)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "implicit_rdpcm_enabled_flag", scope: !772, file: !689, line: 290, baseType: !664, size: 32, align: 32, offset: 106912)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "explicit_rdpcm_enabled_flag", scope: !772, file: !689, line: 291, baseType: !664, size: 32, align: 32, offset: 106944)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "extended_precision_processing_flag", scope: !772, file: !689, line: 292, baseType: !664, size: 32, align: 32, offset: 106976)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "intra_smoothing_disabled_flag", scope: !772, file: !689, line: 293, baseType: !664, size: 32, align: 32, offset: 107008)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "high_precision_offsets_enabled_flag", scope: !772, file: !689, line: 294, baseType: !664, size: 32, align: 32, offset: 107040)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "persistent_rice_adaptation_enabled_flag", scope: !772, file: !689, line: 295, baseType: !664, size: 32, align: 32, offset: 107072)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_bypass_alignment_enabled_flag", scope: !772, file: !689, line: 296, baseType: !664, size: 32, align: 32, offset: 107104)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !772, file: !689, line: 299, baseType: !664, size: 32, align: 32, offset: 107136)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !772, file: !689, line: 300, baseType: !664, size: 32, align: 32, offset: 107168)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_width", scope: !772, file: !689, line: 301, baseType: !664, size: 32, align: 32, offset: 107200)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_height", scope: !772, file: !689, line: 302, baseType: !664, size: 32, align: 32, offset: 107232)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_size", scope: !772, file: !689, line: 303, baseType: !664, size: 32, align: 32, offset: 107264)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_width", scope: !772, file: !689, line: 304, baseType: !664, size: 32, align: 32, offset: 107296)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "min_cb_height", scope: !772, file: !689, line: 305, baseType: !664, size: 32, align: 32, offset: 107328)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_width", scope: !772, file: !689, line: 306, baseType: !664, size: 32, align: 32, offset: 107360)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_height", scope: !772, file: !689, line: 307, baseType: !664, size: 32, align: 32, offset: 107392)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_width", scope: !772, file: !689, line: 308, baseType: !664, size: 32, align: 32, offset: 107424)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "min_pu_height", scope: !772, file: !689, line: 309, baseType: !664, size: 32, align: 32, offset: 107456)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "tb_mask", scope: !772, file: !689, line: 310, baseType: !664, size: 32, align: 32, offset: 107488)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "hshift", scope: !772, file: !689, line: 312, baseType: !920, size: 96, align: 32, offset: 107520)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 96, align: 32, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 3)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "vshift", scope: !772, file: !689, line: 313, baseType: !920, size: 96, align: 32, offset: 107616)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "qp_bd_offset", scope: !772, file: !689, line: 315, baseType: !664, size: 32, align: 32, offset: 107712)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !772, file: !689, line: 317, baseType: !764, size: 32768, align: 8, offset: 107744)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !772, file: !689, line: 318, baseType: !664, size: 32, align: 32, offset: 140512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pps", scope: !690, file: !689, line: 407, baseType: !928, size: 64, align: 64, offset: 6272)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCPPS", file: !689, line: 397, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCPPS", file: !689, line: 321, size: 46784, align: 64, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !980, !981, !982, !983, !985, !986, !987, !988, !990, !991, !992, !993, !994, !995, !996, !997}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !931, file: !689, line: 322, baseType: !665, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "sign_data_hiding_flag", scope: !931, file: !689, line: 324, baseType: !669, size: 8, align: 8, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cabac_init_present_flag", scope: !931, file: !689, line: 326, baseType: !669, size: 8, align: 8, offset: 40)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l0_default_active", scope: !931, file: !689, line: 328, baseType: !664, size: 32, align: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "num_ref_idx_l1_default_active", scope: !931, file: !689, line: 329, baseType: !664, size: 32, align: 32, offset: 96)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "pic_init_qp_minus26", scope: !931, file: !689, line: 330, baseType: !664, size: 32, align: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred_flag", scope: !931, file: !689, line: 332, baseType: !669, size: 8, align: 8, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "transform_skip_enabled_flag", scope: !931, file: !689, line: 333, baseType: !669, size: 8, align: 8, offset: 168)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "cu_qp_delta_enabled_flag", scope: !931, file: !689, line: 335, baseType: !669, size: 8, align: 8, offset: 176)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_qp_delta_depth", scope: !931, file: !689, line: 336, baseType: !664, size: 32, align: 32, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset", scope: !931, file: !689, line: 338, baseType: !664, size: 32, align: 32, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset", scope: !931, file: !689, line: 339, baseType: !664, size: 32, align: 32, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "pic_slice_level_chroma_qp_offsets_present_flag", scope: !931, file: !689, line: 340, baseType: !669, size: 8, align: 8, offset: 288)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred_flag", scope: !931, file: !689, line: 341, baseType: !669, size: 8, align: 8, offset: 296)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_flag", scope: !931, file: !689, line: 342, baseType: !669, size: 8, align: 8, offset: 304)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "output_flag_present_flag", scope: !931, file: !689, line: 343, baseType: !669, size: 8, align: 8, offset: 312)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "transquant_bypass_enable_flag", scope: !931, file: !689, line: 344, baseType: !669, size: 8, align: 8, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dependent_slice_segments_enabled_flag", scope: !931, file: !689, line: 346, baseType: !669, size: 8, align: 8, offset: 328)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tiles_enabled_flag", scope: !931, file: !689, line: 347, baseType: !669, size: 8, align: 8, offset: 336)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "entropy_coding_sync_enabled_flag", scope: !931, file: !689, line: 348, baseType: !669, size: 8, align: 8, offset: 344)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_columns", scope: !931, file: !689, line: 350, baseType: !664, size: 32, align: 32, offset: 352)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "num_tile_rows", scope: !931, file: !689, line: 351, baseType: !664, size: 32, align: 32, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "uniform_spacing_flag", scope: !931, file: !689, line: 352, baseType: !669, size: 8, align: 8, offset: 416)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "loop_filter_across_tiles_enabled_flag", scope: !931, file: !689, line: 353, baseType: !669, size: 8, align: 8, offset: 424)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "seq_loop_filter_across_slices_enabled_flag", scope: !931, file: !689, line: 355, baseType: !669, size: 8, align: 8, offset: 432)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_control_present_flag", scope: !931, file: !689, line: 357, baseType: !669, size: 8, align: 8, offset: 440)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_override_enabled_flag", scope: !931, file: !689, line: 358, baseType: !669, size: 8, align: 8, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "disable_dbf", scope: !931, file: !689, line: 359, baseType: !669, size: 8, align: 8, offset: 456)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "beta_offset", scope: !931, file: !689, line: 360, baseType: !664, size: 32, align: 32, offset: 480)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "tc_offset", scope: !931, file: !689, line: 361, baseType: !664, size: 32, align: 32, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list_data_present_flag", scope: !931, file: !689, line: 363, baseType: !669, size: 8, align: 8, offset: 544)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_list", scope: !931, file: !689, line: 364, baseType: !847, size: 12384, align: 8, offset: 552)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lists_modification_present_flag", scope: !931, file: !689, line: 366, baseType: !669, size: 8, align: 8, offset: 12936)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "log2_parallel_merge_level", scope: !931, file: !689, line: 367, baseType: !664, size: 32, align: 32, offset: 12960)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "num_extra_slice_header_bits", scope: !931, file: !689, line: 368, baseType: !664, size: 32, align: 32, offset: 12992)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "slice_header_extension_present_flag", scope: !931, file: !689, line: 369, baseType: !669, size: 8, align: 8, offset: 13024)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_transform_skip_block_size", scope: !931, file: !689, line: 370, baseType: !669, size: 8, align: 8, offset: 13032)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pps_range_extensions_flag", scope: !931, file: !689, line: 371, baseType: !669, size: 8, align: 8, offset: 13040)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cross_component_prediction_enabled_flag", scope: !931, file: !689, line: 372, baseType: !669, size: 8, align: 8, offset: 13048)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_enabled_flag", scope: !931, file: !689, line: 373, baseType: !669, size: 8, align: 8, offset: 13056)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "diff_cu_chroma_qp_offset_depth", scope: !931, file: !689, line: 374, baseType: !669, size: 8, align: 8, offset: 13064)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_offset_list_len_minus1", scope: !931, file: !689, line: 375, baseType: !669, size: 8, align: 8, offset: 13072)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "cb_qp_offset_list", scope: !931, file: !689, line: 376, baseType: !976, size: 48, align: 8, offset: 13080)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 48, align: 8, elements: !979)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !670, line: 36, baseType: !978)
!978 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!979 = !{!854}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "cr_qp_offset_list", scope: !931, file: !689, line: 377, baseType: !976, size: 48, align: 8, offset: 13128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_luma", scope: !931, file: !689, line: 378, baseType: !669, size: 8, align: 8, offset: 13176)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "log2_sao_offset_scale_chroma", scope: !931, file: !689, line: 379, baseType: !669, size: 8, align: 8, offset: 13184)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "column_width", scope: !931, file: !689, line: 382, baseType: !984, size: 64, align: 64, offset: 13248)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "row_height", scope: !931, file: !689, line: 383, baseType: !984, size: 64, align: 64, offset: 13312)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "col_bd", scope: !931, file: !689, line: 384, baseType: !984, size: 64, align: 64, offset: 13376)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "row_bd", scope: !931, file: !689, line: 385, baseType: !984, size: 64, align: 64, offset: 13440)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "col_idxX", scope: !931, file: !689, line: 386, baseType: !989, size: 64, align: 64, offset: 13504)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_rs_to_ts", scope: !931, file: !689, line: 388, baseType: !989, size: 64, align: 64, offset: 13568)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ctb_addr_ts_to_rs", scope: !931, file: !689, line: 389, baseType: !989, size: 64, align: 64, offset: 13632)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "tile_id", scope: !931, file: !689, line: 390, baseType: !989, size: 64, align: 64, offset: 13696)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "tile_pos_rs", scope: !931, file: !689, line: 391, baseType: !989, size: 64, align: 64, offset: 13760)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs", scope: !931, file: !689, line: 392, baseType: !989, size: 64, align: 64, offset: 13824)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "min_tb_addr_zs_tab", scope: !931, file: !689, line: 393, baseType: !989, size: 64, align: 64, offset: 13888)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !931, file: !689, line: 395, baseType: !764, size: 32768, align: 8, offset: 13952)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !931, file: !689, line: 396, baseType: !664, size: 32, align: 32, offset: 46720)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEI", file: !1000, line: 118, baseType: !1001)
!1000 = !DIFile(filename: "libavcodec/hevc_sei.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEI", file: !1000, line: 108, size: 1280, align: 64, elements: !1002)
!1002 = !{!1003, !1011, !1020, !1028, !1033, !1039, !1052, !1059, !1060}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "picture_hash", scope: !1001, file: !1000, line: 109, baseType: !1004, size: 392, align: 8)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIPictureHash", file: !1000, line: 64, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIPictureHash", file: !1000, line: 61, size: 392, align: 8, elements: !1006)
!1006 = !{!1007, !1010}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !1005, file: !1000, line: 62, baseType: !1008, size: 384, align: 8)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 384, align: 8, elements: !1009)
!1009 = !{!922, !707}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "is_md5", scope: !1005, file: !1000, line: 63, baseType: !669, size: 8, align: 8, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "frame_packing", scope: !1001, file: !1000, line: 110, baseType: !1012, size: 160, align: 32, offset: 416)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIFramePacking", file: !1000, line: 72, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIFramePacking", file: !1000, line: 66, size: 160, align: 32, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1013, file: !1000, line: 67, baseType: !664, size: 32, align: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "arrangement_type", scope: !1013, file: !1000, line: 68, baseType: !664, size: 32, align: 32, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "content_interpretation_type", scope: !1013, file: !1000, line: 69, baseType: !664, size: 32, align: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "quincunx_subsampling", scope: !1013, file: !1000, line: 70, baseType: !664, size: 32, align: 32, offset: 96)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "current_frame_is_frame0_flag", scope: !1013, file: !1000, line: 71, baseType: !664, size: 32, align: 32, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "display_orientation", scope: !1001, file: !1000, line: 111, baseType: !1021, size: 128, align: 32, offset: 576)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIDisplayOrientation", file: !1000, line: 78, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIDisplayOrientation", file: !1000, line: 74, size: 128, align: 32, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1022, file: !1000, line: 75, baseType: !664, size: 32, align: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "anticlockwise_rotation", scope: !1022, file: !1000, line: 76, baseType: !664, size: 32, align: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "hflip", scope: !1022, file: !1000, line: 77, baseType: !664, size: 32, align: 32, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "vflip", scope: !1022, file: !1000, line: 77, baseType: !664, size: 32, align: 32, offset: 96)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "picture_timing", scope: !1001, file: !1000, line: 112, baseType: !1029, size: 32, align: 32, offset: 704)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIPictureTiming", file: !1000, line: 82, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIPictureTiming", file: !1000, line: 80, size: 32, align: 32, elements: !1031)
!1031 = !{!1032}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "picture_struct", scope: !1030, file: !1000, line: 81, baseType: !664, size: 32, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "a53_caption", scope: !1001, file: !1000, line: 113, baseType: !1034, size: 128, align: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIA53Caption", file: !1000, line: 87, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIA53Caption", file: !1000, line: 84, size: 128, align: 64, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "a53_caption_size", scope: !1035, file: !1000, line: 85, baseType: !664, size: 32, align: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "a53_caption", scope: !1035, file: !1000, line: 86, baseType: !704, size: 64, align: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "mastering_display", scope: !1001, file: !1000, line: 114, baseType: !1040, size: 224, align: 32, offset: 896)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIMasteringDisplay", file: !1000, line: 95, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIMasteringDisplay", file: !1000, line: 89, size: 224, align: 32, elements: !1042)
!1042 = !{!1043, !1044, !1047, !1050, !1051}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1041, file: !1000, line: 90, baseType: !664, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "display_primaries", scope: !1041, file: !1000, line: 91, baseType: !1045, size: 96, align: 16, offset: 32)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 96, align: 16, elements: !1046)
!1046 = !{!922, !858}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "white_point", scope: !1041, file: !1000, line: 92, baseType: !1048, size: 32, align: 16, offset: 128)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 32, align: 16, elements: !1049)
!1049 = !{!858}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "max_luminance", scope: !1041, file: !1000, line: 93, baseType: !758, size: 32, align: 32, offset: 160)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "min_luminance", scope: !1041, file: !1000, line: 94, baseType: !758, size: 32, align: 32, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "content_light", scope: !1001, file: !1000, line: 115, baseType: !1053, size: 64, align: 32, offset: 1120)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIContentLight", file: !1000, line: 101, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIContentLight", file: !1000, line: 97, size: 64, align: 32, elements: !1055)
!1055 = !{!1056, !1057, !1058}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1054, file: !1000, line: 98, baseType: !664, size: 32, align: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "max_content_light_level", scope: !1054, file: !1000, line: 99, baseType: !678, size: 16, align: 16, offset: 32)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "max_pic_average_light_level", scope: !1054, file: !1000, line: 100, baseType: !678, size: 16, align: 16, offset: 48)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "active_seq_parameter_set_id", scope: !1001, file: !1000, line: 116, baseType: !664, size: 32, align: 32, offset: 1184)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "alternative_transfer", scope: !1001, file: !1000, line: 117, baseType: !1061, size: 64, align: 32, offset: 1216)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "HEVCSEIAlternativeTransfer", file: !1000, line: 106, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HEVCSEIAlternativeTransfer", file: !1000, line: 103, size: 64, align: 32, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "present", scope: !1062, file: !1000, line: 104, baseType: !664, size: 32, align: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "preferred_transfer_characteristics", scope: !1062, file: !1000, line: 105, baseType: !664, size: 32, align: 32, offset: 32)
!1066 = !{}
!1067 = !DILocalVariable(name: "x", arg: 1, scope: !1068, file: !1069, line: 58, type: !678)
!1068 = distinct !DISubprogram(name: "av_bswap16", scope: !1069, file: !1069, line: 58, type: !1070, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1069 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!678, !678}
!1072 = !DIExpression()
!1073 = !DILocation(line: 58, column: 98, scope: !1068, inlinedAt: !1074)
!1074 = distinct !DILocation(line: 94, column: 118, scope: !1075, inlinedAt: !1080)
!1075 = distinct !DISubprogram(name: "bytestream_get_be16", scope: !1076, file: !1076, line: 94, type: !1077, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1076 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!665, !1079}
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64)
!1080 = distinct !DILocation(line: 94, column: 904, scope: !1081, inlinedAt: !1091)
!1081 = distinct !DISubprogram(name: "bytestream2_get_be16u", scope: !1076, file: !1076, line: 94, type: !1082, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!665, !1084}
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !1076, line: 35, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !1076, line: 33, size: 192, align: 64, elements: !1087)
!1087 = !{!1088, !1089, !1090}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1086, file: !1076, line: 34, baseType: !667, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1086, file: !1076, line: 34, baseType: !667, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !1086, file: !1076, line: 34, baseType: !667, size: 64, align: 64, offset: 128)
!1091 = distinct !DILocation(line: 94, column: 1122, scope: !1092, inlinedAt: !1094)
!1092 = !DILexicalBlockFile(scope: !1093, file: !1076, discriminator: 2)
!1093 = distinct !DISubprogram(name: "bytestream2_get_be16", scope: !1076, file: !1076, line: 94, type: !1082, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1094 = distinct !DILocation(line: 107, column: 23, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1096, file: !684, line: 105, column: 42)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !684, line: 105, column: 9)
!1097 = distinct !DILexicalBlock(scope: !1098, file: !684, line: 105, column: 9)
!1098 = distinct !DILexicalBlock(scope: !1099, file: !684, line: 87, column: 58)
!1099 = distinct !DILexicalBlock(scope: !683, file: !684, line: 87, column: 9)
!1100 = !DILocalVariable(name: "b", arg: 1, scope: !1075, file: !1076, line: 94, type: !1079)
!1101 = !DILocation(line: 94, column: 95, scope: !1075, inlinedAt: !1080)
!1102 = !DILocalVariable(name: "g", arg: 1, scope: !1081, file: !1076, line: 94, type: !1084)
!1103 = !DILocation(line: 94, column: 892, scope: !1081, inlinedAt: !1091)
!1104 = !DILocalVariable(name: "g", arg: 1, scope: !1093, file: !1076, line: 94, type: !1084)
!1105 = !DILocation(line: 94, column: 1034, scope: !1093, inlinedAt: !1094)
!1106 = !DILocation(line: 58, column: 98, scope: !1068, inlinedAt: !1107)
!1107 = distinct !DILocation(line: 94, column: 1303, scope: !1108, inlinedAt: !1110)
!1108 = !DILexicalBlockFile(scope: !1109, file: !1076, discriminator: 2)
!1109 = distinct !DISubprogram(name: "bytestream2_peek_be16", scope: !1076, file: !1076, line: 94, type: !1082, isLocal: true, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1110 = distinct !DILocation(line: 111, column: 31, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !1112, file: !684, line: 109, column: 39)
!1112 = distinct !DILexicalBlock(scope: !1113, file: !684, line: 109, column: 13)
!1113 = distinct !DILexicalBlock(scope: !1095, file: !684, line: 109, column: 13)
!1114 = !DILocalVariable(name: "g", arg: 1, scope: !1109, file: !1076, line: 94, type: !1084)
!1115 = !DILocation(line: 94, column: 1246, scope: !1109, inlinedAt: !1110)
!1116 = !DILocalVariable(name: "g", arg: 1, scope: !1117, file: !1076, line: 154, type: !1084)
!1117 = distinct !DISubprogram(name: "bytestream2_get_bytes_left", scope: !1076, file: !1076, line: 154, type: !1082, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1118 = !DILocation(line: 154, column: 102, scope: !1117, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 112, column: 21, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1111, file: !684, line: 112, column: 21)
!1121 = !DILocalVariable(name: "b", arg: 1, scope: !1122, file: !1076, line: 95, type: !1079)
!1122 = distinct !DISubprogram(name: "bytestream_get_byte", scope: !1076, file: !1076, line: 95, type: !1077, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1123 = !DILocation(line: 95, column: 95, scope: !1122, inlinedAt: !1124)
!1124 = distinct !DILocation(line: 95, column: 855, scope: !1125, inlinedAt: !1126)
!1125 = distinct !DISubprogram(name: "bytestream2_get_byteu", scope: !1076, file: !1076, line: 95, type: !1082, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1126 = distinct !DILocation(line: 95, column: 1073, scope: !1127, inlinedAt: !1129)
!1127 = !DILexicalBlockFile(scope: !1128, file: !1076, discriminator: 2)
!1128 = distinct !DISubprogram(name: "bytestream2_get_byte", scope: !1076, file: !1076, line: 95, type: !1082, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1129 = distinct !DILocation(line: 106, column: 24, scope: !1095)
!1130 = !DILocalVariable(name: "g", arg: 1, scope: !1125, file: !1076, line: 95, type: !1084)
!1131 = !DILocation(line: 95, column: 843, scope: !1125, inlinedAt: !1126)
!1132 = !DILocalVariable(name: "g", arg: 1, scope: !1128, file: !1076, line: 95, type: !1084)
!1133 = !DILocation(line: 95, column: 985, scope: !1128, inlinedAt: !1129)
!1134 = !DILocalVariable(name: "g", arg: 1, scope: !1135, file: !1076, line: 164, type: !1084)
!1135 = distinct !DISubprogram(name: "bytestream2_skip", scope: !1076, file: !1076, line: 164, type: !1136, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{null, !1084, !665}
!1138 = !DILocation(line: 164, column: 84, scope: !1135, inlinedAt: !1139)
!1139 = distinct !DILocation(line: 127, column: 17, scope: !1111)
!1140 = !DILocalVariable(name: "size", arg: 2, scope: !1135, file: !1076, line: 165, type: !665)
!1141 = !DILocation(line: 165, column: 60, scope: !1135, inlinedAt: !1139)
!1142 = !DILocation(line: 95, column: 95, scope: !1122, inlinedAt: !1143)
!1143 = distinct !DILocation(line: 95, column: 855, scope: !1125, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 95, column: 1073, scope: !1127, inlinedAt: !1145)
!1145 = distinct !DILocation(line: 98, column: 22, scope: !1098)
!1146 = !DILocation(line: 95, column: 843, scope: !1125, inlinedAt: !1144)
!1147 = !DILocation(line: 95, column: 985, scope: !1128, inlinedAt: !1145)
!1148 = !DILocation(line: 95, column: 95, scope: !1122, inlinedAt: !1149)
!1149 = distinct !DILocation(line: 95, column: 855, scope: !1125, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 95, column: 1073, scope: !1127, inlinedAt: !1151)
!1151 = distinct !DILocation(line: 97, column: 25, scope: !1098)
!1152 = !DILocation(line: 95, column: 843, scope: !1125, inlinedAt: !1150)
!1153 = !DILocation(line: 95, column: 985, scope: !1128, inlinedAt: !1151)
!1154 = !DILocation(line: 164, column: 84, scope: !1135, inlinedAt: !1155)
!1155 = distinct !DILocation(line: 96, column: 9, scope: !1098)
!1156 = !DILocation(line: 165, column: 60, scope: !1135, inlinedAt: !1155)
!1157 = !DILocalVariable(name: "g", arg: 1, scope: !1158, file: !1076, line: 133, type: !1084)
!1158 = distinct !DISubprogram(name: "bytestream2_init", scope: !1076, file: !1076, line: 133, type: !1159, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !1084, !667, !664}
!1161 = !DILocation(line: 133, column: 84, scope: !1158, inlinedAt: !1162)
!1162 = distinct !DILocation(line: 85, column: 5, scope: !683)
!1163 = !DILocalVariable(name: "buf", arg: 2, scope: !1158, file: !1076, line: 134, type: !667)
!1164 = !DILocation(line: 134, column: 62, scope: !1158, inlinedAt: !1162)
!1165 = !DILocalVariable(name: "buf_size", arg: 3, scope: !1158, file: !1076, line: 135, type: !664)
!1166 = !DILocation(line: 135, column: 51, scope: !1158, inlinedAt: !1162)
!1167 = !DILocalVariable(name: "data", arg: 1, scope: !683, file: !684, line: 78, type: !667)
!1168 = !DILocation(line: 78, column: 45, scope: !683)
!1169 = !DILocalVariable(name: "size", arg: 2, scope: !683, file: !684, line: 78, type: !664)
!1170 = !DILocation(line: 78, column: 55, scope: !683)
!1171 = !DILocalVariable(name: "ps", arg: 3, scope: !683, file: !684, line: 78, type: !687)
!1172 = !DILocation(line: 78, column: 76, scope: !683)
!1173 = !DILocalVariable(name: "sei", arg: 4, scope: !683, file: !684, line: 79, type: !998)
!1174 = !DILocation(line: 79, column: 39, scope: !683)
!1175 = !DILocalVariable(name: "is_nalff", arg: 5, scope: !683, file: !684, line: 79, type: !989)
!1176 = !DILocation(line: 79, column: 49, scope: !683)
!1177 = !DILocalVariable(name: "nal_length_size", arg: 6, scope: !683, file: !684, line: 79, type: !989)
!1178 = !DILocation(line: 79, column: 64, scope: !683)
!1179 = !DILocalVariable(name: "err_recognition", arg: 7, scope: !683, file: !684, line: 80, type: !664)
!1180 = !DILocation(line: 80, column: 34, scope: !683)
!1181 = !DILocalVariable(name: "apply_defdispwin", arg: 8, scope: !683, file: !684, line: 80, type: !664)
!1182 = !DILocation(line: 80, column: 55, scope: !683)
!1183 = !DILocalVariable(name: "logctx", arg: 9, scope: !683, file: !684, line: 80, type: !666)
!1184 = !DILocation(line: 80, column: 79, scope: !683)
!1185 = !DILocalVariable(name: "ret", scope: !683, file: !684, line: 82, type: !664)
!1186 = !DILocation(line: 82, column: 9, scope: !683)
!1187 = !DILocalVariable(name: "gb", scope: !683, file: !684, line: 83, type: !1085)
!1188 = !DILocation(line: 83, column: 20, scope: !683)
!1189 = !DILocation(line: 85, column: 27, scope: !683)
!1190 = !DILocation(line: 85, column: 33, scope: !683)
!1191 = !DILocation(line: 85, column: 5, scope: !683)
!1192 = !DILocation(line: 137, column: 16, scope: !1193, inlinedAt: !1162)
!1193 = !DILexicalBlockFile(scope: !1194, file: !1076, discriminator: 1)
!1194 = distinct !DILexicalBlock(scope: !1195, file: !1076, line: 137, column: 14)
!1195 = distinct !DILexicalBlock(scope: !1158, file: !1076, line: 137, column: 8)
!1196 = !DILocation(line: 137, column: 25, scope: !1193, inlinedAt: !1162)
!1197 = !DILocation(line: 137, column: 14, scope: !1193, inlinedAt: !1162)
!1198 = !DILocation(line: 137, column: 34, scope: !1199, inlinedAt: !1162)
!1199 = !DILexicalBlockFile(scope: !1200, file: !1076, discriminator: 2)
!1200 = distinct !DILexicalBlock(scope: !1194, file: !1076, line: 137, column: 32)
!1201 = !DILocation(line: 137, column: 93, scope: !1202, inlinedAt: !1162)
!1202 = !DILexicalBlockFile(scope: !1199, file: !1076, discriminator: 4)
!1203 = !DILocation(line: 137, column: 93, scope: !1199, inlinedAt: !1162)
!1204 = !DILocation(line: 138, column: 17, scope: !1158, inlinedAt: !1162)
!1205 = !DILocation(line: 138, column: 5, scope: !1158, inlinedAt: !1162)
!1206 = !DILocation(line: 138, column: 8, scope: !1158, inlinedAt: !1162)
!1207 = !DILocation(line: 138, column: 15, scope: !1158, inlinedAt: !1162)
!1208 = !DILocation(line: 139, column: 23, scope: !1158, inlinedAt: !1162)
!1209 = !DILocation(line: 139, column: 5, scope: !1158, inlinedAt: !1162)
!1210 = !DILocation(line: 139, column: 8, scope: !1158, inlinedAt: !1162)
!1211 = !DILocation(line: 139, column: 21, scope: !1158, inlinedAt: !1162)
!1212 = !DILocation(line: 140, column: 21, scope: !1158, inlinedAt: !1162)
!1213 = !DILocation(line: 140, column: 27, scope: !1158, inlinedAt: !1162)
!1214 = !DILocation(line: 140, column: 25, scope: !1158, inlinedAt: !1162)
!1215 = !DILocation(line: 140, column: 5, scope: !1158, inlinedAt: !1162)
!1216 = !DILocation(line: 140, column: 8, scope: !1158, inlinedAt: !1162)
!1217 = !DILocation(line: 140, column: 19, scope: !1158, inlinedAt: !1162)
!1218 = !DILocation(line: 87, column: 9, scope: !1099)
!1219 = !DILocation(line: 87, column: 14, scope: !1099)
!1220 = !DILocation(line: 87, column: 18, scope: !1099)
!1221 = !DILocation(line: 87, column: 22, scope: !1222)
!1222 = !DILexicalBlockFile(scope: !1099, file: !684, discriminator: 1)
!1223 = !DILocation(line: 87, column: 30, scope: !1222)
!1224 = !DILocation(line: 87, column: 33, scope: !1225)
!1225 = !DILexicalBlockFile(scope: !1099, file: !684, discriminator: 2)
!1226 = !DILocation(line: 87, column: 41, scope: !1225)
!1227 = !DILocation(line: 87, column: 44, scope: !1228)
!1228 = !DILexicalBlockFile(scope: !1099, file: !684, discriminator: 3)
!1229 = !DILocation(line: 87, column: 52, scope: !1228)
!1230 = !DILocation(line: 87, column: 9, scope: !1228)
!1231 = !DILocalVariable(name: "i", scope: !1098, file: !684, line: 92, type: !664)
!1232 = !DILocation(line: 92, column: 13, scope: !1098)
!1233 = !DILocalVariable(name: "j", scope: !1098, file: !684, line: 92, type: !664)
!1234 = !DILocation(line: 92, column: 16, scope: !1098)
!1235 = !DILocalVariable(name: "num_arrays", scope: !1098, file: !684, line: 92, type: !664)
!1236 = !DILocation(line: 92, column: 19, scope: !1098)
!1237 = !DILocalVariable(name: "nal_len_size", scope: !1098, file: !684, line: 92, type: !664)
!1238 = !DILocation(line: 92, column: 31, scope: !1098)
!1239 = !DILocation(line: 94, column: 10, scope: !1098)
!1240 = !DILocation(line: 94, column: 19, scope: !1098)
!1241 = !DILocation(line: 96, column: 9, scope: !1098)
!1242 = !DILocation(line: 167, column: 20, scope: !1135, inlinedAt: !1155)
!1243 = !DILocation(line: 167, column: 23, scope: !1135, inlinedAt: !1155)
!1244 = !DILocation(line: 167, column: 36, scope: !1135, inlinedAt: !1155)
!1245 = !DILocation(line: 167, column: 39, scope: !1135, inlinedAt: !1155)
!1246 = !DILocation(line: 167, column: 34, scope: !1135, inlinedAt: !1155)
!1247 = !DILocation(line: 167, column: 50, scope: !1135, inlinedAt: !1155)
!1248 = !DILocation(line: 167, column: 49, scope: !1135, inlinedAt: !1155)
!1249 = !DILocation(line: 167, column: 47, scope: !1135, inlinedAt: !1155)
!1250 = !DILocation(line: 167, column: 19, scope: !1135, inlinedAt: !1155)
!1251 = !DILocation(line: 167, column: 59, scope: !1252, inlinedAt: !1155)
!1252 = !DILexicalBlockFile(scope: !1135, file: !1076, discriminator: 1)
!1253 = !DILocation(line: 167, column: 58, scope: !1252, inlinedAt: !1155)
!1254 = !DILocation(line: 167, column: 19, scope: !1252, inlinedAt: !1155)
!1255 = !DILocation(line: 167, column: 68, scope: !1256, inlinedAt: !1155)
!1256 = !DILexicalBlockFile(scope: !1135, file: !1076, discriminator: 2)
!1257 = !DILocation(line: 167, column: 71, scope: !1256, inlinedAt: !1155)
!1258 = !DILocation(line: 167, column: 84, scope: !1256, inlinedAt: !1155)
!1259 = !DILocation(line: 167, column: 87, scope: !1256, inlinedAt: !1155)
!1260 = !DILocation(line: 167, column: 82, scope: !1256, inlinedAt: !1155)
!1261 = !DILocation(line: 167, column: 19, scope: !1256, inlinedAt: !1155)
!1262 = !DILocation(line: 167, column: 19, scope: !1263, inlinedAt: !1155)
!1263 = !DILexicalBlockFile(scope: !1135, file: !1076, discriminator: 3)
!1264 = !DILocation(line: 167, column: 5, scope: !1263, inlinedAt: !1155)
!1265 = !DILocation(line: 167, column: 8, scope: !1263, inlinedAt: !1155)
!1266 = !DILocation(line: 167, column: 15, scope: !1263, inlinedAt: !1155)
!1267 = !DILocation(line: 97, column: 25, scope: !1098)
!1268 = !DILocation(line: 95, column: 994, scope: !1269, inlinedAt: !1151)
!1269 = distinct !DILexicalBlock(scope: !1128, file: !1076, line: 95, column: 994)
!1270 = !DILocation(line: 95, column: 997, scope: !1269, inlinedAt: !1151)
!1271 = !DILocation(line: 95, column: 1010, scope: !1269, inlinedAt: !1151)
!1272 = !DILocation(line: 95, column: 1013, scope: !1269, inlinedAt: !1151)
!1273 = !DILocation(line: 95, column: 1008, scope: !1269, inlinedAt: !1151)
!1274 = !DILocation(line: 95, column: 1020, scope: !1269, inlinedAt: !1151)
!1275 = !DILocation(line: 95, column: 994, scope: !1128, inlinedAt: !1151)
!1276 = !DILocation(line: 95, column: 1039, scope: !1277, inlinedAt: !1151)
!1277 = !DILexicalBlockFile(scope: !1278, file: !1076, discriminator: 1)
!1278 = distinct !DILexicalBlock(scope: !1269, file: !1076, line: 95, column: 1025)
!1279 = !DILocation(line: 95, column: 1042, scope: !1277, inlinedAt: !1151)
!1280 = !DILocation(line: 95, column: 1027, scope: !1277, inlinedAt: !1151)
!1281 = !DILocation(line: 95, column: 1030, scope: !1277, inlinedAt: !1151)
!1282 = !DILocation(line: 95, column: 1037, scope: !1277, inlinedAt: !1151)
!1283 = !DILocation(line: 95, column: 1054, scope: !1277, inlinedAt: !1151)
!1284 = !DILocation(line: 95, column: 1095, scope: !1127, inlinedAt: !1151)
!1285 = !DILocation(line: 95, column: 1073, scope: !1127, inlinedAt: !1151)
!1286 = !DILocation(line: 95, column: 876, scope: !1125, inlinedAt: !1150)
!1287 = !DILocation(line: 95, column: 879, scope: !1125, inlinedAt: !1150)
!1288 = !DILocation(line: 95, column: 855, scope: !1125, inlinedAt: !1150)
!1289 = !DILocation(line: 95, column: 102, scope: !1122, inlinedAt: !1149)
!1290 = !DILocation(line: 95, column: 105, scope: !1122, inlinedAt: !1149)
!1291 = !DILocation(line: 95, column: 138, scope: !1122, inlinedAt: !1149)
!1292 = !DILocation(line: 95, column: 137, scope: !1122, inlinedAt: !1149)
!1293 = !DILocation(line: 95, column: 140, scope: !1122, inlinedAt: !1149)
!1294 = !DILocation(line: 95, column: 119, scope: !1122, inlinedAt: !1149)
!1295 = !DILocation(line: 95, column: 118, scope: !1122, inlinedAt: !1149)
!1296 = !DILocation(line: 95, column: 1066, scope: !1127, inlinedAt: !1151)
!1297 = !DILocation(line: 95, column: 1099, scope: !1298, inlinedAt: !1151)
!1298 = !DILexicalBlockFile(scope: !1128, file: !1076, discriminator: 3)
!1299 = !DILocation(line: 97, column: 51, scope: !1098)
!1300 = !DILocation(line: 97, column: 56, scope: !1098)
!1301 = !DILocation(line: 97, column: 22, scope: !1098)
!1302 = !DILocation(line: 98, column: 22, scope: !1098)
!1303 = !DILocation(line: 95, column: 994, scope: !1269, inlinedAt: !1145)
!1304 = !DILocation(line: 95, column: 997, scope: !1269, inlinedAt: !1145)
!1305 = !DILocation(line: 95, column: 1010, scope: !1269, inlinedAt: !1145)
!1306 = !DILocation(line: 95, column: 1013, scope: !1269, inlinedAt: !1145)
!1307 = !DILocation(line: 95, column: 1008, scope: !1269, inlinedAt: !1145)
!1308 = !DILocation(line: 95, column: 1020, scope: !1269, inlinedAt: !1145)
!1309 = !DILocation(line: 95, column: 994, scope: !1128, inlinedAt: !1145)
!1310 = !DILocation(line: 95, column: 1039, scope: !1277, inlinedAt: !1145)
!1311 = !DILocation(line: 95, column: 1042, scope: !1277, inlinedAt: !1145)
!1312 = !DILocation(line: 95, column: 1027, scope: !1277, inlinedAt: !1145)
!1313 = !DILocation(line: 95, column: 1030, scope: !1277, inlinedAt: !1145)
!1314 = !DILocation(line: 95, column: 1037, scope: !1277, inlinedAt: !1145)
!1315 = !DILocation(line: 95, column: 1054, scope: !1277, inlinedAt: !1145)
!1316 = !DILocation(line: 95, column: 1095, scope: !1127, inlinedAt: !1145)
!1317 = !DILocation(line: 95, column: 1073, scope: !1127, inlinedAt: !1145)
!1318 = !DILocation(line: 95, column: 876, scope: !1125, inlinedAt: !1144)
!1319 = !DILocation(line: 95, column: 879, scope: !1125, inlinedAt: !1144)
!1320 = !DILocation(line: 95, column: 855, scope: !1125, inlinedAt: !1144)
!1321 = !DILocation(line: 95, column: 102, scope: !1122, inlinedAt: !1143)
!1322 = !DILocation(line: 95, column: 105, scope: !1122, inlinedAt: !1143)
!1323 = !DILocation(line: 95, column: 138, scope: !1122, inlinedAt: !1143)
!1324 = !DILocation(line: 95, column: 137, scope: !1122, inlinedAt: !1143)
!1325 = !DILocation(line: 95, column: 140, scope: !1122, inlinedAt: !1143)
!1326 = !DILocation(line: 95, column: 119, scope: !1122, inlinedAt: !1143)
!1327 = !DILocation(line: 95, column: 118, scope: !1122, inlinedAt: !1143)
!1328 = !DILocation(line: 95, column: 1066, scope: !1127, inlinedAt: !1145)
!1329 = !DILocation(line: 95, column: 1099, scope: !1298, inlinedAt: !1145)
!1330 = !DILocation(line: 98, column: 20, scope: !1098)
!1331 = !DILocation(line: 102, column: 10, scope: !1098)
!1332 = !DILocation(line: 102, column: 26, scope: !1098)
!1333 = !DILocation(line: 105, column: 16, scope: !1097)
!1334 = !DILocation(line: 105, column: 14, scope: !1097)
!1335 = !DILocation(line: 105, column: 21, scope: !1336)
!1336 = !DILexicalBlockFile(scope: !1096, file: !684, discriminator: 1)
!1337 = !DILocation(line: 105, column: 25, scope: !1336)
!1338 = !DILocation(line: 105, column: 23, scope: !1336)
!1339 = !DILocation(line: 105, column: 9, scope: !1336)
!1340 = !DILocalVariable(name: "type", scope: !1095, file: !684, line: 106, type: !664)
!1341 = !DILocation(line: 106, column: 17, scope: !1095)
!1342 = !DILocation(line: 106, column: 24, scope: !1095)
!1343 = !DILocation(line: 95, column: 994, scope: !1269, inlinedAt: !1129)
!1344 = !DILocation(line: 95, column: 997, scope: !1269, inlinedAt: !1129)
!1345 = !DILocation(line: 95, column: 1010, scope: !1269, inlinedAt: !1129)
!1346 = !DILocation(line: 95, column: 1013, scope: !1269, inlinedAt: !1129)
!1347 = !DILocation(line: 95, column: 1008, scope: !1269, inlinedAt: !1129)
!1348 = !DILocation(line: 95, column: 1020, scope: !1269, inlinedAt: !1129)
!1349 = !DILocation(line: 95, column: 994, scope: !1128, inlinedAt: !1129)
!1350 = !DILocation(line: 95, column: 1039, scope: !1277, inlinedAt: !1129)
!1351 = !DILocation(line: 95, column: 1042, scope: !1277, inlinedAt: !1129)
!1352 = !DILocation(line: 95, column: 1027, scope: !1277, inlinedAt: !1129)
!1353 = !DILocation(line: 95, column: 1030, scope: !1277, inlinedAt: !1129)
!1354 = !DILocation(line: 95, column: 1037, scope: !1277, inlinedAt: !1129)
!1355 = !DILocation(line: 95, column: 1054, scope: !1277, inlinedAt: !1129)
!1356 = !DILocation(line: 95, column: 1095, scope: !1127, inlinedAt: !1129)
!1357 = !DILocation(line: 95, column: 1073, scope: !1127, inlinedAt: !1129)
!1358 = !DILocation(line: 95, column: 876, scope: !1125, inlinedAt: !1126)
!1359 = !DILocation(line: 95, column: 879, scope: !1125, inlinedAt: !1126)
!1360 = !DILocation(line: 95, column: 855, scope: !1125, inlinedAt: !1126)
!1361 = !DILocation(line: 95, column: 102, scope: !1122, inlinedAt: !1124)
!1362 = !DILocation(line: 95, column: 105, scope: !1122, inlinedAt: !1124)
!1363 = !DILocation(line: 95, column: 138, scope: !1122, inlinedAt: !1124)
!1364 = !DILocation(line: 95, column: 137, scope: !1122, inlinedAt: !1124)
!1365 = !DILocation(line: 95, column: 140, scope: !1122, inlinedAt: !1124)
!1366 = !DILocation(line: 95, column: 119, scope: !1122, inlinedAt: !1124)
!1367 = !DILocation(line: 95, column: 118, scope: !1122, inlinedAt: !1124)
!1368 = !DILocation(line: 95, column: 1066, scope: !1127, inlinedAt: !1129)
!1369 = !DILocation(line: 95, column: 1099, scope: !1298, inlinedAt: !1129)
!1370 = !DILocation(line: 106, column: 50, scope: !1095)
!1371 = !DILocalVariable(name: "cnt", scope: !1095, file: !684, line: 107, type: !664)
!1372 = !DILocation(line: 107, column: 17, scope: !1095)
!1373 = !DILocation(line: 107, column: 23, scope: !1095)
!1374 = !DILocation(line: 94, column: 1043, scope: !1375, inlinedAt: !1094)
!1375 = distinct !DILexicalBlock(scope: !1093, file: !1076, line: 94, column: 1043)
!1376 = !DILocation(line: 94, column: 1046, scope: !1375, inlinedAt: !1094)
!1377 = !DILocation(line: 94, column: 1059, scope: !1375, inlinedAt: !1094)
!1378 = !DILocation(line: 94, column: 1062, scope: !1375, inlinedAt: !1094)
!1379 = !DILocation(line: 94, column: 1057, scope: !1375, inlinedAt: !1094)
!1380 = !DILocation(line: 94, column: 1069, scope: !1375, inlinedAt: !1094)
!1381 = !DILocation(line: 94, column: 1043, scope: !1093, inlinedAt: !1094)
!1382 = !DILocation(line: 94, column: 1088, scope: !1383, inlinedAt: !1094)
!1383 = !DILexicalBlockFile(scope: !1384, file: !1076, discriminator: 1)
!1384 = distinct !DILexicalBlock(scope: !1375, file: !1076, line: 94, column: 1074)
!1385 = !DILocation(line: 94, column: 1091, scope: !1383, inlinedAt: !1094)
!1386 = !DILocation(line: 94, column: 1076, scope: !1383, inlinedAt: !1094)
!1387 = !DILocation(line: 94, column: 1079, scope: !1383, inlinedAt: !1094)
!1388 = !DILocation(line: 94, column: 1086, scope: !1383, inlinedAt: !1094)
!1389 = !DILocation(line: 94, column: 1103, scope: !1383, inlinedAt: !1094)
!1390 = !DILocation(line: 94, column: 1144, scope: !1092, inlinedAt: !1094)
!1391 = !DILocation(line: 94, column: 1122, scope: !1092, inlinedAt: !1094)
!1392 = !DILocation(line: 94, column: 925, scope: !1081, inlinedAt: !1091)
!1393 = !DILocation(line: 94, column: 928, scope: !1081, inlinedAt: !1091)
!1394 = !DILocation(line: 94, column: 904, scope: !1081, inlinedAt: !1091)
!1395 = !DILocation(line: 94, column: 102, scope: !1075, inlinedAt: !1080)
!1396 = !DILocation(line: 94, column: 105, scope: !1075, inlinedAt: !1080)
!1397 = !DILocation(line: 94, column: 162, scope: !1075, inlinedAt: !1080)
!1398 = !DILocation(line: 94, column: 161, scope: !1075, inlinedAt: !1080)
!1399 = !DILocation(line: 94, column: 164, scope: !1075, inlinedAt: !1080)
!1400 = !DILocation(line: 94, column: 171, scope: !1075, inlinedAt: !1080)
!1401 = !DILocation(line: 94, column: 118, scope: !1075, inlinedAt: !1080)
!1402 = !DILocation(line: 60, column: 9, scope: !1068, inlinedAt: !1074)
!1403 = !DILocation(line: 60, column: 10, scope: !1068, inlinedAt: !1074)
!1404 = !DILocation(line: 60, column: 18, scope: !1068, inlinedAt: !1074)
!1405 = !DILocation(line: 60, column: 19, scope: !1068, inlinedAt: !1074)
!1406 = !DILocation(line: 60, column: 15, scope: !1068, inlinedAt: !1074)
!1407 = !DILocation(line: 60, column: 8, scope: !1068, inlinedAt: !1074)
!1408 = !DILocation(line: 60, column: 6, scope: !1068, inlinedAt: !1074)
!1409 = !DILocation(line: 61, column: 12, scope: !1068, inlinedAt: !1074)
!1410 = !DILocation(line: 94, column: 1115, scope: !1092, inlinedAt: !1094)
!1411 = !DILocation(line: 94, column: 1148, scope: !1412, inlinedAt: !1094)
!1412 = !DILexicalBlockFile(scope: !1093, file: !1076, discriminator: 3)
!1413 = !DILocation(line: 109, column: 20, scope: !1113)
!1414 = !DILocation(line: 109, column: 18, scope: !1113)
!1415 = !DILocation(line: 109, column: 25, scope: !1416)
!1416 = !DILexicalBlockFile(scope: !1112, file: !684, discriminator: 1)
!1417 = !DILocation(line: 109, column: 29, scope: !1416)
!1418 = !DILocation(line: 109, column: 27, scope: !1416)
!1419 = !DILocation(line: 109, column: 13, scope: !1416)
!1420 = !DILocalVariable(name: "nalsize", scope: !1111, file: !684, line: 111, type: !664)
!1421 = !DILocation(line: 111, column: 21, scope: !1111)
!1422 = !DILocation(line: 111, column: 31, scope: !1111)
!1423 = !DILocation(line: 94, column: 1255, scope: !1424, inlinedAt: !1110)
!1424 = distinct !DILexicalBlock(scope: !1109, file: !1076, line: 94, column: 1255)
!1425 = !DILocation(line: 94, column: 1258, scope: !1424, inlinedAt: !1110)
!1426 = !DILocation(line: 94, column: 1271, scope: !1424, inlinedAt: !1110)
!1427 = !DILocation(line: 94, column: 1274, scope: !1424, inlinedAt: !1110)
!1428 = !DILocation(line: 94, column: 1269, scope: !1424, inlinedAt: !1110)
!1429 = !DILocation(line: 94, column: 1281, scope: !1424, inlinedAt: !1110)
!1430 = !DILocation(line: 94, column: 1255, scope: !1109, inlinedAt: !1110)
!1431 = !DILocation(line: 94, column: 1286, scope: !1432, inlinedAt: !1110)
!1432 = !DILexicalBlockFile(scope: !1424, file: !1076, discriminator: 1)
!1433 = !DILocation(line: 94, column: 1346, scope: !1108, inlinedAt: !1110)
!1434 = !DILocation(line: 94, column: 1349, scope: !1108, inlinedAt: !1110)
!1435 = !DILocation(line: 94, column: 1359, scope: !1108, inlinedAt: !1110)
!1436 = !DILocation(line: 94, column: 1303, scope: !1108, inlinedAt: !1110)
!1437 = !DILocation(line: 60, column: 9, scope: !1068, inlinedAt: !1107)
!1438 = !DILocation(line: 60, column: 10, scope: !1068, inlinedAt: !1107)
!1439 = !DILocation(line: 60, column: 18, scope: !1068, inlinedAt: !1107)
!1440 = !DILocation(line: 60, column: 19, scope: !1068, inlinedAt: !1107)
!1441 = !DILocation(line: 60, column: 15, scope: !1068, inlinedAt: !1107)
!1442 = !DILocation(line: 60, column: 8, scope: !1068, inlinedAt: !1107)
!1443 = !DILocation(line: 60, column: 6, scope: !1068, inlinedAt: !1107)
!1444 = !DILocation(line: 61, column: 12, scope: !1068, inlinedAt: !1107)
!1445 = !DILocation(line: 94, column: 1296, scope: !1108, inlinedAt: !1110)
!1446 = !DILocation(line: 94, column: 1364, scope: !1447, inlinedAt: !1110)
!1447 = !DILexicalBlockFile(scope: !1109, file: !1076, discriminator: 3)
!1448 = !DILocation(line: 111, column: 58, scope: !1111)
!1449 = !DILocation(line: 112, column: 21, scope: !1120)
!1450 = !DILocation(line: 156, column: 12, scope: !1117, inlinedAt: !1119)
!1451 = !DILocation(line: 156, column: 15, scope: !1117, inlinedAt: !1119)
!1452 = !DILocation(line: 156, column: 28, scope: !1117, inlinedAt: !1119)
!1453 = !DILocation(line: 156, column: 31, scope: !1117, inlinedAt: !1119)
!1454 = !DILocation(line: 156, column: 26, scope: !1117, inlinedAt: !1119)
!1455 = !DILocation(line: 112, column: 55, scope: !1120)
!1456 = !DILocation(line: 112, column: 53, scope: !1120)
!1457 = !DILocation(line: 112, column: 21, scope: !1111)
!1458 = !DILocation(line: 113, column: 28, scope: !1459)
!1459 = distinct !DILexicalBlock(scope: !1120, file: !684, line: 112, column: 64)
!1460 = !DILocation(line: 113, column: 21, scope: !1459)
!1461 = !DILocation(line: 115, column: 21, scope: !1459)
!1462 = !DILocation(line: 118, column: 48, scope: !1111)
!1463 = !DILocation(line: 118, column: 56, scope: !1111)
!1464 = !DILocation(line: 118, column: 65, scope: !1111)
!1465 = !DILocation(line: 118, column: 69, scope: !1111)
!1466 = !DILocation(line: 118, column: 75, scope: !1111)
!1467 = !DILocation(line: 118, column: 74, scope: !1111)
!1468 = !DILocation(line: 119, column: 46, scope: !1111)
!1469 = !DILocation(line: 119, column: 45, scope: !1111)
!1470 = !DILocation(line: 119, column: 63, scope: !1111)
!1471 = !DILocation(line: 119, column: 80, scope: !1111)
!1472 = !DILocation(line: 120, column: 45, scope: !1111)
!1473 = !DILocation(line: 118, column: 23, scope: !1111)
!1474 = !DILocation(line: 118, column: 21, scope: !1111)
!1475 = !DILocation(line: 121, column: 21, scope: !1476)
!1476 = distinct !DILexicalBlock(scope: !1111, file: !684, line: 121, column: 21)
!1477 = !DILocation(line: 121, column: 25, scope: !1476)
!1478 = !DILocation(line: 121, column: 21, scope: !1111)
!1479 = !DILocation(line: 122, column: 28, scope: !1480)
!1480 = distinct !DILexicalBlock(scope: !1476, file: !684, line: 121, column: 30)
!1481 = !DILocation(line: 124, column: 28, scope: !1480)
!1482 = !DILocation(line: 124, column: 34, scope: !1480)
!1483 = !DILocation(line: 122, column: 21, scope: !1480)
!1484 = !DILocation(line: 125, column: 28, scope: !1480)
!1485 = !DILocation(line: 125, column: 21, scope: !1480)
!1486 = !DILocation(line: 127, column: 39, scope: !1111)
!1487 = !DILocation(line: 127, column: 17, scope: !1111)
!1488 = !DILocation(line: 167, column: 20, scope: !1135, inlinedAt: !1139)
!1489 = !DILocation(line: 167, column: 23, scope: !1135, inlinedAt: !1139)
!1490 = !DILocation(line: 167, column: 36, scope: !1135, inlinedAt: !1139)
!1491 = !DILocation(line: 167, column: 39, scope: !1135, inlinedAt: !1139)
!1492 = !DILocation(line: 167, column: 34, scope: !1135, inlinedAt: !1139)
!1493 = !DILocation(line: 167, column: 50, scope: !1135, inlinedAt: !1139)
!1494 = !DILocation(line: 167, column: 49, scope: !1135, inlinedAt: !1139)
!1495 = !DILocation(line: 167, column: 47, scope: !1135, inlinedAt: !1139)
!1496 = !DILocation(line: 167, column: 19, scope: !1135, inlinedAt: !1139)
!1497 = !DILocation(line: 167, column: 59, scope: !1252, inlinedAt: !1139)
!1498 = !DILocation(line: 167, column: 58, scope: !1252, inlinedAt: !1139)
!1499 = !DILocation(line: 167, column: 19, scope: !1252, inlinedAt: !1139)
!1500 = !DILocation(line: 167, column: 68, scope: !1256, inlinedAt: !1139)
!1501 = !DILocation(line: 167, column: 71, scope: !1256, inlinedAt: !1139)
!1502 = !DILocation(line: 167, column: 84, scope: !1256, inlinedAt: !1139)
!1503 = !DILocation(line: 167, column: 87, scope: !1256, inlinedAt: !1139)
!1504 = !DILocation(line: 167, column: 82, scope: !1256, inlinedAt: !1139)
!1505 = !DILocation(line: 167, column: 19, scope: !1256, inlinedAt: !1139)
!1506 = !DILocation(line: 167, column: 19, scope: !1263, inlinedAt: !1139)
!1507 = !DILocation(line: 167, column: 5, scope: !1263, inlinedAt: !1139)
!1508 = !DILocation(line: 167, column: 8, scope: !1263, inlinedAt: !1139)
!1509 = !DILocation(line: 167, column: 15, scope: !1263, inlinedAt: !1139)
!1510 = !DILocation(line: 128, column: 13, scope: !1111)
!1511 = !DILocation(line: 109, column: 35, scope: !1512)
!1512 = !DILexicalBlockFile(scope: !1112, file: !684, discriminator: 2)
!1513 = !DILocation(line: 109, column: 13, scope: !1512)
!1514 = distinct !{!1514, !1515}
!1515 = !DILocation(line: 109, column: 13, scope: !1095)
!1516 = !DILocation(line: 129, column: 9, scope: !1095)
!1517 = !DILocation(line: 105, column: 38, scope: !1518)
!1518 = !DILexicalBlockFile(scope: !1096, file: !684, discriminator: 2)
!1519 = !DILocation(line: 105, column: 9, scope: !1518)
!1520 = distinct !{!1520, !1521}
!1521 = !DILocation(line: 105, column: 9, scope: !1098)
!1522 = !DILocation(line: 133, column: 28, scope: !1098)
!1523 = !DILocation(line: 133, column: 10, scope: !1098)
!1524 = !DILocation(line: 133, column: 26, scope: !1098)
!1525 = !DILocation(line: 134, column: 5, scope: !1098)
!1526 = !DILocation(line: 135, column: 10, scope: !1527)
!1527 = distinct !DILexicalBlock(scope: !1099, file: !684, line: 134, column: 12)
!1528 = !DILocation(line: 135, column: 19, scope: !1527)
!1529 = !DILocation(line: 136, column: 37, scope: !1527)
!1530 = !DILocation(line: 136, column: 43, scope: !1527)
!1531 = !DILocation(line: 136, column: 49, scope: !1527)
!1532 = !DILocation(line: 136, column: 53, scope: !1527)
!1533 = !DILocation(line: 136, column: 59, scope: !1527)
!1534 = !DILocation(line: 136, column: 58, scope: !1527)
!1535 = !DILocation(line: 136, column: 70, scope: !1527)
!1536 = !DILocation(line: 136, column: 69, scope: !1527)
!1537 = !DILocation(line: 137, column: 37, scope: !1527)
!1538 = !DILocation(line: 137, column: 54, scope: !1527)
!1539 = !DILocation(line: 137, column: 72, scope: !1527)
!1540 = !DILocation(line: 136, column: 15, scope: !1527)
!1541 = !DILocation(line: 136, column: 13, scope: !1527)
!1542 = !DILocation(line: 138, column: 13, scope: !1543)
!1543 = distinct !DILexicalBlock(scope: !1527, file: !684, line: 138, column: 13)
!1544 = !DILocation(line: 138, column: 17, scope: !1543)
!1545 = !DILocation(line: 138, column: 13, scope: !1527)
!1546 = !DILocation(line: 139, column: 20, scope: !1543)
!1547 = !DILocation(line: 139, column: 13, scope: !1543)
!1548 = !DILocation(line: 142, column: 12, scope: !683)
!1549 = !DILocation(line: 142, column: 5, scope: !683)
!1550 = !DILocation(line: 143, column: 1, scope: !683)
!1551 = distinct !DISubprogram(name: "hevc_decode_nal_units", scope: !684, file: !684, line: 24, type: !1552, isLocal: true, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1066)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!664, !667, !664, !687, !998, !664, !664, !664, !664, !666}
!1554 = !DILocalVariable(name: "buf", arg: 1, scope: !1551, file: !684, line: 24, type: !667)
!1555 = !DILocation(line: 24, column: 49, scope: !1551)
!1556 = !DILocalVariable(name: "buf_size", arg: 2, scope: !1551, file: !684, line: 24, type: !664)
!1557 = !DILocation(line: 24, column: 58, scope: !1551)
!1558 = !DILocalVariable(name: "ps", arg: 3, scope: !1551, file: !684, line: 24, type: !687)
!1559 = !DILocation(line: 24, column: 83, scope: !1551)
!1560 = !DILocalVariable(name: "sei", arg: 4, scope: !1551, file: !684, line: 25, type: !998)
!1561 = !DILocation(line: 25, column: 43, scope: !1551)
!1562 = !DILocalVariable(name: "is_nalff", arg: 5, scope: !1551, file: !684, line: 25, type: !664)
!1563 = !DILocation(line: 25, column: 52, scope: !1551)
!1564 = !DILocalVariable(name: "nal_length_size", arg: 6, scope: !1551, file: !684, line: 25, type: !664)
!1565 = !DILocation(line: 25, column: 66, scope: !1551)
!1566 = !DILocalVariable(name: "err_recognition", arg: 7, scope: !1551, file: !684, line: 26, type: !664)
!1567 = !DILocation(line: 26, column: 38, scope: !1551)
!1568 = !DILocalVariable(name: "apply_defdispwin", arg: 8, scope: !1551, file: !684, line: 26, type: !664)
!1569 = !DILocation(line: 26, column: 59, scope: !1551)
!1570 = !DILocalVariable(name: "logctx", arg: 9, scope: !1551, file: !684, line: 26, type: !666)
!1571 = !DILocation(line: 26, column: 83, scope: !1551)
!1572 = !DILocalVariable(name: "i", scope: !1551, file: !684, line: 28, type: !664)
!1573 = !DILocation(line: 28, column: 9, scope: !1551)
!1574 = !DILocalVariable(name: "ret", scope: !1551, file: !684, line: 29, type: !664)
!1575 = !DILocation(line: 29, column: 9, scope: !1551)
!1576 = !DILocalVariable(name: "pkt", scope: !1551, file: !684, line: 30, type: !1577)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645Packet", file: !1578, line: 81, baseType: !1579)
!1578 = !DIFile(filename: "libavcodec/h2645_parse.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645Packet", file: !1578, line: 76, size: 320, align: 64, elements: !1580)
!1580 = !{!1581, !1608, !1616, !1617}
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "nals", scope: !1579, file: !1578, line: 77, baseType: !1582, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645NAL", file: !1578, line: 66, baseType: !1584)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645NAL", file: !1578, line: 32, size: 832, align: 64, elements: !1585)
!1585 = !{!1586, !1587, !1588, !1589, !1590, !1591, !1592, !1602, !1603, !1604, !1605, !1606, !1607}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer", scope: !1584, file: !1578, line: 33, baseType: !704, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1584, file: !1578, line: 35, baseType: !664, size: 32, align: 32, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1584, file: !1578, line: 36, baseType: !667, size: 64, align: 64, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "size_bits", scope: !1584, file: !1578, line: 42, baseType: !664, size: 32, align: 32, offset: 192)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "raw_size", scope: !1584, file: !1578, line: 44, baseType: !664, size: 32, align: 32, offset: 224)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !1584, file: !1578, line: 45, baseType: !667, size: 64, align: 64, offset: 256)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1584, file: !1578, line: 47, baseType: !1593, size: 256, align: 64, offset: 320)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1594, line: 70, baseType: !1595)
!1594 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1594, line: 61, size: 256, align: 64, elements: !1596)
!1596 = !{!1597, !1598, !1599, !1600, !1601}
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1595, file: !1594, line: 62, baseType: !667, size: 64, align: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1595, file: !1594, line: 62, baseType: !667, size: 64, align: 64, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1595, file: !1594, line: 67, baseType: !664, size: 32, align: 32, offset: 128)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1595, file: !1594, line: 68, baseType: !664, size: 32, align: 32, offset: 160)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1595, file: !1594, line: 69, baseType: !664, size: 32, align: 32, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1584, file: !1578, line: 52, baseType: !664, size: 32, align: 32, offset: 576)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !1584, file: !1578, line: 57, baseType: !664, size: 32, align: 32, offset: 608)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes", scope: !1584, file: !1578, line: 59, baseType: !664, size: 32, align: 32, offset: 640)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes_pos_size", scope: !1584, file: !1578, line: 60, baseType: !664, size: 32, align: 32, offset: 672)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "skipped_bytes_pos", scope: !1584, file: !1578, line: 61, baseType: !989, size: 64, align: 64, offset: 704)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "ref_idc", scope: !1584, file: !1578, line: 65, baseType: !664, size: 32, align: 32, offset: 768)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp", scope: !1579, file: !1578, line: 78, baseType: !1609, size: 192, align: 64, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_typedef, name: "H2645RBSP", file: !1578, line: 73, baseType: !1610)
!1610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H2645RBSP", file: !1578, line: 68, size: 192, align: 64, elements: !1611)
!1611 = !{!1612, !1613, !1614, !1615}
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer", scope: !1610, file: !1578, line: 69, baseType: !704, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_ref", scope: !1610, file: !1578, line: 70, baseType: !694, size: 64, align: 64, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rbsp_buffer_alloc_size", scope: !1610, file: !1578, line: 71, baseType: !664, size: 32, align: 32, offset: 128)
