; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lzw.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lzw.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GetByteContext = type { i8*, i8*, i8* }
%struct.LZWState = type { %struct.GetByteContext, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i8*, [4096 x i8], [4096 x i8], [4096 x i16], i32 }

@mask = internal constant [17 x i16] [i16 0, i16 1, i16 3, i16 7, i16 15, i16 31, i16 63, i16 127, i16 255, i16 511, i16 1023, i16 2047, i16 4095, i16 8191, i16 16383, i16 32767, i16 -1], align 16
@.str = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"buf_size >= 0\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"libavcodec/bytestream.h\00", align 1

; Function Attrs: nounwind uwtable
define i32 @ff_lzw_decode_tail(i8* %p) #0 !dbg !64 {
entry:
  %g.addr.i39 = alloca %struct.GetByteContext*, align 8
  call void @llvm.dbg.declare(metadata %struct.GetByteContext** %g.addr.i39, metadata !70, metadata !75), !dbg !76
  %size.addr.i40 = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %size.addr.i40, metadata !81, metadata !75), !dbg !82
  %b.addr.i.i.i = alloca i8**, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !8, globals: !55)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--lzw.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "FF_LZW_MODES", file: !4, line: 37, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/lzw.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7}
!6 = !DIEnumerator(name: "FF_LZW_GIF", value: 0)
!7 = !DIEnumerator(name: "FF_LZW_TIFF", value: 1)
!8 = !{!9, !19, !27, !54}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64, align: 64)
!10 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LZWState", file: !11, line: 46, size: 131840, align: 64, elements: !12)
!11 = !DIFile(filename: "libavcodec/lzw.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!12 = !{!13, !26, !28, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !44, !48, !49, !53}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !10, file: !11, line: 47, baseType: !14, size: 192, align: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !15, line: 35, baseType: !16)
!15 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !15, line: 33, size: 192, align: 64, elements: !17)
!17 = !{!18, !24, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !16, file: !15, line: 34, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 48, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !16, file: !15, line: 34, baseType: !19, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !16, file: !15, line: 34, baseType: !19, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "bbits", scope: !10, file: !11, line: 48, baseType: !27, size: 32, align: 32, offset: 192)
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "bbuf", scope: !10, file: !11, line: 49, baseType: !29, size: 32, align: 32, offset: 224)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !10, file: !11, line: 51, baseType: !27, size: 32, align: 32, offset: 256)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "cursize", scope: !10, file: !11, line: 52, baseType: !27, size: 32, align: 32, offset: 288)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "curmask", scope: !10, file: !11, line: 53, baseType: !27, size: 32, align: 32, offset: 320)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "codesize", scope: !10, file: !11, line: 54, baseType: !27, size: 32, align: 32, offset: 352)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "clear_code", scope: !10, file: !11, line: 55, baseType: !27, size: 32, align: 32, offset: 384)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "end_code", scope: !10, file: !11, line: 56, baseType: !27, size: 32, align: 32, offset: 416)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "newcodes", scope: !10, file: !11, line: 57, baseType: !27, size: 32, align: 32, offset: 448)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "top_slot", scope: !10, file: !11, line: 58, baseType: !27, size: 32, align: 32, offset: 480)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "extra_slot", scope: !10, file: !11, line: 59, baseType: !27, size: 32, align: 32, offset: 512)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !10, file: !11, line: 60, baseType: !27, size: 32, align: 32, offset: 544)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fc", scope: !10, file: !11, line: 61, baseType: !27, size: 32, align: 32, offset: 576)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "oc", scope: !10, file: !11, line: 61, baseType: !27, size: 32, align: 32, offset: 608)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sp", scope: !10, file: !11, line: 62, baseType: !43, size: 64, align: 64, offset: 640)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !10, file: !11, line: 63, baseType: !45, size: 32768, align: 8, offset: 704)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 32768, align: 8, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 4096)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "suffix", scope: !10, file: !11, line: 64, baseType: !45, size: 32768, align: 8, offset: 33472)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !10, file: !11, line: 65, baseType: !50, size: 65536, align: 16, offset: 66240)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 65536, align: 16, elements: !46)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !22, line: 49, baseType: !52)
!52 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "bs", scope: !10, file: !11, line: 66, baseType: !27, size: 32, align: 32, offset: 131776)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!55 = !{!56}
!56 = distinct !DIGlobalVariable(name: "mask", scope: !0, file: !11, line: 38, type: !57, isLocal: true, isDefinition: true, variable: [17 x i16]* @mask)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 272, align: 16, elements: !59)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!59 = !{!60}
!60 = !DISubrange(count: 17)
!61 = !{i32 2, !"Dwarf Version", i32 4}
!62 = !{i32 2, !"Debug Info Version", i32 3}
!63 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!64 = distinct !DISubprogram(name: "ff_lzw_decode_tail", scope: !11, file: !11, line: 99, type: !65, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !69)
!65 = !DISubroutineType(types: !66)
!66 = !{!27, !67}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "LZWState", file: !4, line: 43, baseType: null)
!69 = !{}
!70 = !DILocalVariable(name: "g", arg: 1, scope: !71, file: !15, line: 164, type: !74)
!71 = distinct !DISubprogram(name: "bytestream2_skip", scope: !15, file: !15, line: 164, type: !72, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !69)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !74, !29}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64, align: 64)
!75 = !DIExpression()
!76 = !DILocation(line: 164, column: 84, scope: !71, inlinedAt: !77)
!77 = distinct !DILocation(line: 105, column: 13, scope: !78)
!78 = distinct !DILexicalBlock(scope: !79, file: !11, line: 104, column: 65)
!79 = distinct !DILexicalBlock(scope: !80, file: !11, line: 103, column: 31)
!80 = distinct !DILexicalBlock(scope: !64, file: !11, line: 103, column: 8)
!81 = !DILocalVariable(name: "size", arg: 2, scope: !71, file: !15, line: 165, type: !29)
!82 = !DILocation(line: 165, column: 60, scope: !71, inlinedAt: !77)
!83 = !DILocalVariable(name: "b", arg: 1, scope: !84, file: !15, line: 95, type: !87)
!84 = distinct !DISubprogram(name: "bytestream_get_byte", scope: !15, file: !15, line: 95, type: !85, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !69)
!85 = !DISubroutineType(types: !86)
!86 = !{!29, !87}
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!88 = !DILocation(line: 95, column: 95, scope: !84, inlinedAt: !89)
!89 = distinct !DILocation(line: 95, column: 855, scope: !90, inlinedAt: !93)
!90 = distinct !DISubprogram(name: "bytestream2_get_byteu", scope: !15, file: !15, line: 95, type: !91, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !69)
!91 = !DISubroutineType(types: !92)
!92 = !{!29, !74}
!93 = distinct !DILocation(line: 95, column: 1073, scope: !94, inlinedAt: !96)
!94 = !DILexicalBlockFile(scope: !95, file: !15, discriminator: 2)
!95 = distinct !DISubprogram(name: "bytestream2_get_byte", scope: !15, file: !15, line: 95, type: !91, isLocal: true, isDefinition: true, scopeLine: 95, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !69)
!96 = distinct !DILocation(line: 106, column: 21, scope: !78)
!97 = !DILocalVariable(name: "g", arg: 1, scope: !90, file: !15, line: 95, type: !74)
!98 = !DILocation(line: 95, column: 843, scope: !90, inlinedAt: !93)
!99 = !DILocalVariable(name: "g", arg: 1, scope: !95, file: !15, line: 95, type: !74)
!100 = !DILocation(line: 95, column: 985, scope: !95, inlinedAt: !96)
!101 = !DILocalVariable(name: "g", arg: 1, scope: !102, file: !15, line: 154, type: !74)
