; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--opus_celt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--opus_celt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CeltFrame = type { %struct.AVCodecContext*, [4 x %struct.MDCT15Context*], %struct.AVFloatDSPContext*, [16 x i8], [2 x %struct.CeltBlock], %struct.CeltPVQ*, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [21 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, float, i32, i32, i32, [21 x i32], [21 x i32], [21 x i32], [21 x i32], [21 x i32], [12 x i8] }

!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !888, line: 77, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892}
!890 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!892 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !888, line: 83, size: 32, align: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!896 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltBlockSize", file: !898, line: 56, size: 32, align: 32, elements: !899)
!898 = !DIFile(filename: "libavcodec/opus_celt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!899 = !{!900, !901, !902, !903, !904}
!900 = !DIEnumerator(name: "CELT_BLOCK_120", value: 0)
!901 = !DIEnumerator(name: "CELT_BLOCK_240", value: 1)
!902 = !DIEnumerator(name: "CELT_BLOCK_480", value: 2)
!903 = !DIEnumerator(name: "CELT_BLOCK_960", value: 3)
!904 = !DIEnumerator(name: "CELT_BLOCK_NB", value: 4)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CeltSpread", file: !898, line: 49, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "CELT_SPREAD_NONE", value: 0)
!908 = !DIEnumerator(name: "CELT_SPREAD_LIGHT", value: 1)
!909 = !DIEnumerator(name: "CELT_SPREAD_NORMAL", value: 2)
!910 = !DIEnumerator(name: "CELT_SPREAD_AGGRESSIVE", value: 3)
!911 = !{!912, !913, !914}
!912 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!913 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!914 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!915 = !{i32 2, !"Dwarf Version", i32 4}
!916 = !{i32 2, !"Debug Info Version", i32 3}
!917 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!918 = distinct !DISubprogram(name: "ff_celt_decode_frame", scope: !919, file: !919, line: 347, type: !920, isLocal: false, isDefinition: true, scopeLine: 350, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1784)
!919 = !DIFile(filename: "libavcodec/opus_celt.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !DISubroutineType(types: !921)
!921 = !{!912, !922, !1713, !1783, !912, !912, !912, !912}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "CeltFrame", file: !924, line: 82, baseType: !925)
!924 = !DIFile(filename: "libavcodec/opus.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CeltFrame", file: !898, line: 92, size: 275968, align: 256, elements: !926)
!926 = !{!927, !1526, !1608, !1651, !1692, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !925, file: !898, line: 94, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !931)
!931 = !{!932, !977, !978, !979, !1250, !1251, !1252, !1253, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1279, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1464, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !930, file: !35, line: 1561, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !937)
!937 = !{!938, !942, !947, !951, !952, !953, !954, !958, !964, !966, !970}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !936, file: !4, line: 72, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !936, file: !4, line: 78, baseType: !943, size: 64, align: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DISubroutineType(types: !945)
!945 = !{!939, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !936, file: !4, line: 85, baseType: !948, size: 64, align: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !936, file: !4, line: 93, baseType: !912, size: 32, align: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !936, file: !4, line: 99, baseType: !912, size: 32, align: 32, offset: 224)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !936, file: !4, line: 108, baseType: !912, size: 32, align: 32, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !936, file: !4, line: 113, baseType: !955, size: 64, align: 64, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!946, !946, !946}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !936, file: !4, line: 123, baseType: !959, size: 64, align: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!962, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !936, file: !4, line: 130, baseType: !965, size: 32, align: 32, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !936, file: !4, line: 136, baseType: !967, size: 64, align: 64, offset: 512)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!965, !946}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !936, file: !4, line: 142, baseType: !971, size: 64, align: 64, offset: 576)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!912, !974, !946, !939, !912}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!976 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !930, file: !35, line: 1562, baseType: !912, size: 32, align: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !930, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !930, file: !35, line: 1565, baseType: !980, size: 64, align: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !998, !1001, !1004, !1007, !1013, !1016, !1017, !1025, !1026, !1027, !1029, !1033, !1039, !1044, !1048, !1049, !1100, !1221, !1225, !1226, !1230, !1234, !1239, !1243, !1244, !1245}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !982, file: !35, line: 3475, baseType: !939, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !982, file: !35, line: 3480, baseType: !939, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !982, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !982, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !982, file: !35, line: 3487, baseType: !912, size: 32, align: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !982, file: !35, line: 3488, baseType: !990, size: 64, align: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !993, line: 61, baseType: !994)
!993 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !993, line: 58, size: 64, align: 32, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !994, file: !993, line: 59, baseType: !912, size: 32, align: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !994, file: !993, line: 60, baseType: !912, size: 32, align: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !982, file: !35, line: 3489, baseType: !999, size: 64, align: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !982, file: !35, line: 3490, baseType: !1002, size: 64, align: 64, offset: 384)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !982, file: !35, line: 3491, baseType: !1005, size: 64, align: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !982, file: !35, line: 3492, baseType: !1008, size: 64, align: 64, offset: 512)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1011, line: 55, baseType: !1012)
!1011 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1012 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !982, file: !35, line: 3493, baseType: !1014, size: 8, align: 8, offset: 576)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1011, line: 48, baseType: !1015)
!1015 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !982, file: !35, line: 3494, baseType: !933, size: 64, align: 64, offset: 640)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !982, file: !35, line: 3495, baseType: !1018, size: 64, align: 64, offset: 704)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1021, file: !35, line: 3402, baseType: !912, size: 32, align: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1021, file: !35, line: 3403, baseType: !939, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !982, file: !35, line: 3507, baseType: !939, size: 64, align: 64, offset: 768)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !982, file: !35, line: 3516, baseType: !912, size: 32, align: 32, offset: 832)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !35, line: 3517, baseType: !1028, size: 64, align: 64, offset: 896)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !982, file: !35, line: 3527, baseType: !1030, size: 64, align: 64, offset: 960)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!912, !928}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !982, file: !35, line: 3535, baseType: !1034, size: 64, align: 64, offset: 1024)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!912, !928, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !982, file: !35, line: 3541, baseType: !1040, size: 64, align: 64, offset: 1088)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1043)
!1043 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !982, file: !35, line: 3549, baseType: !1045, size: 64, align: 64, offset: 1152)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{null, !1028}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !982, file: !35, line: 3551, baseType: !1030, size: 64, align: 64, offset: 1216)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !982, file: !35, line: 3552, baseType: !1050, size: 64, align: 64, offset: 1280)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!912, !928, !1053, !912, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1057)
!1057 = !{!1058, !1061, !1063, !1064, !1065, !1097}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1056, file: !35, line: 3921, baseType: !1059, size: 16, align: 16)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1011, line: 49, baseType: !1060)
!1060 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1056, file: !35, line: 3922, baseType: !1062, size: 32, align: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1011, line: 51, baseType: !913)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1056, file: !35, line: 3923, baseType: !1062, size: 32, align: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1056, file: !35, line: 3924, baseType: !913, size: 32, align: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1056, file: !35, line: 3925, baseType: !1066, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1086, !1090, !1092, !1093, !1095, !1096}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1069, file: !35, line: 3886, baseType: !912, size: 32, align: 32)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1069, file: !35, line: 3887, baseType: !912, size: 32, align: 32, offset: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1069, file: !35, line: 3888, baseType: !912, size: 32, align: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1069, file: !35, line: 3889, baseType: !912, size: 32, align: 32, offset: 96)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1069, file: !35, line: 3890, baseType: !912, size: 32, align: 32, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1069, file: !35, line: 3897, baseType: !1077, size: 768, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1079)
!1079 = !{!1080, !1084}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1078, file: !35, line: 3855, baseType: !1081, size: 512, align: 64)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 512, align: 64, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 8)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1078, file: !35, line: 3857, baseType: !1085, size: 256, align: 32, offset: 512)
!1085 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 256, align: 32, elements: !1082)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1069, file: !35, line: 3903, baseType: !1087, size: 256, align: 64, offset: 960)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1053, size: 256, align: 64, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 4)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1069, file: !35, line: 3904, baseType: !1091, size: 128, align: 32, offset: 1216)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 128, align: 32, elements: !1088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1069, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1069, file: !35, line: 3908, baseType: !1094, size: 64, align: 64, offset: 1408)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1069, file: !35, line: 3915, baseType: !1094, size: 64, align: 64, offset: 1472)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1069, file: !35, line: 3917, baseType: !912, size: 32, align: 32, offset: 1536)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1056, file: !35, line: 3926, baseType: !1098, size: 64, align: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1011, line: 40, baseType: !1099)
!1099 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !982, file: !35, line: 3564, baseType: !1101, size: 64, align: 64, offset: 1344)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!912, !928, !1104, !1138, !1220}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1107)
!1107 = !{!1108, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1134, !1135, !1136, !1137}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !35, line: 1451, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1111, line: 94, baseType: !1112)
!1111 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1111, line: 81, size: 192, align: 64, elements: !1113)
!1113 = !{!1114, !1118, !1119}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1112, file: !1111, line: 82, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1111, line: 73, baseType: !1117)
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1111, line: 73, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !1111, line: 89, baseType: !1053, size: 64, align: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !1111, line: 93, baseType: !912, size: 32, align: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1106, file: !35, line: 1461, baseType: !1098, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1106, file: !35, line: 1467, baseType: !1098, size: 64, align: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !35, line: 1468, baseType: !1053, size: 64, align: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !35, line: 1469, baseType: !912, size: 32, align: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1106, file: !35, line: 1470, baseType: !912, size: 32, align: 32, offset: 288)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !35, line: 1474, baseType: !912, size: 32, align: 32, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1106, file: !35, line: 1479, baseType: !1127, size: 64, align: 64, offset: 384)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !35, line: 1412, baseType: !1053, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !35, line: 1413, baseType: !912, size: 32, align: 32, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1129, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1106, file: !35, line: 1480, baseType: !912, size: 32, align: 32, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1106, file: !35, line: 1486, baseType: !1098, size: 64, align: 64, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1106, file: !35, line: 1488, baseType: !1098, size: 64, align: 64, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1106, file: !35, line: 1497, baseType: !1098, size: 64, align: 64, offset: 640)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1172, !1174, !1175, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1208, !1209, !1210, !1211, !1212, !1213, !1216, !1217, !1218, !1219}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !758, line: 282, baseType: !1081, size: 512, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1141, file: !758, line: 299, baseType: !1085, size: 256, align: 32, offset: 512)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1141, file: !758, line: 315, baseType: !1146, size: 64, align: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1141, file: !758, line: 326, baseType: !912, size: 32, align: 32, offset: 832)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1141, file: !758, line: 326, baseType: !912, size: 32, align: 32, offset: 864)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1141, file: !758, line: 334, baseType: !912, size: 32, align: 32, offset: 896)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1141, file: !758, line: 341, baseType: !912, size: 32, align: 32, offset: 928)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1141, file: !758, line: 346, baseType: !912, size: 32, align: 32, offset: 960)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1141, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1141, file: !758, line: 356, baseType: !992, size: 64, align: 32, offset: 1024)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1141, file: !758, line: 361, baseType: !1098, size: 64, align: 64, offset: 1088)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1141, file: !758, line: 369, baseType: !1098, size: 64, align: 64, offset: 1152)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1141, file: !758, line: 377, baseType: !1098, size: 64, align: 64, offset: 1216)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1141, file: !758, line: 382, baseType: !912, size: 32, align: 32, offset: 1280)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1141, file: !758, line: 386, baseType: !912, size: 32, align: 32, offset: 1312)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1141, file: !758, line: 391, baseType: !912, size: 32, align: 32, offset: 1344)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1141, file: !758, line: 396, baseType: !946, size: 64, align: 64, offset: 1408)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1141, file: !758, line: 403, baseType: !1162, size: 512, align: 64, offset: 1472)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 512, align: 64, elements: !1082)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1141, file: !758, line: 410, baseType: !912, size: 32, align: 32, offset: 1984)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1141, file: !758, line: 415, baseType: !912, size: 32, align: 32, offset: 2016)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1141, file: !758, line: 420, baseType: !912, size: 32, align: 32, offset: 2048)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1141, file: !758, line: 425, baseType: !912, size: 32, align: 32, offset: 2080)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1141, file: !758, line: 435, baseType: !1098, size: 64, align: 64, offset: 2112)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1141, file: !758, line: 440, baseType: !912, size: 32, align: 32, offset: 2176)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1141, file: !758, line: 445, baseType: !1010, size: 64, align: 64, offset: 2240)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1141, file: !758, line: 459, baseType: !1171, size: 512, align: 64, offset: 2304)
!1171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 512, align: 64, elements: !1082)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1141, file: !758, line: 473, baseType: !1173, size: 64, align: 64, offset: 2816)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1141, file: !758, line: 477, baseType: !912, size: 32, align: 32, offset: 2880)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1141, file: !758, line: 479, baseType: !1176, size: 64, align: 64, offset: 2944)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1179)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1189}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1179, file: !758, line: 203, baseType: !1053, size: 64, align: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1179, file: !758, line: 204, baseType: !912, size: 32, align: 32, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1179, file: !758, line: 205, baseType: !1185, size: 64, align: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1187, line: 86, baseType: !1188)
!1187 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1187, line: 86, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1179, file: !758, line: 206, baseType: !1109, size: 64, align: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1141, file: !758, line: 480, baseType: !912, size: 32, align: 32, offset: 3008)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !758, line: 505, baseType: !912, size: 32, align: 32, offset: 3040)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1141, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1141, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1141, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1141, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1141, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1141, file: !758, line: 532, baseType: !1098, size: 64, align: 64, offset: 3264)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1141, file: !758, line: 539, baseType: !1098, size: 64, align: 64, offset: 3328)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1141, file: !758, line: 547, baseType: !1098, size: 64, align: 64, offset: 3392)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1141, file: !758, line: 554, baseType: !1185, size: 64, align: 64, offset: 3456)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1141, file: !758, line: 563, baseType: !912, size: 32, align: 32, offset: 3520)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1141, file: !758, line: 572, baseType: !912, size: 32, align: 32, offset: 3552)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1141, file: !758, line: 581, baseType: !912, size: 32, align: 32, offset: 3584)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1141, file: !758, line: 588, baseType: !1205, size: 64, align: 64, offset: 3648)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1011, line: 36, baseType: !1207)
!1207 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1141, file: !758, line: 593, baseType: !912, size: 32, align: 32, offset: 3712)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1141, file: !758, line: 596, baseType: !912, size: 32, align: 32, offset: 3744)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1141, file: !758, line: 599, baseType: !1109, size: 64, align: 64, offset: 3776)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1141, file: !758, line: 605, baseType: !1109, size: 64, align: 64, offset: 3840)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1141, file: !758, line: 616, baseType: !1109, size: 64, align: 64, offset: 3904)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1141, file: !758, line: 626, baseType: !1214, size: 64, align: 64, offset: 3968)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1215, line: 216, baseType: !1012)
!1215 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1141, file: !758, line: 627, baseType: !1214, size: 64, align: 64, offset: 4032)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1141, file: !758, line: 628, baseType: !1214, size: 64, align: 64, offset: 4096)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1141, file: !758, line: 629, baseType: !1214, size: 64, align: 64, offset: 4160)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1141, file: !758, line: 645, baseType: !1109, size: 64, align: 64, offset: 4224)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !982, file: !35, line: 3566, baseType: !1222, size: 64, align: 64, offset: 1408)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!912, !928, !946, !1220, !1104}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !982, file: !35, line: 3567, baseType: !1030, size: 64, align: 64, offset: 1472)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !982, file: !35, line: 3576, baseType: !1227, size: 64, align: 64, offset: 1536)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!912, !928, !1138}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !982, file: !35, line: 3577, baseType: !1231, size: 64, align: 64, offset: 1600)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!912, !928, !1104}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !982, file: !35, line: 3584, baseType: !1235, size: 64, align: 64, offset: 1664)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!912, !928, !1238}
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !982, file: !35, line: 3589, baseType: !1240, size: 64, align: 64, offset: 1728)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !928}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !982, file: !35, line: 3594, baseType: !912, size: 32, align: 32, offset: 1792)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !982, file: !35, line: 3600, baseType: !939, size: 64, align: 64, offset: 1856)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !982, file: !35, line: 3609, baseType: !1246, size: 64, align: 64, offset: 1920)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1249)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !930, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !930, file: !35, line: 1581, baseType: !913, size: 32, align: 32, offset: 224)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !930, file: !35, line: 1583, baseType: !946, size: 64, align: 64, offset: 256)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !930, file: !35, line: 1591, baseType: !1254, size: 64, align: 64, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !930, file: !35, line: 1598, baseType: !946, size: 64, align: 64, offset: 384)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !930, file: !35, line: 1606, baseType: !1098, size: 64, align: 64, offset: 448)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !930, file: !35, line: 1614, baseType: !912, size: 32, align: 32, offset: 512)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !930, file: !35, line: 1622, baseType: !912, size: 32, align: 32, offset: 544)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !930, file: !35, line: 1628, baseType: !912, size: 32, align: 32, offset: 576)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !930, file: !35, line: 1636, baseType: !912, size: 32, align: 32, offset: 608)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !930, file: !35, line: 1643, baseType: !912, size: 32, align: 32, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !930, file: !35, line: 1657, baseType: !1053, size: 64, align: 64, offset: 704)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !930, file: !35, line: 1658, baseType: !912, size: 32, align: 32, offset: 768)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !930, file: !35, line: 1679, baseType: !992, size: 64, align: 32, offset: 800)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !930, file: !35, line: 1688, baseType: !912, size: 32, align: 32, offset: 864)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !930, file: !35, line: 1712, baseType: !912, size: 32, align: 32, offset: 896)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !930, file: !35, line: 1729, baseType: !912, size: 32, align: 32, offset: 928)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !930, file: !35, line: 1729, baseType: !912, size: 32, align: 32, offset: 960)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !930, file: !35, line: 1744, baseType: !912, size: 32, align: 32, offset: 992)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !930, file: !35, line: 1744, baseType: !912, size: 32, align: 32, offset: 1024)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !930, file: !35, line: 1751, baseType: !912, size: 32, align: 32, offset: 1056)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !930, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !930, file: !35, line: 1791, baseType: !1275, size: 64, align: 64, offset: 1152)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{null, !1278, !1138, !1220, !912, !912, !912}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !930, file: !35, line: 1808, baseType: !1280, size: 64, align: 64, offset: 1216)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!494, !1278, !999}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !930, file: !35, line: 1816, baseType: !912, size: 32, align: 32, offset: 1280)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !930, file: !35, line: 1825, baseType: !914, size: 32, align: 32, offset: 1312)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !930, file: !35, line: 1830, baseType: !912, size: 32, align: 32, offset: 1344)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !930, file: !35, line: 1838, baseType: !914, size: 32, align: 32, offset: 1376)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !930, file: !35, line: 1846, baseType: !912, size: 32, align: 32, offset: 1408)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !930, file: !35, line: 1851, baseType: !912, size: 32, align: 32, offset: 1440)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !930, file: !35, line: 1861, baseType: !914, size: 32, align: 32, offset: 1472)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !930, file: !35, line: 1868, baseType: !914, size: 32, align: 32, offset: 1504)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !930, file: !35, line: 1875, baseType: !914, size: 32, align: 32, offset: 1536)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !930, file: !35, line: 1882, baseType: !914, size: 32, align: 32, offset: 1568)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !930, file: !35, line: 1889, baseType: !914, size: 32, align: 32, offset: 1600)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !930, file: !35, line: 1896, baseType: !914, size: 32, align: 32, offset: 1632)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !930, file: !35, line: 1903, baseType: !914, size: 32, align: 32, offset: 1664)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !930, file: !35, line: 1910, baseType: !912, size: 32, align: 32, offset: 1696)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !930, file: !35, line: 1915, baseType: !912, size: 32, align: 32, offset: 1728)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !930, file: !35, line: 1926, baseType: !1220, size: 64, align: 64, offset: 1792)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !930, file: !35, line: 1935, baseType: !992, size: 64, align: 32, offset: 1856)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !930, file: !35, line: 1942, baseType: !912, size: 32, align: 32, offset: 1920)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !930, file: !35, line: 1948, baseType: !912, size: 32, align: 32, offset: 1952)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !930, file: !35, line: 1954, baseType: !912, size: 32, align: 32, offset: 1984)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !930, file: !35, line: 1960, baseType: !912, size: 32, align: 32, offset: 2016)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !930, file: !35, line: 1984, baseType: !912, size: 32, align: 32, offset: 2048)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !930, file: !35, line: 1991, baseType: !912, size: 32, align: 32, offset: 2080)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !930, file: !35, line: 1996, baseType: !912, size: 32, align: 32, offset: 2112)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !930, file: !35, line: 2004, baseType: !912, size: 32, align: 32, offset: 2144)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !930, file: !35, line: 2011, baseType: !912, size: 32, align: 32, offset: 2176)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !930, file: !35, line: 2018, baseType: !912, size: 32, align: 32, offset: 2208)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !930, file: !35, line: 2027, baseType: !912, size: 32, align: 32, offset: 2240)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !930, file: !35, line: 2034, baseType: !912, size: 32, align: 32, offset: 2272)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !930, file: !35, line: 2044, baseType: !912, size: 32, align: 32, offset: 2304)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !930, file: !35, line: 2054, baseType: !1314, size: 64, align: 64, offset: 2368)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !930, file: !35, line: 2061, baseType: !1314, size: 64, align: 64, offset: 2432)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !930, file: !35, line: 2066, baseType: !912, size: 32, align: 32, offset: 2496)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !930, file: !35, line: 2070, baseType: !912, size: 32, align: 32, offset: 2528)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !930, file: !35, line: 2078, baseType: !912, size: 32, align: 32, offset: 2560)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !930, file: !35, line: 2085, baseType: !912, size: 32, align: 32, offset: 2592)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !930, file: !35, line: 2092, baseType: !912, size: 32, align: 32, offset: 2624)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !930, file: !35, line: 2099, baseType: !912, size: 32, align: 32, offset: 2656)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !930, file: !35, line: 2106, baseType: !912, size: 32, align: 32, offset: 2688)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !930, file: !35, line: 2113, baseType: !912, size: 32, align: 32, offset: 2720)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !930, file: !35, line: 2120, baseType: !912, size: 32, align: 32, offset: 2752)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !930, file: !35, line: 2125, baseType: !912, size: 32, align: 32, offset: 2784)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !930, file: !35, line: 2133, baseType: !912, size: 32, align: 32, offset: 2816)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !930, file: !35, line: 2140, baseType: !912, size: 32, align: 32, offset: 2848)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !930, file: !35, line: 2145, baseType: !912, size: 32, align: 32, offset: 2880)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !930, file: !35, line: 2153, baseType: !912, size: 32, align: 32, offset: 2912)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !930, file: !35, line: 2158, baseType: !912, size: 32, align: 32, offset: 2944)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !930, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !930, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !930, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !930, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !930, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !930, file: !35, line: 2203, baseType: !912, size: 32, align: 32, offset: 3136)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !930, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !930, file: !35, line: 2212, baseType: !912, size: 32, align: 32, offset: 3200)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !930, file: !35, line: 2213, baseType: !912, size: 32, align: 32, offset: 3232)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !930, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !930, file: !35, line: 2232, baseType: !912, size: 32, align: 32, offset: 3296)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !930, file: !35, line: 2243, baseType: !912, size: 32, align: 32, offset: 3328)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !930, file: !35, line: 2249, baseType: !912, size: 32, align: 32, offset: 3360)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !930, file: !35, line: 2256, baseType: !912, size: 32, align: 32, offset: 3392)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !930, file: !35, line: 2263, baseType: !1010, size: 64, align: 64, offset: 3456)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !930, file: !35, line: 2270, baseType: !1010, size: 64, align: 64, offset: 3520)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !930, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !930, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !930, file: !35, line: 2367, baseType: !1350, size: 64, align: 64, offset: 3648)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!912, !1278, !1238, !912}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !930, file: !35, line: 2383, baseType: !912, size: 32, align: 32, offset: 3712)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !930, file: !35, line: 2386, baseType: !914, size: 32, align: 32, offset: 3744)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !930, file: !35, line: 2387, baseType: !914, size: 32, align: 32, offset: 3776)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !930, file: !35, line: 2394, baseType: !912, size: 32, align: 32, offset: 3808)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !930, file: !35, line: 2401, baseType: !912, size: 32, align: 32, offset: 3840)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !930, file: !35, line: 2408, baseType: !912, size: 32, align: 32, offset: 3872)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !930, file: !35, line: 2415, baseType: !912, size: 32, align: 32, offset: 3904)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !930, file: !35, line: 2422, baseType: !912, size: 32, align: 32, offset: 3936)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !930, file: !35, line: 2423, baseType: !1362, size: 64, align: 64, offset: 3968)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1364, file: !35, line: 827, baseType: !912, size: 32, align: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1364, file: !35, line: 828, baseType: !912, size: 32, align: 32, offset: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1364, file: !35, line: 829, baseType: !912, size: 32, align: 32, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1364, file: !35, line: 830, baseType: !914, size: 32, align: 32, offset: 96)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !930, file: !35, line: 2430, baseType: !1098, size: 64, align: 64, offset: 4032)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !930, file: !35, line: 2437, baseType: !1098, size: 64, align: 64, offset: 4096)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !930, file: !35, line: 2444, baseType: !914, size: 32, align: 32, offset: 4160)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !930, file: !35, line: 2451, baseType: !914, size: 32, align: 32, offset: 4192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !930, file: !35, line: 2458, baseType: !912, size: 32, align: 32, offset: 4224)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !930, file: !35, line: 2469, baseType: !912, size: 32, align: 32, offset: 4256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !930, file: !35, line: 2475, baseType: !912, size: 32, align: 32, offset: 4288)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !930, file: !35, line: 2481, baseType: !912, size: 32, align: 32, offset: 4320)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !930, file: !35, line: 2485, baseType: !912, size: 32, align: 32, offset: 4352)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !930, file: !35, line: 2489, baseType: !912, size: 32, align: 32, offset: 4384)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !930, file: !35, line: 2493, baseType: !912, size: 32, align: 32, offset: 4416)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !930, file: !35, line: 2501, baseType: !912, size: 32, align: 32, offset: 4448)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !930, file: !35, line: 2506, baseType: !912, size: 32, align: 32, offset: 4480)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !930, file: !35, line: 2510, baseType: !912, size: 32, align: 32, offset: 4512)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !930, file: !35, line: 2514, baseType: !1098, size: 64, align: 64, offset: 4544)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !930, file: !35, line: 2528, baseType: !1386, size: 64, align: 64, offset: 4608)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DISubroutineType(types: !1388)
!1388 = !{null, !1278, !946, !912, !912}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !930, file: !35, line: 2534, baseType: !912, size: 32, align: 32, offset: 4672)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !930, file: !35, line: 2545, baseType: !912, size: 32, align: 32, offset: 4704)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !930, file: !35, line: 2547, baseType: !912, size: 32, align: 32, offset: 4736)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !930, file: !35, line: 2549, baseType: !912, size: 32, align: 32, offset: 4768)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !930, file: !35, line: 2551, baseType: !912, size: 32, align: 32, offset: 4800)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !930, file: !35, line: 2553, baseType: !912, size: 32, align: 32, offset: 4832)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !930, file: !35, line: 2555, baseType: !912, size: 32, align: 32, offset: 4864)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !930, file: !35, line: 2557, baseType: !912, size: 32, align: 32, offset: 4896)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !930, file: !35, line: 2559, baseType: !912, size: 32, align: 32, offset: 4928)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !930, file: !35, line: 2563, baseType: !912, size: 32, align: 32, offset: 4960)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !930, file: !35, line: 2571, baseType: !1094, size: 64, align: 64, offset: 4992)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !930, file: !35, line: 2579, baseType: !1094, size: 64, align: 64, offset: 5056)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !930, file: !35, line: 2586, baseType: !912, size: 32, align: 32, offset: 5120)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !930, file: !35, line: 2615, baseType: !912, size: 32, align: 32, offset: 5152)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !930, file: !35, line: 2627, baseType: !912, size: 32, align: 32, offset: 5184)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !930, file: !35, line: 2637, baseType: !912, size: 32, align: 32, offset: 5216)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !930, file: !35, line: 2681, baseType: !912, size: 32, align: 32, offset: 5248)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !930, file: !35, line: 2709, baseType: !1098, size: 64, align: 64, offset: 5312)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !930, file: !35, line: 2716, baseType: !1408, size: 64, align: 64, offset: 5376)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1410)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1415, !1416, !1417, !1418, !1424, !1428, !1429, !1430, !1431, !1437, !1438, !1439, !1440, !1441}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1410, file: !35, line: 3642, baseType: !939, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1410, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1410, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1410, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1410, file: !35, line: 3669, baseType: !912, size: 32, align: 32, offset: 160)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1410, file: !35, line: 3682, baseType: !1235, size: 64, align: 64, offset: 192)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1410, file: !35, line: 3698, baseType: !1419, size: 64, align: 64, offset: 256)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{!912, !928, !1422, !1062}
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1410, file: !35, line: 3712, baseType: !1425, size: 64, align: 64, offset: 320)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!912, !928, !912, !1422, !1062}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1410, file: !35, line: 3726, baseType: !1419, size: 64, align: 64, offset: 384)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1410, file: !35, line: 3737, baseType: !1030, size: 64, align: 64, offset: 448)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1410, file: !35, line: 3746, baseType: !912, size: 32, align: 32, offset: 512)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1410, file: !35, line: 3757, baseType: !1432, size: 64, align: 64, offset: 576)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{null, !1435}
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1410, file: !35, line: 3766, baseType: !1030, size: 64, align: 64, offset: 640)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1410, file: !35, line: 3774, baseType: !1030, size: 64, align: 64, offset: 704)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1410, file: !35, line: 3780, baseType: !912, size: 32, align: 32, offset: 768)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1410, file: !35, line: 3785, baseType: !912, size: 32, align: 32, offset: 800)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1410, file: !35, line: 3795, baseType: !1442, size: 64, align: 64, offset: 832)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!912, !928, !1109}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !930, file: !35, line: 2728, baseType: !946, size: 64, align: 64, offset: 5440)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !930, file: !35, line: 2735, baseType: !1162, size: 512, align: 64, offset: 5504)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !930, file: !35, line: 2742, baseType: !912, size: 32, align: 32, offset: 6016)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !930, file: !35, line: 2755, baseType: !912, size: 32, align: 32, offset: 6048)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !930, file: !35, line: 2776, baseType: !912, size: 32, align: 32, offset: 6080)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !930, file: !35, line: 2783, baseType: !912, size: 32, align: 32, offset: 6112)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !930, file: !35, line: 2791, baseType: !912, size: 32, align: 32, offset: 6144)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !930, file: !35, line: 2802, baseType: !1238, size: 64, align: 64, offset: 6208)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !930, file: !35, line: 2811, baseType: !912, size: 32, align: 32, offset: 6272)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !930, file: !35, line: 2821, baseType: !912, size: 32, align: 32, offset: 6304)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !930, file: !35, line: 2830, baseType: !912, size: 32, align: 32, offset: 6336)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !930, file: !35, line: 2840, baseType: !912, size: 32, align: 32, offset: 6368)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !930, file: !35, line: 2851, baseType: !1458, size: 64, align: 64, offset: 6400)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!912, !1278, !1461, !946, !1220, !912, !912}
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!912, !1278, !946}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !930, file: !35, line: 2871, baseType: !1465, size: 64, align: 64, offset: 6464)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!912, !1278, !1468, !946, !1220, !912}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!912, !1278, !946, !912, !912}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !930, file: !35, line: 2878, baseType: !912, size: 32, align: 32, offset: 6528)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !930, file: !35, line: 2885, baseType: !912, size: 32, align: 32, offset: 6560)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !930, file: !35, line: 3005, baseType: !912, size: 32, align: 32, offset: 6592)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !930, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !930, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !930, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !930, file: !35, line: 3037, baseType: !1053, size: 64, align: 64, offset: 6720)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !930, file: !35, line: 3038, baseType: !912, size: 32, align: 32, offset: 6784)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !930, file: !35, line: 3050, baseType: !1010, size: 64, align: 64, offset: 6848)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !930, file: !35, line: 3065, baseType: !912, size: 32, align: 32, offset: 6912)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !930, file: !35, line: 3083, baseType: !912, size: 32, align: 32, offset: 6944)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !930, file: !35, line: 3092, baseType: !992, size: 64, align: 32, offset: 6976)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !930, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !930, file: !35, line: 3106, baseType: !992, size: 64, align: 32, offset: 7072)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !930, file: !35, line: 3113, baseType: !1486, size: 64, align: 64, offset: 7168)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1488)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1489)
!1489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1490)
!1490 = !{!1491, !1492, !1493, !1494, !1495, !1496, !1499}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1489, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1489, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1489, file: !35, line: 720, baseType: !939, size: 64, align: 64, offset: 64)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1489, file: !35, line: 724, baseType: !939, size: 64, align: 64, offset: 128)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1489, file: !35, line: 728, baseType: !912, size: 32, align: 32, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1489, file: !35, line: 734, baseType: !1497, size: 64, align: 64, offset: 256)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1489, file: !35, line: 739, baseType: !1500, size: 64, align: 64, offset: 320)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !930, file: !35, line: 3129, baseType: !1098, size: 64, align: 64, offset: 7232)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !930, file: !35, line: 3130, baseType: !1098, size: 64, align: 64, offset: 7296)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !930, file: !35, line: 3131, baseType: !1098, size: 64, align: 64, offset: 7360)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !930, file: !35, line: 3132, baseType: !1098, size: 64, align: 64, offset: 7424)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !930, file: !35, line: 3139, baseType: !1094, size: 64, align: 64, offset: 7488)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !930, file: !35, line: 3147, baseType: !912, size: 32, align: 32, offset: 7552)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !930, file: !35, line: 3165, baseType: !912, size: 32, align: 32, offset: 7584)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !930, file: !35, line: 3172, baseType: !912, size: 32, align: 32, offset: 7616)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !930, file: !35, line: 3180, baseType: !912, size: 32, align: 32, offset: 7648)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !930, file: !35, line: 3191, baseType: !1314, size: 64, align: 64, offset: 7680)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !930, file: !35, line: 3199, baseType: !1053, size: 64, align: 64, offset: 7744)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !930, file: !35, line: 3207, baseType: !1094, size: 64, align: 64, offset: 7808)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !930, file: !35, line: 3214, baseType: !913, size: 32, align: 32, offset: 7872)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !930, file: !35, line: 3224, baseType: !1127, size: 64, align: 64, offset: 7936)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !930, file: !35, line: 3225, baseType: !912, size: 32, align: 32, offset: 8000)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !930, file: !35, line: 3249, baseType: !1109, size: 64, align: 64, offset: 8064)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !930, file: !35, line: 3256, baseType: !912, size: 32, align: 32, offset: 8128)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !930, file: !35, line: 3271, baseType: !912, size: 32, align: 32, offset: 8160)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !930, file: !35, line: 3279, baseType: !1098, size: 64, align: 64, offset: 8192)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !930, file: !35, line: 3301, baseType: !1109, size: 64, align: 64, offset: 8256)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !930, file: !35, line: 3310, baseType: !912, size: 32, align: 32, offset: 8320)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !930, file: !35, line: 3337, baseType: !912, size: 32, align: 32, offset: 8352)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !930, file: !35, line: 3351, baseType: !912, size: 32, align: 32, offset: 8384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !930, file: !35, line: 3359, baseType: !912, size: 32, align: 32, offset: 8416)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "imdct", scope: !925, file: !898, line: 95, baseType: !1527, size: 256, align: 64, offset: 64)
!1527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1528, size: 256, align: 64, elements: !1088)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_typedef, name: "MDCT15Context", file: !1530, line: 54, baseType: !1531)
!1530 = !DIFile(filename: "libavcodec/mdct15.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MDCT15Context", file: !1530, line: 28, size: 5632, align: 256, elements: !1532)
!1532 = !{!1533, !1534, !1535, !1536, !1537, !1538, !1539, !1584, !1585, !1586, !1590, !1595, !1599, !1607}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "fft_n", scope: !1531, file: !1530, line: 29, baseType: !912, size: 32, align: 32)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "len2", scope: !1531, file: !1530, line: 30, baseType: !912, size: 32, align: 32, offset: 32)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "len4", scope: !1531, file: !1530, line: 31, baseType: !912, size: 32, align: 32, offset: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1531, file: !1530, line: 32, baseType: !912, size: 32, align: 32, offset: 96)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_prereindex", scope: !1531, file: !1530, line: 33, baseType: !1220, size: 64, align: 64, offset: 128)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pfa_postreindex", scope: !1531, file: !1530, line: 34, baseType: !1220, size: 64, align: 64, offset: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "ptwo_fft", scope: !1531, file: !1530, line: 36, baseType: !1540, size: 896, align: 64, offset: 256)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !1541, line: 41, baseType: !1542)
!1541 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !888, line: 88, size: 896, align: 64, elements: !1543)
!1543 = !{!1544, !1545, !1546, !1547, !1555, !1556, !1557, !1559, !1560, !1565, !1566, !1572, !1573, !1574, !1580, !1581, !1582}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !1542, file: !888, line: 89, baseType: !912, size: 32, align: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !1542, file: !888, line: 90, baseType: !912, size: 32, align: 32, offset: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !1542, file: !888, line: 91, baseType: !1314, size: 64, align: 64, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !1542, file: !888, line: 92, baseType: !1548, size: 64, align: 64, offset: 128)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !1541, line: 39, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !1541, line: 37, size: 64, align: 32, elements: !1551)
!1551 = !{!1552, !1554}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !1550, file: !1541, line: 38, baseType: !1553, size: 32, align: 32)
!1553 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !1541, line: 35, baseType: !914)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !1550, file: !1541, line: 38, baseType: !1553, size: 32, align: 32, offset: 32)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !1542, file: !888, line: 93, baseType: !912, size: 32, align: 32, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !1542, file: !888, line: 94, baseType: !912, size: 32, align: 32, offset: 224)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !1542, file: !888, line: 96, baseType: !1558, size: 64, align: 64, offset: 256)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !1542, file: !888, line: 97, baseType: !1558, size: 64, align: 64, offset: 320)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !1542, file: !888, line: 101, baseType: !1561, size: 64, align: 64, offset: 384)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{null, !1564, !1548}
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !1542, file: !888, line: 106, baseType: !1561, size: 64, align: 64, offset: 448)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !1542, file: !888, line: 107, baseType: !1567, size: 64, align: 64, offset: 512)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{null, !1564, !1558, !1570}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1553)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1542, file: !888, line: 108, baseType: !1567, size: 64, align: 64, offset: 576)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !1542, file: !888, line: 109, baseType: !1567, size: 64, align: 64, offset: 640)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !1542, file: !888, line: 110, baseType: !1575, size: 64, align: 64, offset: 704)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{null, !1564, !1578, !1570}
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !888, line: 43, baseType: !914)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !1542, file: !888, line: 111, baseType: !887, size: 32, align: 32, offset: 768)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !1542, file: !888, line: 112, baseType: !893, size: 32, align: 32, offset: 800)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !1542, file: !888, line: 113, baseType: !1583, size: 64, align: 64, offset: 832)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !1531, file: !1530, line: 37, baseType: !1548, size: 64, align: 64, offset: 1152)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "twiddle_exptab", scope: !1531, file: !1530, line: 38, baseType: !1548, size: 64, align: 64, offset: 1216)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "exptab", scope: !1531, file: !1530, line: 40, baseType: !1587, size: 4096, align: 32, offset: 1280)
!1587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1549, size: 4096, align: 32, elements: !1588)
!1588 = !{!1589}
!1589 = !DISubrange(count: 64)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "fft15", scope: !1531, file: !1530, line: 43, baseType: !1591, size: 64, align: 64, offset: 5376)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DISubroutineType(types: !1593)
!1593 = !{null, !1548, !1548, !1548, !1594}
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1215, line: 149, baseType: !1099)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "postreindex", scope: !1531, file: !1530, line: 46, baseType: !1596, size: 64, align: 64, offset: 5440)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{null, !1548, !1548, !1548, !1220, !1594}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "mdct", scope: !1531, file: !1530, line: 49, baseType: !1600, size: 64, align: 64, offset: 5504)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1603, !1604, !1605, !1594}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !1531, file: !1530, line: 52, baseType: !1600, size: 64, align: 64, offset: 5568)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "dsp", scope: !925, file: !898, line: 96, baseType: !1609, size: 64, align: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !1611, line: 192, baseType: !1612)
!1611 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !1611, line: 24, size: 704, align: 64, elements: !1613)
!1613 = !{!1614, !1618, !1622, !1630, !1631, !1632, !1636, !1637, !1638, !1643, !1647}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !1612, file: !1611, line: 38, baseType: !1615, size: 64, align: 64)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{null, !1604, !1605, !1605, !912}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !1612, file: !1611, line: 54, baseType: !1619, size: 64, align: 64, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{null, !1604, !1605, !914, !912}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !1612, file: !1611, line: 70, baseType: !1623, size: 64, align: 64, offset: 128)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{null, !1626, !1628, !1627, !912}
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1627)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !1612, file: !1611, line: 85, baseType: !1619, size: 64, align: 64, offset: 192)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !1612, file: !1611, line: 100, baseType: !1623, size: 64, align: 64, offset: 256)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !1612, file: !1611, line: 119, baseType: !1633, size: 64, align: 64, offset: 320)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{null, !1604, !1605, !1605, !1605, !912}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !1612, file: !1611, line: 137, baseType: !1633, size: 64, align: 64, offset: 384)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !1612, file: !1611, line: 154, baseType: !1615, size: 64, align: 64, offset: 448)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !1612, file: !1611, line: 164, baseType: !1639, size: 64, align: 64, offset: 512)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64, align: 64)
!1640 = !DISubroutineType(types: !1641)
!1641 = !{null, !1642, !1642, !912}
!1642 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1604)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !1612, file: !1611, line: 175, baseType: !1644, size: 64, align: 64, offset: 576)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64, align: 64)
!1645 = !DISubroutineType(types: !1646)
!1646 = !{!914, !1605, !1605, !912}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !1612, file: !1611, line: 190, baseType: !1648, size: 64, align: 64, offset: 640)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1626, !1628, !1628, !912}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !925, file: !898, line: 97, baseType: !1652, size: 270336, align: 256, offset: 512)
!1652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1653, size: 270336, align: 256, elements: !1691)
!1653 = !DIDerivedType(tag: DW_TAG_typedef, name: "CeltBlock", file: !898, line: 90, baseType: !1654)
!1654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CeltBlock", file: !898, line: 65, size: 135168, align: 256, elements: !1655)
!1655 = !{!1656, !1660, !1661, !1662, !1666, !1668, !1672, !1676, !1680, !1681, !1682, !1686, !1687, !1688, !1689, !1690}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "energy", scope: !1654, file: !898, line: 66, baseType: !1657, size: 672, align: 32)
!1657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 672, align: 32, elements: !1658)
!1658 = !{!1659}
!1659 = !DISubrange(count: 21)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "lin_energy", scope: !1654, file: !898, line: 67, baseType: !1657, size: 672, align: 32, offset: 672)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "error_energy", scope: !1654, file: !898, line: 68, baseType: !1657, size: 672, align: 32, offset: 1344)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "prev_energy", scope: !1654, file: !898, line: 69, baseType: !1663, size: 1344, align: 32, offset: 2016)
!1663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 1344, align: 32, elements: !1664)
!1664 = !{!1665, !1659}
!1665 = !DISubrange(count: 2)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "collapse_masks", scope: !1654, file: !898, line: 71, baseType: !1667, size: 168, align: 8, offset: 3360)
!1667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 168, align: 8, elements: !1658)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1654, file: !898, line: 74, baseType: !1669, size: 65536, align: 32, offset: 3584)
!1669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 65536, align: 32, elements: !1670)
!1670 = !{!1671}
!1671 = !DISubrange(count: 2048)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "coeffs", scope: !1654, file: !898, line: 75, baseType: !1673, size: 30720, align: 32, offset: 69120)
!1673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 30720, align: 32, elements: !1674)
!1674 = !{!1675}
!1675 = !DISubrange(count: 960)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "overlap", scope: !1654, file: !898, line: 78, baseType: !1677, size: 4096, align: 32, offset: 99840)
!1677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 4096, align: 32, elements: !1678)
!1678 = !{!1679}
!1679 = !DISubrange(count: 128)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1654, file: !898, line: 79, baseType: !1673, size: 30720, align: 32, offset: 103936)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "pf_period_new", scope: !1654, file: !898, line: 82, baseType: !912, size: 32, align: 32, offset: 134656)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gains_new", scope: !1654, file: !898, line: 83, baseType: !1683, size: 96, align: 32, offset: 134688)
!1683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 96, align: 32, elements: !1684)
!1684 = !{!1685}
!1685 = !DISubrange(count: 3)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pf_period", scope: !1654, file: !898, line: 84, baseType: !912, size: 32, align: 32, offset: 134784)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gains", scope: !1654, file: !898, line: 85, baseType: !1683, size: 96, align: 32, offset: 134816)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pf_period_old", scope: !1654, file: !898, line: 86, baseType: !912, size: 32, align: 32, offset: 134912)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pf_gains_old", scope: !1654, file: !898, line: 87, baseType: !1683, size: 96, align: 32, offset: 134944)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "emph_coeff", scope: !1654, file: !898, line: 89, baseType: !914, size: 32, align: 32, offset: 135040)
!1691 = !{!1665}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pvq", scope: !925, file: !898, line: 98, baseType: !1693, size: 64, align: 64, offset: 270848)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DIDerivedType(tag: DW_TAG_typedef, name: "CeltPVQ", file: !898, line: 47, baseType: !1695)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CeltPVQ", file: !1696, line: 35, size: 16640, align: 256, elements: !1697)
!1696 = !DIFile(filename: "libavcodec/opus_pvq.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1697 = !{!1698, !1702, !1704, !1708}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "qcoeff", scope: !1695, file: !1696, line: 36, baseType: !1699, size: 8192, align: 32)
!1699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !912, size: 8192, align: 32, elements: !1700)
!1700 = !{!1701}
!1701 = !DISubrange(count: 256)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "hadamard_tmp", scope: !1695, file: !1696, line: 37, baseType: !1703, size: 8192, align: 32, offset: 8192)
!1703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 8192, align: 32, elements: !1700)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "pvq_search", scope: !1695, file: !1696, line: 39, baseType: !1705, size: 64, align: 64, offset: 16384)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!914, !1604, !1220, !912, !912}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "quant_band", scope: !1695, file: !1696, line: 40, baseType: !1709, size: 64, align: 64, offset: 16448)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!1062, !1712, !922, !1713, !1003, !1604, !1604, !912, !912, !1062, !1604, !912, !1604, !912, !914, !1604, !912}
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "OpusRangeCoder", file: !1715, line: 55, baseType: !1716)
!1715 = !DIFile(filename: "libavcodec/opus_rc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpusRangeCoder", file: !1715, line: 40, size: 11072, align: 64, elements: !1717)
!1717 = !{!1718, !1728, !1736, !1737, !1738, !1739, !1743, !1744, !1745, !1746}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1716, file: !1715, line: 41, baseType: !1719, size: 256, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1720, line: 70, baseType: !1721)
!1720 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1720, line: 61, size: 256, align: 64, elements: !1722)
!1722 = !{!1723, !1724, !1725, !1726, !1727}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1721, file: !1720, line: 62, baseType: !1422, size: 64, align: 64)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1721, file: !1720, line: 62, baseType: !1422, size: 64, align: 64, offset: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1721, file: !1720, line: 67, baseType: !912, size: 32, align: 32, offset: 128)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1721, file: !1720, line: 68, baseType: !912, size: 32, align: 32, offset: 160)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1721, file: !1720, line: 69, baseType: !912, size: 32, align: 32, offset: 192)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "rb", scope: !1716, file: !1715, line: 42, baseType: !1729, size: 192, align: 64, offset: 256)
!1729 = !DIDerivedType(tag: DW_TAG_typedef, name: "RawBitsContext", file: !1715, line: 38, baseType: !1730)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawBitsContext", file: !1715, line: 33, size: 192, align: 64, elements: !1731)
!1731 = !{!1732, !1733, !1734, !1735}
