; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--hlsenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--hlsenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 61, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "libavformat/hlsenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942}
!941 = !DIEnumerator(name: "CODEC_ATTRIBUTE_WRITTEN", value: 0)
!942 = !DIEnumerator(name: "CODEC_ATTRIBUTE_WILL_NOT_BE_WRITTEN", value: 1)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "HLSFlags", file: !939, line: 86, size: 32, align: 32, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!945 = !DIEnumerator(name: "HLS_SINGLE_FILE", value: 1)
!946 = !DIEnumerator(name: "HLS_DELETE_SEGMENTS", value: 2)
!947 = !DIEnumerator(name: "HLS_ROUND_DURATIONS", value: 4)
!948 = !DIEnumerator(name: "HLS_DISCONT_START", value: 8)
!949 = !DIEnumerator(name: "HLS_OMIT_ENDLIST", value: 16)
!950 = !DIEnumerator(name: "HLS_SPLIT_BY_TIME", value: 32)
!951 = !DIEnumerator(name: "HLS_APPEND_LIST", value: 64)
!952 = !DIEnumerator(name: "HLS_PROGRAM_DATE_TIME", value: 128)
!953 = !DIEnumerator(name: "HLS_SECOND_LEVEL_SEGMENT_INDEX", value: 256)
!954 = !DIEnumerator(name: "HLS_SECOND_LEVEL_SEGMENT_DURATION", value: 512)
!955 = !DIEnumerator(name: "HLS_SECOND_LEVEL_SEGMENT_SIZE", value: 1024)
!956 = !DIEnumerator(name: "HLS_TEMP_FILE", value: 2048)
!957 = !DIEnumerator(name: "HLS_PERIODIC_REKEY", value: 4096)
!958 = !DIEnumerator(name: "HLS_INDEPENDENT_SEGMENTS", value: 8192)
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 104, size: 32, align: 32, elements: !960)
!960 = !{!961, !962}
!961 = !DIEnumerator(name: "SEGMENT_TYPE_MPEGTS", value: 0)
!962 = !DIEnumerator(name: "SEGMENT_TYPE_FMP4", value: 1)
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !964, line: 32, size: 32, align: 32, elements: !965)
!964 = !DIFile(filename: "libavformat/hlsplaylist.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!965 = !{!966, !967, !968, !969}
!966 = !DIEnumerator(name: "PLAYLIST_TYPE_NONE", value: 0)
!967 = !DIEnumerator(name: "PLAYLIST_TYPE_EVENT", value: 1)
!968 = !DIEnumerator(name: "PLAYLIST_TYPE_VOD", value: 2)
!969 = !DIEnumerator(name: "PLAYLIST_TYPE_NB", value: 3)
!970 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 55, size: 32, align: 32, elements: !971)
!971 = !{!972, !973, !974}
!972 = !DIEnumerator(name: "HLS_START_SEQUENCE_AS_START_NUMBER", value: 0)
!973 = !DIEnumerator(name: "HLS_START_SEQUENCE_AS_SECONDS_SINCE_EPOCH", value: 1)
!974 = !DIEnumerator(name: "HLS_START_SEQUENCE_AS_FORMATTED_DATETIME", value: 2)
!975 = !{!976, !979, !980, !981, !982, !983, !1008, !1009, !1014, !1016}
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !977, line: 40, baseType: !978)
!977 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!978 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!979 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!981 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!982 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "HLSSegment", file: !939, line: 84, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HLSSegment", file: !939, line: 71, size: 25216, align: 64, elements: !986)
!986 = !{!987, !992, !993, !994, !995, !996, !997, !998, !1002, !1006}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !985, file: !939, line: 72, baseType: !988, size: 8192, align: 8)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 8192, align: 8, elements: !990)
!989 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!990 = !{!991}
!991 = !DISubrange(count: 1024)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "sub_filename", scope: !985, file: !939, line: 73, baseType: !988, size: 8192, align: 8, offset: 8192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !985, file: !939, line: 74, baseType: !979, size: 64, align: 64, offset: 16384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "discont", scope: !985, file: !939, line: 75, baseType: !981, size: 32, align: 32, offset: 16448)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !985, file: !939, line: 76, baseType: !976, size: 64, align: 64, offset: 16512)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !985, file: !939, line: 77, baseType: !976, size: 64, align: 64, offset: 16576)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "var_stream_idx", scope: !985, file: !939, line: 78, baseType: !982, size: 32, align: 32, offset: 16640)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "key_uri", scope: !985, file: !939, line: 80, baseType: !999, size: 8200, align: 8, offset: 16672)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 8200, align: 8, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 1025)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "iv_string", scope: !985, file: !939, line: 81, baseType: !1003, size: 264, align: 8, offset: 24872)
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 264, align: 8, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 33)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !985, file: !939, line: 83, baseType: !1007, size: 64, align: 64, offset: 25152)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !1011, line: 220, size: 64, align: 8, elements: !1012)
!1011 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1012 = !{!1013}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1010, file: !1011, line: 220, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !977, line: 55, baseType: !1015)
!1015 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCPBProperties", file: !4, line: 1162, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCPBProperties", file: !4, line: 1119, size: 192, align: 64, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "max_bitrate", scope: !1018, file: !4, line: 1125, baseType: !981, size: 32, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "min_bitrate", scope: !1018, file: !4, line: 1134, baseType: !981, size: 32, align: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "avg_bitrate", scope: !1018, file: !4, line: 1143, baseType: !981, size: 32, align: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1018, file: !4, line: 1152, baseType: !981, size: 32, align: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1018, file: !4, line: 1161, baseType: !1014, size: 64, align: 64, offset: 128)
!1025 = !{!1026, !2261, !2262, !2268}
!1026 = distinct !DIGlobalVariable(name: "ff_hls_muxer", scope: !0, file: !939, line: 2956, type: !1027, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_hls_muxer)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1029)
!1029 = !{!1030, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1050, !1128, !1130, !1131, !2226, !2227, !2228, !2232, !2236, !2240, !2241, !2246, !2247, !2248, !2249, !2250, !2251, !2255}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1028, file: !919, line: 498, baseType: !1031, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1028, file: !919, line: 504, baseType: !1031, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1028, file: !919, line: 505, baseType: !1031, size: 64, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1028, file: !919, line: 506, baseType: !1031, size: 64, align: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1028, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1028, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1028, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !919, line: 517, baseType: !981, size: 32, align: 32, offset: 352)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1028, file: !919, line: 523, baseType: !1041, size: 64, align: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1046, line: 44, size: 64, align: 32, elements: !1047)
!1046 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1045, file: !1046, line: 45, baseType: !3, size: 32, align: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1045, file: !1046, line: 46, baseType: !982, size: 32, align: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1028, file: !919, line: 526, baseType: !1051, size: 64, align: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1055)
!1055 = !{!1056, !1057, !1061, !1087, !1088, !1089, !1090, !1094, !1100, !1102, !1106}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1054, file: !486, line: 72, baseType: !1031, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1054, file: !486, line: 78, baseType: !1058, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1031, !980}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1054, file: !486, line: 85, baseType: !1062, size: 64, align: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1083, !1084, !1085, !1086}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1064, file: !464, line: 247, baseType: !1031, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1064, file: !464, line: 253, baseType: !1031, size: 64, align: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1064, file: !464, line: 259, baseType: !981, size: 32, align: 32, offset: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1064, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1064, file: !464, line: 271, baseType: !1071, size: 64, align: 64, offset: 192)
!1071 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1064, file: !464, line: 265, size: 64, align: 64, elements: !1072)
!1072 = !{!1073, !1074, !1075, !1076}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1071, file: !464, line: 266, baseType: !976, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1071, file: !464, line: 267, baseType: !979, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1071, file: !464, line: 268, baseType: !1031, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1071, file: !464, line: 270, baseType: !1077, size: 64, align: 32)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1078, line: 61, baseType: !1079)
!1078 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1078, line: 58, size: 64, align: 32, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1079, file: !1078, line: 59, baseType: !981, size: 32, align: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1079, file: !1078, line: 60, baseType: !981, size: 32, align: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1064, file: !464, line: 272, baseType: !979, size: 64, align: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1064, file: !464, line: 273, baseType: !979, size: 64, align: 64, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1064, file: !464, line: 275, baseType: !981, size: 32, align: 32, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1064, file: !464, line: 300, baseType: !1031, size: 64, align: 64, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1054, file: !486, line: 93, baseType: !981, size: 32, align: 32, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1054, file: !486, line: 99, baseType: !981, size: 32, align: 32, offset: 224)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1054, file: !486, line: 108, baseType: !981, size: 32, align: 32, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1054, file: !486, line: 113, baseType: !1091, size: 64, align: 64, offset: 320)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!980, !980, !980}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1054, file: !486, line: 123, baseType: !1095, size: 64, align: 64, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!1098, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1054, file: !486, line: 130, baseType: !1101, size: 32, align: 32, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1054, file: !486, line: 136, baseType: !1103, size: 64, align: 64, offset: 512)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!1101, !980}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1054, file: !486, line: 142, baseType: !1107, size: 64, align: 64, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!981, !1110, !980, !1031, !981}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1113)
!1113 = !{!1114, !1126, !1127}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1112, file: !464, line: 360, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1118, file: !464, line: 307, baseType: !1031, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1118, file: !464, line: 313, baseType: !979, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1118, file: !464, line: 313, baseType: !979, size: 64, align: 64, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1118, file: !464, line: 318, baseType: !979, size: 64, align: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1118, file: !464, line: 318, baseType: !979, size: 64, align: 64, offset: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1118, file: !464, line: 323, baseType: !981, size: 32, align: 32, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1112, file: !464, line: 364, baseType: !981, size: 32, align: 32, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1112, file: !464, line: 368, baseType: !981, size: 32, align: 32, offset: 96)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !919, line: 535, baseType: !1129, size: 64, align: 64, offset: 512)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1028, file: !919, line: 539, baseType: !981, size: 32, align: 32, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1028, file: !919, line: 541, baseType: !1132, size: 64, align: 64, offset: 640)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!981, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1137)
!1137 = !{!1138, !1139, !1237, !1238, !1239, !1304, !1305, !1306, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2134, !2135, !2136, !2137, !2138, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2161, !2162, !2163, !2164, !2165, !2189, !2190, !2193, !2194, !2195, !2196, !2197, !2198, !2203, !2204, !2205, !2206, !2214, !2215, !2219, !2223, !2224, !2225}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1136, file: !919, line: 1342, baseType: !1051, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1136, file: !919, line: 1349, baseType: !1140, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1142)
!1142 = !{!1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1167, !1168, !1208, !1209, !1213, !1218, !1219, !1220, !1224, !1230, !1236}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1141, file: !919, line: 638, baseType: !1031, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1141, file: !919, line: 645, baseType: !1031, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !919, line: 652, baseType: !981, size: 32, align: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1141, file: !919, line: 659, baseType: !1031, size: 64, align: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1141, file: !919, line: 661, baseType: !1041, size: 64, align: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1141, file: !919, line: 663, baseType: !1051, size: 64, align: 64, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1141, file: !919, line: 670, baseType: !1031, size: 64, align: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1141, file: !919, line: 679, baseType: !1140, size: 64, align: 64, offset: 448)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1141, file: !919, line: 684, baseType: !981, size: 32, align: 32, offset: 512)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1141, file: !919, line: 689, baseType: !981, size: 32, align: 32, offset: 544)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1141, file: !919, line: 696, baseType: !1154, size: 64, align: 64, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!981, !1157}
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1160)
!1160 = !{!1161, !1162, !1165, !1166}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1159, file: !919, line: 449, baseType: !1031, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1159, file: !919, line: 450, baseType: !1163, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1159, file: !919, line: 451, baseType: !981, size: 32, align: 32, offset: 128)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1159, file: !919, line: 452, baseType: !1031, size: 64, align: 64, offset: 192)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1141, file: !919, line: 703, baseType: !1132, size: 64, align: 64, offset: 640)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1141, file: !919, line: 714, baseType: !1169, size: 64, align: 64, offset: 704)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!981, !1135, !1172}
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1175)
!1175 = !{!1176, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1204, !1205, !1206, !1207}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1174, file: !4, line: 1451, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1179, line: 94, baseType: !1180)
!1179 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1179, line: 81, size: 192, align: 64, elements: !1181)
!1181 = !{!1182, !1186, !1189}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1180, file: !1179, line: 82, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1179, line: 73, baseType: !1185)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1179, line: 73, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1180, file: !1179, line: 89, baseType: !1187, size: 64, align: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !977, line: 48, baseType: !1164)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1180, file: !1179, line: 93, baseType: !981, size: 32, align: 32, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1174, file: !4, line: 1461, baseType: !976, size: 64, align: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1174, file: !4, line: 1467, baseType: !976, size: 64, align: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1174, file: !4, line: 1468, baseType: !1187, size: 64, align: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1174, file: !4, line: 1469, baseType: !981, size: 32, align: 32, offset: 256)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1174, file: !4, line: 1470, baseType: !981, size: 32, align: 32, offset: 288)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1174, file: !4, line: 1474, baseType: !981, size: 32, align: 32, offset: 320)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1174, file: !4, line: 1479, baseType: !1197, size: 64, align: 64, offset: 384)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1199)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1199, file: !4, line: 1412, baseType: !1187, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1199, file: !4, line: 1413, baseType: !981, size: 32, align: 32, offset: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1199, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1174, file: !4, line: 1480, baseType: !981, size: 32, align: 32, offset: 448)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1174, file: !4, line: 1486, baseType: !976, size: 64, align: 64, offset: 512)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1174, file: !4, line: 1488, baseType: !976, size: 64, align: 64, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1174, file: !4, line: 1497, baseType: !976, size: 64, align: 64, offset: 640)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1141, file: !919, line: 720, baseType: !1132, size: 64, align: 64, offset: 768)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1141, file: !919, line: 730, baseType: !1210, size: 64, align: 64, offset: 832)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!981, !1135, !981, !976, !981}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1141, file: !919, line: 737, baseType: !1214, size: 64, align: 64, offset: 896)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!976, !1135, !981, !1217, !976}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1141, file: !919, line: 744, baseType: !1132, size: 64, align: 64, offset: 960)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1141, file: !919, line: 750, baseType: !1132, size: 64, align: 64, offset: 1024)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1141, file: !919, line: 758, baseType: !1221, size: 64, align: 64, offset: 1088)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!981, !1135, !981, !976, !976, !976, !981}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1141, file: !919, line: 764, baseType: !1225, size: 64, align: 64, offset: 1152)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!981, !1135, !1228}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1141, file: !919, line: 770, baseType: !1231, size: 64, align: 64, offset: 1216)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!981, !1135, !1234}
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1141, file: !919, line: 776, baseType: !1231, size: 64, align: 64, offset: 1280)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1136, file: !919, line: 1356, baseType: !1129, size: 64, align: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1136, file: !919, line: 1365, baseType: !980, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1136, file: !919, line: 1379, baseType: !1240, size: 64, align: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249, !1250, !1254, !1255, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1271, !1272, !1276, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1294, !1295, !1296, !1297, !1301, !1302, !1303}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1242, file: !537, line: 174, baseType: !1051, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1242, file: !537, line: 226, baseType: !1163, size: 64, align: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1242, file: !537, line: 227, baseType: !981, size: 32, align: 32, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1242, file: !537, line: 228, baseType: !1163, size: 64, align: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1242, file: !537, line: 229, baseType: !1163, size: 64, align: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1242, file: !537, line: 233, baseType: !980, size: 64, align: 64, offset: 320)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1242, file: !537, line: 235, baseType: !1251, size: 64, align: 64, offset: 384)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!981, !980, !1187, !981}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1242, file: !537, line: 236, baseType: !1251, size: 64, align: 64, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1242, file: !537, line: 237, baseType: !1256, size: 64, align: 64, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!976, !980, !976, !981}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1242, file: !537, line: 238, baseType: !976, size: 64, align: 64, offset: 576)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1242, file: !537, line: 239, baseType: !981, size: 32, align: 32, offset: 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1242, file: !537, line: 240, baseType: !981, size: 32, align: 32, offset: 672)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1242, file: !537, line: 241, baseType: !981, size: 32, align: 32, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1242, file: !537, line: 242, baseType: !1015, size: 64, align: 64, offset: 768)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1242, file: !537, line: 243, baseType: !1163, size: 64, align: 64, offset: 832)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1242, file: !537, line: 244, baseType: !1266, size: 64, align: 64, offset: 896)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!1015, !1015, !1269, !982}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1188)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1242, file: !537, line: 245, baseType: !981, size: 32, align: 32, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1242, file: !537, line: 249, baseType: !1273, size: 64, align: 64, offset: 1024)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!981, !980, !981}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1242, file: !537, line: 255, baseType: !1277, size: 64, align: 64, offset: 1088)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!976, !980, !981, !976, !981}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1242, file: !537, line: 260, baseType: !981, size: 32, align: 32, offset: 1152)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1242, file: !537, line: 266, baseType: !976, size: 64, align: 64, offset: 1216)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1242, file: !537, line: 273, baseType: !981, size: 32, align: 32, offset: 1280)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1242, file: !537, line: 279, baseType: !976, size: 64, align: 64, offset: 1344)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1242, file: !537, line: 285, baseType: !981, size: 32, align: 32, offset: 1408)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1242, file: !537, line: 291, baseType: !981, size: 32, align: 32, offset: 1440)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1242, file: !537, line: 298, baseType: !981, size: 32, align: 32, offset: 1472)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1242, file: !537, line: 304, baseType: !981, size: 32, align: 32, offset: 1504)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1242, file: !537, line: 309, baseType: !1031, size: 64, align: 64, offset: 1536)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1242, file: !537, line: 314, baseType: !1031, size: 64, align: 64, offset: 1600)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1242, file: !537, line: 319, baseType: !1291, size: 64, align: 64, offset: 1664)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DISubroutineType(types: !1293)
!1293 = !{!981, !980, !1187, !981, !536, !976}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1242, file: !537, line: 326, baseType: !981, size: 32, align: 32, offset: 1728)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1242, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1242, file: !537, line: 332, baseType: !976, size: 64, align: 64, offset: 1792)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1242, file: !537, line: 338, baseType: !1298, size: 64, align: 64, offset: 1856)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{!981, !980}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1242, file: !537, line: 340, baseType: !976, size: 64, align: 64, offset: 1920)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1242, file: !537, line: 346, baseType: !1163, size: 64, align: 64, offset: 1984)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1242, file: !537, line: 351, baseType: !981, size: 32, align: 32, offset: 2048)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1136, file: !919, line: 1386, baseType: !981, size: 32, align: 32, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1136, file: !919, line: 1393, baseType: !982, size: 32, align: 32, offset: 352)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1136, file: !919, line: 1405, baseType: !1307, size: 64, align: 64, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1869, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1969, !1975, !1976, !1980, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2012, !2013, !2014, !2015, !2016, !2017}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1310, file: !919, line: 866, baseType: !981, size: 32, align: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1310, file: !919, line: 872, baseType: !981, size: 32, align: 32, offset: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1310, file: !919, line: 878, baseType: !1315, size: 64, align: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1544, !1545, !1546, !1547, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1573, !1577, !1578, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1757, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1317, file: !4, line: 1561, baseType: !1051, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1317, file: !4, line: 1562, baseType: !981, size: 32, align: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1317, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1317, file: !4, line: 1565, baseType: !1323, size: 64, align: 64, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1330, !1331, !1332, !1335, !1338, !1341, !1344, !1347, !1348, !1349, !1357, !1358, !1359, !1361, !1365, !1371, !1376, !1380, !1381, !1428, !1515, !1519, !1520, !1524, !1528, !1533, !1537, !1538, !1539}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1325, file: !4, line: 3475, baseType: !1031, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1325, file: !4, line: 3480, baseType: !1031, size: 64, align: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1325, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1325, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1325, file: !4, line: 3487, baseType: !981, size: 32, align: 32, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1325, file: !4, line: 3488, baseType: !1333, size: 64, align: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1325, file: !4, line: 3489, baseType: !1336, size: 64, align: 64, offset: 320)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1325, file: !4, line: 3490, baseType: !1339, size: 64, align: 64, offset: 384)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1325, file: !4, line: 3491, baseType: !1342, size: 64, align: 64, offset: 448)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1325, file: !4, line: 3492, baseType: !1345, size: 64, align: 64, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1325, file: !4, line: 3493, baseType: !1188, size: 8, align: 8, offset: 576)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1325, file: !4, line: 3494, baseType: !1051, size: 64, align: 64, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1325, file: !4, line: 3495, baseType: !1350, size: 64, align: 64, offset: 704)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1354)
!1354 = !{!1355, !1356}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1353, file: !4, line: 3402, baseType: !981, size: 32, align: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1353, file: !4, line: 3403, baseType: !1031, size: 64, align: 64, offset: 64)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1325, file: !4, line: 3507, baseType: !1031, size: 64, align: 64, offset: 768)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1325, file: !4, line: 3516, baseType: !981, size: 32, align: 32, offset: 832)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1325, file: !4, line: 3517, baseType: !1360, size: 64, align: 64, offset: 896)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1325, file: !4, line: 3527, baseType: !1362, size: 64, align: 64, offset: 960)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!981, !1315}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1325, file: !4, line: 3535, baseType: !1366, size: 64, align: 64, offset: 1024)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{!981, !1315, !1369}
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1316)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1325, file: !4, line: 3541, baseType: !1372, size: 64, align: 64, offset: 1088)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1374)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1375)
!1375 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1325, file: !4, line: 3549, baseType: !1377, size: 64, align: 64, offset: 1152)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DISubroutineType(types: !1379)
!1379 = !{null, !1360}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1325, file: !4, line: 3551, baseType: !1362, size: 64, align: 64, offset: 1216)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1325, file: !4, line: 3552, baseType: !1382, size: 64, align: 64, offset: 1280)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DISubroutineType(types: !1384)
!1384 = !{!981, !1315, !1187, !981, !1385}
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1388)
!1388 = !{!1389, !1392, !1394, !1395, !1396, !1427}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1387, file: !4, line: 3921, baseType: !1390, size: 16, align: 16)
!1390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !977, line: 49, baseType: !1391)
!1391 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1387, file: !4, line: 3922, baseType: !1393, size: 32, align: 32, offset: 32)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !977, line: 51, baseType: !982)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1387, file: !4, line: 3923, baseType: !1393, size: 32, align: 32, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1387, file: !4, line: 3924, baseType: !982, size: 32, align: 32, offset: 96)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1387, file: !4, line: 3925, baseType: !1397, size: 64, align: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407, !1417, !1421, !1423, !1424, !1425, !1426}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1400, file: !4, line: 3886, baseType: !981, size: 32, align: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1400, file: !4, line: 3887, baseType: !981, size: 32, align: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1400, file: !4, line: 3888, baseType: !981, size: 32, align: 32, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1400, file: !4, line: 3889, baseType: !981, size: 32, align: 32, offset: 96)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1400, file: !4, line: 3890, baseType: !981, size: 32, align: 32, offset: 128)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1400, file: !4, line: 3897, baseType: !1408, size: 768, align: 64, offset: 192)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1410)
!1410 = !{!1411, !1415}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1409, file: !4, line: 3855, baseType: !1412, size: 512, align: 64)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1187, size: 512, align: 64, elements: !1413)
!1413 = !{!1414}
!1414 = !DISubrange(count: 8)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1409, file: !4, line: 3857, baseType: !1416, size: 256, align: 32, offset: 512)
!1416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 256, align: 32, elements: !1413)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1400, file: !4, line: 3903, baseType: !1418, size: 256, align: 64, offset: 960)
!1418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1187, size: 256, align: 64, elements: !1419)
!1419 = !{!1420}
!1420 = !DISubrange(count: 4)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1400, file: !4, line: 3904, baseType: !1422, size: 128, align: 32, offset: 1216)
!1422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !981, size: 128, align: 32, elements: !1419)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1400, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1400, file: !4, line: 3908, baseType: !1008, size: 64, align: 64, offset: 1408)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1400, file: !4, line: 3915, baseType: !1008, size: 64, align: 64, offset: 1472)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1400, file: !4, line: 3917, baseType: !981, size: 32, align: 32, offset: 1536)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1387, file: !4, line: 3926, baseType: !976, size: 64, align: 64, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1325, file: !4, line: 3564, baseType: !1429, size: 64, align: 64, offset: 1344)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!981, !1315, !1172, !1432, !1514}
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1434)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1436)
!1436 = !{!1437, !1438, !1439, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1466, !1468, !1469, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1502, !1503, !1504, !1505, !1506, !1507, !1510, !1511, !1512, !1513}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1435, file: !789, line: 282, baseType: !1412, size: 512, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1435, file: !789, line: 299, baseType: !1416, size: 256, align: 32, offset: 512)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1435, file: !789, line: 315, baseType: !1440, size: 64, align: 64, offset: 768)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1435, file: !789, line: 326, baseType: !981, size: 32, align: 32, offset: 832)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1435, file: !789, line: 326, baseType: !981, size: 32, align: 32, offset: 864)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1435, file: !789, line: 334, baseType: !981, size: 32, align: 32, offset: 896)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1435, file: !789, line: 341, baseType: !981, size: 32, align: 32, offset: 928)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1435, file: !789, line: 346, baseType: !981, size: 32, align: 32, offset: 960)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1435, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1435, file: !789, line: 356, baseType: !1077, size: 64, align: 32, offset: 1024)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1435, file: !789, line: 361, baseType: !976, size: 64, align: 64, offset: 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1435, file: !789, line: 369, baseType: !976, size: 64, align: 64, offset: 1152)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1435, file: !789, line: 377, baseType: !976, size: 64, align: 64, offset: 1216)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1435, file: !789, line: 382, baseType: !981, size: 32, align: 32, offset: 1280)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1435, file: !789, line: 386, baseType: !981, size: 32, align: 32, offset: 1312)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1435, file: !789, line: 391, baseType: !981, size: 32, align: 32, offset: 1344)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1435, file: !789, line: 396, baseType: !980, size: 64, align: 64, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1435, file: !789, line: 403, baseType: !1456, size: 512, align: 64, offset: 1472)
!1456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 512, align: 64, elements: !1413)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1435, file: !789, line: 410, baseType: !981, size: 32, align: 32, offset: 1984)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1435, file: !789, line: 415, baseType: !981, size: 32, align: 32, offset: 2016)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1435, file: !789, line: 420, baseType: !981, size: 32, align: 32, offset: 2048)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1435, file: !789, line: 425, baseType: !981, size: 32, align: 32, offset: 2080)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1435, file: !789, line: 435, baseType: !976, size: 64, align: 64, offset: 2112)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1435, file: !789, line: 440, baseType: !981, size: 32, align: 32, offset: 2176)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1435, file: !789, line: 445, baseType: !1014, size: 64, align: 64, offset: 2240)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1435, file: !789, line: 459, baseType: !1465, size: 512, align: 64, offset: 2304)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1177, size: 512, align: 64, elements: !1413)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1435, file: !789, line: 473, baseType: !1467, size: 64, align: 64, offset: 2816)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1435, file: !789, line: 477, baseType: !981, size: 32, align: 32, offset: 2880)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1435, file: !789, line: 479, baseType: !1470, size: 64, align: 64, offset: 2944)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1478, !1483}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1473, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1473, file: !789, line: 203, baseType: !1187, size: 64, align: 64, offset: 64)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1473, file: !789, line: 204, baseType: !981, size: 32, align: 32, offset: 128)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1473, file: !789, line: 205, baseType: !1479, size: 64, align: 64, offset: 192)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1481, line: 86, baseType: !1482)
!1481 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1482 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1481, line: 86, flags: DIFlagFwdDecl)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1473, file: !789, line: 206, baseType: !1177, size: 64, align: 64, offset: 256)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1435, file: !789, line: 480, baseType: !981, size: 32, align: 32, offset: 3008)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1435, file: !789, line: 505, baseType: !981, size: 32, align: 32, offset: 3040)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1435, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1435, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1435, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1435, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1435, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1435, file: !789, line: 532, baseType: !976, size: 64, align: 64, offset: 3264)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1435, file: !789, line: 539, baseType: !976, size: 64, align: 64, offset: 3328)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1435, file: !789, line: 547, baseType: !976, size: 64, align: 64, offset: 3392)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1435, file: !789, line: 554, baseType: !1479, size: 64, align: 64, offset: 3456)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1435, file: !789, line: 563, baseType: !981, size: 32, align: 32, offset: 3520)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1435, file: !789, line: 572, baseType: !981, size: 32, align: 32, offset: 3552)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1435, file: !789, line: 581, baseType: !981, size: 32, align: 32, offset: 3584)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1435, file: !789, line: 588, baseType: !1499, size: 64, align: 64, offset: 3648)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !977, line: 36, baseType: !1501)
!1501 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1435, file: !789, line: 593, baseType: !981, size: 32, align: 32, offset: 3712)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1435, file: !789, line: 596, baseType: !981, size: 32, align: 32, offset: 3744)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1435, file: !789, line: 599, baseType: !1177, size: 64, align: 64, offset: 3776)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1435, file: !789, line: 605, baseType: !1177, size: 64, align: 64, offset: 3840)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1435, file: !789, line: 616, baseType: !1177, size: 64, align: 64, offset: 3904)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1435, file: !789, line: 626, baseType: !1508, size: 64, align: 64, offset: 3968)
!1508 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1509, line: 216, baseType: !1015)
!1509 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1435, file: !789, line: 627, baseType: !1508, size: 64, align: 64, offset: 4032)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1435, file: !789, line: 628, baseType: !1508, size: 64, align: 64, offset: 4096)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1435, file: !789, line: 629, baseType: !1508, size: 64, align: 64, offset: 4160)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1435, file: !789, line: 645, baseType: !1177, size: 64, align: 64, offset: 4224)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1325, file: !4, line: 3566, baseType: !1516, size: 64, align: 64, offset: 1408)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!981, !1315, !980, !1514, !1172}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1325, file: !4, line: 3567, baseType: !1362, size: 64, align: 64, offset: 1472)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1325, file: !4, line: 3576, baseType: !1521, size: 64, align: 64, offset: 1536)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!981, !1315, !1432}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1325, file: !4, line: 3577, baseType: !1525, size: 64, align: 64, offset: 1600)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{!981, !1315, !1172}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1325, file: !4, line: 3584, baseType: !1529, size: 64, align: 64, offset: 1664)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!981, !1315, !1532}
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1325, file: !4, line: 3589, baseType: !1534, size: 64, align: 64, offset: 1728)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{null, !1315}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1325, file: !4, line: 3594, baseType: !981, size: 32, align: 32, offset: 1792)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1325, file: !4, line: 3600, baseType: !1031, size: 64, align: 64, offset: 1856)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1325, file: !4, line: 3609, baseType: !1540, size: 64, align: 64, offset: 1920)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1543)
!1543 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1317, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1317, file: !4, line: 1581, baseType: !982, size: 32, align: 32, offset: 224)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1317, file: !4, line: 1583, baseType: !980, size: 64, align: 64, offset: 256)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1317, file: !4, line: 1591, baseType: !1548, size: 64, align: 64, offset: 320)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1317, file: !4, line: 1598, baseType: !980, size: 64, align: 64, offset: 384)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1317, file: !4, line: 1606, baseType: !976, size: 64, align: 64, offset: 448)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1317, file: !4, line: 1614, baseType: !981, size: 32, align: 32, offset: 512)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1317, file: !4, line: 1622, baseType: !981, size: 32, align: 32, offset: 544)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1317, file: !4, line: 1628, baseType: !981, size: 32, align: 32, offset: 576)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1317, file: !4, line: 1636, baseType: !981, size: 32, align: 32, offset: 608)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1317, file: !4, line: 1643, baseType: !981, size: 32, align: 32, offset: 640)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1317, file: !4, line: 1657, baseType: !1187, size: 64, align: 64, offset: 704)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1317, file: !4, line: 1658, baseType: !981, size: 32, align: 32, offset: 768)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1317, file: !4, line: 1679, baseType: !1077, size: 64, align: 32, offset: 800)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1317, file: !4, line: 1688, baseType: !981, size: 32, align: 32, offset: 864)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1317, file: !4, line: 1712, baseType: !981, size: 32, align: 32, offset: 896)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1317, file: !4, line: 1729, baseType: !981, size: 32, align: 32, offset: 928)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1317, file: !4, line: 1729, baseType: !981, size: 32, align: 32, offset: 960)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1317, file: !4, line: 1744, baseType: !981, size: 32, align: 32, offset: 992)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1317, file: !4, line: 1744, baseType: !981, size: 32, align: 32, offset: 1024)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1317, file: !4, line: 1751, baseType: !981, size: 32, align: 32, offset: 1056)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1317, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1317, file: !4, line: 1791, baseType: !1569, size: 64, align: 64, offset: 1152)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DISubroutineType(types: !1571)
!1571 = !{null, !1572, !1432, !1514, !981, !981, !981}
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1317, file: !4, line: 1808, baseType: !1574, size: 64, align: 64, offset: 1216)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!555, !1572, !1336}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1317, file: !4, line: 1816, baseType: !981, size: 32, align: 32, offset: 1280)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1317, file: !4, line: 1825, baseType: !1579, size: 32, align: 32, offset: 1312)
!1579 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1317, file: !4, line: 1830, baseType: !981, size: 32, align: 32, offset: 1344)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1317, file: !4, line: 1838, baseType: !1579, size: 32, align: 32, offset: 1376)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1317, file: !4, line: 1846, baseType: !981, size: 32, align: 32, offset: 1408)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1317, file: !4, line: 1851, baseType: !981, size: 32, align: 32, offset: 1440)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1317, file: !4, line: 1861, baseType: !1579, size: 32, align: 32, offset: 1472)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1317, file: !4, line: 1868, baseType: !1579, size: 32, align: 32, offset: 1504)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1317, file: !4, line: 1875, baseType: !1579, size: 32, align: 32, offset: 1536)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1317, file: !4, line: 1882, baseType: !1579, size: 32, align: 32, offset: 1568)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1317, file: !4, line: 1889, baseType: !1579, size: 32, align: 32, offset: 1600)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1317, file: !4, line: 1896, baseType: !1579, size: 32, align: 32, offset: 1632)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1317, file: !4, line: 1903, baseType: !1579, size: 32, align: 32, offset: 1664)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1317, file: !4, line: 1910, baseType: !981, size: 32, align: 32, offset: 1696)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1317, file: !4, line: 1915, baseType: !981, size: 32, align: 32, offset: 1728)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1317, file: !4, line: 1926, baseType: !1514, size: 64, align: 64, offset: 1792)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1317, file: !4, line: 1935, baseType: !1077, size: 64, align: 32, offset: 1856)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1317, file: !4, line: 1942, baseType: !981, size: 32, align: 32, offset: 1920)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1317, file: !4, line: 1948, baseType: !981, size: 32, align: 32, offset: 1952)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1317, file: !4, line: 1954, baseType: !981, size: 32, align: 32, offset: 1984)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1317, file: !4, line: 1960, baseType: !981, size: 32, align: 32, offset: 2016)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1317, file: !4, line: 1984, baseType: !981, size: 32, align: 32, offset: 2048)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1317, file: !4, line: 1991, baseType: !981, size: 32, align: 32, offset: 2080)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1317, file: !4, line: 1996, baseType: !981, size: 32, align: 32, offset: 2112)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1317, file: !4, line: 2004, baseType: !981, size: 32, align: 32, offset: 2144)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1317, file: !4, line: 2011, baseType: !981, size: 32, align: 32, offset: 2176)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1317, file: !4, line: 2018, baseType: !981, size: 32, align: 32, offset: 2208)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1317, file: !4, line: 2027, baseType: !981, size: 32, align: 32, offset: 2240)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1317, file: !4, line: 2034, baseType: !981, size: 32, align: 32, offset: 2272)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1317, file: !4, line: 2044, baseType: !981, size: 32, align: 32, offset: 2304)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1317, file: !4, line: 2054, baseType: !1609, size: 64, align: 64, offset: 2368)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1317, file: !4, line: 2061, baseType: !1609, size: 64, align: 64, offset: 2432)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1317, file: !4, line: 2066, baseType: !981, size: 32, align: 32, offset: 2496)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1317, file: !4, line: 2070, baseType: !981, size: 32, align: 32, offset: 2528)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1317, file: !4, line: 2078, baseType: !981, size: 32, align: 32, offset: 2560)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1317, file: !4, line: 2085, baseType: !981, size: 32, align: 32, offset: 2592)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1317, file: !4, line: 2092, baseType: !981, size: 32, align: 32, offset: 2624)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1317, file: !4, line: 2099, baseType: !981, size: 32, align: 32, offset: 2656)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1317, file: !4, line: 2106, baseType: !981, size: 32, align: 32, offset: 2688)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1317, file: !4, line: 2113, baseType: !981, size: 32, align: 32, offset: 2720)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1317, file: !4, line: 2120, baseType: !981, size: 32, align: 32, offset: 2752)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1317, file: !4, line: 2125, baseType: !981, size: 32, align: 32, offset: 2784)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1317, file: !4, line: 2133, baseType: !981, size: 32, align: 32, offset: 2816)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1317, file: !4, line: 2140, baseType: !981, size: 32, align: 32, offset: 2848)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1317, file: !4, line: 2145, baseType: !981, size: 32, align: 32, offset: 2880)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1317, file: !4, line: 2153, baseType: !981, size: 32, align: 32, offset: 2912)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1317, file: !4, line: 2158, baseType: !981, size: 32, align: 32, offset: 2944)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1317, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1317, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1317, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1317, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1317, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1317, file: !4, line: 2203, baseType: !981, size: 32, align: 32, offset: 3136)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1317, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1317, file: !4, line: 2212, baseType: !981, size: 32, align: 32, offset: 3200)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1317, file: !4, line: 2213, baseType: !981, size: 32, align: 32, offset: 3232)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1317, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1317, file: !4, line: 2232, baseType: !981, size: 32, align: 32, offset: 3296)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1317, file: !4, line: 2243, baseType: !981, size: 32, align: 32, offset: 3328)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1317, file: !4, line: 2249, baseType: !981, size: 32, align: 32, offset: 3360)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1317, file: !4, line: 2256, baseType: !981, size: 32, align: 32, offset: 3392)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1317, file: !4, line: 2263, baseType: !1014, size: 64, align: 64, offset: 3456)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1317, file: !4, line: 2270, baseType: !1014, size: 64, align: 64, offset: 3520)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1317, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1317, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1317, file: !4, line: 2367, baseType: !1645, size: 64, align: 64, offset: 3648)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!981, !1572, !1532, !981}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1317, file: !4, line: 2383, baseType: !981, size: 32, align: 32, offset: 3712)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1317, file: !4, line: 2386, baseType: !1579, size: 32, align: 32, offset: 3744)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1317, file: !4, line: 2387, baseType: !1579, size: 32, align: 32, offset: 3776)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1317, file: !4, line: 2394, baseType: !981, size: 32, align: 32, offset: 3808)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1317, file: !4, line: 2401, baseType: !981, size: 32, align: 32, offset: 3840)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1317, file: !4, line: 2408, baseType: !981, size: 32, align: 32, offset: 3872)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1317, file: !4, line: 2415, baseType: !981, size: 32, align: 32, offset: 3904)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1317, file: !4, line: 2422, baseType: !981, size: 32, align: 32, offset: 3936)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1317, file: !4, line: 2423, baseType: !1657, size: 64, align: 64, offset: 3968)
!1657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1658, size: 64, align: 64)
!1658 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1659)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1660)
!1660 = !{!1661, !1662, !1663, !1664}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1659, file: !4, line: 827, baseType: !981, size: 32, align: 32)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1659, file: !4, line: 828, baseType: !981, size: 32, align: 32, offset: 32)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1659, file: !4, line: 829, baseType: !981, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1659, file: !4, line: 830, baseType: !1579, size: 32, align: 32, offset: 96)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1317, file: !4, line: 2430, baseType: !976, size: 64, align: 64, offset: 4032)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1317, file: !4, line: 2437, baseType: !976, size: 64, align: 64, offset: 4096)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1317, file: !4, line: 2444, baseType: !1579, size: 32, align: 32, offset: 4160)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1317, file: !4, line: 2451, baseType: !1579, size: 32, align: 32, offset: 4192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1317, file: !4, line: 2458, baseType: !981, size: 32, align: 32, offset: 4224)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1317, file: !4, line: 2469, baseType: !981, size: 32, align: 32, offset: 4256)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1317, file: !4, line: 2475, baseType: !981, size: 32, align: 32, offset: 4288)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1317, file: !4, line: 2481, baseType: !981, size: 32, align: 32, offset: 4320)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1317, file: !4, line: 2485, baseType: !981, size: 32, align: 32, offset: 4352)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1317, file: !4, line: 2489, baseType: !981, size: 32, align: 32, offset: 4384)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1317, file: !4, line: 2493, baseType: !981, size: 32, align: 32, offset: 4416)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1317, file: !4, line: 2501, baseType: !981, size: 32, align: 32, offset: 4448)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1317, file: !4, line: 2506, baseType: !981, size: 32, align: 32, offset: 4480)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1317, file: !4, line: 2510, baseType: !981, size: 32, align: 32, offset: 4512)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1317, file: !4, line: 2514, baseType: !976, size: 64, align: 64, offset: 4544)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1317, file: !4, line: 2528, baseType: !1681, size: 64, align: 64, offset: 4608)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{null, !1572, !980, !981, !981}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1317, file: !4, line: 2534, baseType: !981, size: 32, align: 32, offset: 4672)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1317, file: !4, line: 2545, baseType: !981, size: 32, align: 32, offset: 4704)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1317, file: !4, line: 2547, baseType: !981, size: 32, align: 32, offset: 4736)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1317, file: !4, line: 2549, baseType: !981, size: 32, align: 32, offset: 4768)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1317, file: !4, line: 2551, baseType: !981, size: 32, align: 32, offset: 4800)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1317, file: !4, line: 2553, baseType: !981, size: 32, align: 32, offset: 4832)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1317, file: !4, line: 2555, baseType: !981, size: 32, align: 32, offset: 4864)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1317, file: !4, line: 2557, baseType: !981, size: 32, align: 32, offset: 4896)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1317, file: !4, line: 2559, baseType: !981, size: 32, align: 32, offset: 4928)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1317, file: !4, line: 2563, baseType: !981, size: 32, align: 32, offset: 4960)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1317, file: !4, line: 2571, baseType: !1008, size: 64, align: 64, offset: 4992)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1317, file: !4, line: 2579, baseType: !1008, size: 64, align: 64, offset: 5056)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1317, file: !4, line: 2586, baseType: !981, size: 32, align: 32, offset: 5120)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1317, file: !4, line: 2615, baseType: !981, size: 32, align: 32, offset: 5152)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1317, file: !4, line: 2627, baseType: !981, size: 32, align: 32, offset: 5184)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1317, file: !4, line: 2637, baseType: !981, size: 32, align: 32, offset: 5216)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1317, file: !4, line: 2681, baseType: !981, size: 32, align: 32, offset: 5248)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1317, file: !4, line: 2709, baseType: !976, size: 64, align: 64, offset: 5312)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1317, file: !4, line: 2716, baseType: !1703, size: 64, align: 64, offset: 5376)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1705)
!1705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1706)
!1706 = !{!1707, !1708, !1709, !1710, !1711, !1712, !1713, !1717, !1721, !1722, !1723, !1724, !1730, !1731, !1732, !1733, !1734}
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1705, file: !4, line: 3642, baseType: !1031, size: 64, align: 64)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1705, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1705, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1705, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1705, file: !4, line: 3669, baseType: !981, size: 32, align: 32, offset: 160)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1705, file: !4, line: 3682, baseType: !1529, size: 64, align: 64, offset: 192)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1705, file: !4, line: 3698, baseType: !1714, size: 64, align: 64, offset: 256)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DISubroutineType(types: !1716)
!1716 = !{!981, !1315, !1269, !1393}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1705, file: !4, line: 3712, baseType: !1718, size: 64, align: 64, offset: 320)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DISubroutineType(types: !1720)
!1720 = !{!981, !1315, !981, !1269, !1393}
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1705, file: !4, line: 3726, baseType: !1714, size: 64, align: 64, offset: 384)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1705, file: !4, line: 3737, baseType: !1362, size: 64, align: 64, offset: 448)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1705, file: !4, line: 3746, baseType: !981, size: 32, align: 32, offset: 512)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1705, file: !4, line: 3757, baseType: !1725, size: 64, align: 64, offset: 576)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{null, !1728}
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1705, file: !4, line: 3766, baseType: !1362, size: 64, align: 64, offset: 640)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1705, file: !4, line: 3774, baseType: !1362, size: 64, align: 64, offset: 704)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1705, file: !4, line: 3780, baseType: !981, size: 32, align: 32, offset: 768)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1705, file: !4, line: 3785, baseType: !981, size: 32, align: 32, offset: 800)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1705, file: !4, line: 3795, baseType: !1735, size: 64, align: 64, offset: 832)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64, align: 64)
!1736 = !DISubroutineType(types: !1737)
!1737 = !{!981, !1315, !1177}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1317, file: !4, line: 2728, baseType: !980, size: 64, align: 64, offset: 5440)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1317, file: !4, line: 2735, baseType: !1456, size: 512, align: 64, offset: 5504)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1317, file: !4, line: 2742, baseType: !981, size: 32, align: 32, offset: 6016)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1317, file: !4, line: 2755, baseType: !981, size: 32, align: 32, offset: 6048)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1317, file: !4, line: 2776, baseType: !981, size: 32, align: 32, offset: 6080)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1317, file: !4, line: 2783, baseType: !981, size: 32, align: 32, offset: 6112)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1317, file: !4, line: 2791, baseType: !981, size: 32, align: 32, offset: 6144)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1317, file: !4, line: 2802, baseType: !1532, size: 64, align: 64, offset: 6208)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1317, file: !4, line: 2811, baseType: !981, size: 32, align: 32, offset: 6272)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1317, file: !4, line: 2821, baseType: !981, size: 32, align: 32, offset: 6304)
