; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--diracdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--diracdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DiracDSPContext = type { void (i8*, i8*, i8*, i8*, i32, i32, i32)*, [3 x [4 x void (i8*, i8**, i32, i32)*]], [3 x [4 x void (i8*, i8**, i32, i32)*]], [3 x void (i8*, i32, i8*, i32, i32, i32)*], void (i8*, i32, i8*, i32, i32, i32)*, void (i8*, i16*, i32, i16*, i32, i32, i32)*, [3 x void (i16*, i8*, i32, i8*, i32)*], [4 x void (i8*, i8*, i64, i32, i32, i32, i32)*], [3 x void (i8*, i32, i32, i32, i32)*], [3 x void (i8*, i8*, i32, i32, i32, i32, i32)*] }

; Function Attrs: cold nounwind optsize uwtable
define void @ff_diracdsp_init(%struct.DiracDSPContext* %c) #0 !dbg !18 {
entry:
  %c.addr = alloca %struct.DiracDSPContext*, align 8
  store %struct.DiracDSPContext* %c, %struct.DiracDSPContext** %c.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.DiracDSPContext** %c.addr, metadata !88, metadata !89), !dbg !90
  %0 = load %struct.DiracDSPContext*, %struct.DiracDSPContext** %c.addr, align 8, !dbg !91
  %dirac_hpel_filter = getelementptr inbounds %struct.DiracDSPContext, %struct.DiracDSPContext* %0, i32 0, i32 0, !dbg !92

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--diracdsp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{}
!3 = !{!4, !8, !11, !14}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64, align: 64)
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !6, line: 37, baseType: !7)
!6 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!7 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64, align: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !6, line: 49, baseType: !10)
!10 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64, align: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !6, line: 38, baseType: !13)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !{i32 2, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!18 = distinct !DISubprogram(name: "ff_diracdsp_init", scope: !19, file: !19, line: 219, type: !20, isLocal: false, isDefinition: true, scopeLine: 220, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2)
!19 = !DIFile(filename: "libavcodec/diracdsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64, align: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "DiracDSPContext", file: !24, line: 55, baseType: !25)
!24 = !DIFile(filename: "libavcodec/diracdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !24, line: 30, size: 2752, align: 64, elements: !26)
!26 = !{!27, !36, !45, !46, !52, !53, !61, !66, !76, !82}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "dirac_hpel_filter", scope: !25, file: !24, line: 31, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31, !31, !31, !34, !13, !13, !13}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !6, line: 48, baseType: !33)
!33 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64, align: 64)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "put_dirac_pixels_tab", scope: !25, file: !24, line: 42, baseType: !37, size: 768, align: 64, offset: 64)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 768, align: 64, elements: !42)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !31, !41, !13, !13}
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64, align: 64)
!42 = !{!43, !44}
!43 = !DISubrange(count: 3)
!44 = !DISubrange(count: 4)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "avg_dirac_pixels_tab", scope: !25, file: !24, line: 43, baseType: !37, size: 768, align: 64, offset: 832)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_rect_clamped", scope: !25, file: !24, line: 45, baseType: !47, size: 192, align: 64, offset: 1600)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 192, align: 64, elements: !51)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{null, !31, !13, !34, !13, !13, !13}
!51 = !{!43}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "put_rect_clamped", scope: !25, file: !24, line: 46, baseType: !48, size: 64, align: 64, offset: 1792)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "add_rect_clamped", scope: !25, file: !24, line: 47, baseType: !54, size: 64, align: 64, offset: 1856)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !31, !57, !13, !59, !13, !13, !13}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "add_dirac_obmc", scope: !25, file: !24, line: 48, baseType: !62, size: 192, align: 64, offset: 1920)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 192, align: 64, elements: !51)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !8, !34, !13, !34, !13}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dequant_subband", scope: !25, file: !24, line: 51, baseType: !67, size: 256, align: 64, offset: 2112)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 256, align: 64, elements: !75)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64, align: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !31, !31, !71, !74, !74, !13, !13}
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !72, line: 149, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!73 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!75 = !{!44}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "weight_dirac_pixels_tab", scope: !25, file: !24, line: 53, baseType: !77, size: 192, align: 64, offset: 2368)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 192, align: 64, elements: !51)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "dirac_weight_func", file: !24, line: 27, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{null, !31, !13, !13, !13, !13}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "biweight_dirac_pixels_tab", scope: !25, file: !24, line: 54, baseType: !83, size: 192, align: 64, offset: 2560)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 192, align: 64, elements: !51)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "dirac_biweight_func", file: !24, line: 28, baseType: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64, align: 64)
!86 = !DISubroutineType(types: !87)
!87 = !{null, !31, !34, !13, !13, !13, !13, !13}
!88 = !DILocalVariable(name: "c", arg: 1, scope: !18, file: !19, line: 219, type: !22)
!89 = !DIExpression()
!90 = !DILocation(line: 219, column: 62, scope: !18)
!91 = !DILocation(line: 221, column: 5, scope: !18)
!92 = !DILocation(line: 221, column: 8, scope: !18)
!93 = !DILocation(line: 221, column: 26, scope: !18)
!94 = !DILocation(line: 222, column: 5, scope: !18)
!95 = !DILocation(line: 222, column: 8, scope: !18)
!96 = !DILocation(line: 222, column: 25, scope: !18)
!97 = !DILocation(line: 223, column: 5, scope: !18)
!98 = !DILocation(line: 223, column: 8, scope: !18)
!99 = !DILocation(line: 223, column: 35, scope: !18)
!100 = !DILocation(line: 224, column: 5, scope: !18)
!101 = !DILocation(line: 224, column: 8, scope: !18)
!102 = !DILocation(line: 224, column: 35, scope: !18)
!103 = !DILocation(line: 225, column: 5, scope: !18)
!104 = !DILocation(line: 225, column: 8, scope: !18)
!105 = !DILocation(line: 225, column: 35, scope: !18)
!106 = !DILocation(line: 227, column: 5, scope: !18)
!107 = !DILocation(line: 227, column: 8, scope: !18)
!108 = !DILocation(line: 227, column: 26, scope: !18)
!109 = !DILocation(line: 228, column: 5, scope: !18)
!110 = !DILocation(line: 228, column: 8, scope: !18)
!111 = !DILocation(line: 228, column: 26, scope: !18)
!112 = !DILocation(line: 229, column: 5, scope: !18)
!113 = !DILocation(line: 229, column: 8, scope: !18)
!114 = !DILocation(line: 229, column: 26, scope: !18)
!115 = !DILocation(line: 231, column: 5, scope: !18)
!116 = !DILocation(line: 231, column: 8, scope: !18)
!117 = !DILocation(line: 231, column: 35, scope: !18)
!118 = !DILocation(line: 232, column: 5, scope: !18)
!119 = !DILocation(line: 232, column: 8, scope: !18)
!120 = !DILocation(line: 232, column: 35, scope: !18)
!121 = !DILocation(line: 233, column: 5, scope: !18)
!122 = !DILocation(line: 233, column: 8, scope: !18)
!123 = !DILocation(line: 233, column: 35, scope: !18)
!124 = !DILocation(line: 234, column: 5, scope: !18)
!125 = !DILocation(line: 234, column: 8, scope: !18)
!126 = !DILocation(line: 234, column: 37, scope: !18)
!127 = !DILocation(line: 235, column: 5, scope: !18)
!128 = !DILocation(line: 235, column: 8, scope: !18)
!129 = !DILocation(line: 235, column: 37, scope: !18)
!130 = !DILocation(line: 236, column: 5, scope: !18)
!131 = !DILocation(line: 236, column: 8, scope: !18)
!132 = !DILocation(line: 236, column: 37, scope: !18)
!133 = !DILocation(line: 238, column: 29, scope: !18)
!134 = !DILocation(line: 238, column: 32, scope: !18)
!135 = !DILocation(line: 238, column: 51, scope: !18)
!136 = !DILocation(line: 238, column: 5, scope: !18)
!137 = !DILocation(line: 238, column: 8, scope: !18)
!138 = !DILocation(line: 238, column: 27, scope: !18)
!139 = !DILocation(line: 239, column: 29, scope: !18)
!140 = !DILocation(line: 239, column: 32, scope: !18)
!141 = !DILocation(line: 239, column: 51, scope: !18)
!142 = !DILocation(line: 239, column: 5, scope: !18)
!143 = !DILocation(line: 239, column: 8, scope: !18)
!144 = !DILocation(line: 239, column: 27, scope: !18)
!145 = !DILocation(line: 241, column: 5, scope: !18)
!146 = !DILocation(line: 241, column: 8, scope: !18)
!147 = !DILocation(line: 241, column: 38, scope: !18)
!148 = !DILocation(line: 241, column: 64, scope: !18)
!149 = !DILocation(line: 241, column: 67, scope: !18)
!150 = !DILocation(line: 241, column: 97, scope: !18)
!151 = !DILocation(line: 241, column: 126, scope: !18)
!152 = !DILocation(line: 241, column: 129, scope: !18)
