; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--av1_parse.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--av1_parse.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AV1OBU = type { i32, i8*, i32, i32, i8*, %struct.GetBitContext, i32, i32, i32 }
%struct.GetBitContext = type { i8*, i8*, i32, i32, i32 }
%struct.AV1Packet = type { %struct.AV1OBU*, i32, i32 }
%struct.GetByteContext = type { i8*, i8*, i8* }
%union.unaligned_32 = type { i32 }

@.str = private unnamed_addr constant [65 x i8] c"obu_type: %d, temporal_id: %d, spatial_id: %d, payload size: %d\0A\00", align 1
@.str.1 = private unnamed_addr constant [35 x i8] c"Invalid OBU of type %d, skipping.\0A\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"Assertion %s failed at %s:%d\0A\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"buf_size >= 0\00", align 1
@.str.4 = private unnamed_addr constant [24 x i8] c"libavcodec/bytestream.h\00", align 1

; Function Attrs: nounwind uwtable
define i32 @ff_av1_extract_obu(%struct.AV1OBU* %obu, i8* %buf, i32 %length, i8* %logctx) #0 !dbg !34 {
entry:
  %retval = alloca i32, align 4
  %obu.addr = alloca %struct.AV1OBU*, align 8
  %buf.addr = alloca i8*, align 8
  %length.addr = alloca i32, align 4
  %logctx.addr = alloca i8*, align 8
  %obu_size = alloca i64, align 8
  %start_pos = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !15)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--av1_parse.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 28, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/av1.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14}
!6 = !DIEnumerator(name: "AV1_OBU_SEQUENCE_HEADER", value: 1)
!7 = !DIEnumerator(name: "AV1_OBU_TEMPORAL_DELIMITER", value: 2)
!8 = !DIEnumerator(name: "AV1_OBU_FRAME_HEADER", value: 3)
!9 = !DIEnumerator(name: "AV1_OBU_TILE_GROUP", value: 4)
!10 = !DIEnumerator(name: "AV1_OBU_METADATA", value: 5)
!11 = !DIEnumerator(name: "AV1_OBU_FRAME", value: 6)
!12 = !DIEnumerator(name: "AV1_OBU_REDUNDANT_FRAME_HEADER", value: 7)
!13 = !DIEnumerator(name: "AV1_OBU_TILE_LIST", value: 8)
!14 = !DIEnumerator(name: "AV1_OBU_PADDING", value: 15)
!15 = !{!16, !17, !18, !26, !28, !30}
!16 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!17 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64, align: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !21, line: 221, size: 32, align: 8, elements: !22)
!21 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!22 = !{!23}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !20, file: !21, line: 221, baseType: !24, size: 32, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !25, line: 51, baseType: !17)
!25 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !25, line: 48, baseType: !27)
!27 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !25, line: 40, baseType: !29)
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!31 = !{i32 2, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!34 = distinct !DISubprogram(name: "ff_av1_extract_obu", scope: !35, file: !35, line: 29, type: !36, isLocal: false, isDefinition: true, scopeLine: 30, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !63)
!35 = !DIFile(filename: "libavcodec/av1_parse.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!36 = !DISubroutineType(types: !37)
!37 = !{!16, !38, !45, !16, !30}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1OBU", file: !40, line: 52, baseType: !41)
!40 = !DIFile(filename: "libavcodec/av1_parse.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1OBU", file: !40, line: 30, size: 640, align: 64, elements: !42)
!42 = !{!43, !44, !47, !48, !49, !50, !60, !61, !62}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !41, file: !40, line: 32, baseType: !16, size: 32, align: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !41, file: !40, line: 33, baseType: !45, size: 64, align: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !26)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "size_bits", scope: !41, file: !40, line: 39, baseType: !16, size: 32, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "raw_size", scope: !41, file: !40, line: 42, baseType: !16, size: 32, align: 32, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "raw_data", scope: !41, file: !40, line: 43, baseType: !45, size: 64, align: 64, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !41, file: !40, line: 46, baseType: !51, size: 256, align: 64, offset: 256)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !52, line: 70, baseType: !53)
!52 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !52, line: 61, size: 256, align: 64, elements: !54)
!54 = !{!55, !56, !57, !58, !59}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !53, file: !52, line: 62, baseType: !45, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !53, file: !52, line: 62, baseType: !45, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !53, file: !52, line: 67, baseType: !16, size: 32, align: 32, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !53, file: !52, line: 68, baseType: !16, size: 32, align: 32, offset: 160)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !53, file: !52, line: 69, baseType: !16, size: 32, align: 32, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !41, file: !40, line: 48, baseType: !16, size: 32, align: 32, offset: 512)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_id", scope: !41, file: !40, line: 50, baseType: !16, size: 32, align: 32, offset: 544)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_id", scope: !41, file: !40, line: 51, baseType: !16, size: 32, align: 32, offset: 576)
!63 = !{}
!64 = !DILocalVariable(name: "obu", arg: 1, scope: !34, file: !35, line: 29, type: !38)
!65 = !DIExpression()
!66 = !DILocation(line: 29, column: 32, scope: !34)
!67 = !DILocalVariable(name: "buf", arg: 2, scope: !34, file: !35, line: 29, type: !45)
!68 = !DILocation(line: 29, column: 52, scope: !34)
!69 = !DILocalVariable(name: "length", arg: 3, scope: !34, file: !35, line: 29, type: !16)
!70 = !DILocation(line: 29, column: 61, scope: !34)
!71 = !DILocalVariable(name: "logctx", arg: 4, scope: !34, file: !35, line: 29, type: !30)
!72 = !DILocation(line: 29, column: 75, scope: !34)
!73 = !DILocalVariable(name: "obu_size", scope: !34, file: !35, line: 31, type: !28)
!74 = !DILocation(line: 31, column: 13, scope: !34)
!75 = !DILocalVariable(name: "start_pos", scope: !34, file: !35, line: 32, type: !16)
!76 = !DILocation(line: 32, column: 9, scope: !34)
!77 = !DILocalVariable(name: "type", scope: !34, file: !35, line: 32, type: !16)
!78 = !DILocation(line: 32, column: 20, scope: !34)
!79 = !DILocalVariable(name: "temporal_id", scope: !34, file: !35, line: 32, type: !16)
!80 = !DILocation(line: 32, column: 26, scope: !34)
!81 = !DILocalVariable(name: "spatial_id", scope: !34, file: !35, line: 32, type: !16)
!82 = !DILocation(line: 32, column: 39, scope: !34)
!83 = !DILocalVariable(name: "len", scope: !34, file: !35, line: 33, type: !16)
!84 = !DILocation(line: 33, column: 9, scope: !34)
!85 = !DILocation(line: 35, column: 28, scope: !34)
!86 = !DILocation(line: 35, column: 33, scope: !34)
!87 = !DILocation(line: 35, column: 11, scope: !34)
!88 = !DILocation(line: 35, column: 9, scope: !34)
!89 = !DILocation(line: 37, column: 9, scope: !90)
!90 = distinct !DILexicalBlock(scope: !34, file: !35, line: 37, column: 9)
!91 = !DILocation(line: 37, column: 13, scope: !90)
!92 = !DILocation(line: 37, column: 9, scope: !34)
!93 = !DILocation(line: 38, column: 16, scope: !90)
!94 = !DILocation(line: 38, column: 9, scope: !90)
!95 = !DILocation(line: 40, column: 17, scope: !34)
!96 = !DILocation(line: 40, column: 5, scope: !34)
!97 = !DILocation(line: 40, column: 10, scope: !34)
!98 = !DILocation(line: 40, column: 15, scope: !34)
!99 = !DILocation(line: 41, column: 24, scope: !34)
!100 = !DILocation(line: 41, column: 5, scope: !34)
!101 = !DILocation(line: 41, column: 10, scope: !34)
!102 = !DILocation(line: 41, column: 22, scope: !34)
!103 = !DILocation(line: 42, column: 23, scope: !34)
!104 = !DILocation(line: 42, column: 5, scope: !34)
!105 = !DILocation(line: 42, column: 10, scope: !34)
!106 = !DILocation(line: 42, column: 21, scope: !34)
!107 = !DILocation(line: 44, column: 17, scope: !34)
!108 = !DILocation(line: 44, column: 23, scope: !34)
!109 = !DILocation(line: 44, column: 21, scope: !34)
!110 = !DILocation(line: 44, column: 5, scope: !34)
!111 = !DILocation(line: 44, column: 10, scope: !34)
!112 = !DILocation(line: 44, column: 15, scope: !34)
!113 = !DILocation(line: 45, column: 17, scope: !34)
!114 = !DILocation(line: 45, column: 5, scope: !34)
!115 = !DILocation(line: 45, column: 10, scope: !34)
!116 = !DILocation(line: 45, column: 15, scope: !34)
!117 = !DILocation(line: 46, column: 21, scope: !34)
!118 = !DILocation(line: 46, column: 5, scope: !34)
!119 = !DILocation(line: 46, column: 10, scope: !34)
!120 = !DILocation(line: 46, column: 19, scope: !34)
!121 = !DILocation(line: 47, column: 21, scope: !34)
!122 = !DILocation(line: 47, column: 5, scope: !34)
!123 = !DILocation(line: 47, column: 10, scope: !34)
!124 = !DILocation(line: 47, column: 19, scope: !34)
!125 = !DILocation(line: 49, column: 12, scope: !34)
!126 = !DILocation(line: 51, column: 12, scope: !34)
!127 = !DILocation(line: 51, column: 17, scope: !34)
!128 = !DILocation(line: 51, column: 23, scope: !34)
!129 = !DILocation(line: 51, column: 28, scope: !34)
!130 = !DILocation(line: 51, column: 41, scope: !34)
!131 = !DILocation(line: 51, column: 46, scope: !34)
!132 = !DILocation(line: 51, column: 58, scope: !34)
!133 = !DILocation(line: 51, column: 63, scope: !34)
!134 = !DILocation(line: 49, column: 5, scope: !34)
!135 = !DILocation(line: 53, column: 12, scope: !34)
!136 = !DILocation(line: 53, column: 5, scope: !34)
!137 = !DILocation(line: 54, column: 1, scope: !34)
!138 = distinct !DISubprogram(name: "parse_obu_header", scope: !40, file: !40, line: 99, type: !139, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !63)
!139 = !DISubroutineType(types: !140)
!140 = !{!16, !45, !16, !141, !142, !142, !142, !142}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!143 = !DILocalVariable(name: "buf", arg: 1, scope: !138, file: !40, line: 99, type: !45)
!144 = !DILocation(line: 99, column: 51, scope: !138)
!145 = !DILocalVariable(name: "buf_size", arg: 2, scope: !138, file: !40, line: 99, type: !16)
!146 = !DILocation(line: 99, column: 60, scope: !138)
!147 = !DILocalVariable(name: "obu_size", arg: 3, scope: !138, file: !40, line: 100, type: !141)
!148 = !DILocation(line: 100, column: 45, scope: !138)
!149 = !DILocalVariable(name: "start_pos", arg: 4, scope: !138, file: !40, line: 100, type: !142)
!150 = !DILocation(line: 100, column: 60, scope: !138)
!151 = !DILocalVariable(name: "type", arg: 5, scope: !138, file: !40, line: 100, type: !142)
!152 = !DILocation(line: 100, column: 76, scope: !138)
!153 = !DILocalVariable(name: "temporal_id", arg: 6, scope: !138, file: !40, line: 101, type: !142)
!154 = !DILocation(line: 101, column: 41, scope: !138)
!155 = !DILocalVariable(name: "spatial_id", arg: 7, scope: !138, file: !40, line: 101, type: !142)
!156 = !DILocation(line: 101, column: 59, scope: !138)
!157 = !DILocalVariable(name: "gb", scope: !138, file: !40, line: 103, type: !51)
!158 = !DILocation(line: 103, column: 19, scope: !138)
!159 = !DILocalVariable(name: "ret", scope: !138, file: !40, line: 104, type: !16)
!160 = !DILocation(line: 104, column: 9, scope: !138)
!161 = !DILocalVariable(name: "extension_flag", scope: !138, file: !40, line: 104, type: !16)
!162 = !DILocation(line: 104, column: 14, scope: !138)
!163 = !DILocalVariable(name: "has_size_flag", scope: !138, file: !40, line: 104, type: !16)
!164 = !DILocation(line: 104, column: 30, scope: !138)
!165 = !DILocalVariable(name: "size", scope: !138, file: !40, line: 105, type: !28)
!166 = !DILocation(line: 105, column: 13, scope: !138)
!167 = !DILocation(line: 107, column: 31, scope: !138)
!168 = !DILocation(line: 107, column: 38, scope: !138)
!169 = !DILocation(line: 107, column: 48, scope: !138)
!170 = !DILocation(line: 107, column: 37, scope: !138)
!171 = !DILocation(line: 107, column: 37, scope: !172)
!172 = !DILexicalBlockFile(scope: !138, file: !40, discriminator: 1)
!173 = !DILocation(line: 107, column: 71, scope: !174)
!174 = !DILexicalBlockFile(scope: !138, file: !40, discriminator: 2)
!175 = !DILocation(line: 107, column: 37, scope: !174)
!176 = !DILocation(line: 107, column: 37, scope: !177)
!177 = !DILexicalBlockFile(scope: !138, file: !40, discriminator: 3)
!178 = !DILocation(line: 107, column: 11, scope: !177)
!179 = !DILocation(line: 107, column: 9, scope: !177)
!180 = !DILocation(line: 108, column: 9, scope: !181)
!181 = distinct !DILexicalBlock(scope: !138, file: !40, line: 108, column: 9)
!182 = !DILocation(line: 108, column: 13, scope: !181)
!183 = !DILocation(line: 108, column: 9, scope: !138)
!184 = !DILocation(line: 109, column: 16, scope: !181)
!185 = !DILocation(line: 109, column: 9, scope: !181)
!186 = !DILocation(line: 111, column: 9, scope: !187)
!187 = distinct !DILexicalBlock(scope: !138, file: !40, line: 111, column: 9)
!188 = !DILocation(line: 111, column: 24, scope: !187)
!189 = !DILocation(line: 111, column: 9, scope: !138)
!190 = !DILocation(line: 112, column: 9, scope: !187)
!191 = !DILocation(line: 114, column: 13, scope: !138)
!192 = !DILocation(line: 114, column: 6, scope: !138)
!193 = !DILocation(line: 114, column: 11, scope: !138)
!194 = !DILocation(line: 115, column: 22, scope: !138)
!195 = !DILocation(line: 115, column: 20, scope: !138)
!196 = !DILocation(line: 116, column: 21, scope: !138)
!197 = !DILocation(line: 116, column: 19, scope: !138)
!198 = !DILocation(line: 117, column: 5, scope: !138)
!199 = !DILocation(line: 119, column: 9, scope: !200)
!200 = distinct !DILexicalBlock(scope: !138, file: !40, line: 119, column: 9)
!201 = !DILocation(line: 119, column: 9, scope: !138)
!202 = !DILocation(line: 120, column: 24, scope: !203)
!203 = distinct !DILexicalBlock(scope: !200, file: !40, line: 119, column: 25)
!204 = !DILocation(line: 120, column: 10, scope: !203)
!205 = !DILocation(line: 120, column: 22, scope: !203)
!206 = !DILocation(line: 121, column: 23, scope: !203)
!207 = !DILocation(line: 121, column: 10, scope: !203)
!208 = !DILocation(line: 121, column: 21, scope: !203)
!209 = !DILocation(line: 122, column: 9, scope: !203)
!210 = !DILocation(line: 123, column: 5, scope: !203)
!211 = !DILocation(line: 124, column: 25, scope: !212)
!212 = distinct !DILexicalBlock(scope: !200, file: !40, line: 123, column: 12)
!213 = !DILocation(line: 124, column: 36, scope: !212)
!214 = !DILocation(line: 124, column: 10, scope: !212)
!215 = !DILocation(line: 124, column: 22, scope: !212)
!216 = !DILocation(line: 127, column: 17, scope: !138)
!217 = !DILocation(line: 127, column: 33, scope: !172)
!218 = !DILocation(line: 127, column: 17, scope: !172)
!219 = !DILocation(line: 128, column: 34, scope: !138)
!220 = !DILocation(line: 128, column: 43, scope: !138)
!221 = !DILocation(line: 128, column: 49, scope: !138)
!222 = !DILocation(line: 128, column: 47, scope: !138)
!223 = !DILocation(line: 127, column: 17, scope: !174)
!224 = !DILocation(line: 127, column: 17, scope: !177)
!225 = !DILocation(line: 127, column: 6, scope: !177)
!226 = !DILocation(line: 127, column: 15, scope: !177)
!227 = !DILocation(line: 130, column: 9, scope: !228)
!228 = distinct !DILexicalBlock(scope: !138, file: !40, line: 130, column: 9)
!229 = !DILocation(line: 130, column: 28, scope: !228)
!230 = !DILocation(line: 130, column: 9, scope: !138)
!231 = !DILocation(line: 131, column: 9, scope: !228)
!232 = !DILocation(line: 133, column: 18, scope: !138)
!233 = !DILocation(line: 133, column: 38, scope: !138)
!234 = !DILocation(line: 133, column: 6, scope: !138)
!235 = !DILocation(line: 133, column: 16, scope: !138)
!236 = !DILocation(line: 135, column: 13, scope: !138)
!237 = !DILocation(line: 135, column: 12, scope: !138)
!238 = !DILocation(line: 135, column: 25, scope: !138)
!239 = !DILocation(line: 135, column: 24, scope: !138)
!240 = !DILocation(line: 135, column: 22, scope: !138)
!241 = !DILocation(line: 135, column: 10, scope: !138)
!242 = !DILocation(line: 137, column: 9, scope: !243)
!243 = distinct !DILexicalBlock(scope: !138, file: !40, line: 137, column: 9)
!244 = !DILocation(line: 137, column: 16, scope: !243)
!245 = !DILocation(line: 137, column: 14, scope: !243)
!246 = !DILocation(line: 137, column: 9, scope: !138)
!247 = !DILocation(line: 138, column: 9, scope: !243)
!248 = !DILocation(line: 140, column: 12, scope: !138)
!249 = !DILocation(line: 140, column: 5, scope: !138)
!250 = !DILocation(line: 141, column: 1, scope: !138)
!251 = distinct !DISubprogram(name: "ff_av1_packet_split", scope: !35, file: !35, line: 56, type: !252, isLocal: false, isDefinition: true, scopeLine: 57, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !63)
!252 = !DISubroutineType(types: !253)
!253 = !{!16, !254, !45, !16, !30}
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "AV1Packet", file: !40, line: 59, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AV1Packet", file: !40, line: 55, size: 128, align: 64, elements: !257)
!257 = !{!258, !259, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "obus", scope: !256, file: !40, line: 56, baseType: !38, size: 64, align: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_obus", scope: !256, file: !40, line: 57, baseType: !16, size: 32, align: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "obus_allocated", scope: !256, file: !40, line: 58, baseType: !16, size: 32, align: 32, offset: 96)
!261 = !DILocalVariable(name: "g", arg: 1, scope: !262, file: !263, line: 164, type: !266)
!262 = distinct !DISubprogram(name: "bytestream2_skip", scope: !263, file: !263, line: 164, type: !264, isLocal: true, isDefinition: true, scopeLine: 166, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !63)
!263 = !DIFile(filename: "libavcodec/bytestream.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!264 = !DISubroutineType(types: !265)
!265 = !{null, !266, !17}
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetByteContext", file: !263, line: 35, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetByteContext", file: !263, line: 33, size: 192, align: 64, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !268, file: !263, line: 34, baseType: !45, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !268, file: !263, line: 34, baseType: !45, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !268, file: !263, line: 34, baseType: !45, size: 64, align: 64, offset: 128)
!273 = !DILocation(line: 164, column: 84, scope: !262, inlinedAt: !274)
!274 = distinct !DILocation(line: 84, column: 9, scope: !275)
!275 = distinct !DILexicalBlock(scope: !251, file: !35, line: 64, column: 49)
!276 = !DILocalVariable(name: "size", arg: 2, scope: !262, file: !263, line: 165, type: !17)
!277 = !DILocation(line: 165, column: 60, scope: !262, inlinedAt: !274)
!278 = !DILocalVariable(name: "g", arg: 1, scope: !279, file: !263, line: 154, type: !266)
!279 = distinct !DISubprogram(name: "bytestream2_get_bytes_left", scope: !263, file: !263, line: 154, type: !280, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !63)
!280 = !DISubroutineType(types: !281)
!281 = !{!17, !266}
!282 = !DILocation(line: 154, column: 102, scope: !279, inlinedAt: !283)
!283 = distinct !DILocation(line: 80, column: 55, scope: !275)
!284 = !DILocation(line: 154, column: 102, scope: !279, inlinedAt: !285)
!285 = distinct !DILocation(line: 64, column: 12, scope: !286)
!286 = !DILexicalBlockFile(scope: !251, file: !35, discriminator: 1)
!287 = !DILocalVariable(name: "g", arg: 1, scope: !288, file: !263, line: 133, type: !266)
!288 = distinct !DISubprogram(name: "bytestream2_init", scope: !263, file: !263, line: 133, type: !289, isLocal: true, isDefinition: true, scopeLine: 136, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !63)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !266, !45, !16}
!291 = !DILocation(line: 133, column: 84, scope: !288, inlinedAt: !292)
!292 = distinct !DILocation(line: 61, column: 5, scope: !251)
!293 = !DILocalVariable(name: "buf", arg: 2, scope: !288, file: !263, line: 134, type: !45)
!294 = !DILocation(line: 134, column: 62, scope: !288, inlinedAt: !292)
!295 = !DILocalVariable(name: "buf_size", arg: 3, scope: !288, file: !263, line: 135, type: !16)
!296 = !DILocation(line: 135, column: 51, scope: !288, inlinedAt: !292)
!297 = !DILocalVariable(name: "pkt", arg: 1, scope: !251, file: !35, line: 56, type: !254)
!298 = !DILocation(line: 56, column: 36, scope: !251)
!299 = !DILocalVariable(name: "buf", arg: 2, scope: !251, file: !35, line: 56, type: !45)
!300 = !DILocation(line: 56, column: 56, scope: !251)
!301 = !DILocalVariable(name: "length", arg: 3, scope: !251, file: !35, line: 56, type: !16)
!302 = !DILocation(line: 56, column: 65, scope: !251)
!303 = !DILocalVariable(name: "logctx", arg: 4, scope: !251, file: !35, line: 56, type: !30)
!304 = !DILocation(line: 56, column: 79, scope: !251)
!305 = !DILocalVariable(name: "bc", scope: !251, file: !35, line: 58, type: !267)
!306 = !DILocation(line: 58, column: 20, scope: !251)
!307 = !DILocalVariable(name: "ret", scope: !251, file: !35, line: 59, type: !16)
!308 = !DILocation(line: 59, column: 9, scope: !251)
!309 = !DILocalVariable(name: "consumed", scope: !251, file: !35, line: 59, type: !16)
!310 = !DILocation(line: 59, column: 14, scope: !251)
!311 = !DILocation(line: 61, column: 27, scope: !251)
!312 = !DILocation(line: 61, column: 32, scope: !251)
!313 = !DILocation(line: 61, column: 5, scope: !251)
!314 = !DILocation(line: 137, column: 16, scope: !315, inlinedAt: !292)
!315 = !DILexicalBlockFile(scope: !316, file: !263, discriminator: 1)
!316 = distinct !DILexicalBlock(scope: !317, file: !263, line: 137, column: 14)
!317 = distinct !DILexicalBlock(scope: !288, file: !263, line: 137, column: 8)
!318 = !DILocation(line: 137, column: 25, scope: !315, inlinedAt: !292)
!319 = !DILocation(line: 137, column: 14, scope: !315, inlinedAt: !292)
!320 = !DILocation(line: 137, column: 34, scope: !321, inlinedAt: !292)
!321 = !DILexicalBlockFile(scope: !322, file: !263, discriminator: 2)
!322 = distinct !DILexicalBlock(scope: !316, file: !263, line: 137, column: 32)
!323 = !DILocation(line: 137, column: 93, scope: !324, inlinedAt: !292)
