; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--oggparseflac.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--oggparseflac.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ogg_codec = type { i8*, i8, i8*, i32 (%struct.AVFormatContext*, i32)*, i32 (%struct.AVFormatContext*, i32)*, i64 (%struct.AVFormatContext*, i32, i64, i64*)*, i32, i32, void (%struct.AVFormatContext*, i32)* }
%struct.AVFormatContext = type { %struct.AVClass*, %struct.AVInputFormat*, %struct.AVOutputFormat*, i8*, %struct.AVIOContext*, i32, i32, %struct.AVStream**, [1024 x i8], i8*, i64, i64, i64, i32, i32, i32, i64, i64, i8*, i32, i32, %struct.AVProgram**, i32, i32, i32, i32, i32, i32, %struct.AVChapter**, %struct.AVDictionary*, i64, i32, i32, %struct.AVIOInterruptCB, i32, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i8*, i8*, %struct.AVFormatInternal*, i32, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, %struct.AVCodec*, i32, i8*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i64, i8*, i32, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVIOInterruptCB*, %struct.AVDictionary**)*, i8*, i32 (%struct.AVFormatContext*, %struct.AVIOContext**, i8*, i32, %struct.AVDictionary**)*, void (%struct.AVFormatContext*, %struct.AVIOContext*)*, i8*, i32, i32 }

!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !25, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !25, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !917, line: 47, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavcodec/flac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926}
!919 = !DIEnumerator(name: "FLAC_METADATA_TYPE_STREAMINFO", value: 0)
!920 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PADDING", value: 1)
!921 = !DIEnumerator(name: "FLAC_METADATA_TYPE_APPLICATION", value: 2)
!922 = !DIEnumerator(name: "FLAC_METADATA_TYPE_SEEKTABLE", value: 3)
!923 = !DIEnumerator(name: "FLAC_METADATA_TYPE_VORBIS_COMMENT", value: 4)
!924 = !DIEnumerator(name: "FLAC_METADATA_TYPE_CUESHEET", value: 5)
!925 = !DIEnumerator(name: "FLAC_METADATA_TYPE_PICTURE", value: 6)
!926 = !DIEnumerator(name: "FLAC_METADATA_TYPE_INVALID", value: 127)
!927 = !{!928, !933, !934, !935, !930, !942}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !931, line: 48, baseType: !932)
!931 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!932 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!933 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!934 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !938, line: 221, size: 32, align: 8, elements: !939)
!938 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !937, file: !938, line: 221, baseType: !941, size: 32, align: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !931, line: 51, baseType: !934)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !943, line: 197, baseType: !944)
!943 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!944 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!945 = !{!946, !2180}
!946 = distinct !DIGlobalVariable(name: "ff_flac_codec", scope: !0, file: !947, line: 128, type: !948, isLocal: false, isDefinition: true, variable: %struct.ogg_codec* @ff_flac_codec)
!947 = !DIFile(filename: "libavformat/oggparseflac.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ogg_codec", file: !950, line: 31, size: 512, align: 64, elements: !951)
!950 = !DIFile(filename: "libavformat/oggdec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !{!952, !957, !958, !959, !2169, !2170, !2174, !2175, !2176}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !949, file: !950, line: 32, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !943, line: 194, baseType: !956)
!956 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "magicsize", scope: !949, file: !950, line: 33, baseType: !930, size: 8, align: 8, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !949, file: !950, line: 34, baseType: !953, size: 64, align: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !949, file: !950, line: 41, baseType: !960, size: 64, align: 64, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!933, !963, !933}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !966)
!966 = !{!967, !1012, !1121, !1267, !1268, !1331, !1332, !1333, !2026, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2063, !2064, !2065, !2066, !2067, !2068, !2069, !2080, !2081, !2082, !2083, !2084, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2135, !2136, !2139, !2140, !2141, !2142, !2143, !2144, !2146, !2147, !2148, !2149, !2157, !2158, !2162, !2166, !2167, !2168}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !965, file: !897, line: 1342, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !972)
!972 = !{!973, !977, !982, !986, !987, !988, !989, !993, !999, !1001, !1005}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !971, file: !4, line: 72, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !971, file: !4, line: 78, baseType: !978, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!974, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !971, file: !4, line: 85, baseType: !983, size: 64, align: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !971, file: !4, line: 93, baseType: !933, size: 32, align: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !971, file: !4, line: 99, baseType: !933, size: 32, align: 32, offset: 224)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !971, file: !4, line: 108, baseType: !933, size: 32, align: 32, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !971, file: !4, line: 113, baseType: !990, size: 64, align: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!981, !981, !981}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !971, file: !4, line: 123, baseType: !994, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!997, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !971, file: !4, line: 130, baseType: !1000, size: 32, align: 32, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !971, file: !4, line: 136, baseType: !1002, size: 64, align: 64, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!1000, !981}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !971, file: !4, line: 142, baseType: !1006, size: 64, align: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!933, !1009, !981, !974, !933}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !965, file: !897, line: 1349, baseType: !1013, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1030, !1031, !1032, !1033, !1034, !1035, !1048, !1053, !1092, !1093, !1097, !1102, !1103, !1104, !1108, !1114, !1120}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !897, line: 638, baseType: !974, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1014, file: !897, line: 645, baseType: !974, size: 64, align: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1014, file: !897, line: 652, baseType: !933, size: 32, align: 32, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1014, file: !897, line: 659, baseType: !974, size: 64, align: 64, offset: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1014, file: !897, line: 661, baseType: !1021, size: 64, align: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1026, line: 44, size: 64, align: 32, elements: !1027)
!1026 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1025, file: !1026, line: 45, baseType: !24, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1025, file: !1026, line: 46, baseType: !934, size: 32, align: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1014, file: !897, line: 663, baseType: !968, size: 64, align: 64, offset: 320)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1014, file: !897, line: 670, baseType: !974, size: 64, align: 64, offset: 384)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !897, line: 679, baseType: !1013, size: 64, align: 64, offset: 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1014, file: !897, line: 684, baseType: !933, size: 32, align: 32, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1014, file: !897, line: 689, baseType: !933, size: 32, align: 32, offset: 544)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1014, file: !897, line: 696, baseType: !1036, size: 64, align: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!933, !1039}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1042)
!1042 = !{!1043, !1044, !1046, !1047}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1041, file: !897, line: 449, baseType: !974, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1041, file: !897, line: 450, baseType: !1045, size: 64, align: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1041, file: !897, line: 451, baseType: !933, size: 32, align: 32, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1041, file: !897, line: 452, baseType: !974, size: 64, align: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1014, file: !897, line: 703, baseType: !1049, size: 64, align: 64, offset: 640)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!933, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1014, file: !897, line: 714, baseType: !1054, size: 64, align: 64, offset: 704)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!933, !1052, !1057}
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !25, line: 1499, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !25, line: 1445, size: 704, align: 64, elements: !1060)
!1060 = !{!1061, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1088, !1089, !1090, !1091}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1059, file: !25, line: 1451, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1064, line: 94, baseType: !1065)
!1064 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1064, line: 81, size: 192, align: 64, elements: !1066)
!1066 = !{!1067, !1071, !1073}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1065, file: !1064, line: 82, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1064, line: 73, baseType: !1070)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1064, line: 73, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1065, file: !1064, line: 89, baseType: !1072, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1065, file: !1064, line: 93, baseType: !933, size: 32, align: 32, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1059, file: !25, line: 1461, baseType: !942, size: 64, align: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1059, file: !25, line: 1467, baseType: !942, size: 64, align: 64, offset: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1059, file: !25, line: 1468, baseType: !1072, size: 64, align: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1059, file: !25, line: 1469, baseType: !933, size: 32, align: 32, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1059, file: !25, line: 1470, baseType: !933, size: 32, align: 32, offset: 288)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1059, file: !25, line: 1474, baseType: !933, size: 32, align: 32, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1059, file: !25, line: 1479, baseType: !1081, size: 64, align: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !25, line: 1415, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !25, line: 1411, size: 128, align: 64, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !25, line: 1412, baseType: !1072, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !25, line: 1413, baseType: !933, size: 32, align: 32, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1083, file: !25, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1059, file: !25, line: 1480, baseType: !933, size: 32, align: 32, offset: 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1059, file: !25, line: 1486, baseType: !942, size: 64, align: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1059, file: !25, line: 1488, baseType: !942, size: 64, align: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1059, file: !25, line: 1497, baseType: !942, size: 64, align: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1014, file: !897, line: 720, baseType: !1049, size: 64, align: 64, offset: 768)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1014, file: !897, line: 730, baseType: !1094, size: 64, align: 64, offset: 832)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DISubroutineType(types: !1096)
!1096 = !{!933, !1052, !933, !942, !933}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1014, file: !897, line: 737, baseType: !1098, size: 64, align: 64, offset: 896)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!942, !1052, !933, !1101, !942}
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1014, file: !897, line: 744, baseType: !1049, size: 64, align: 64, offset: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1014, file: !897, line: 750, baseType: !1049, size: 64, align: 64, offset: 1024)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1014, file: !897, line: 758, baseType: !1105, size: 64, align: 64, offset: 1088)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DISubroutineType(types: !1107)
!1107 = !{!933, !1052, !933, !942, !942, !942, !933}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1014, file: !897, line: 764, baseType: !1109, size: 64, align: 64, offset: 1152)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!933, !1052, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1014, file: !897, line: 770, baseType: !1115, size: 64, align: 64, offset: 1216)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!933, !1052, !1118}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1014, file: !897, line: 776, baseType: !1115, size: 64, align: 64, offset: 1280)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !965, file: !897, line: 1356, baseType: !1122, size: 64, align: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1144, !1148, !1152, !1159, !1252, !1253, !1254, !1255, !1256, !1257, !1261}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1123, file: !897, line: 498, baseType: !974, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1123, file: !897, line: 504, baseType: !974, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1123, file: !897, line: 505, baseType: !974, size: 64, align: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1123, file: !897, line: 506, baseType: !974, size: 64, align: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1123, file: !897, line: 508, baseType: !24, size: 32, align: 32, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1123, file: !897, line: 509, baseType: !24, size: 32, align: 32, offset: 288)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1123, file: !897, line: 510, baseType: !24, size: 32, align: 32, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1123, file: !897, line: 517, baseType: !933, size: 32, align: 32, offset: 352)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1123, file: !897, line: 523, baseType: !1021, size: 64, align: 64, offset: 384)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1123, file: !897, line: 526, baseType: !968, size: 64, align: 64, offset: 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1123, file: !897, line: 535, baseType: !1122, size: 64, align: 64, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1123, file: !897, line: 539, baseType: !933, size: 32, align: 32, offset: 576)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1123, file: !897, line: 541, baseType: !1049, size: 64, align: 64, offset: 640)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1123, file: !897, line: 549, baseType: !1054, size: 64, align: 64, offset: 704)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1123, file: !897, line: 550, baseType: !1049, size: 64, align: 64, offset: 768)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1123, file: !897, line: 554, baseType: !1141, size: 64, align: 64, offset: 832)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{!933, !1052, !1057, !1057, !933}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1123, file: !897, line: 563, baseType: !1145, size: 64, align: 64, offset: 896)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!933, !24, !933}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1123, file: !897, line: 565, baseType: !1149, size: 64, align: 64, offset: 960)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{null, !1052, !933, !1101, !1101}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1123, file: !897, line: 570, baseType: !1153, size: 64, align: 64, offset: 1024)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!933, !1052, !933, !981, !1156}
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1157, line: 216, baseType: !1158)
!1157 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1158 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1123, file: !897, line: 581, baseType: !1160, size: 64, align: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DISubroutineType(types: !1162)
!1162 = !{!933, !1052, !933, !1163, !934}
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !526, line: 646, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !526, line: 268, size: 4288, align: 64, elements: !1167)
!1167 = !{!1168, !1172, !1174, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1208, !1210, !1211, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1166, file: !526, line: 282, baseType: !1169, size: 512, align: 64)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 512, align: 64, elements: !1170)
!1170 = !{!1171}
!1171 = !DISubrange(count: 8)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1166, file: !526, line: 299, baseType: !1173, size: 256, align: 32, offset: 512)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 256, align: 32, elements: !1170)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1166, file: !526, line: 315, baseType: !1175, size: 64, align: 64, offset: 768)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1166, file: !526, line: 326, baseType: !933, size: 32, align: 32, offset: 832)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1166, file: !526, line: 326, baseType: !933, size: 32, align: 32, offset: 864)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1166, file: !526, line: 334, baseType: !933, size: 32, align: 32, offset: 896)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1166, file: !526, line: 341, baseType: !933, size: 32, align: 32, offset: 928)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1166, file: !526, line: 346, baseType: !933, size: 32, align: 32, offset: 960)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1166, file: !526, line: 351, baseType: !514, size: 32, align: 32, offset: 992)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1166, file: !526, line: 356, baseType: !1183, size: 64, align: 32, offset: 1024)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1184, line: 61, baseType: !1185)
!1184 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1184, line: 58, size: 64, align: 32, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1185, file: !1184, line: 59, baseType: !933, size: 32, align: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1185, file: !1184, line: 60, baseType: !933, size: 32, align: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1166, file: !526, line: 361, baseType: !942, size: 64, align: 64, offset: 1088)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1166, file: !526, line: 369, baseType: !942, size: 64, align: 64, offset: 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1166, file: !526, line: 377, baseType: !942, size: 64, align: 64, offset: 1216)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1166, file: !526, line: 382, baseType: !933, size: 32, align: 32, offset: 1280)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1166, file: !526, line: 386, baseType: !933, size: 32, align: 32, offset: 1312)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1166, file: !526, line: 391, baseType: !933, size: 32, align: 32, offset: 1344)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1166, file: !526, line: 396, baseType: !981, size: 64, align: 64, offset: 1408)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1166, file: !526, line: 403, baseType: !1197, size: 512, align: 64, offset: 1472)
!1197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1198, size: 512, align: 64, elements: !1170)
!1198 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !931, line: 55, baseType: !1158)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1166, file: !526, line: 410, baseType: !933, size: 32, align: 32, offset: 1984)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1166, file: !526, line: 415, baseType: !933, size: 32, align: 32, offset: 2016)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1166, file: !526, line: 420, baseType: !933, size: 32, align: 32, offset: 2048)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1166, file: !526, line: 425, baseType: !933, size: 32, align: 32, offset: 2080)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1166, file: !526, line: 435, baseType: !942, size: 64, align: 64, offset: 2112)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1166, file: !526, line: 440, baseType: !933, size: 32, align: 32, offset: 2176)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1166, file: !526, line: 445, baseType: !1198, size: 64, align: 64, offset: 2240)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1166, file: !526, line: 459, baseType: !1207, size: 512, align: 64, offset: 2304)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 512, align: 64, elements: !1170)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1166, file: !526, line: 473, baseType: !1209, size: 64, align: 64, offset: 2816)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1166, file: !526, line: 477, baseType: !933, size: 32, align: 32, offset: 2880)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1166, file: !526, line: 479, baseType: !1212, size: 64, align: 64, offset: 2944)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !526, line: 207, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !526, line: 201, size: 320, align: 64, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1225}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1215, file: !526, line: 202, baseType: !525, size: 32, align: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1215, file: !526, line: 203, baseType: !1072, size: 64, align: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1215, file: !526, line: 204, baseType: !933, size: 32, align: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1215, file: !526, line: 205, baseType: !1221, size: 64, align: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1223, line: 86, baseType: !1224)
!1223 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1223, line: 86, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1215, file: !526, line: 206, baseType: !1062, size: 64, align: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1166, file: !526, line: 480, baseType: !933, size: 32, align: 32, offset: 3008)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1166, file: !526, line: 505, baseType: !933, size: 32, align: 32, offset: 3040)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1166, file: !526, line: 512, baseType: !549, size: 32, align: 32, offset: 3072)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1166, file: !526, line: 514, baseType: !556, size: 32, align: 32, offset: 3104)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1166, file: !526, line: 516, baseType: !574, size: 32, align: 32, offset: 3136)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1166, file: !526, line: 523, baseType: !598, size: 32, align: 32, offset: 3168)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1166, file: !526, line: 525, baseType: !617, size: 32, align: 32, offset: 3200)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1166, file: !526, line: 532, baseType: !942, size: 64, align: 64, offset: 3264)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1166, file: !526, line: 539, baseType: !942, size: 64, align: 64, offset: 3328)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1166, file: !526, line: 547, baseType: !942, size: 64, align: 64, offset: 3392)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1166, file: !526, line: 554, baseType: !1221, size: 64, align: 64, offset: 3456)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1166, file: !526, line: 563, baseType: !933, size: 32, align: 32, offset: 3520)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1166, file: !526, line: 572, baseType: !933, size: 32, align: 32, offset: 3552)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1166, file: !526, line: 581, baseType: !933, size: 32, align: 32, offset: 3584)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1166, file: !526, line: 588, baseType: !1241, size: 64, align: 64, offset: 3648)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1166, file: !526, line: 593, baseType: !933, size: 32, align: 32, offset: 3712)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1166, file: !526, line: 596, baseType: !933, size: 32, align: 32, offset: 3744)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1166, file: !526, line: 599, baseType: !1062, size: 64, align: 64, offset: 3776)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1166, file: !526, line: 605, baseType: !1062, size: 64, align: 64, offset: 3840)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1166, file: !526, line: 616, baseType: !1062, size: 64, align: 64, offset: 3904)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1166, file: !526, line: 626, baseType: !1156, size: 64, align: 64, offset: 3968)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1166, file: !526, line: 627, baseType: !1156, size: 64, align: 64, offset: 4032)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1166, file: !526, line: 628, baseType: !1156, size: 64, align: 64, offset: 4096)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1166, file: !526, line: 629, baseType: !1156, size: 64, align: 64, offset: 4160)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1166, file: !526, line: 645, baseType: !1062, size: 64, align: 64, offset: 4224)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1123, file: !897, line: 587, baseType: !1109, size: 64, align: 64, offset: 1152)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1123, file: !897, line: 592, baseType: !1115, size: 64, align: 64, offset: 1216)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1123, file: !897, line: 597, baseType: !1115, size: 64, align: 64, offset: 1280)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1123, file: !897, line: 598, baseType: !24, size: 32, align: 32, offset: 1344)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1123, file: !897, line: 608, baseType: !1049, size: 64, align: 64, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1123, file: !897, line: 617, baseType: !1258, size: 64, align: 64, offset: 1472)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{null, !1052}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1123, file: !897, line: 623, baseType: !1262, size: 64, align: 64, offset: 1536)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!933, !1052, !1265}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1058)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !965, file: !897, line: 1365, baseType: !981, size: 64, align: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !965, file: !897, line: 1379, baseType: !1269, size: 64, align: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !628, line: 352, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !628, line: 161, size: 2112, align: 64, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277, !1278, !1279, !1283, !1284, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1298, !1299, !1303, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1321, !1322, !1323, !1324, !1328, !1329, !1330}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1271, file: !628, line: 174, baseType: !968, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1271, file: !628, line: 226, baseType: !1045, size: 64, align: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1271, file: !628, line: 227, baseType: !933, size: 32, align: 32, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1271, file: !628, line: 228, baseType: !1045, size: 64, align: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1271, file: !628, line: 229, baseType: !1045, size: 64, align: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1271, file: !628, line: 233, baseType: !981, size: 64, align: 64, offset: 320)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1271, file: !628, line: 235, baseType: !1280, size: 64, align: 64, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DISubroutineType(types: !1282)
!1282 = !{!933, !981, !1072, !933}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1271, file: !628, line: 236, baseType: !1280, size: 64, align: 64, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1271, file: !628, line: 237, baseType: !1285, size: 64, align: 64, offset: 512)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!942, !981, !942, !933}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1271, file: !628, line: 238, baseType: !942, size: 64, align: 64, offset: 576)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1271, file: !628, line: 239, baseType: !933, size: 32, align: 32, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1271, file: !628, line: 240, baseType: !933, size: 32, align: 32, offset: 672)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1271, file: !628, line: 241, baseType: !933, size: 32, align: 32, offset: 704)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1271, file: !628, line: 242, baseType: !1158, size: 64, align: 64, offset: 768)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1271, file: !628, line: 243, baseType: !1045, size: 64, align: 64, offset: 832)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1271, file: !628, line: 244, baseType: !1295, size: 64, align: 64, offset: 896)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64, align: 64)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{!1158, !1158, !928, !934}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1271, file: !628, line: 245, baseType: !933, size: 32, align: 32, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1271, file: !628, line: 249, baseType: !1300, size: 64, align: 64, offset: 1024)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!933, !981, !933}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1271, file: !628, line: 255, baseType: !1304, size: 64, align: 64, offset: 1088)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!942, !981, !933, !942, !933}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1271, file: !628, line: 260, baseType: !933, size: 32, align: 32, offset: 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1271, file: !628, line: 266, baseType: !942, size: 64, align: 64, offset: 1216)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1271, file: !628, line: 273, baseType: !933, size: 32, align: 32, offset: 1280)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1271, file: !628, line: 279, baseType: !942, size: 64, align: 64, offset: 1344)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1271, file: !628, line: 285, baseType: !933, size: 32, align: 32, offset: 1408)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1271, file: !628, line: 291, baseType: !933, size: 32, align: 32, offset: 1440)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1271, file: !628, line: 298, baseType: !933, size: 32, align: 32, offset: 1472)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1271, file: !628, line: 304, baseType: !933, size: 32, align: 32, offset: 1504)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1271, file: !628, line: 309, baseType: !974, size: 64, align: 64, offset: 1536)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1271, file: !628, line: 314, baseType: !974, size: 64, align: 64, offset: 1600)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1271, file: !628, line: 319, baseType: !1318, size: 64, align: 64, offset: 1664)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!933, !981, !1072, !933, !627, !942}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1271, file: !628, line: 326, baseType: !933, size: 32, align: 32, offset: 1728)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1271, file: !628, line: 331, baseType: !627, size: 32, align: 32, offset: 1760)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1271, file: !628, line: 332, baseType: !942, size: 64, align: 64, offset: 1792)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1271, file: !628, line: 338, baseType: !1325, size: 64, align: 64, offset: 1856)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!933, !981}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1271, file: !628, line: 340, baseType: !942, size: 64, align: 64, offset: 1920)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1271, file: !628, line: 346, baseType: !1045, size: 64, align: 64, offset: 1984)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1271, file: !628, line: 351, baseType: !933, size: 32, align: 32, offset: 2048)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !965, file: !897, line: 1386, baseType: !933, size: 32, align: 32, offset: 320)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !965, file: !897, line: 1393, baseType: !934, size: 32, align: 32, offset: 352)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !965, file: !897, line: 1405, baseType: !1334, size: 64, align: 64, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1811, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1912, !1918, !1919, !1923, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1955, !1956, !1957, !1958, !1959, !1960}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1337, file: !897, line: 866, baseType: !933, size: 32, align: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1337, file: !897, line: 872, baseType: !933, size: 32, align: 32, offset: 32)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1337, file: !897, line: 878, baseType: !1342, size: 64, align: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !25, line: 3360, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !25, line: 1556, size: 8448, align: 64, elements: !1345)
!1345 = !{!1346, !1347, !1348, !1349, !1486, !1487, !1488, !1489, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1515, !1519, !1520, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1699, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1344, file: !25, line: 1561, baseType: !968, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1344, file: !25, line: 1562, baseType: !933, size: 32, align: 32, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1344, file: !25, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1344, file: !25, line: 1565, baseType: !1350, size: 64, align: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !25, line: 3468, size: 1984, align: 64, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1362, !1365, !1368, !1371, !1374, !1375, !1376, !1384, !1385, !1386, !1388, !1392, !1398, !1403, !1407, !1408, !1451, !1458, !1462, !1463, !1467, !1471, !1475, !1479, !1480, !1481}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1352, file: !25, line: 3475, baseType: !974, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1352, file: !25, line: 3480, baseType: !974, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1352, file: !25, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1352, file: !25, line: 3482, baseType: !24, size: 32, align: 32, offset: 160)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1352, file: !25, line: 3487, baseType: !933, size: 32, align: 32, offset: 192)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1352, file: !25, line: 3488, baseType: !1360, size: 64, align: 64, offset: 256)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1183)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1352, file: !25, line: 3489, baseType: !1363, size: 64, align: 64, offset: 320)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1352, file: !25, line: 3490, baseType: !1366, size: 64, align: 64, offset: 384)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1352, file: !25, line: 3491, baseType: !1369, size: 64, align: 64, offset: 448)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1352, file: !25, line: 3492, baseType: !1372, size: 64, align: 64, offset: 512)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1198)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1352, file: !25, line: 3493, baseType: !930, size: 8, align: 8, offset: 576)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1352, file: !25, line: 3494, baseType: !968, size: 64, align: 64, offset: 640)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1352, file: !25, line: 3495, baseType: !1377, size: 64, align: 64, offset: 704)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1379)
!1379 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !25, line: 3404, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !25, line: 3401, size: 128, align: 64, elements: !1381)
!1381 = !{!1382, !1383}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1380, file: !25, line: 3402, baseType: !933, size: 32, align: 32)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1380, file: !25, line: 3403, baseType: !974, size: 64, align: 64, offset: 64)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1352, file: !25, line: 3507, baseType: !974, size: 64, align: 64, offset: 768)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1352, file: !25, line: 3516, baseType: !933, size: 32, align: 32, offset: 832)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1352, file: !25, line: 3517, baseType: !1387, size: 64, align: 64, offset: 896)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1352, file: !25, line: 3527, baseType: !1389, size: 64, align: 64, offset: 960)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!933, !1342}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1352, file: !25, line: 3535, baseType: !1393, size: 64, align: 64, offset: 1024)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!933, !1342, !1396}
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1352, file: !25, line: 3541, baseType: !1399, size: 64, align: 64, offset: 1088)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1401)
!1401 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !25, line: 3461, baseType: !1402)
!1402 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !25, line: 3461, flags: DIFlagFwdDecl)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1352, file: !25, line: 3549, baseType: !1404, size: 64, align: 64, offset: 1152)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{null, !1387}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1352, file: !25, line: 3551, baseType: !1389, size: 64, align: 64, offset: 1216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1352, file: !25, line: 3552, baseType: !1409, size: 64, align: 64, offset: 1280)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!933, !1342, !1072, !933, !1412}
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !25, line: 3920, size: 256, align: 64, elements: !1415)
!1415 = !{!1416, !1419, !1420, !1421, !1422, !1450}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1414, file: !25, line: 3921, baseType: !1417, size: 16, align: 16)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !931, line: 49, baseType: !1418)
!1418 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1414, file: !25, line: 3922, baseType: !941, size: 32, align: 32, offset: 32)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1414, file: !25, line: 3923, baseType: !941, size: 32, align: 32, offset: 64)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1414, file: !25, line: 3924, baseType: !934, size: 32, align: 32, offset: 96)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1414, file: !25, line: 3925, baseType: !1423, size: 64, align: 64, offset: 128)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !25, line: 3918, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !25, line: 3885, size: 1600, align: 64, elements: !1427)
!1427 = !{!1428, !1429, !1430, !1431, !1432, !1433, !1439, !1443, !1445, !1446, !1448, !1449}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1426, file: !25, line: 3886, baseType: !933, size: 32, align: 32)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1426, file: !25, line: 3887, baseType: !933, size: 32, align: 32, offset: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1426, file: !25, line: 3888, baseType: !933, size: 32, align: 32, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1426, file: !25, line: 3889, baseType: !933, size: 32, align: 32, offset: 96)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1426, file: !25, line: 3890, baseType: !933, size: 32, align: 32, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1426, file: !25, line: 3897, baseType: !1434, size: 768, align: 64, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !25, line: 3858, baseType: !1435)
!1435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !25, line: 3853, size: 768, align: 64, elements: !1436)
!1436 = !{!1437, !1438}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1435, file: !25, line: 3855, baseType: !1169, size: 512, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1435, file: !25, line: 3857, baseType: !1173, size: 256, align: 32, offset: 512)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1426, file: !25, line: 3903, baseType: !1440, size: 256, align: 64, offset: 960)
!1440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 256, align: 64, elements: !1441)
!1441 = !{!1442}
!1442 = !DISubrange(count: 4)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1426, file: !25, line: 3904, baseType: !1444, size: 128, align: 32, offset: 1216)
!1444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 128, align: 32, elements: !1441)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1426, file: !25, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1426, file: !25, line: 3908, baseType: !1447, size: 64, align: 64, offset: 1408)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1426, file: !25, line: 3915, baseType: !1447, size: 64, align: 64, offset: 1472)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1426, file: !25, line: 3917, baseType: !933, size: 32, align: 32, offset: 1536)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1414, file: !25, line: 3926, baseType: !942, size: 64, align: 64, offset: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1352, file: !25, line: 3564, baseType: !1452, size: 64, align: 64, offset: 1344)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!933, !1342, !1057, !1455, !1457}
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1352, file: !25, line: 3566, baseType: !1459, size: 64, align: 64, offset: 1408)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!933, !1342, !981, !1457, !1057}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1352, file: !25, line: 3567, baseType: !1389, size: 64, align: 64, offset: 1472)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1352, file: !25, line: 3576, baseType: !1464, size: 64, align: 64, offset: 1536)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!933, !1342, !1455}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1352, file: !25, line: 3577, baseType: !1468, size: 64, align: 64, offset: 1600)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!933, !1342, !1057}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1352, file: !25, line: 3584, baseType: !1472, size: 64, align: 64, offset: 1664)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!933, !1342, !1164}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1352, file: !25, line: 3589, baseType: !1476, size: 64, align: 64, offset: 1728)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1342}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1352, file: !25, line: 3594, baseType: !933, size: 32, align: 32, offset: 1792)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1352, file: !25, line: 3600, baseType: !974, size: 64, align: 64, offset: 1856)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1352, file: !25, line: 3609, baseType: !1482, size: 64, align: 64, offset: 1920)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1485)
!1485 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !25, line: 3609, flags: DIFlagFwdDecl)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1344, file: !25, line: 1566, baseType: !24, size: 32, align: 32, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1344, file: !25, line: 1581, baseType: !934, size: 32, align: 32, offset: 224)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1344, file: !25, line: 1583, baseType: !981, size: 64, align: 64, offset: 256)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1344, file: !25, line: 1591, baseType: !1490, size: 64, align: 64, offset: 320)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !25, line: 1532, flags: DIFlagFwdDecl)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1344, file: !25, line: 1598, baseType: !981, size: 64, align: 64, offset: 384)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1344, file: !25, line: 1606, baseType: !942, size: 64, align: 64, offset: 448)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1344, file: !25, line: 1614, baseType: !933, size: 32, align: 32, offset: 512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1344, file: !25, line: 1622, baseType: !933, size: 32, align: 32, offset: 544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1344, file: !25, line: 1628, baseType: !933, size: 32, align: 32, offset: 576)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1344, file: !25, line: 1636, baseType: !933, size: 32, align: 32, offset: 608)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1344, file: !25, line: 1643, baseType: !933, size: 32, align: 32, offset: 640)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1344, file: !25, line: 1657, baseType: !1072, size: 64, align: 64, offset: 704)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1344, file: !25, line: 1658, baseType: !933, size: 32, align: 32, offset: 768)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1344, file: !25, line: 1679, baseType: !1183, size: 64, align: 32, offset: 800)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1344, file: !25, line: 1688, baseType: !933, size: 32, align: 32, offset: 864)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1344, file: !25, line: 1712, baseType: !933, size: 32, align: 32, offset: 896)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1344, file: !25, line: 1729, baseType: !933, size: 32, align: 32, offset: 928)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1344, file: !25, line: 1729, baseType: !933, size: 32, align: 32, offset: 960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1344, file: !25, line: 1744, baseType: !933, size: 32, align: 32, offset: 992)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1344, file: !25, line: 1744, baseType: !933, size: 32, align: 32, offset: 1024)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1344, file: !25, line: 1751, baseType: !933, size: 32, align: 32, offset: 1056)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1344, file: !25, line: 1766, baseType: !645, size: 32, align: 32, offset: 1088)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1344, file: !25, line: 1791, baseType: !1511, size: 64, align: 64, offset: 1152)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DISubroutineType(types: !1513)
!1513 = !{null, !1514, !1455, !1457, !933, !933, !933}
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1344, file: !25, line: 1808, baseType: !1516, size: 64, align: 64, offset: 1216)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DISubroutineType(types: !1518)
!1518 = !{!645, !1514, !1363}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1344, file: !25, line: 1816, baseType: !933, size: 32, align: 32, offset: 1280)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1344, file: !25, line: 1825, baseType: !1521, size: 32, align: 32, offset: 1312)
!1521 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1344, file: !25, line: 1830, baseType: !933, size: 32, align: 32, offset: 1344)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1344, file: !25, line: 1838, baseType: !1521, size: 32, align: 32, offset: 1376)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1344, file: !25, line: 1846, baseType: !933, size: 32, align: 32, offset: 1408)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1344, file: !25, line: 1851, baseType: !933, size: 32, align: 32, offset: 1440)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1344, file: !25, line: 1861, baseType: !1521, size: 32, align: 32, offset: 1472)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1344, file: !25, line: 1868, baseType: !1521, size: 32, align: 32, offset: 1504)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1344, file: !25, line: 1875, baseType: !1521, size: 32, align: 32, offset: 1536)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1344, file: !25, line: 1882, baseType: !1521, size: 32, align: 32, offset: 1568)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1344, file: !25, line: 1889, baseType: !1521, size: 32, align: 32, offset: 1600)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1344, file: !25, line: 1896, baseType: !1521, size: 32, align: 32, offset: 1632)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1344, file: !25, line: 1903, baseType: !1521, size: 32, align: 32, offset: 1664)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1344, file: !25, line: 1910, baseType: !933, size: 32, align: 32, offset: 1696)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1344, file: !25, line: 1915, baseType: !933, size: 32, align: 32, offset: 1728)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1344, file: !25, line: 1926, baseType: !1457, size: 64, align: 64, offset: 1792)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1344, file: !25, line: 1935, baseType: !1183, size: 64, align: 32, offset: 1856)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1344, file: !25, line: 1942, baseType: !933, size: 32, align: 32, offset: 1920)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1344, file: !25, line: 1948, baseType: !933, size: 32, align: 32, offset: 1952)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1344, file: !25, line: 1954, baseType: !933, size: 32, align: 32, offset: 1984)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1344, file: !25, line: 1960, baseType: !933, size: 32, align: 32, offset: 2016)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1344, file: !25, line: 1984, baseType: !933, size: 32, align: 32, offset: 2048)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1344, file: !25, line: 1991, baseType: !933, size: 32, align: 32, offset: 2080)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1344, file: !25, line: 1996, baseType: !933, size: 32, align: 32, offset: 2112)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1344, file: !25, line: 2004, baseType: !933, size: 32, align: 32, offset: 2144)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1344, file: !25, line: 2011, baseType: !933, size: 32, align: 32, offset: 2176)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1344, file: !25, line: 2018, baseType: !933, size: 32, align: 32, offset: 2208)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1344, file: !25, line: 2027, baseType: !933, size: 32, align: 32, offset: 2240)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1344, file: !25, line: 2034, baseType: !933, size: 32, align: 32, offset: 2272)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1344, file: !25, line: 2044, baseType: !933, size: 32, align: 32, offset: 2304)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1344, file: !25, line: 2054, baseType: !1551, size: 64, align: 64, offset: 2368)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1344, file: !25, line: 2061, baseType: !1551, size: 64, align: 64, offset: 2432)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1344, file: !25, line: 2066, baseType: !933, size: 32, align: 32, offset: 2496)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1344, file: !25, line: 2070, baseType: !933, size: 32, align: 32, offset: 2528)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1344, file: !25, line: 2078, baseType: !933, size: 32, align: 32, offset: 2560)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1344, file: !25, line: 2085, baseType: !933, size: 32, align: 32, offset: 2592)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1344, file: !25, line: 2092, baseType: !933, size: 32, align: 32, offset: 2624)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1344, file: !25, line: 2099, baseType: !933, size: 32, align: 32, offset: 2656)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1344, file: !25, line: 2106, baseType: !933, size: 32, align: 32, offset: 2688)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1344, file: !25, line: 2113, baseType: !933, size: 32, align: 32, offset: 2720)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1344, file: !25, line: 2120, baseType: !933, size: 32, align: 32, offset: 2752)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1344, file: !25, line: 2125, baseType: !933, size: 32, align: 32, offset: 2784)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1344, file: !25, line: 2133, baseType: !933, size: 32, align: 32, offset: 2816)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1344, file: !25, line: 2140, baseType: !933, size: 32, align: 32, offset: 2848)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1344, file: !25, line: 2145, baseType: !933, size: 32, align: 32, offset: 2880)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1344, file: !25, line: 2153, baseType: !933, size: 32, align: 32, offset: 2912)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1344, file: !25, line: 2158, baseType: !933, size: 32, align: 32, offset: 2944)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1344, file: !25, line: 2166, baseType: !556, size: 32, align: 32, offset: 2976)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1344, file: !25, line: 2173, baseType: !574, size: 32, align: 32, offset: 3008)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1344, file: !25, line: 2180, baseType: !598, size: 32, align: 32, offset: 3040)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1344, file: !25, line: 2187, baseType: !549, size: 32, align: 32, offset: 3072)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1344, file: !25, line: 2194, baseType: !617, size: 32, align: 32, offset: 3104)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1344, file: !25, line: 2203, baseType: !933, size: 32, align: 32, offset: 3136)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1344, file: !25, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1344, file: !25, line: 2212, baseType: !933, size: 32, align: 32, offset: 3200)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1344, file: !25, line: 2213, baseType: !933, size: 32, align: 32, offset: 3232)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1344, file: !25, line: 2220, baseType: !844, size: 32, align: 32, offset: 3264)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1344, file: !25, line: 2232, baseType: !933, size: 32, align: 32, offset: 3296)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1344, file: !25, line: 2243, baseType: !933, size: 32, align: 32, offset: 3328)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1344, file: !25, line: 2249, baseType: !933, size: 32, align: 32, offset: 3360)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1344, file: !25, line: 2256, baseType: !933, size: 32, align: 32, offset: 3392)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1344, file: !25, line: 2263, baseType: !1198, size: 64, align: 64, offset: 3456)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1344, file: !25, line: 2270, baseType: !1198, size: 64, align: 64, offset: 3520)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1344, file: !25, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1344, file: !25, line: 2285, baseType: !844, size: 32, align: 32, offset: 3616)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1344, file: !25, line: 2367, baseType: !1587, size: 64, align: 64, offset: 3648)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DISubroutineType(types: !1589)
!1589 = !{!933, !1514, !1164, !933}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1344, file: !25, line: 2383, baseType: !933, size: 32, align: 32, offset: 3712)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1344, file: !25, line: 2386, baseType: !1521, size: 32, align: 32, offset: 3744)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1344, file: !25, line: 2387, baseType: !1521, size: 32, align: 32, offset: 3776)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1344, file: !25, line: 2394, baseType: !933, size: 32, align: 32, offset: 3808)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1344, file: !25, line: 2401, baseType: !933, size: 32, align: 32, offset: 3840)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1344, file: !25, line: 2408, baseType: !933, size: 32, align: 32, offset: 3872)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1344, file: !25, line: 2415, baseType: !933, size: 32, align: 32, offset: 3904)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1344, file: !25, line: 2422, baseType: !933, size: 32, align: 32, offset: 3936)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1344, file: !25, line: 2423, baseType: !1599, size: 64, align: 64, offset: 3968)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !25, line: 831, baseType: !1601)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !25, line: 826, size: 128, align: 32, elements: !1602)
!1602 = !{!1603, !1604, !1605, !1606}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1601, file: !25, line: 827, baseType: !933, size: 32, align: 32)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1601, file: !25, line: 828, baseType: !933, size: 32, align: 32, offset: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1601, file: !25, line: 829, baseType: !933, size: 32, align: 32, offset: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1601, file: !25, line: 830, baseType: !1521, size: 32, align: 32, offset: 96)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1344, file: !25, line: 2430, baseType: !942, size: 64, align: 64, offset: 4032)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1344, file: !25, line: 2437, baseType: !942, size: 64, align: 64, offset: 4096)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1344, file: !25, line: 2444, baseType: !1521, size: 32, align: 32, offset: 4160)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1344, file: !25, line: 2451, baseType: !1521, size: 32, align: 32, offset: 4192)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1344, file: !25, line: 2458, baseType: !933, size: 32, align: 32, offset: 4224)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1344, file: !25, line: 2469, baseType: !933, size: 32, align: 32, offset: 4256)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1344, file: !25, line: 2475, baseType: !933, size: 32, align: 32, offset: 4288)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1344, file: !25, line: 2481, baseType: !933, size: 32, align: 32, offset: 4320)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1344, file: !25, line: 2485, baseType: !933, size: 32, align: 32, offset: 4352)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1344, file: !25, line: 2489, baseType: !933, size: 32, align: 32, offset: 4384)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1344, file: !25, line: 2493, baseType: !933, size: 32, align: 32, offset: 4416)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1344, file: !25, line: 2501, baseType: !933, size: 32, align: 32, offset: 4448)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1344, file: !25, line: 2506, baseType: !933, size: 32, align: 32, offset: 4480)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1344, file: !25, line: 2510, baseType: !933, size: 32, align: 32, offset: 4512)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1344, file: !25, line: 2514, baseType: !942, size: 64, align: 64, offset: 4544)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1344, file: !25, line: 2528, baseType: !1623, size: 64, align: 64, offset: 4608)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DISubroutineType(types: !1625)
!1625 = !{null, !1514, !981, !933, !933}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1344, file: !25, line: 2534, baseType: !933, size: 32, align: 32, offset: 4672)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1344, file: !25, line: 2545, baseType: !933, size: 32, align: 32, offset: 4704)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1344, file: !25, line: 2547, baseType: !933, size: 32, align: 32, offset: 4736)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1344, file: !25, line: 2549, baseType: !933, size: 32, align: 32, offset: 4768)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1344, file: !25, line: 2551, baseType: !933, size: 32, align: 32, offset: 4800)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1344, file: !25, line: 2553, baseType: !933, size: 32, align: 32, offset: 4832)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1344, file: !25, line: 2555, baseType: !933, size: 32, align: 32, offset: 4864)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1344, file: !25, line: 2557, baseType: !933, size: 32, align: 32, offset: 4896)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1344, file: !25, line: 2559, baseType: !933, size: 32, align: 32, offset: 4928)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1344, file: !25, line: 2563, baseType: !933, size: 32, align: 32, offset: 4960)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1344, file: !25, line: 2571, baseType: !1447, size: 64, align: 64, offset: 4992)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1344, file: !25, line: 2579, baseType: !1447, size: 64, align: 64, offset: 5056)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1344, file: !25, line: 2586, baseType: !933, size: 32, align: 32, offset: 5120)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1344, file: !25, line: 2615, baseType: !933, size: 32, align: 32, offset: 5152)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1344, file: !25, line: 2627, baseType: !933, size: 32, align: 32, offset: 5184)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1344, file: !25, line: 2637, baseType: !933, size: 32, align: 32, offset: 5216)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1344, file: !25, line: 2681, baseType: !933, size: 32, align: 32, offset: 5248)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1344, file: !25, line: 2709, baseType: !942, size: 64, align: 64, offset: 5312)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1344, file: !25, line: 2716, baseType: !1645, size: 64, align: 64, offset: 5376)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1647)
!1647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !25, line: 3636, size: 896, align: 64, elements: !1648)
!1648 = !{!1649, !1650, !1651, !1652, !1653, !1654, !1655, !1659, !1663, !1664, !1665, !1666, !1672, !1673, !1674, !1675, !1676}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1647, file: !25, line: 3642, baseType: !974, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1647, file: !25, line: 3649, baseType: !636, size: 32, align: 32, offset: 64)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1647, file: !25, line: 3656, baseType: !24, size: 32, align: 32, offset: 96)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1647, file: !25, line: 3663, baseType: !645, size: 32, align: 32, offset: 128)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1647, file: !25, line: 3669, baseType: !933, size: 32, align: 32, offset: 160)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1647, file: !25, line: 3682, baseType: !1472, size: 64, align: 64, offset: 192)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1647, file: !25, line: 3698, baseType: !1656, size: 64, align: 64, offset: 256)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{!933, !1342, !928, !941}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1647, file: !25, line: 3712, baseType: !1660, size: 64, align: 64, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1661, size: 64, align: 64)
!1661 = !DISubroutineType(types: !1662)
!1662 = !{!933, !1342, !933, !928, !941}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1647, file: !25, line: 3726, baseType: !1656, size: 64, align: 64, offset: 384)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1647, file: !25, line: 3737, baseType: !1389, size: 64, align: 64, offset: 448)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1647, file: !25, line: 3746, baseType: !933, size: 32, align: 32, offset: 512)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1647, file: !25, line: 3757, baseType: !1667, size: 64, align: 64, offset: 576)
!1667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1668, size: 64, align: 64)
!1668 = !DISubroutineType(types: !1669)
!1669 = !{null, !1670}
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !25, line: 3617, flags: DIFlagFwdDecl)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1647, file: !25, line: 3766, baseType: !1389, size: 64, align: 64, offset: 640)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1647, file: !25, line: 3774, baseType: !1389, size: 64, align: 64, offset: 704)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1647, file: !25, line: 3780, baseType: !933, size: 32, align: 32, offset: 768)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1647, file: !25, line: 3785, baseType: !933, size: 32, align: 32, offset: 800)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1647, file: !25, line: 3795, baseType: !1677, size: 64, align: 64, offset: 832)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!933, !1342, !1062}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1344, file: !25, line: 2728, baseType: !981, size: 64, align: 64, offset: 5440)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1344, file: !25, line: 2735, baseType: !1197, size: 512, align: 64, offset: 5504)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1344, file: !25, line: 2742, baseType: !933, size: 32, align: 32, offset: 6016)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1344, file: !25, line: 2755, baseType: !933, size: 32, align: 32, offset: 6048)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1344, file: !25, line: 2776, baseType: !933, size: 32, align: 32, offset: 6080)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1344, file: !25, line: 2783, baseType: !933, size: 32, align: 32, offset: 6112)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1344, file: !25, line: 2791, baseType: !933, size: 32, align: 32, offset: 6144)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1344, file: !25, line: 2802, baseType: !1164, size: 64, align: 64, offset: 6208)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1344, file: !25, line: 2811, baseType: !933, size: 32, align: 32, offset: 6272)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1344, file: !25, line: 2821, baseType: !933, size: 32, align: 32, offset: 6304)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1344, file: !25, line: 2830, baseType: !933, size: 32, align: 32, offset: 6336)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1344, file: !25, line: 2840, baseType: !933, size: 32, align: 32, offset: 6368)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1344, file: !25, line: 2851, baseType: !1693, size: 64, align: 64, offset: 6400)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DISubroutineType(types: !1695)
!1695 = !{!933, !1514, !1696, !981, !1457, !933, !933}
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!933, !1514, !981}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1344, file: !25, line: 2871, baseType: !1700, size: 64, align: 64, offset: 6464)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!933, !1514, !1703, !981, !1457, !933}
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64, align: 64)
!1704 = !DISubroutineType(types: !1705)
!1705 = !{!933, !1514, !981, !933, !933}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1344, file: !25, line: 2878, baseType: !933, size: 32, align: 32, offset: 6528)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1344, file: !25, line: 2885, baseType: !933, size: 32, align: 32, offset: 6560)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1344, file: !25, line: 3005, baseType: !933, size: 32, align: 32, offset: 6592)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1344, file: !25, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1344, file: !25, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1344, file: !25, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1344, file: !25, line: 3037, baseType: !1072, size: 64, align: 64, offset: 6720)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1344, file: !25, line: 3038, baseType: !933, size: 32, align: 32, offset: 6784)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1344, file: !25, line: 3050, baseType: !1198, size: 64, align: 64, offset: 6848)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1344, file: !25, line: 3065, baseType: !933, size: 32, align: 32, offset: 6912)
