; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--threadmessage.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--threadmessage.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVThreadMessageQueue = type { %struct.AVFifoBuffer*, %union.pthread_mutex_t, %union.pthread_cond_t, %union.pthread_cond_t, i32, i32, i32, void (i8*)* }
%struct.AVFifoBuffer = type { i8*, i8*, i8*, i8*, i32, i32 }
%union.pthread_mutex_t = type { %struct.__pthread_mutex_s }
%struct.__pthread_mutex_s = type { i32, i32, i32, i32, i32, i16, i16, %struct.__pthread_internal_list }
%struct.__pthread_internal_list = type { %struct.__pthread_internal_list*, %struct.__pthread_internal_list* }
%union.pthread_cond_t = type { %struct.anon }
%struct.anon = type { i32, i32, i64, i64, i64, i8*, i32, i32 }
%union.pthread_mutexattr_t = type { i32 }
%union.pthread_condattr_t = type { i32 }

; Function Attrs: nounwind uwtable
define i32 @av_thread_message_queue_alloc(%struct.AVThreadMessageQueue** %mq, i32 %nelem, i32 %elsize) #0 !dbg !10 {
entry:
  %retval = alloca i32, align 4
  %mq.addr = alloca %struct.AVThreadMessageQueue**, align 8
  %nelem.addr = alloca i32, align 4
  %elsize.addr = alloca i32, align 4
  %rmq = alloca %struct.AVThreadMessageQueue*, align 8
  %ret = alloca i32, align 4
  store %struct.AVThreadMessageQueue** %mq, %struct.AVThreadMessageQueue*** %mq.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--threadmessage.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVThreadMessageFlags", file: !4, line: 24, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavutil/threadmessage.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6}
!6 = !DIEnumerator(name: "AV_THREAD_MESSAGE_NONBLOCK", value: 1)
!7 = !{i32 2, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!10 = distinct !DISubprogram(name: "av_thread_message_queue_alloc", scope: !11, file: !11, line: 40, type: !12, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !99)
!11 = !DIFile(filename: "libavutil/threadmessage.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!12 = !DISubroutineType(types: !13)
!13 = !{!14, !15, !36, !36}
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64, align: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64, align: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVThreadMessageQueue", file: !4, line: 22, baseType: !18)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVThreadMessageQueue", file: !11, line: 25, size: 1344, align: 64, elements: !19)
!19 = !{!20, !38, !68, !91, !92, !93, !94, !95}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !18, file: !11, line: 27, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64, align: 64)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFifoBuffer", file: !23, line: 35, baseType: !24)
!23 = !DIFile(filename: "libavutil/fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFifoBuffer", file: !23, line: 31, size: 320, align: 64, elements: !25)
!25 = !{!26, !31, !32, !33, !34, !37}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !24, file: !23, line: 32, baseType: !27, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64, align: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !29, line: 48, baseType: !30)
!29 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!30 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "rptr", scope: !24, file: !23, line: 33, baseType: !27, size: 64, align: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "wptr", scope: !24, file: !23, line: 33, baseType: !27, size: 64, align: 64, offset: 128)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !24, file: !23, line: 33, baseType: !27, size: 64, align: 64, offset: 192)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "rndx", scope: !24, file: !23, line: 34, baseType: !35, size: 32, align: 32, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !29, line: 51, baseType: !36)
!36 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "wndx", scope: !24, file: !23, line: 34, baseType: !35, size: 32, align: 32, offset: 288)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !18, file: !11, line: 28, baseType: !39, size: 320, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !40, line: 128, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!41 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !40, line: 90, size: 320, align: 64, elements: !42)
!42 = !{!43, !61, !66}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !41, file: !40, line: 125, baseType: !44, size: 320, align: 64)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_mutex_s", file: !40, line: 92, size: 320, align: 64, elements: !45)
!45 = !{!46, !47, !48, !49, !50, !51, !53, !54}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !44, file: !40, line: 94, baseType: !14, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !44, file: !40, line: 95, baseType: !36, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__owner", scope: !44, file: !40, line: 96, baseType: !14, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__nusers", scope: !44, file: !40, line: 98, baseType: !36, size: 32, align: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "__kind", scope: !44, file: !40, line: 102, baseType: !14, size: 32, align: 32, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "__spins", scope: !44, file: !40, line: 104, baseType: !52, size: 16, align: 16, offset: 160)
!52 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "__elision", scope: !44, file: !40, line: 105, baseType: !52, size: 16, align: 16, offset: 176)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "__list", scope: !44, file: !40, line: 106, baseType: !55, size: 128, align: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_list_t", file: !40, line: 79, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_internal_list", file: !40, line: 75, size: 128, align: 64, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__prev", scope: !56, file: !40, line: 77, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__next", scope: !56, file: !40, line: 78, baseType: !59, size: 64, align: 64, offset: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !41, file: !40, line: 126, baseType: !62, size: 320, align: 8)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 320, align: 8, elements: !64)
!63 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!64 = !{!65}
!65 = !DISubrange(count: 40)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !41, file: !40, line: 127, baseType: !67, size: 64, align: 64)
!67 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "cond_recv", scope: !18, file: !11, line: 29, baseType: !69, size: 384, align: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !40, line: 154, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !40, line: 139, size: 384, align: 64, elements: !71)
!71 = !{!72, !85, !89}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !70, file: !40, line: 151, baseType: !73, size: 384, align: 64)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !70, file: !40, line: 141, size: 384, align: 64, elements: !74)
!74 = !{!75, !76, !77, !79, !80, !81, !83, !84}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__lock", scope: !73, file: !40, line: 143, baseType: !14, size: 32, align: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__futex", scope: !73, file: !40, line: 144, baseType: !36, size: 32, align: 32, offset: 32)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__total_seq", scope: !73, file: !40, line: 145, baseType: !78, size: 64, align: 64, offset: 64)
!78 = !DIBasicType(name: "long long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "__wakeup_seq", scope: !73, file: !40, line: 146, baseType: !78, size: 64, align: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__woken_seq", scope: !73, file: !40, line: 147, baseType: !78, size: 64, align: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__mutex", scope: !73, file: !40, line: 148, baseType: !82, size: 64, align: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__nwaiters", scope: !73, file: !40, line: 149, baseType: !36, size: 32, align: 32, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "__broadcast_seq", scope: !73, file: !40, line: 150, baseType: !36, size: 32, align: 32, offset: 352)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !70, file: !40, line: 152, baseType: !86, size: 384, align: 8)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 384, align: 8, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 48)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !70, file: !40, line: 153, baseType: !90, size: 64, align: 64)
!90 = !DIBasicType(name: "long long int", size: 64, align: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "cond_send", scope: !18, file: !11, line: 30, baseType: !69, size: 384, align: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "err_send", scope: !18, file: !11, line: 31, baseType: !14, size: 32, align: 32, offset: 1152)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "err_recv", scope: !18, file: !11, line: 32, baseType: !14, size: 32, align: 32, offset: 1184)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "elsize", scope: !18, file: !11, line: 33, baseType: !36, size: 32, align: 32, offset: 1216)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "free_func", scope: !18, file: !11, line: 34, baseType: !96, size: 64, align: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64, align: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !82}
!99 = !{}
!100 = !DILocalVariable(name: "mq", arg: 1, scope: !10, file: !11, line: 40, type: !15)
!101 = !DIExpression()
!102 = !DILocation(line: 40, column: 58, scope: !10)
!103 = !DILocalVariable(name: "nelem", arg: 2, scope: !10, file: !11, line: 41, type: !36)
!104 = !DILocation(line: 41, column: 44, scope: !10)
!105 = !DILocalVariable(name: "elsize", arg: 3, scope: !10, file: !11, line: 42, type: !36)
!106 = !DILocation(line: 42, column: 44, scope: !10)
!107 = !DILocalVariable(name: "rmq", scope: !10, file: !11, line: 45, type: !16)
!108 = !DILocation(line: 45, column: 27, scope: !10)
!109 = !DILocalVariable(name: "ret", scope: !10, file: !11, line: 46, type: !14)
!110 = !DILocation(line: 46, column: 9, scope: !10)
!111 = !DILocation(line: 48, column: 9, scope: !112)
!112 = distinct !DILexicalBlock(scope: !10, file: !11, line: 48, column: 9)
!113 = !DILocation(line: 48, column: 30, scope: !112)
!114 = !DILocation(line: 48, column: 28, scope: !112)
!115 = !DILocation(line: 48, column: 15, scope: !112)
!116 = !DILocation(line: 48, column: 9, scope: !10)
!117 = !DILocation(line: 49, column: 9, scope: !112)
!118 = !DILocation(line: 50, column: 17, scope: !119)
!119 = distinct !DILexicalBlock(scope: !10, file: !11, line: 50, column: 9)
!120 = !DILocation(line: 50, column: 15, scope: !119)
!121 = !DILocation(line: 50, column: 9, scope: !10)
!122 = !DILocation(line: 51, column: 9, scope: !119)
!123 = !DILocation(line: 52, column: 36, scope: !124)
!124 = distinct !DILexicalBlock(scope: !10, file: !11, line: 52, column: 9)
!125 = !DILocation(line: 52, column: 41, scope: !124)
!126 = !DILocation(line: 52, column: 16, scope: !124)
!127 = !DILocation(line: 52, column: 14, scope: !124)
!128 = !DILocation(line: 52, column: 9, scope: !10)
!129 = !DILocation(line: 53, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !124, file: !11, line: 52, column: 54)
!131 = !DILocation(line: 53, column: 9, scope: !130)
!132 = !DILocation(line: 54, column: 19, scope: !130)
!133 = !DILocation(line: 54, column: 17, scope: !130)
!134 = !DILocation(line: 54, column: 9, scope: !130)
!135 = !DILocation(line: 56, column: 35, scope: !136)
!136 = distinct !DILexicalBlock(scope: !10, file: !11, line: 56, column: 9)
!137 = !DILocation(line: 56, column: 40, scope: !136)
!138 = !DILocation(line: 56, column: 16, scope: !136)
!139 = !DILocation(line: 56, column: 14, scope: !136)
!140 = !DILocation(line: 56, column: 9, scope: !10)
!141 = !DILocation(line: 57, column: 32, scope: !142)
!142 = distinct !DILexicalBlock(scope: !136, file: !11, line: 56, column: 58)
!143 = !DILocation(line: 57, column: 37, scope: !142)
!144 = !DILocation(line: 57, column: 9, scope: !142)
!145 = !DILocation(line: 58, column: 17, scope: !142)
!146 = !DILocation(line: 58, column: 9, scope: !142)
!147 = !DILocation(line: 59, column: 19, scope: !142)
!148 = !DILocation(line: 59, column: 17, scope: !142)
!149 = !DILocation(line: 59, column: 9, scope: !142)
!150 = !DILocation(line: 61, column: 35, scope: !151)
!151 = distinct !DILexicalBlock(scope: !10, file: !11, line: 61, column: 9)
!152 = !DILocation(line: 61, column: 40, scope: !151)
!153 = !DILocation(line: 61, column: 16, scope: !151)
!154 = !DILocation(line: 61, column: 14, scope: !151)
!155 = !DILocation(line: 61, column: 9, scope: !10)
!156 = !DILocation(line: 62, column: 31, scope: !157)
!157 = distinct !DILexicalBlock(scope: !151, file: !11, line: 61, column: 58)
!158 = !DILocation(line: 62, column: 36, scope: !157)
!159 = !DILocation(line: 62, column: 9, scope: !157)
!160 = !DILocation(line: 63, column: 32, scope: !157)
!161 = !DILocation(line: 63, column: 37, scope: !157)
!162 = !DILocation(line: 63, column: 9, scope: !157)
