; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dvenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dvenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!882 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902}
!896 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!897 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!898 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!899 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!900 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!901 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!902 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dv_section_type", file: !910, line: 59, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/dv.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIEnumerator(name: "dv_sect_header", value: 31)
!913 = !DIEnumerator(name: "dv_sect_subcode", value: 63)
!914 = !DIEnumerator(name: "dv_sect_vaux", value: 86)
!915 = !DIEnumerator(name: "dv_sect_audio", value: 118)
!916 = !DIEnumerator(name: "dv_sect_video", value: 150)
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dv_pack_type", file: !910, line: 67, size: 32, align: 32, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!919 = !DIEnumerator(name: "dv_header525", value: 63)
!920 = !DIEnumerator(name: "dv_header625", value: 191)
!921 = !DIEnumerator(name: "dv_timecode", value: 19)
!922 = !DIEnumerator(name: "dv_audio_source", value: 80)
!923 = !DIEnumerator(name: "dv_audio_control", value: 81)
!924 = !DIEnumerator(name: "dv_audio_recdate", value: 82)
!925 = !DIEnumerator(name: "dv_audio_rectime", value: 83)
!926 = !DIEnumerator(name: "dv_video_source", value: 96)
!927 = !DIEnumerator(name: "dv_video_control", value: 97)
!928 = !DIEnumerator(name: "dv_video_recdate", value: 98)
!929 = !DIEnumerator(name: "dv_video_rectime", value: 99)
!930 = !DIEnumerator(name: "dv_unknown_pack", value: 255)
!931 = !{!932, !933, !934, !937, !943, !944, !946}
!932 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!933 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !935, line: 49, baseType: !936)
!935 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!936 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !939, line: 221, size: 32, align: 8, elements: !940)
!939 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !938, file: !939, line: 221, baseType: !942, size: 32, align: 32)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !935, line: 51, baseType: !933)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !935, line: 48, baseType: !945)
!945 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!946 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!947 = !{!948, !1705, !1706, !1712, !1722, !1723, !1833, !1834, !1836, !1837}
!948 = distinct !DIGlobalVariable(name: "ff_dvvideo_encoder", scope: !0, file: !949, line: 770, type: !950, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_dvvideo_encoder)
!949 = !DIFile(filename: "libavcodec/dvenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !952)
!952 = !{!953, !957, !958, !959, !960, !961, !970, !973, !976, !979, !984, !985, !1059, !1067, !1068, !1069, !1071, !1620, !1626, !1634, !1638, !1639, !1676, !1680, !1684, !1685, !1689, !1693, !1694, !1698, !1699, !1700}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !951, file: !14, line: 3475, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !951, file: !14, line: 3480, baseType: !954, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !951, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !951, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !951, file: !14, line: 3487, baseType: !932, size: 32, align: 32, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !951, file: !14, line: 3488, baseType: !962, size: 64, align: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !965, line: 61, baseType: !966)
!965 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !965, line: 58, size: 64, align: 32, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !966, file: !965, line: 59, baseType: !932, size: 32, align: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !966, file: !965, line: 60, baseType: !932, size: 32, align: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !951, file: !14, line: 3489, baseType: !971, size: 64, align: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !951, file: !14, line: 3490, baseType: !974, size: 64, align: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !951, file: !14, line: 3491, baseType: !977, size: 64, align: 64, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !951, file: !14, line: 3492, baseType: !980, size: 64, align: 64, offset: 512)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !935, line: 55, baseType: !983)
!983 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !951, file: !14, line: 3493, baseType: !944, size: 8, align: 8, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !951, file: !14, line: 3494, baseType: !986, size: 64, align: 64, offset: 640)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !990)
!990 = !{!991, !992, !996, !1018, !1019, !1020, !1021, !1025, !1031, !1033, !1037}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !989, file: !713, line: 72, baseType: !954, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !989, file: !713, line: 78, baseType: !993, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!954, !943}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !989, file: !713, line: 85, baseType: !997, size: 64, align: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1014, !1015, !1016, !1017}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !999, file: !691, line: 247, baseType: !954, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !999, file: !691, line: 253, baseType: !954, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !999, file: !691, line: 259, baseType: !932, size: 32, align: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !999, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !999, file: !691, line: 271, baseType: !1006, size: 64, align: 64, offset: 192)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !999, file: !691, line: 265, size: 64, align: 64, elements: !1007)
!1007 = !{!1008, !1011, !1012, !1013}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1006, file: !691, line: 266, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !935, line: 40, baseType: !1010)
!1010 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1006, file: !691, line: 267, baseType: !946, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1006, file: !691, line: 268, baseType: !954, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1006, file: !691, line: 270, baseType: !964, size: 64, align: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !999, file: !691, line: 272, baseType: !946, size: 64, align: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !999, file: !691, line: 273, baseType: !946, size: 64, align: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !999, file: !691, line: 275, baseType: !932, size: 32, align: 32, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !999, file: !691, line: 300, baseType: !954, size: 64, align: 64, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !989, file: !713, line: 93, baseType: !932, size: 32, align: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !989, file: !713, line: 99, baseType: !932, size: 32, align: 32, offset: 224)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !989, file: !713, line: 108, baseType: !932, size: 32, align: 32, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !989, file: !713, line: 113, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!943, !943, !943}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !989, file: !713, line: 123, baseType: !1026, size: 64, align: 64, offset: 384)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!1029, !1029}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !989, file: !713, line: 130, baseType: !1032, size: 32, align: 32, offset: 448)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !989, file: !713, line: 136, baseType: !1034, size: 64, align: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!1032, !943}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !989, file: !713, line: 142, baseType: !1038, size: 64, align: 64, offset: 576)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!932, !1041, !943, !954, !932}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1044)
!1044 = !{!1045, !1057, !1058}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1043, file: !691, line: 360, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1049, file: !691, line: 307, baseType: !954, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1049, file: !691, line: 313, baseType: !946, size: 64, align: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1049, file: !691, line: 313, baseType: !946, size: 64, align: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1049, file: !691, line: 318, baseType: !946, size: 64, align: 64, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1049, file: !691, line: 318, baseType: !946, size: 64, align: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1049, file: !691, line: 323, baseType: !932, size: 32, align: 32, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1043, file: !691, line: 364, baseType: !932, size: 32, align: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1043, file: !691, line: 368, baseType: !932, size: 32, align: 32, offset: 96)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !951, file: !14, line: 3495, baseType: !1060, size: 64, align: 64, offset: 704)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1062)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1064)
!1064 = !{!1065, !1066}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1063, file: !14, line: 3402, baseType: !932, size: 32, align: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1063, file: !14, line: 3403, baseType: !954, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !951, file: !14, line: 3507, baseType: !954, size: 64, align: 64, offset: 768)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !951, file: !14, line: 3516, baseType: !932, size: 32, align: 32, offset: 832)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !951, file: !14, line: 3517, baseType: !1070, size: 64, align: 64, offset: 896)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !951, file: !14, line: 3527, baseType: !1072, size: 64, align: 64, offset: 960)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DISubroutineType(types: !1074)
!1074 = !{!932, !1075}
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1081, !1082, !1085, !1086, !1087, !1088, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1368, !1372, !1373, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1558, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1077, file: !14, line: 1561, baseType: !986, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1077, file: !14, line: 1562, baseType: !932, size: 32, align: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1077, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1077, file: !14, line: 1565, baseType: !1083, size: 64, align: 64, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1077, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1077, file: !14, line: 1581, baseType: !933, size: 32, align: 32, offset: 224)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1077, file: !14, line: 1583, baseType: !943, size: 64, align: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1077, file: !14, line: 1591, baseType: !1089, size: 64, align: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1091, line: 129, size: 1664, align: 64, elements: !1092)
!1091 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1092 = !{!1093, !1094, !1095, !1096, !1194, !1215, !1216, !1245, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1090, file: !1091, line: 136, baseType: !932, size: 32, align: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1090, file: !1091, line: 151, baseType: !932, size: 32, align: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1090, file: !1091, line: 157, baseType: !932, size: 32, align: 32, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1090, file: !1091, line: 159, baseType: !1097, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1100)
!1100 = !{!1101, !1106, !1108, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1146, !1148, !1149, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1182, !1183, !1184, !1185, !1186, !1187, !1190, !1191, !1192, !1193}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !744, line: 282, baseType: !1102, size: 512, align: 64)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 512, align: 64, elements: !1104)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1104 = !{!1105}
!1105 = !DISubrange(count: 8)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1099, file: !744, line: 299, baseType: !1107, size: 256, align: 32, offset: 512)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 256, align: 32, elements: !1104)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1099, file: !744, line: 315, baseType: !1109, size: 64, align: 64, offset: 768)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1099, file: !744, line: 326, baseType: !932, size: 32, align: 32, offset: 832)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1099, file: !744, line: 326, baseType: !932, size: 32, align: 32, offset: 864)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1099, file: !744, line: 334, baseType: !932, size: 32, align: 32, offset: 896)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1099, file: !744, line: 341, baseType: !932, size: 32, align: 32, offset: 928)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1099, file: !744, line: 346, baseType: !932, size: 32, align: 32, offset: 960)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1099, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1099, file: !744, line: 356, baseType: !964, size: 64, align: 32, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1099, file: !744, line: 361, baseType: !1009, size: 64, align: 64, offset: 1088)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1099, file: !744, line: 369, baseType: !1009, size: 64, align: 64, offset: 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1099, file: !744, line: 377, baseType: !1009, size: 64, align: 64, offset: 1216)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1099, file: !744, line: 382, baseType: !932, size: 32, align: 32, offset: 1280)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1099, file: !744, line: 386, baseType: !932, size: 32, align: 32, offset: 1312)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1099, file: !744, line: 391, baseType: !932, size: 32, align: 32, offset: 1344)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1099, file: !744, line: 396, baseType: !943, size: 64, align: 64, offset: 1408)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1099, file: !744, line: 403, baseType: !1125, size: 512, align: 64, offset: 1472)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 512, align: 64, elements: !1104)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1099, file: !744, line: 410, baseType: !932, size: 32, align: 32, offset: 1984)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1099, file: !744, line: 415, baseType: !932, size: 32, align: 32, offset: 2016)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1099, file: !744, line: 420, baseType: !932, size: 32, align: 32, offset: 2048)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1099, file: !744, line: 425, baseType: !932, size: 32, align: 32, offset: 2080)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1099, file: !744, line: 435, baseType: !1009, size: 64, align: 64, offset: 2112)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1099, file: !744, line: 440, baseType: !932, size: 32, align: 32, offset: 2176)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1099, file: !744, line: 445, baseType: !982, size: 64, align: 64, offset: 2240)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1099, file: !744, line: 459, baseType: !1134, size: 512, align: 64, offset: 2304)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 512, align: 64, elements: !1104)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1137, line: 94, baseType: !1138)
!1137 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1137, line: 81, size: 192, align: 64, elements: !1139)
!1139 = !{!1140, !1144, !1145}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1138, file: !1137, line: 82, baseType: !1141, size: 64, align: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1137, line: 73, baseType: !1143)
!1143 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1137, line: 73, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1138, file: !1137, line: 89, baseType: !1103, size: 64, align: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !1137, line: 93, baseType: !932, size: 32, align: 32, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1099, file: !744, line: 473, baseType: !1147, size: 64, align: 64, offset: 2816)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1099, file: !744, line: 477, baseType: !932, size: 32, align: 32, offset: 2880)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1099, file: !744, line: 479, baseType: !1150, size: 64, align: 64, offset: 2944)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1163}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1153, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1153, file: !744, line: 203, baseType: !1103, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !744, line: 204, baseType: !932, size: 32, align: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1153, file: !744, line: 205, baseType: !1159, size: 64, align: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1161, line: 86, baseType: !1162)
!1161 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1162 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1161, line: 86, flags: DIFlagFwdDecl)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !744, line: 206, baseType: !1135, size: 64, align: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1099, file: !744, line: 480, baseType: !932, size: 32, align: 32, offset: 3008)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !744, line: 505, baseType: !932, size: 32, align: 32, offset: 3040)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1099, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1099, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1099, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1099, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1099, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1099, file: !744, line: 532, baseType: !1009, size: 64, align: 64, offset: 3264)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1099, file: !744, line: 539, baseType: !1009, size: 64, align: 64, offset: 3328)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1099, file: !744, line: 547, baseType: !1009, size: 64, align: 64, offset: 3392)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1099, file: !744, line: 554, baseType: !1159, size: 64, align: 64, offset: 3456)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1099, file: !744, line: 563, baseType: !932, size: 32, align: 32, offset: 3520)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1099, file: !744, line: 572, baseType: !932, size: 32, align: 32, offset: 3552)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1099, file: !744, line: 581, baseType: !932, size: 32, align: 32, offset: 3584)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1099, file: !744, line: 588, baseType: !1179, size: 64, align: 64, offset: 3648)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !935, line: 36, baseType: !1181)
!1181 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1099, file: !744, line: 593, baseType: !932, size: 32, align: 32, offset: 3712)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1099, file: !744, line: 596, baseType: !932, size: 32, align: 32, offset: 3744)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1099, file: !744, line: 599, baseType: !1135, size: 64, align: 64, offset: 3776)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1099, file: !744, line: 605, baseType: !1135, size: 64, align: 64, offset: 3840)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1099, file: !744, line: 616, baseType: !1135, size: 64, align: 64, offset: 3904)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1099, file: !744, line: 626, baseType: !1188, size: 64, align: 64, offset: 3968)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1189, line: 216, baseType: !983)
!1189 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1099, file: !744, line: 627, baseType: !1188, size: 64, align: 64, offset: 4032)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1099, file: !744, line: 628, baseType: !1188, size: 64, align: 64, offset: 4096)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1099, file: !744, line: 629, baseType: !1188, size: 64, align: 64, offset: 4160)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1099, file: !744, line: 645, baseType: !1135, size: 64, align: 64, offset: 4224)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1090, file: !1091, line: 161, baseType: !1195, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1091, line: 117, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1091, line: 100, size: 832, align: 64, elements: !1198)
!1198 = !{!1199, !1206, !1207, !1208, !1209, !1210, !1212, !1213, !1214}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1197, file: !1091, line: 105, baseType: !1200, size: 256, align: 64)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1201, size: 256, align: 64, elements: !1204)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1137, line: 238, baseType: !1203)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1137, line: 238, flags: DIFlagFwdDecl)
!1204 = !{!1205}
!1205 = !DISubrange(count: 4)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1197, file: !1091, line: 110, baseType: !932, size: 32, align: 32, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1197, file: !1091, line: 111, baseType: !932, size: 32, align: 32, offset: 288)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1197, file: !1091, line: 111, baseType: !932, size: 32, align: 32, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1197, file: !1091, line: 112, baseType: !1107, size: 256, align: 32, offset: 352)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1197, file: !1091, line: 113, baseType: !1211, size: 128, align: 32, offset: 608)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 128, align: 32, elements: !1204)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1197, file: !1091, line: 114, baseType: !932, size: 32, align: 32, offset: 736)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1197, file: !1091, line: 115, baseType: !932, size: 32, align: 32, offset: 768)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1197, file: !1091, line: 116, baseType: !932, size: 32, align: 32, offset: 800)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1090, file: !1091, line: 163, baseType: !943, size: 64, align: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1090, file: !1091, line: 165, baseType: !1217, size: 128, align: 64, offset: 320)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1091, line: 122, baseType: !1218)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1091, line: 119, size: 128, align: 64, elements: !1219)
!1219 = !{!1220, !1244}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1218, file: !1091, line: 120, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1223)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1240, !1241, !1242, !1243}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1223, file: !14, line: 1451, baseType: !1135, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1223, file: !14, line: 1461, baseType: !1009, size: 64, align: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1223, file: !14, line: 1467, baseType: !1009, size: 64, align: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1223, file: !14, line: 1468, baseType: !1103, size: 64, align: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !14, line: 1469, baseType: !932, size: 32, align: 32, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1223, file: !14, line: 1470, baseType: !932, size: 32, align: 32, offset: 288)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1223, file: !14, line: 1474, baseType: !932, size: 32, align: 32, offset: 320)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1223, file: !14, line: 1479, baseType: !1233, size: 64, align: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1236)
!1236 = !{!1237, !1238, !1239}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1235, file: !14, line: 1412, baseType: !1103, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1235, file: !14, line: 1413, baseType: !932, size: 32, align: 32, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1235, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1223, file: !14, line: 1480, baseType: !932, size: 32, align: 32, offset: 448)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1223, file: !14, line: 1486, baseType: !1009, size: 64, align: 64, offset: 512)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1223, file: !14, line: 1488, baseType: !1009, size: 64, align: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1223, file: !14, line: 1497, baseType: !1009, size: 64, align: 64, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1218, file: !1091, line: 121, baseType: !1097, size: 64, align: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1090, file: !1091, line: 166, baseType: !1246, size: 128, align: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1091, line: 127, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1091, line: 124, size: 128, align: 64, elements: !1248)
!1248 = !{!1249, !1322}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1247, file: !1091, line: 125, baseType: !1250, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1254)
!1254 = !{!1255, !1256, !1280, !1284, !1285, !1319, !1320, !1321}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1253, file: !14, line: 5751, baseType: !986, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1253, file: !14, line: 5756, baseType: !1257, size: 64, align: 64, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1265, !1266, !1267, !1271, !1275, !1279}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1259, file: !14, line: 5797, baseType: !954, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1259, file: !14, line: 5804, baseType: !1263, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1259, file: !14, line: 5815, baseType: !986, size: 64, align: 64, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1259, file: !14, line: 5825, baseType: !932, size: 32, align: 32, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1259, file: !14, line: 5826, baseType: !1268, size: 64, align: 64, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!932, !1251}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1259, file: !14, line: 5827, baseType: !1272, size: 64, align: 64, offset: 320)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!932, !1251, !1221}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1259, file: !14, line: 5828, baseType: !1276, size: 64, align: 64, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DISubroutineType(types: !1278)
!1278 = !{null, !1251}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1259, file: !14, line: 5829, baseType: !1276, size: 64, align: 64, offset: 448)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1253, file: !14, line: 5762, baseType: !1281, size: 64, align: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1283)
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1253, file: !14, line: 5768, baseType: !943, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1253, file: !14, line: 5775, baseType: !1286, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1288, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1288, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1288, file: !14, line: 3948, baseType: !942, size: 32, align: 32, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1288, file: !14, line: 3958, baseType: !1103, size: 64, align: 64, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1288, file: !14, line: 3962, baseType: !932, size: 32, align: 32, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1288, file: !14, line: 3968, baseType: !932, size: 32, align: 32, offset: 224)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1288, file: !14, line: 3973, baseType: !1009, size: 64, align: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1288, file: !14, line: 3986, baseType: !932, size: 32, align: 32, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1288, file: !14, line: 3999, baseType: !932, size: 32, align: 32, offset: 352)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1288, file: !14, line: 4004, baseType: !932, size: 32, align: 32, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1288, file: !14, line: 4005, baseType: !932, size: 32, align: 32, offset: 416)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1288, file: !14, line: 4010, baseType: !932, size: 32, align: 32, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1288, file: !14, line: 4011, baseType: !932, size: 32, align: 32, offset: 480)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1288, file: !14, line: 4020, baseType: !964, size: 64, align: 32, offset: 512)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1288, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1288, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1288, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1288, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1288, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1288, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1288, file: !14, line: 4039, baseType: !932, size: 32, align: 32, offset: 768)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1288, file: !14, line: 4046, baseType: !982, size: 64, align: 64, offset: 832)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1288, file: !14, line: 4050, baseType: !932, size: 32, align: 32, offset: 896)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1288, file: !14, line: 4054, baseType: !932, size: 32, align: 32, offset: 928)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1288, file: !14, line: 4061, baseType: !932, size: 32, align: 32, offset: 960)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1288, file: !14, line: 4065, baseType: !932, size: 32, align: 32, offset: 992)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1288, file: !14, line: 4073, baseType: !932, size: 32, align: 32, offset: 1024)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1288, file: !14, line: 4080, baseType: !932, size: 32, align: 32, offset: 1056)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1288, file: !14, line: 4084, baseType: !932, size: 32, align: 32, offset: 1088)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1253, file: !14, line: 5781, baseType: !1286, size: 64, align: 64, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1253, file: !14, line: 5787, baseType: !964, size: 64, align: 32, offset: 384)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1253, file: !14, line: 5793, baseType: !964, size: 64, align: 32, offset: 448)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1247, file: !1091, line: 126, baseType: !932, size: 32, align: 32, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1090, file: !1091, line: 172, baseType: !1221, size: 64, align: 64, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1090, file: !1091, line: 177, baseType: !1103, size: 64, align: 64, offset: 640)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1090, file: !1091, line: 178, baseType: !933, size: 32, align: 32, offset: 704)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1090, file: !1091, line: 180, baseType: !943, size: 64, align: 64, offset: 768)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1090, file: !1091, line: 185, baseType: !932, size: 32, align: 32, offset: 832)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1090, file: !1091, line: 190, baseType: !943, size: 64, align: 64, offset: 896)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1090, file: !1091, line: 195, baseType: !932, size: 32, align: 32, offset: 960)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1090, file: !1091, line: 200, baseType: !1221, size: 64, align: 64, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1090, file: !1091, line: 201, baseType: !932, size: 32, align: 32, offset: 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1090, file: !1091, line: 202, baseType: !1097, size: 64, align: 64, offset: 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1090, file: !1091, line: 203, baseType: !932, size: 32, align: 32, offset: 1216)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1090, file: !1091, line: 205, baseType: !932, size: 32, align: 32, offset: 1248)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1090, file: !1091, line: 206, baseType: !932, size: 32, align: 32, offset: 1280)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1090, file: !1091, line: 209, baseType: !1188, size: 64, align: 64, offset: 1344)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1090, file: !1091, line: 212, baseType: !1188, size: 64, align: 64, offset: 1408)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1090, file: !1091, line: 213, baseType: !1097, size: 64, align: 64, offset: 1472)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1090, file: !1091, line: 215, baseType: !932, size: 32, align: 32, offset: 1536)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1090, file: !1091, line: 217, baseType: !932, size: 32, align: 32, offset: 1568)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1090, file: !1091, line: 220, baseType: !932, size: 32, align: 32, offset: 1600)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1077, file: !14, line: 1598, baseType: !943, size: 64, align: 64, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1077, file: !14, line: 1606, baseType: !1009, size: 64, align: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1077, file: !14, line: 1614, baseType: !932, size: 32, align: 32, offset: 512)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1077, file: !14, line: 1622, baseType: !932, size: 32, align: 32, offset: 544)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1077, file: !14, line: 1628, baseType: !932, size: 32, align: 32, offset: 576)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !14, line: 1636, baseType: !932, size: 32, align: 32, offset: 608)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1077, file: !14, line: 1643, baseType: !932, size: 32, align: 32, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1077, file: !14, line: 1657, baseType: !1103, size: 64, align: 64, offset: 704)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1077, file: !14, line: 1658, baseType: !932, size: 32, align: 32, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1077, file: !14, line: 1679, baseType: !964, size: 64, align: 32, offset: 800)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1077, file: !14, line: 1688, baseType: !932, size: 32, align: 32, offset: 864)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1077, file: !14, line: 1712, baseType: !932, size: 32, align: 32, offset: 896)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1077, file: !14, line: 1729, baseType: !932, size: 32, align: 32, offset: 928)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1077, file: !14, line: 1729, baseType: !932, size: 32, align: 32, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1077, file: !14, line: 1744, baseType: !932, size: 32, align: 32, offset: 992)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1077, file: !14, line: 1744, baseType: !932, size: 32, align: 32, offset: 1024)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1077, file: !14, line: 1751, baseType: !932, size: 32, align: 32, offset: 1056)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1077, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1077, file: !14, line: 1791, baseType: !1361, size: 64, align: 64, offset: 1152)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DISubroutineType(types: !1363)
!1363 = !{null, !1364, !1365, !1367, !932, !932, !932}
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1098)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1077, file: !14, line: 1808, baseType: !1369, size: 64, align: 64, offset: 1216)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{!473, !1364, !971}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1077, file: !14, line: 1816, baseType: !932, size: 32, align: 32, offset: 1280)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1077, file: !14, line: 1825, baseType: !1374, size: 32, align: 32, offset: 1312)
!1374 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1077, file: !14, line: 1830, baseType: !932, size: 32, align: 32, offset: 1344)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1077, file: !14, line: 1838, baseType: !1374, size: 32, align: 32, offset: 1376)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1077, file: !14, line: 1846, baseType: !932, size: 32, align: 32, offset: 1408)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1077, file: !14, line: 1851, baseType: !932, size: 32, align: 32, offset: 1440)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1077, file: !14, line: 1861, baseType: !1374, size: 32, align: 32, offset: 1472)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1077, file: !14, line: 1868, baseType: !1374, size: 32, align: 32, offset: 1504)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1077, file: !14, line: 1875, baseType: !1374, size: 32, align: 32, offset: 1536)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1077, file: !14, line: 1882, baseType: !1374, size: 32, align: 32, offset: 1568)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1077, file: !14, line: 1889, baseType: !1374, size: 32, align: 32, offset: 1600)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1077, file: !14, line: 1896, baseType: !1374, size: 32, align: 32, offset: 1632)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1077, file: !14, line: 1903, baseType: !1374, size: 32, align: 32, offset: 1664)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1077, file: !14, line: 1910, baseType: !932, size: 32, align: 32, offset: 1696)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1077, file: !14, line: 1915, baseType: !932, size: 32, align: 32, offset: 1728)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1077, file: !14, line: 1926, baseType: !1367, size: 64, align: 64, offset: 1792)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1077, file: !14, line: 1935, baseType: !964, size: 64, align: 32, offset: 1856)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1077, file: !14, line: 1942, baseType: !932, size: 32, align: 32, offset: 1920)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1077, file: !14, line: 1948, baseType: !932, size: 32, align: 32, offset: 1952)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1077, file: !14, line: 1954, baseType: !932, size: 32, align: 32, offset: 1984)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1077, file: !14, line: 1960, baseType: !932, size: 32, align: 32, offset: 2016)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1077, file: !14, line: 1984, baseType: !932, size: 32, align: 32, offset: 2048)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1077, file: !14, line: 1991, baseType: !932, size: 32, align: 32, offset: 2080)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1077, file: !14, line: 1996, baseType: !932, size: 32, align: 32, offset: 2112)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1077, file: !14, line: 2004, baseType: !932, size: 32, align: 32, offset: 2144)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1077, file: !14, line: 2011, baseType: !932, size: 32, align: 32, offset: 2176)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1077, file: !14, line: 2018, baseType: !932, size: 32, align: 32, offset: 2208)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1077, file: !14, line: 2027, baseType: !932, size: 32, align: 32, offset: 2240)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1077, file: !14, line: 2034, baseType: !932, size: 32, align: 32, offset: 2272)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1077, file: !14, line: 2044, baseType: !932, size: 32, align: 32, offset: 2304)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1077, file: !14, line: 2054, baseType: !1404, size: 64, align: 64, offset: 2368)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1077, file: !14, line: 2061, baseType: !1404, size: 64, align: 64, offset: 2432)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1077, file: !14, line: 2066, baseType: !932, size: 32, align: 32, offset: 2496)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1077, file: !14, line: 2070, baseType: !932, size: 32, align: 32, offset: 2528)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1077, file: !14, line: 2078, baseType: !932, size: 32, align: 32, offset: 2560)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1077, file: !14, line: 2085, baseType: !932, size: 32, align: 32, offset: 2592)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1077, file: !14, line: 2092, baseType: !932, size: 32, align: 32, offset: 2624)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1077, file: !14, line: 2099, baseType: !932, size: 32, align: 32, offset: 2656)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1077, file: !14, line: 2106, baseType: !932, size: 32, align: 32, offset: 2688)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1077, file: !14, line: 2113, baseType: !932, size: 32, align: 32, offset: 2720)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1077, file: !14, line: 2120, baseType: !932, size: 32, align: 32, offset: 2752)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1077, file: !14, line: 2125, baseType: !932, size: 32, align: 32, offset: 2784)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1077, file: !14, line: 2133, baseType: !932, size: 32, align: 32, offset: 2816)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1077, file: !14, line: 2140, baseType: !932, size: 32, align: 32, offset: 2848)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1077, file: !14, line: 2145, baseType: !932, size: 32, align: 32, offset: 2880)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1077, file: !14, line: 2153, baseType: !932, size: 32, align: 32, offset: 2912)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1077, file: !14, line: 2158, baseType: !932, size: 32, align: 32, offset: 2944)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1077, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1077, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1077, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1077, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1077, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1077, file: !14, line: 2203, baseType: !932, size: 32, align: 32, offset: 3136)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1077, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1077, file: !14, line: 2212, baseType: !932, size: 32, align: 32, offset: 3200)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1077, file: !14, line: 2213, baseType: !932, size: 32, align: 32, offset: 3232)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1077, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1077, file: !14, line: 2232, baseType: !932, size: 32, align: 32, offset: 3296)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1077, file: !14, line: 2243, baseType: !932, size: 32, align: 32, offset: 3328)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1077, file: !14, line: 2249, baseType: !932, size: 32, align: 32, offset: 3360)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1077, file: !14, line: 2256, baseType: !932, size: 32, align: 32, offset: 3392)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1077, file: !14, line: 2263, baseType: !982, size: 64, align: 64, offset: 3456)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1077, file: !14, line: 2270, baseType: !982, size: 64, align: 64, offset: 3520)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1077, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1077, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1077, file: !14, line: 2367, baseType: !1440, size: 64, align: 64, offset: 3648)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{!932, !1364, !1097, !932}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1077, file: !14, line: 2383, baseType: !932, size: 32, align: 32, offset: 3712)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1077, file: !14, line: 2386, baseType: !1374, size: 32, align: 32, offset: 3744)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1077, file: !14, line: 2387, baseType: !1374, size: 32, align: 32, offset: 3776)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1077, file: !14, line: 2394, baseType: !932, size: 32, align: 32, offset: 3808)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1077, file: !14, line: 2401, baseType: !932, size: 32, align: 32, offset: 3840)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1077, file: !14, line: 2408, baseType: !932, size: 32, align: 32, offset: 3872)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1077, file: !14, line: 2415, baseType: !932, size: 32, align: 32, offset: 3904)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1077, file: !14, line: 2422, baseType: !932, size: 32, align: 32, offset: 3936)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1077, file: !14, line: 2423, baseType: !1452, size: 64, align: 64, offset: 3968)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1454)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1454, file: !14, line: 827, baseType: !932, size: 32, align: 32)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1454, file: !14, line: 828, baseType: !932, size: 32, align: 32, offset: 32)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1454, file: !14, line: 829, baseType: !932, size: 32, align: 32, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1454, file: !14, line: 830, baseType: !1374, size: 32, align: 32, offset: 96)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1077, file: !14, line: 2430, baseType: !1009, size: 64, align: 64, offset: 4032)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1077, file: !14, line: 2437, baseType: !1009, size: 64, align: 64, offset: 4096)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1077, file: !14, line: 2444, baseType: !1374, size: 32, align: 32, offset: 4160)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1077, file: !14, line: 2451, baseType: !1374, size: 32, align: 32, offset: 4192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1077, file: !14, line: 2458, baseType: !932, size: 32, align: 32, offset: 4224)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1077, file: !14, line: 2469, baseType: !932, size: 32, align: 32, offset: 4256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1077, file: !14, line: 2475, baseType: !932, size: 32, align: 32, offset: 4288)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1077, file: !14, line: 2481, baseType: !932, size: 32, align: 32, offset: 4320)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1077, file: !14, line: 2485, baseType: !932, size: 32, align: 32, offset: 4352)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1077, file: !14, line: 2489, baseType: !932, size: 32, align: 32, offset: 4384)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1077, file: !14, line: 2493, baseType: !932, size: 32, align: 32, offset: 4416)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1077, file: !14, line: 2501, baseType: !932, size: 32, align: 32, offset: 4448)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1077, file: !14, line: 2506, baseType: !932, size: 32, align: 32, offset: 4480)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1077, file: !14, line: 2510, baseType: !932, size: 32, align: 32, offset: 4512)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1077, file: !14, line: 2514, baseType: !1009, size: 64, align: 64, offset: 4544)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1077, file: !14, line: 2528, baseType: !1476, size: 64, align: 64, offset: 4608)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1364, !943, !932, !932}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1077, file: !14, line: 2534, baseType: !932, size: 32, align: 32, offset: 4672)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1077, file: !14, line: 2545, baseType: !932, size: 32, align: 32, offset: 4704)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1077, file: !14, line: 2547, baseType: !932, size: 32, align: 32, offset: 4736)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1077, file: !14, line: 2549, baseType: !932, size: 32, align: 32, offset: 4768)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1077, file: !14, line: 2551, baseType: !932, size: 32, align: 32, offset: 4800)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1077, file: !14, line: 2553, baseType: !932, size: 32, align: 32, offset: 4832)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1077, file: !14, line: 2555, baseType: !932, size: 32, align: 32, offset: 4864)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1077, file: !14, line: 2557, baseType: !932, size: 32, align: 32, offset: 4896)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1077, file: !14, line: 2559, baseType: !932, size: 32, align: 32, offset: 4928)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1077, file: !14, line: 2563, baseType: !932, size: 32, align: 32, offset: 4960)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1077, file: !14, line: 2571, baseType: !1490, size: 64, align: 64, offset: 4992)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1077, file: !14, line: 2579, baseType: !1490, size: 64, align: 64, offset: 5056)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1077, file: !14, line: 2586, baseType: !932, size: 32, align: 32, offset: 5120)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1077, file: !14, line: 2615, baseType: !932, size: 32, align: 32, offset: 5152)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1077, file: !14, line: 2627, baseType: !932, size: 32, align: 32, offset: 5184)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1077, file: !14, line: 2637, baseType: !932, size: 32, align: 32, offset: 5216)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1077, file: !14, line: 2681, baseType: !932, size: 32, align: 32, offset: 5248)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1077, file: !14, line: 2709, baseType: !1009, size: 64, align: 64, offset: 5312)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1077, file: !14, line: 2716, baseType: !1499, size: 64, align: 64, offset: 5376)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506, !1507, !1508, !1512, !1518, !1522, !1523, !1524, !1525, !1531, !1532, !1533, !1534, !1535}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1501, file: !14, line: 3642, baseType: !954, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1501, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1501, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1501, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1501, file: !14, line: 3669, baseType: !932, size: 32, align: 32, offset: 160)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1501, file: !14, line: 3682, baseType: !1509, size: 64, align: 64, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DISubroutineType(types: !1511)
!1511 = !{!932, !1075, !1097}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1501, file: !14, line: 3698, baseType: !1513, size: 64, align: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64, align: 64)
!1514 = !DISubroutineType(types: !1515)
!1515 = !{!932, !1075, !1516, !942}
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1501, file: !14, line: 3712, baseType: !1519, size: 64, align: 64, offset: 320)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!932, !1075, !932, !1516, !942}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1501, file: !14, line: 3726, baseType: !1513, size: 64, align: 64, offset: 384)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1501, file: !14, line: 3737, baseType: !1072, size: 64, align: 64, offset: 448)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1501, file: !14, line: 3746, baseType: !932, size: 32, align: 32, offset: 512)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1501, file: !14, line: 3757, baseType: !1526, size: 64, align: 64, offset: 576)
!1526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1527, size: 64, align: 64)
!1527 = !DISubroutineType(types: !1528)
!1528 = !{null, !1529}
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1501, file: !14, line: 3766, baseType: !1072, size: 64, align: 64, offset: 640)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1501, file: !14, line: 3774, baseType: !1072, size: 64, align: 64, offset: 704)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1501, file: !14, line: 3780, baseType: !932, size: 32, align: 32, offset: 768)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1501, file: !14, line: 3785, baseType: !932, size: 32, align: 32, offset: 800)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1501, file: !14, line: 3795, baseType: !1536, size: 64, align: 64, offset: 832)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!932, !1075, !1135}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1077, file: !14, line: 2728, baseType: !943, size: 64, align: 64, offset: 5440)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1077, file: !14, line: 2735, baseType: !1125, size: 512, align: 64, offset: 5504)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1077, file: !14, line: 2742, baseType: !932, size: 32, align: 32, offset: 6016)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1077, file: !14, line: 2755, baseType: !932, size: 32, align: 32, offset: 6048)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1077, file: !14, line: 2776, baseType: !932, size: 32, align: 32, offset: 6080)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1077, file: !14, line: 2783, baseType: !932, size: 32, align: 32, offset: 6112)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1077, file: !14, line: 2791, baseType: !932, size: 32, align: 32, offset: 6144)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1077, file: !14, line: 2802, baseType: !1097, size: 64, align: 64, offset: 6208)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1077, file: !14, line: 2811, baseType: !932, size: 32, align: 32, offset: 6272)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1077, file: !14, line: 2821, baseType: !932, size: 32, align: 32, offset: 6304)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1077, file: !14, line: 2830, baseType: !932, size: 32, align: 32, offset: 6336)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1077, file: !14, line: 2840, baseType: !932, size: 32, align: 32, offset: 6368)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1077, file: !14, line: 2851, baseType: !1552, size: 64, align: 64, offset: 6400)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DISubroutineType(types: !1554)
!1554 = !{!932, !1364, !1555, !943, !1367, !932, !932}
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!932, !1364, !943}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1077, file: !14, line: 2871, baseType: !1559, size: 64, align: 64, offset: 6464)
!1559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1560, size: 64, align: 64)
!1560 = !DISubroutineType(types: !1561)
!1561 = !{!932, !1364, !1562, !943, !1367, !932}
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!932, !1364, !943, !932, !932}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1077, file: !14, line: 2878, baseType: !932, size: 32, align: 32, offset: 6528)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1077, file: !14, line: 2885, baseType: !932, size: 32, align: 32, offset: 6560)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1077, file: !14, line: 3005, baseType: !932, size: 32, align: 32, offset: 6592)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1077, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1077, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1077, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1077, file: !14, line: 3037, baseType: !1103, size: 64, align: 64, offset: 6720)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1077, file: !14, line: 3038, baseType: !932, size: 32, align: 32, offset: 6784)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1077, file: !14, line: 3050, baseType: !982, size: 64, align: 64, offset: 6848)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1077, file: !14, line: 3065, baseType: !932, size: 32, align: 32, offset: 6912)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1077, file: !14, line: 3083, baseType: !932, size: 32, align: 32, offset: 6944)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1077, file: !14, line: 3092, baseType: !964, size: 64, align: 32, offset: 6976)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1077, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1077, file: !14, line: 3106, baseType: !964, size: 64, align: 32, offset: 7072)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1077, file: !14, line: 3113, baseType: !1580, size: 64, align: 64, offset: 7168)
!1580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1582)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1583)
!1583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1584)
!1584 = !{!1585, !1586, !1587, !1588, !1589, !1590, !1593}
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1583, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1583, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1583, file: !14, line: 720, baseType: !954, size: 64, align: 64, offset: 64)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1583, file: !14, line: 724, baseType: !954, size: 64, align: 64, offset: 128)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1583, file: !14, line: 728, baseType: !932, size: 32, align: 32, offset: 192)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1583, file: !14, line: 734, baseType: !1591, size: 64, align: 64, offset: 256)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1583, file: !14, line: 739, baseType: !1594, size: 64, align: 64, offset: 320)
!1594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1595, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1077, file: !14, line: 3129, baseType: !1009, size: 64, align: 64, offset: 7232)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1077, file: !14, line: 3130, baseType: !1009, size: 64, align: 64, offset: 7296)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1077, file: !14, line: 3131, baseType: !1009, size: 64, align: 64, offset: 7360)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1077, file: !14, line: 3132, baseType: !1009, size: 64, align: 64, offset: 7424)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1077, file: !14, line: 3139, baseType: !1490, size: 64, align: 64, offset: 7488)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1077, file: !14, line: 3147, baseType: !932, size: 32, align: 32, offset: 7552)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1077, file: !14, line: 3165, baseType: !932, size: 32, align: 32, offset: 7584)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1077, file: !14, line: 3172, baseType: !932, size: 32, align: 32, offset: 7616)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1077, file: !14, line: 3180, baseType: !932, size: 32, align: 32, offset: 7648)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1077, file: !14, line: 3191, baseType: !1404, size: 64, align: 64, offset: 7680)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1077, file: !14, line: 3199, baseType: !1103, size: 64, align: 64, offset: 7744)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1077, file: !14, line: 3207, baseType: !1490, size: 64, align: 64, offset: 7808)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1077, file: !14, line: 3214, baseType: !933, size: 32, align: 32, offset: 7872)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1077, file: !14, line: 3224, baseType: !1233, size: 64, align: 64, offset: 7936)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1077, file: !14, line: 3225, baseType: !932, size: 32, align: 32, offset: 8000)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1077, file: !14, line: 3249, baseType: !1135, size: 64, align: 64, offset: 8064)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1077, file: !14, line: 3256, baseType: !932, size: 32, align: 32, offset: 8128)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1077, file: !14, line: 3271, baseType: !932, size: 32, align: 32, offset: 8160)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1077, file: !14, line: 3279, baseType: !1009, size: 64, align: 64, offset: 8192)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1077, file: !14, line: 3301, baseType: !1135, size: 64, align: 64, offset: 8256)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1077, file: !14, line: 3310, baseType: !932, size: 32, align: 32, offset: 8320)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1077, file: !14, line: 3337, baseType: !932, size: 32, align: 32, offset: 8352)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1077, file: !14, line: 3351, baseType: !932, size: 32, align: 32, offset: 8384)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1077, file: !14, line: 3359, baseType: !932, size: 32, align: 32, offset: 8416)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !951, file: !14, line: 3535, baseType: !1621, size: 64, align: 64, offset: 1024)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DISubroutineType(types: !1623)
!1623 = !{!932, !1075, !1624}
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !951, file: !14, line: 3541, baseType: !1627, size: 64, align: 64, offset: 1088)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1629)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1630)
!1630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1091, line: 223, size: 128, align: 64, elements: !1631)
!1631 = !{!1632, !1633}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1630, file: !1091, line: 224, baseType: !1516, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1630, file: !1091, line: 225, baseType: !1516, size: 64, align: 64, offset: 64)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !951, file: !14, line: 3549, baseType: !1635, size: 64, align: 64, offset: 1152)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{null, !1070}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !951, file: !14, line: 3551, baseType: !1072, size: 64, align: 64, offset: 1216)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !951, file: !14, line: 3552, baseType: !1640, size: 64, align: 64, offset: 1280)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!932, !1075, !1103, !932, !1643}
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1645)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1646)
!1646 = !{!1647, !1648, !1649, !1650, !1651, !1675}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1645, file: !14, line: 3921, baseType: !934, size: 16, align: 16)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1645, file: !14, line: 3922, baseType: !942, size: 32, align: 32, offset: 32)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1645, file: !14, line: 3923, baseType: !942, size: 32, align: 32, offset: 64)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1645, file: !14, line: 3924, baseType: !933, size: 32, align: 32, offset: 96)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1645, file: !14, line: 3925, baseType: !1652, size: 64, align: 64, offset: 128)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1655)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1656)
!1656 = !{!1657, !1658, !1659, !1660, !1661, !1662, !1668, !1670, !1671, !1672, !1673, !1674}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1655, file: !14, line: 3886, baseType: !932, size: 32, align: 32)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1655, file: !14, line: 3887, baseType: !932, size: 32, align: 32, offset: 32)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1655, file: !14, line: 3888, baseType: !932, size: 32, align: 32, offset: 64)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1655, file: !14, line: 3889, baseType: !932, size: 32, align: 32, offset: 96)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1655, file: !14, line: 3890, baseType: !932, size: 32, align: 32, offset: 128)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1655, file: !14, line: 3897, baseType: !1663, size: 768, align: 64, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1664)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1665)
!1665 = !{!1666, !1667}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1664, file: !14, line: 3855, baseType: !1102, size: 512, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1664, file: !14, line: 3857, baseType: !1107, size: 256, align: 32, offset: 512)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1655, file: !14, line: 3903, baseType: !1669, size: 256, align: 64, offset: 960)
!1669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1103, size: 256, align: 64, elements: !1204)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1655, file: !14, line: 3904, baseType: !1211, size: 128, align: 32, offset: 1216)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1655, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1655, file: !14, line: 3908, baseType: !1490, size: 64, align: 64, offset: 1408)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1655, file: !14, line: 3915, baseType: !1490, size: 64, align: 64, offset: 1472)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1655, file: !14, line: 3917, baseType: !932, size: 32, align: 32, offset: 1536)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1645, file: !14, line: 3926, baseType: !1009, size: 64, align: 64, offset: 192)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !951, file: !14, line: 3564, baseType: !1677, size: 64, align: 64, offset: 1344)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!932, !1075, !1221, !1365, !1367}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !951, file: !14, line: 3566, baseType: !1681, size: 64, align: 64, offset: 1408)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!932, !1075, !943, !1367, !1221}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !951, file: !14, line: 3567, baseType: !1072, size: 64, align: 64, offset: 1472)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !951, file: !14, line: 3576, baseType: !1686, size: 64, align: 64, offset: 1536)
!1686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1687, size: 64, align: 64)
!1687 = !DISubroutineType(types: !1688)
!1688 = !{!932, !1075, !1365}
