; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--dvenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--dvenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dv_pack_type", file: !939, line: 67, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavcodec/dv.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!941 = !DIEnumerator(name: "dv_header525", value: 63)
!942 = !DIEnumerator(name: "dv_header625", value: 191)
!943 = !DIEnumerator(name: "dv_timecode", value: 19)
!944 = !DIEnumerator(name: "dv_audio_source", value: 80)
!945 = !DIEnumerator(name: "dv_audio_control", value: 81)
!946 = !DIEnumerator(name: "dv_audio_recdate", value: 82)
!947 = !DIEnumerator(name: "dv_audio_rectime", value: 83)
!948 = !DIEnumerator(name: "dv_video_source", value: 96)
!949 = !DIEnumerator(name: "dv_video_control", value: 97)
!950 = !DIEnumerator(name: "dv_video_recdate", value: 98)
!951 = !DIEnumerator(name: "dv_video_rectime", value: 99)
!952 = !DIEnumerator(name: "dv_unknown_pack", value: 255)
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVRounding", file: !954, line: 79, size: 32, align: 32, elements: !955)
!954 = !DIFile(filename: "./libavutil/mathematics.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!955 = !{!956, !957, !958, !959, !960, !961}
!956 = !DIEnumerator(name: "AV_ROUND_ZERO", value: 0)
!957 = !DIEnumerator(name: "AV_ROUND_INF", value: 1)
!958 = !DIEnumerator(name: "AV_ROUND_DOWN", value: 2)
!959 = !DIEnumerator(name: "AV_ROUND_UP", value: 3)
!960 = !DIEnumerator(name: "AV_ROUND_NEAR_INF", value: 5)
!961 = !DIEnumerator(name: "AV_ROUND_PASS_MINMAX", value: 8192)
!962 = !{!963, !964, !965, !968}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!964 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !966, line: 48, baseType: !967)
!966 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !970, line: 221, size: 32, align: 8, elements: !971)
!970 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!971 = !{!972}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !969, file: !970, line: 221, baseType: !973, size: 32, align: 32)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !966, line: 51, baseType: !974)
!974 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!975 = !{!976, !2219}
!976 = distinct !DIGlobalVariable(name: "ff_dv_muxer", scope: !0, file: !977, line: 445, type: !978, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_dv_muxer)
!977 = !DIFile(filename: "libavformat/dvenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !979)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !980)
!980 = !{!981, !985, !986, !987, !988, !989, !990, !991, !993, !1003, !1083, !1085, !1086, !2184, !2185, !2186, !2190, !2194, !2198, !2199, !2204, !2205, !2206, !2207, !2208, !2209, !2213}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !979, file: !919, line: 498, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !979, file: !919, line: 504, baseType: !982, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !979, file: !919, line: 505, baseType: !982, size: 64, align: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !979, file: !919, line: 506, baseType: !982, size: 64, align: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !979, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !979, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !979, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !979, file: !919, line: 517, baseType: !992, size: 32, align: 32, offset: 352)
!992 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !979, file: !919, line: 523, baseType: !994, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !999, line: 44, size: 64, align: 32, elements: !1000)
!999 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !998, file: !999, line: 45, baseType: !3, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !998, file: !999, line: 46, baseType: !974, size: 32, align: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !979, file: !919, line: 526, baseType: !1004, size: 64, align: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1014, !1042, !1043, !1044, !1045, !1049, !1055, !1057, !1061}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1007, file: !486, line: 72, baseType: !982, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1007, file: !486, line: 78, baseType: !1011, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!982, !963}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1007, file: !486, line: 85, baseType: !1015, size: 64, align: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1038, !1039, !1040, !1041}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1017, file: !464, line: 247, baseType: !982, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1017, file: !464, line: 253, baseType: !982, size: 64, align: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1017, file: !464, line: 259, baseType: !992, size: 32, align: 32, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1017, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1017, file: !464, line: 271, baseType: !1024, size: 64, align: 64, offset: 192)
!1024 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1017, file: !464, line: 265, size: 64, align: 64, elements: !1025)
!1025 = !{!1026, !1028, !1030, !1031}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1024, file: !464, line: 266, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !966, line: 40, baseType: !964)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1024, file: !464, line: 267, baseType: !1029, size: 64, align: 64)
!1029 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1024, file: !464, line: 268, baseType: !982, size: 64, align: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1024, file: !464, line: 270, baseType: !1032, size: 64, align: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1033, line: 61, baseType: !1034)
!1033 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1033, line: 58, size: 64, align: 32, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1034, file: !1033, line: 59, baseType: !992, size: 32, align: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1034, file: !1033, line: 60, baseType: !992, size: 32, align: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1017, file: !464, line: 272, baseType: !1029, size: 64, align: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1017, file: !464, line: 273, baseType: !1029, size: 64, align: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1017, file: !464, line: 275, baseType: !992, size: 32, align: 32, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1017, file: !464, line: 300, baseType: !982, size: 64, align: 64, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1007, file: !486, line: 93, baseType: !992, size: 32, align: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1007, file: !486, line: 99, baseType: !992, size: 32, align: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1007, file: !486, line: 108, baseType: !992, size: 32, align: 32, offset: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1007, file: !486, line: 113, baseType: !1046, size: 64, align: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{!963, !963, !963}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1007, file: !486, line: 123, baseType: !1050, size: 64, align: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1053}
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1007, file: !486, line: 130, baseType: !1056, size: 32, align: 32, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1007, file: !486, line: 136, baseType: !1058, size: 64, align: 64, offset: 512)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1056, !963}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1007, file: !486, line: 142, baseType: !1062, size: 64, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!992, !1065, !963, !982, !992}
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1068)
!1068 = !{!1069, !1081, !1082}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1067, file: !464, line: 360, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1074)
!1074 = !{!1075, !1076, !1077, !1078, !1079, !1080}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1073, file: !464, line: 307, baseType: !982, size: 64, align: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1073, file: !464, line: 313, baseType: !1029, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1073, file: !464, line: 313, baseType: !1029, size: 64, align: 64, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1073, file: !464, line: 318, baseType: !1029, size: 64, align: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1073, file: !464, line: 318, baseType: !1029, size: 64, align: 64, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1073, file: !464, line: 323, baseType: !992, size: 32, align: 32, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1067, file: !464, line: 364, baseType: !992, size: 32, align: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1067, file: !464, line: 368, baseType: !992, size: 32, align: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !979, file: !919, line: 535, baseType: !1084, size: 64, align: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !979, file: !919, line: 539, baseType: !992, size: 32, align: 32, offset: 576)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !979, file: !919, line: 541, baseType: !1087, size: 64, align: 64, offset: 640)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!992, !1090}
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1092)
!1092 = !{!1093, !1094, !1190, !1191, !1192, !1258, !1259, !1260, !2038, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2092, !2093, !2094, !2095, !2096, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2147, !2148, !2151, !2152, !2153, !2154, !2155, !2156, !2161, !2162, !2163, !2164, !2172, !2173, !2177, !2181, !2182, !2183}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1091, file: !919, line: 1342, baseType: !1004, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1091, file: !919, line: 1349, baseType: !1095, size: 64, align: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1121, !1122, !1161, !1162, !1166, !1171, !1172, !1173, !1177, !1183, !1189}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1096, file: !919, line: 638, baseType: !982, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1096, file: !919, line: 645, baseType: !982, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1096, file: !919, line: 652, baseType: !992, size: 32, align: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1096, file: !919, line: 659, baseType: !982, size: 64, align: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1096, file: !919, line: 661, baseType: !994, size: 64, align: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1096, file: !919, line: 663, baseType: !1004, size: 64, align: 64, offset: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1096, file: !919, line: 670, baseType: !982, size: 64, align: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1096, file: !919, line: 679, baseType: !1095, size: 64, align: 64, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1096, file: !919, line: 684, baseType: !992, size: 32, align: 32, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1096, file: !919, line: 689, baseType: !992, size: 32, align: 32, offset: 544)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1096, file: !919, line: 696, baseType: !1109, size: 64, align: 64, offset: 576)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!992, !1112}
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1115)
!1115 = !{!1116, !1117, !1119, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1114, file: !919, line: 449, baseType: !982, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1114, file: !919, line: 450, baseType: !1118, size: 64, align: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1114, file: !919, line: 451, baseType: !992, size: 32, align: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1114, file: !919, line: 452, baseType: !982, size: 64, align: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1096, file: !919, line: 703, baseType: !1087, size: 64, align: 64, offset: 640)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1096, file: !919, line: 714, baseType: !1123, size: 64, align: 64, offset: 704)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!992, !1090, !1126}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1128)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1129)
!1129 = !{!1130, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1157, !1158, !1159, !1160}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1128, file: !4, line: 1451, baseType: !1131, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1133, line: 94, baseType: !1134)
!1133 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1133, line: 81, size: 192, align: 64, elements: !1135)
!1135 = !{!1136, !1140, !1142}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1134, file: !1133, line: 82, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1133, line: 73, baseType: !1139)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1133, line: 73, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !1133, line: 89, baseType: !1141, size: 64, align: 64, offset: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !1133, line: 93, baseType: !992, size: 32, align: 32, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1128, file: !4, line: 1461, baseType: !1027, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1128, file: !4, line: 1467, baseType: !1027, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1128, file: !4, line: 1468, baseType: !1141, size: 64, align: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1128, file: !4, line: 1469, baseType: !992, size: 32, align: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1128, file: !4, line: 1470, baseType: !992, size: 32, align: 32, offset: 288)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1128, file: !4, line: 1474, baseType: !992, size: 32, align: 32, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1128, file: !4, line: 1479, baseType: !1150, size: 64, align: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !4, line: 1412, baseType: !1141, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !4, line: 1413, baseType: !992, size: 32, align: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1128, file: !4, line: 1480, baseType: !992, size: 32, align: 32, offset: 448)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1128, file: !4, line: 1486, baseType: !1027, size: 64, align: 64, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1128, file: !4, line: 1488, baseType: !1027, size: 64, align: 64, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1128, file: !4, line: 1497, baseType: !1027, size: 64, align: 64, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1096, file: !919, line: 720, baseType: !1087, size: 64, align: 64, offset: 768)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1096, file: !919, line: 730, baseType: !1163, size: 64, align: 64, offset: 832)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!992, !1090, !992, !1027, !992}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1096, file: !919, line: 737, baseType: !1167, size: 64, align: 64, offset: 896)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!1027, !1090, !992, !1170, !1027}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1096, file: !919, line: 744, baseType: !1087, size: 64, align: 64, offset: 960)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1096, file: !919, line: 750, baseType: !1087, size: 64, align: 64, offset: 1024)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1096, file: !919, line: 758, baseType: !1174, size: 64, align: 64, offset: 1088)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!992, !1090, !992, !1027, !1027, !1027, !992}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1096, file: !919, line: 764, baseType: !1178, size: 64, align: 64, offset: 1152)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!992, !1090, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1096, file: !919, line: 770, baseType: !1184, size: 64, align: 64, offset: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DISubroutineType(types: !1186)
!1186 = !{!992, !1090, !1187}
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1096, file: !919, line: 776, baseType: !1184, size: 64, align: 64, offset: 1280)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1091, file: !919, line: 1356, baseType: !1084, size: 64, align: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1091, file: !919, line: 1365, baseType: !963, size: 64, align: 64, offset: 192)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1091, file: !919, line: 1379, baseType: !1193, size: 64, align: 64, offset: 256)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1202, !1203, !1207, !1208, !1212, !1213, !1214, !1215, !1216, !1218, !1219, !1225, !1226, !1230, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1248, !1249, !1250, !1251, !1255, !1256, !1257}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1195, file: !537, line: 174, baseType: !1004, size: 64, align: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1195, file: !537, line: 226, baseType: !1118, size: 64, align: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1195, file: !537, line: 227, baseType: !992, size: 32, align: 32, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1195, file: !537, line: 228, baseType: !1118, size: 64, align: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1195, file: !537, line: 229, baseType: !1118, size: 64, align: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1195, file: !537, line: 233, baseType: !963, size: 64, align: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1195, file: !537, line: 235, baseType: !1204, size: 64, align: 64, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!992, !963, !1141, !992}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1195, file: !537, line: 236, baseType: !1204, size: 64, align: 64, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1195, file: !537, line: 237, baseType: !1209, size: 64, align: 64, offset: 512)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!1027, !963, !1027, !992}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1195, file: !537, line: 238, baseType: !1027, size: 64, align: 64, offset: 576)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1195, file: !537, line: 239, baseType: !992, size: 32, align: 32, offset: 640)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1195, file: !537, line: 240, baseType: !992, size: 32, align: 32, offset: 672)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1195, file: !537, line: 241, baseType: !992, size: 32, align: 32, offset: 704)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1195, file: !537, line: 242, baseType: !1217, size: 64, align: 64, offset: 768)
!1217 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1195, file: !537, line: 243, baseType: !1118, size: 64, align: 64, offset: 832)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1195, file: !537, line: 244, baseType: !1220, size: 64, align: 64, offset: 896)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64, align: 64)
!1221 = !DISubroutineType(types: !1222)
!1222 = !{!1217, !1217, !1223, !974}
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1195, file: !537, line: 245, baseType: !992, size: 32, align: 32, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1195, file: !537, line: 249, baseType: !1227, size: 64, align: 64, offset: 1024)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!992, !963, !992}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1195, file: !537, line: 255, baseType: !1231, size: 64, align: 64, offset: 1088)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!1027, !963, !992, !1027, !992}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1195, file: !537, line: 260, baseType: !992, size: 32, align: 32, offset: 1152)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1195, file: !537, line: 266, baseType: !1027, size: 64, align: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1195, file: !537, line: 273, baseType: !992, size: 32, align: 32, offset: 1280)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1195, file: !537, line: 279, baseType: !1027, size: 64, align: 64, offset: 1344)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1195, file: !537, line: 285, baseType: !992, size: 32, align: 32, offset: 1408)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1195, file: !537, line: 291, baseType: !992, size: 32, align: 32, offset: 1440)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1195, file: !537, line: 298, baseType: !992, size: 32, align: 32, offset: 1472)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1195, file: !537, line: 304, baseType: !992, size: 32, align: 32, offset: 1504)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1195, file: !537, line: 309, baseType: !982, size: 64, align: 64, offset: 1536)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1195, file: !537, line: 314, baseType: !982, size: 64, align: 64, offset: 1600)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1195, file: !537, line: 319, baseType: !1245, size: 64, align: 64, offset: 1664)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!992, !963, !1141, !992, !536, !1027}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1195, file: !537, line: 326, baseType: !992, size: 32, align: 32, offset: 1728)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1195, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1195, file: !537, line: 332, baseType: !1027, size: 64, align: 64, offset: 1792)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1195, file: !537, line: 338, baseType: !1252, size: 64, align: 64, offset: 1856)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!992, !963}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1195, file: !537, line: 340, baseType: !1027, size: 64, align: 64, offset: 1920)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1195, file: !537, line: 346, baseType: !1118, size: 64, align: 64, offset: 1984)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1195, file: !537, line: 351, baseType: !992, size: 32, align: 32, offset: 2048)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1091, file: !919, line: 1386, baseType: !992, size: 32, align: 32, offset: 320)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1091, file: !919, line: 1393, baseType: !974, size: 32, align: 32, offset: 352)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1091, file: !919, line: 1405, baseType: !1261, size: 64, align: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1824, !1847, !1848, !1849, !1850, !1851, !1852, !1853, !1854, !1855, !1924, !1930, !1931, !1935, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1967, !1968, !1969, !1970, !1971, !1972}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1264, file: !919, line: 866, baseType: !992, size: 32, align: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1264, file: !919, line: 872, baseType: !992, size: 32, align: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1264, file: !919, line: 878, baseType: !1269, size: 64, align: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1499, !1500, !1501, !1502, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1528, !1532, !1533, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1712, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1271, file: !4, line: 1561, baseType: !1004, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1271, file: !4, line: 1562, baseType: !992, size: 32, align: 32, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1271, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1271, file: !4, line: 1565, baseType: !1277, size: 64, align: 64, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283, !1284, !1285, !1286, !1289, !1292, !1295, !1298, !1302, !1303, !1304, !1312, !1313, !1314, !1316, !1320, !1326, !1331, !1335, !1336, !1383, !1470, !1474, !1475, !1479, !1483, !1488, !1492, !1493, !1494}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1279, file: !4, line: 3475, baseType: !982, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1279, file: !4, line: 3480, baseType: !982, size: 64, align: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1279, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1279, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1279, file: !4, line: 3487, baseType: !992, size: 32, align: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1279, file: !4, line: 3488, baseType: !1287, size: 64, align: 64, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1032)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1279, file: !4, line: 3489, baseType: !1290, size: 64, align: 64, offset: 320)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1279, file: !4, line: 3490, baseType: !1293, size: 64, align: 64, offset: 384)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1279, file: !4, line: 3491, baseType: !1296, size: 64, align: 64, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1279, file: !4, line: 3492, baseType: !1299, size: 64, align: 64, offset: 512)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1301)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !966, line: 55, baseType: !1217)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1279, file: !4, line: 3493, baseType: !965, size: 8, align: 8, offset: 576)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1279, file: !4, line: 3494, baseType: !1004, size: 64, align: 64, offset: 640)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1279, file: !4, line: 3495, baseType: !1305, size: 64, align: 64, offset: 704)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1307)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1309)
!1309 = !{!1310, !1311}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1308, file: !4, line: 3402, baseType: !992, size: 32, align: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1308, file: !4, line: 3403, baseType: !982, size: 64, align: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1279, file: !4, line: 3507, baseType: !982, size: 64, align: 64, offset: 768)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1279, file: !4, line: 3516, baseType: !992, size: 32, align: 32, offset: 832)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1279, file: !4, line: 3517, baseType: !1315, size: 64, align: 64, offset: 896)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1279, file: !4, line: 3527, baseType: !1317, size: 64, align: 64, offset: 960)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!992, !1269}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1279, file: !4, line: 3535, baseType: !1321, size: 64, align: 64, offset: 1024)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!992, !1269, !1324}
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1270)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1279, file: !4, line: 3541, baseType: !1327, size: 64, align: 64, offset: 1088)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1329)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1330)
!1330 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1279, file: !4, line: 3549, baseType: !1332, size: 64, align: 64, offset: 1152)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DISubroutineType(types: !1334)
!1334 = !{null, !1315}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1279, file: !4, line: 3551, baseType: !1317, size: 64, align: 64, offset: 1216)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1279, file: !4, line: 3552, baseType: !1337, size: 64, align: 64, offset: 1280)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!992, !1269, !1141, !992, !1340}
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1343)
!1343 = !{!1344, !1347, !1348, !1349, !1350, !1382}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1342, file: !4, line: 3921, baseType: !1345, size: 16, align: 16)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !966, line: 49, baseType: !1346)
!1346 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1342, file: !4, line: 3922, baseType: !973, size: 32, align: 32, offset: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1342, file: !4, line: 3923, baseType: !973, size: 32, align: 32, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1342, file: !4, line: 3924, baseType: !974, size: 32, align: 32, offset: 96)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1342, file: !4, line: 3925, baseType: !1351, size: 64, align: 64, offset: 128)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1354)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1355)
!1355 = !{!1356, !1357, !1358, !1359, !1360, !1361, !1371, !1375, !1377, !1378, !1380, !1381}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1354, file: !4, line: 3886, baseType: !992, size: 32, align: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1354, file: !4, line: 3887, baseType: !992, size: 32, align: 32, offset: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1354, file: !4, line: 3888, baseType: !992, size: 32, align: 32, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1354, file: !4, line: 3889, baseType: !992, size: 32, align: 32, offset: 96)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1354, file: !4, line: 3890, baseType: !992, size: 32, align: 32, offset: 128)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1354, file: !4, line: 3897, baseType: !1362, size: 768, align: 64, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1364)
!1364 = !{!1365, !1369}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1363, file: !4, line: 3855, baseType: !1366, size: 512, align: 64)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 512, align: 64, elements: !1367)
!1367 = !{!1368}
!1368 = !DISubrange(count: 8)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1363, file: !4, line: 3857, baseType: !1370, size: 256, align: 32, offset: 512)
!1370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 256, align: 32, elements: !1367)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1354, file: !4, line: 3903, baseType: !1372, size: 256, align: 64, offset: 960)
!1372 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 256, align: 64, elements: !1373)
!1373 = !{!1374}
!1374 = !DISubrange(count: 4)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1354, file: !4, line: 3904, baseType: !1376, size: 128, align: 32, offset: 1216)
!1376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 128, align: 32, elements: !1373)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1354, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1354, file: !4, line: 3908, baseType: !1379, size: 64, align: 64, offset: 1408)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1354, file: !4, line: 3915, baseType: !1379, size: 64, align: 64, offset: 1472)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1354, file: !4, line: 3917, baseType: !992, size: 32, align: 32, offset: 1536)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1342, file: !4, line: 3926, baseType: !1027, size: 64, align: 64, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1279, file: !4, line: 3564, baseType: !1384, size: 64, align: 64, offset: 1344)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DISubroutineType(types: !1386)
!1386 = !{!992, !1269, !1126, !1387, !1469}
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1389)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1394, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1421, !1423, !1424, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1457, !1458, !1459, !1460, !1461, !1462, !1465, !1466, !1467, !1468}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1390, file: !789, line: 282, baseType: !1366, size: 512, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1390, file: !789, line: 299, baseType: !1370, size: 256, align: 32, offset: 512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1390, file: !789, line: 315, baseType: !1395, size: 64, align: 64, offset: 768)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1390, file: !789, line: 326, baseType: !992, size: 32, align: 32, offset: 832)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1390, file: !789, line: 326, baseType: !992, size: 32, align: 32, offset: 864)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1390, file: !789, line: 334, baseType: !992, size: 32, align: 32, offset: 896)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1390, file: !789, line: 341, baseType: !992, size: 32, align: 32, offset: 928)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1390, file: !789, line: 346, baseType: !992, size: 32, align: 32, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1390, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1390, file: !789, line: 356, baseType: !1032, size: 64, align: 32, offset: 1024)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1390, file: !789, line: 361, baseType: !1027, size: 64, align: 64, offset: 1088)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1390, file: !789, line: 369, baseType: !1027, size: 64, align: 64, offset: 1152)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1390, file: !789, line: 377, baseType: !1027, size: 64, align: 64, offset: 1216)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1390, file: !789, line: 382, baseType: !992, size: 32, align: 32, offset: 1280)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1390, file: !789, line: 386, baseType: !992, size: 32, align: 32, offset: 1312)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1390, file: !789, line: 391, baseType: !992, size: 32, align: 32, offset: 1344)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1390, file: !789, line: 396, baseType: !963, size: 64, align: 64, offset: 1408)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1390, file: !789, line: 403, baseType: !1411, size: 512, align: 64, offset: 1472)
!1411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1301, size: 512, align: 64, elements: !1367)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1390, file: !789, line: 410, baseType: !992, size: 32, align: 32, offset: 1984)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1390, file: !789, line: 415, baseType: !992, size: 32, align: 32, offset: 2016)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1390, file: !789, line: 420, baseType: !992, size: 32, align: 32, offset: 2048)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1390, file: !789, line: 425, baseType: !992, size: 32, align: 32, offset: 2080)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1390, file: !789, line: 435, baseType: !1027, size: 64, align: 64, offset: 2112)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1390, file: !789, line: 440, baseType: !992, size: 32, align: 32, offset: 2176)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1390, file: !789, line: 445, baseType: !1301, size: 64, align: 64, offset: 2240)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1390, file: !789, line: 459, baseType: !1420, size: 512, align: 64, offset: 2304)
!1420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1131, size: 512, align: 64, elements: !1367)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1390, file: !789, line: 473, baseType: !1422, size: 64, align: 64, offset: 2816)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1390, file: !789, line: 477, baseType: !992, size: 32, align: 32, offset: 2880)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1390, file: !789, line: 479, baseType: !1425, size: 64, align: 64, offset: 2944)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1428)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1429)
!1429 = !{!1430, !1431, !1432, !1433, !1438}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1428, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1428, file: !789, line: 203, baseType: !1141, size: 64, align: 64, offset: 64)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1428, file: !789, line: 204, baseType: !992, size: 32, align: 32, offset: 128)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1428, file: !789, line: 205, baseType: !1434, size: 64, align: 64, offset: 192)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1436, line: 86, baseType: !1437)
!1436 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1437 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1436, line: 86, flags: DIFlagFwdDecl)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1428, file: !789, line: 206, baseType: !1131, size: 64, align: 64, offset: 256)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1390, file: !789, line: 480, baseType: !992, size: 32, align: 32, offset: 3008)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1390, file: !789, line: 505, baseType: !992, size: 32, align: 32, offset: 3040)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1390, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1390, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1390, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1390, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1390, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1390, file: !789, line: 532, baseType: !1027, size: 64, align: 64, offset: 3264)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1390, file: !789, line: 539, baseType: !1027, size: 64, align: 64, offset: 3328)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1390, file: !789, line: 547, baseType: !1027, size: 64, align: 64, offset: 3392)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1390, file: !789, line: 554, baseType: !1434, size: 64, align: 64, offset: 3456)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1390, file: !789, line: 563, baseType: !992, size: 32, align: 32, offset: 3520)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1390, file: !789, line: 572, baseType: !992, size: 32, align: 32, offset: 3552)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1390, file: !789, line: 581, baseType: !992, size: 32, align: 32, offset: 3584)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1390, file: !789, line: 588, baseType: !1454, size: 64, align: 64, offset: 3648)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !966, line: 36, baseType: !1456)
!1456 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1390, file: !789, line: 593, baseType: !992, size: 32, align: 32, offset: 3712)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1390, file: !789, line: 596, baseType: !992, size: 32, align: 32, offset: 3744)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1390, file: !789, line: 599, baseType: !1131, size: 64, align: 64, offset: 3776)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1390, file: !789, line: 605, baseType: !1131, size: 64, align: 64, offset: 3840)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1390, file: !789, line: 616, baseType: !1131, size: 64, align: 64, offset: 3904)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1390, file: !789, line: 626, baseType: !1463, size: 64, align: 64, offset: 3968)
!1463 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1464, line: 216, baseType: !1217)
!1464 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1390, file: !789, line: 627, baseType: !1463, size: 64, align: 64, offset: 4032)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1390, file: !789, line: 628, baseType: !1463, size: 64, align: 64, offset: 4096)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1390, file: !789, line: 629, baseType: !1463, size: 64, align: 64, offset: 4160)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1390, file: !789, line: 645, baseType: !1131, size: 64, align: 64, offset: 4224)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1279, file: !4, line: 3566, baseType: !1471, size: 64, align: 64, offset: 1408)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DISubroutineType(types: !1473)
!1473 = !{!992, !1269, !963, !1469, !1126}
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1279, file: !4, line: 3567, baseType: !1317, size: 64, align: 64, offset: 1472)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1279, file: !4, line: 3576, baseType: !1476, size: 64, align: 64, offset: 1536)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!992, !1269, !1387}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1279, file: !4, line: 3577, baseType: !1480, size: 64, align: 64, offset: 1600)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DISubroutineType(types: !1482)
!1482 = !{!992, !1269, !1126}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1279, file: !4, line: 3584, baseType: !1484, size: 64, align: 64, offset: 1664)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!992, !1269, !1487}
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1279, file: !4, line: 3589, baseType: !1489, size: 64, align: 64, offset: 1728)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{null, !1269}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1279, file: !4, line: 3594, baseType: !992, size: 32, align: 32, offset: 1792)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1279, file: !4, line: 3600, baseType: !982, size: 64, align: 64, offset: 1856)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1279, file: !4, line: 3609, baseType: !1495, size: 64, align: 64, offset: 1920)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1498)
!1498 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1271, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1271, file: !4, line: 1581, baseType: !974, size: 32, align: 32, offset: 224)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1271, file: !4, line: 1583, baseType: !963, size: 64, align: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1271, file: !4, line: 1591, baseType: !1503, size: 64, align: 64, offset: 320)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1271, file: !4, line: 1598, baseType: !963, size: 64, align: 64, offset: 384)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1271, file: !4, line: 1606, baseType: !1027, size: 64, align: 64, offset: 448)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1271, file: !4, line: 1614, baseType: !992, size: 32, align: 32, offset: 512)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1271, file: !4, line: 1622, baseType: !992, size: 32, align: 32, offset: 544)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1271, file: !4, line: 1628, baseType: !992, size: 32, align: 32, offset: 576)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1271, file: !4, line: 1636, baseType: !992, size: 32, align: 32, offset: 608)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1271, file: !4, line: 1643, baseType: !992, size: 32, align: 32, offset: 640)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1271, file: !4, line: 1657, baseType: !1141, size: 64, align: 64, offset: 704)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1271, file: !4, line: 1658, baseType: !992, size: 32, align: 32, offset: 768)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1271, file: !4, line: 1679, baseType: !1032, size: 64, align: 32, offset: 800)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1271, file: !4, line: 1688, baseType: !992, size: 32, align: 32, offset: 864)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1271, file: !4, line: 1712, baseType: !992, size: 32, align: 32, offset: 896)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1271, file: !4, line: 1729, baseType: !992, size: 32, align: 32, offset: 928)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1271, file: !4, line: 1729, baseType: !992, size: 32, align: 32, offset: 960)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1271, file: !4, line: 1744, baseType: !992, size: 32, align: 32, offset: 992)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1271, file: !4, line: 1744, baseType: !992, size: 32, align: 32, offset: 1024)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1271, file: !4, line: 1751, baseType: !992, size: 32, align: 32, offset: 1056)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1271, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1271, file: !4, line: 1791, baseType: !1524, size: 64, align: 64, offset: 1152)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DISubroutineType(types: !1526)
!1526 = !{null, !1527, !1387, !1469, !992, !992, !992}
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1271, file: !4, line: 1808, baseType: !1529, size: 64, align: 64, offset: 1216)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!555, !1527, !1290}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1271, file: !4, line: 1816, baseType: !992, size: 32, align: 32, offset: 1280)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1271, file: !4, line: 1825, baseType: !1534, size: 32, align: 32, offset: 1312)
!1534 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1271, file: !4, line: 1830, baseType: !992, size: 32, align: 32, offset: 1344)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1271, file: !4, line: 1838, baseType: !1534, size: 32, align: 32, offset: 1376)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1271, file: !4, line: 1846, baseType: !992, size: 32, align: 32, offset: 1408)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1271, file: !4, line: 1851, baseType: !992, size: 32, align: 32, offset: 1440)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1271, file: !4, line: 1861, baseType: !1534, size: 32, align: 32, offset: 1472)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1271, file: !4, line: 1868, baseType: !1534, size: 32, align: 32, offset: 1504)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1271, file: !4, line: 1875, baseType: !1534, size: 32, align: 32, offset: 1536)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1271, file: !4, line: 1882, baseType: !1534, size: 32, align: 32, offset: 1568)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1271, file: !4, line: 1889, baseType: !1534, size: 32, align: 32, offset: 1600)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1271, file: !4, line: 1896, baseType: !1534, size: 32, align: 32, offset: 1632)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1271, file: !4, line: 1903, baseType: !1534, size: 32, align: 32, offset: 1664)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1271, file: !4, line: 1910, baseType: !992, size: 32, align: 32, offset: 1696)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1271, file: !4, line: 1915, baseType: !992, size: 32, align: 32, offset: 1728)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1271, file: !4, line: 1926, baseType: !1469, size: 64, align: 64, offset: 1792)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1271, file: !4, line: 1935, baseType: !1032, size: 64, align: 32, offset: 1856)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1271, file: !4, line: 1942, baseType: !992, size: 32, align: 32, offset: 1920)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1271, file: !4, line: 1948, baseType: !992, size: 32, align: 32, offset: 1952)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1271, file: !4, line: 1954, baseType: !992, size: 32, align: 32, offset: 1984)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1271, file: !4, line: 1960, baseType: !992, size: 32, align: 32, offset: 2016)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1271, file: !4, line: 1984, baseType: !992, size: 32, align: 32, offset: 2048)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1271, file: !4, line: 1991, baseType: !992, size: 32, align: 32, offset: 2080)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1271, file: !4, line: 1996, baseType: !992, size: 32, align: 32, offset: 2112)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1271, file: !4, line: 2004, baseType: !992, size: 32, align: 32, offset: 2144)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1271, file: !4, line: 2011, baseType: !992, size: 32, align: 32, offset: 2176)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1271, file: !4, line: 2018, baseType: !992, size: 32, align: 32, offset: 2208)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1271, file: !4, line: 2027, baseType: !992, size: 32, align: 32, offset: 2240)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1271, file: !4, line: 2034, baseType: !992, size: 32, align: 32, offset: 2272)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1271, file: !4, line: 2044, baseType: !992, size: 32, align: 32, offset: 2304)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1271, file: !4, line: 2054, baseType: !1564, size: 64, align: 64, offset: 2368)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1271, file: !4, line: 2061, baseType: !1564, size: 64, align: 64, offset: 2432)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1271, file: !4, line: 2066, baseType: !992, size: 32, align: 32, offset: 2496)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1271, file: !4, line: 2070, baseType: !992, size: 32, align: 32, offset: 2528)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1271, file: !4, line: 2078, baseType: !992, size: 32, align: 32, offset: 2560)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1271, file: !4, line: 2085, baseType: !992, size: 32, align: 32, offset: 2592)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1271, file: !4, line: 2092, baseType: !992, size: 32, align: 32, offset: 2624)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1271, file: !4, line: 2099, baseType: !992, size: 32, align: 32, offset: 2656)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1271, file: !4, line: 2106, baseType: !992, size: 32, align: 32, offset: 2688)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1271, file: !4, line: 2113, baseType: !992, size: 32, align: 32, offset: 2720)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1271, file: !4, line: 2120, baseType: !992, size: 32, align: 32, offset: 2752)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1271, file: !4, line: 2125, baseType: !992, size: 32, align: 32, offset: 2784)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1271, file: !4, line: 2133, baseType: !992, size: 32, align: 32, offset: 2816)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1271, file: !4, line: 2140, baseType: !992, size: 32, align: 32, offset: 2848)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1271, file: !4, line: 2145, baseType: !992, size: 32, align: 32, offset: 2880)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1271, file: !4, line: 2153, baseType: !992, size: 32, align: 32, offset: 2912)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1271, file: !4, line: 2158, baseType: !992, size: 32, align: 32, offset: 2944)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1271, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1271, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1271, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1271, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1271, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1271, file: !4, line: 2203, baseType: !992, size: 32, align: 32, offset: 3136)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1271, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1271, file: !4, line: 2212, baseType: !992, size: 32, align: 32, offset: 3200)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1271, file: !4, line: 2213, baseType: !992, size: 32, align: 32, offset: 3232)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1271, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1271, file: !4, line: 2232, baseType: !992, size: 32, align: 32, offset: 3296)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1271, file: !4, line: 2243, baseType: !992, size: 32, align: 32, offset: 3328)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1271, file: !4, line: 2249, baseType: !992, size: 32, align: 32, offset: 3360)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1271, file: !4, line: 2256, baseType: !992, size: 32, align: 32, offset: 3392)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1271, file: !4, line: 2263, baseType: !1301, size: 64, align: 64, offset: 3456)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1271, file: !4, line: 2270, baseType: !1301, size: 64, align: 64, offset: 3520)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1271, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1271, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1271, file: !4, line: 2367, baseType: !1600, size: 64, align: 64, offset: 3648)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!992, !1527, !1487, !992}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1271, file: !4, line: 2383, baseType: !992, size: 32, align: 32, offset: 3712)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1271, file: !4, line: 2386, baseType: !1534, size: 32, align: 32, offset: 3744)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1271, file: !4, line: 2387, baseType: !1534, size: 32, align: 32, offset: 3776)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1271, file: !4, line: 2394, baseType: !992, size: 32, align: 32, offset: 3808)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1271, file: !4, line: 2401, baseType: !992, size: 32, align: 32, offset: 3840)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1271, file: !4, line: 2408, baseType: !992, size: 32, align: 32, offset: 3872)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1271, file: !4, line: 2415, baseType: !992, size: 32, align: 32, offset: 3904)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1271, file: !4, line: 2422, baseType: !992, size: 32, align: 32, offset: 3936)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1271, file: !4, line: 2423, baseType: !1612, size: 64, align: 64, offset: 3968)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1614)
!1614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1615)
!1615 = !{!1616, !1617, !1618, !1619}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1614, file: !4, line: 827, baseType: !992, size: 32, align: 32)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1614, file: !4, line: 828, baseType: !992, size: 32, align: 32, offset: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1614, file: !4, line: 829, baseType: !992, size: 32, align: 32, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1614, file: !4, line: 830, baseType: !1534, size: 32, align: 32, offset: 96)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1271, file: !4, line: 2430, baseType: !1027, size: 64, align: 64, offset: 4032)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1271, file: !4, line: 2437, baseType: !1027, size: 64, align: 64, offset: 4096)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1271, file: !4, line: 2444, baseType: !1534, size: 32, align: 32, offset: 4160)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1271, file: !4, line: 2451, baseType: !1534, size: 32, align: 32, offset: 4192)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1271, file: !4, line: 2458, baseType: !992, size: 32, align: 32, offset: 4224)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1271, file: !4, line: 2469, baseType: !992, size: 32, align: 32, offset: 4256)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1271, file: !4, line: 2475, baseType: !992, size: 32, align: 32, offset: 4288)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1271, file: !4, line: 2481, baseType: !992, size: 32, align: 32, offset: 4320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1271, file: !4, line: 2485, baseType: !992, size: 32, align: 32, offset: 4352)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1271, file: !4, line: 2489, baseType: !992, size: 32, align: 32, offset: 4384)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1271, file: !4, line: 2493, baseType: !992, size: 32, align: 32, offset: 4416)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1271, file: !4, line: 2501, baseType: !992, size: 32, align: 32, offset: 4448)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1271, file: !4, line: 2506, baseType: !992, size: 32, align: 32, offset: 4480)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1271, file: !4, line: 2510, baseType: !992, size: 32, align: 32, offset: 4512)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1271, file: !4, line: 2514, baseType: !1027, size: 64, align: 64, offset: 4544)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1271, file: !4, line: 2528, baseType: !1636, size: 64, align: 64, offset: 4608)
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{null, !1527, !963, !992, !992}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1271, file: !4, line: 2534, baseType: !992, size: 32, align: 32, offset: 4672)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1271, file: !4, line: 2545, baseType: !992, size: 32, align: 32, offset: 4704)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1271, file: !4, line: 2547, baseType: !992, size: 32, align: 32, offset: 4736)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1271, file: !4, line: 2549, baseType: !992, size: 32, align: 32, offset: 4768)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1271, file: !4, line: 2551, baseType: !992, size: 32, align: 32, offset: 4800)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1271, file: !4, line: 2553, baseType: !992, size: 32, align: 32, offset: 4832)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1271, file: !4, line: 2555, baseType: !992, size: 32, align: 32, offset: 4864)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1271, file: !4, line: 2557, baseType: !992, size: 32, align: 32, offset: 4896)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1271, file: !4, line: 2559, baseType: !992, size: 32, align: 32, offset: 4928)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1271, file: !4, line: 2563, baseType: !992, size: 32, align: 32, offset: 4960)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1271, file: !4, line: 2571, baseType: !1379, size: 64, align: 64, offset: 4992)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1271, file: !4, line: 2579, baseType: !1379, size: 64, align: 64, offset: 5056)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1271, file: !4, line: 2586, baseType: !992, size: 32, align: 32, offset: 5120)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1271, file: !4, line: 2615, baseType: !992, size: 32, align: 32, offset: 5152)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1271, file: !4, line: 2627, baseType: !992, size: 32, align: 32, offset: 5184)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1271, file: !4, line: 2637, baseType: !992, size: 32, align: 32, offset: 5216)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1271, file: !4, line: 2681, baseType: !992, size: 32, align: 32, offset: 5248)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1271, file: !4, line: 2709, baseType: !1027, size: 64, align: 64, offset: 5312)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1271, file: !4, line: 2716, baseType: !1658, size: 64, align: 64, offset: 5376)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1660)
!1660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1661)
!1661 = !{!1662, !1663, !1664, !1665, !1666, !1667, !1668, !1672, !1676, !1677, !1678, !1679, !1685, !1686, !1687, !1688, !1689}
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1660, file: !4, line: 3642, baseType: !982, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1660, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1660, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1660, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1660, file: !4, line: 3669, baseType: !992, size: 32, align: 32, offset: 160)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1660, file: !4, line: 3682, baseType: !1484, size: 64, align: 64, offset: 192)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1660, file: !4, line: 3698, baseType: !1669, size: 64, align: 64, offset: 256)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!992, !1269, !1223, !973}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1660, file: !4, line: 3712, baseType: !1673, size: 64, align: 64, offset: 320)
!1673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1674, size: 64, align: 64)
!1674 = !DISubroutineType(types: !1675)
!1675 = !{!992, !1269, !992, !1223, !973}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1660, file: !4, line: 3726, baseType: !1669, size: 64, align: 64, offset: 384)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1660, file: !4, line: 3737, baseType: !1317, size: 64, align: 64, offset: 448)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1660, file: !4, line: 3746, baseType: !992, size: 32, align: 32, offset: 512)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1660, file: !4, line: 3757, baseType: !1680, size: 64, align: 64, offset: 576)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{null, !1683}
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1684, size: 64, align: 64)
!1684 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1660, file: !4, line: 3766, baseType: !1317, size: 64, align: 64, offset: 640)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1660, file: !4, line: 3774, baseType: !1317, size: 64, align: 64, offset: 704)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1660, file: !4, line: 3780, baseType: !992, size: 32, align: 32, offset: 768)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1660, file: !4, line: 3785, baseType: !992, size: 32, align: 32, offset: 800)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1660, file: !4, line: 3795, baseType: !1690, size: 64, align: 64, offset: 832)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!992, !1269, !1131}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1271, file: !4, line: 2728, baseType: !963, size: 64, align: 64, offset: 5440)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1271, file: !4, line: 2735, baseType: !1411, size: 512, align: 64, offset: 5504)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1271, file: !4, line: 2742, baseType: !992, size: 32, align: 32, offset: 6016)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1271, file: !4, line: 2755, baseType: !992, size: 32, align: 32, offset: 6048)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1271, file: !4, line: 2776, baseType: !992, size: 32, align: 32, offset: 6080)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1271, file: !4, line: 2783, baseType: !992, size: 32, align: 32, offset: 6112)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1271, file: !4, line: 2791, baseType: !992, size: 32, align: 32, offset: 6144)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1271, file: !4, line: 2802, baseType: !1487, size: 64, align: 64, offset: 6208)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1271, file: !4, line: 2811, baseType: !992, size: 32, align: 32, offset: 6272)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1271, file: !4, line: 2821, baseType: !992, size: 32, align: 32, offset: 6304)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1271, file: !4, line: 2830, baseType: !992, size: 32, align: 32, offset: 6336)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1271, file: !4, line: 2840, baseType: !992, size: 32, align: 32, offset: 6368)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1271, file: !4, line: 2851, baseType: !1706, size: 64, align: 64, offset: 6400)
!1706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1707, size: 64, align: 64)
!1707 = !DISubroutineType(types: !1708)
!1708 = !{!992, !1527, !1709, !963, !1469, !992, !992}
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!992, !1527, !963}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1271, file: !4, line: 2871, baseType: !1713, size: 64, align: 64, offset: 6464)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{!992, !1527, !1716, !963, !1469, !992}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!992, !1527, !963, !992, !992}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1271, file: !4, line: 2878, baseType: !992, size: 32, align: 32, offset: 6528)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1271, file: !4, line: 2885, baseType: !992, size: 32, align: 32, offset: 6560)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1271, file: !4, line: 3005, baseType: !992, size: 32, align: 32, offset: 6592)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1271, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1271, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1271, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1271, file: !4, line: 3037, baseType: !1141, size: 64, align: 64, offset: 6720)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1271, file: !4, line: 3038, baseType: !992, size: 32, align: 32, offset: 6784)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1271, file: !4, line: 3050, baseType: !1301, size: 64, align: 64, offset: 6848)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1271, file: !4, line: 3065, baseType: !992, size: 32, align: 32, offset: 6912)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1271, file: !4, line: 3083, baseType: !992, size: 32, align: 32, offset: 6944)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1271, file: !4, line: 3092, baseType: !1032, size: 64, align: 32, offset: 6976)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1271, file: !4, line: 3099, baseType: !555, size: 32, align: 32, offset: 7040)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1271, file: !4, line: 3106, baseType: !1032, size: 64, align: 32, offset: 7072)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1271, file: !4, line: 3113, baseType: !1734, size: 64, align: 64, offset: 7168)
