; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--avdct.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--avdct.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVDCT = type { %struct.AVClass*, void (i16*)*, [64 x i8], void (i16*)*, i32, i32, void (i16*, i8*, i64)*, i32 }

!845 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!846 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!847 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!848 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!849 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!850 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !517, line: 493, size: 32, align: 32, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!853 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!854 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!855 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!856 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!857 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!858 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!859 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!860 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!861 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!862 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!863 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!864 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!865 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!866 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!867 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!868 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!869 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !517, line: 538, size: 32, align: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879}
!872 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!873 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!874 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !910, line: 37, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917}
!912 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!913 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!914 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!915 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!916 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!917 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!918 = !{!919, !1006}
!919 = distinct !DIGlobalVariable(name: "avdct_class", scope: !0, file: !920, line: 64, type: !921, isLocal: true, isDefinition: true, variable: %struct.AVClass* @avdct_class)
!920 = !DIFile(filename: "libavcodec/avdct.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !924)
!924 = !{!925, !929, !934, !965, !966, !967, !968, !972, !978, !980, !984}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !923, file: !26, line: 72, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !923, file: !26, line: 78, baseType: !930, size: 64, align: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!926, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !923, file: !26, line: 85, baseType: !935, size: 64, align: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !938)
!938 = !{!939, !940, !941, !943, !944, !961, !962, !963, !964}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !937, file: !4, line: 247, baseType: !926, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !937, file: !4, line: 253, baseType: !926, size: 64, align: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !937, file: !4, line: 259, baseType: !942, size: 32, align: 32, offset: 128)
!942 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !937, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !937, file: !4, line: 271, baseType: !945, size: 64, align: 64, offset: 192)
!945 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !937, file: !4, line: 265, size: 64, align: 64, elements: !946)
!946 = !{!947, !951, !953, !954}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !945, file: !4, line: 266, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !949, line: 40, baseType: !950)
!949 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !945, file: !4, line: 267, baseType: !952, size: 64, align: 64)
!952 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !945, file: !4, line: 268, baseType: !926, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !945, file: !4, line: 270, baseType: !955, size: 64, align: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !956, line: 61, baseType: !957)
!956 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !956, line: 58, size: 64, align: 32, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !957, file: !956, line: 59, baseType: !942, size: 32, align: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !957, file: !956, line: 60, baseType: !942, size: 32, align: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !937, file: !4, line: 272, baseType: !952, size: 64, align: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !937, file: !4, line: 273, baseType: !952, size: 64, align: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !4, line: 275, baseType: !942, size: 32, align: 32, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !937, file: !4, line: 300, baseType: !926, size: 64, align: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !923, file: !26, line: 93, baseType: !942, size: 32, align: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !923, file: !26, line: 99, baseType: !942, size: 32, align: 32, offset: 224)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !923, file: !26, line: 108, baseType: !942, size: 32, align: 32, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !923, file: !26, line: 113, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!933, !933, !933}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !923, file: !26, line: 123, baseType: !973, size: 64, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !923, file: !26, line: 130, baseType: !979, size: 32, align: 32, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !923, file: !26, line: 136, baseType: !981, size: 64, align: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!979, !933}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !923, file: !26, line: 142, baseType: !985, size: 64, align: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!942, !988, !933, !926, !942}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !991)
!991 = !{!992, !1004, !1005}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !990, file: !4, line: 360, baseType: !993, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1003}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !996, file: !4, line: 307, baseType: !926, size: 64, align: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !996, file: !4, line: 313, baseType: !952, size: 64, align: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !996, file: !4, line: 313, baseType: !952, size: 64, align: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !996, file: !4, line: 318, baseType: !952, size: 64, align: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !996, file: !4, line: 318, baseType: !952, size: 64, align: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !996, file: !4, line: 323, baseType: !942, size: 32, align: 32, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !990, file: !4, line: 364, baseType: !942, size: 32, align: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !990, file: !4, line: 368, baseType: !942, size: 32, align: 32, offset: 96)
!1006 = distinct !DIGlobalVariable(name: "avdct_options", scope: !0, file: !920, line: 35, type: !1007, isLocal: true, isDefinition: true, variable: [24 x %struct.AVOption]* @avdct_options)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 12288, align: 64, elements: !1010)
!1008 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !937)
!1010 = !{!1011}
!1011 = !DISubrange(count: 24)
!1012 = !{i32 2, !"Dwarf Version", i32 4}
!1013 = !{i32 2, !"Debug Info Version", i32 3}
!1014 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1015 = distinct !DISubprogram(name: "avcodec_dct_get_class", scope: !920, file: !920, line: 70, type: !1016, isLocal: false, isDefinition: true, scopeLine: 71, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1019)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1018}
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1019 = !{}
!1020 = !DILocation(line: 72, column: 5, scope: !1015)
!1021 = distinct !DISubprogram(name: "avcodec_dct_alloc", scope: !920, file: !920, line: 75, type: !1022, isLocal: false, isDefinition: true, scopeLine: 76, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1019)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDCT", file: !1026, line: 70, baseType: !1027)
!1026 = !DIFile(filename: "libavcodec/avdct.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVDCT", file: !1026, line: 29, size: 896, align: 64, elements: !1028)
!1028 = !{!1029, !1030, !1037, !1043, !1044, !1045, !1046, !1054}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1027, file: !1026, line: 30, baseType: !1018, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !1027, file: !1026, line: 32, baseType: !1031, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{null, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !949, line: 37, baseType: !1036)
!1036 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !1027, file: !1026, line: 48, baseType: !1038, size: 512, align: 8, offset: 128)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 512, align: 8, elements: !1041)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !949, line: 48, baseType: !1040)
!1040 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1041 = !{!1042}
!1042 = !DISubrange(count: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !1027, file: !1026, line: 50, baseType: !1031, size: 64, align: 64, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1027, file: !1026, line: 57, baseType: !942, size: 32, align: 32, offset: 704)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1027, file: !1026, line: 63, baseType: !942, size: 32, align: 32, offset: 736)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixels", scope: !1027, file: !1026, line: 65, baseType: !1047, size: 64, align: 64, offset: 768)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{null, !1034, !1050, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1053, line: 149, baseType: !950)
!1053 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_sample", scope: !1027, file: !1026, line: 69, baseType: !942, size: 32, align: 32, offset: 832)
!1055 = !DILocalVariable(name: "dsp", scope: !1021, file: !920, line: 77, type: !1024)
!1056 = !DIExpression()
!1057 = !DILocation(line: 77, column: 12, scope: !1021)
!1058 = !DILocation(line: 77, column: 18, scope: !1021)
!1059 = !DILocation(line: 79, column: 10, scope: !1060)
!1060 = distinct !DILexicalBlock(scope: !1021, file: !920, line: 79, column: 9)
!1061 = !DILocation(line: 79, column: 9, scope: !1021)
!1062 = !DILocation(line: 80, column: 9, scope: !1060)
!1063 = !DILocation(line: 82, column: 5, scope: !1021)
!1064 = !DILocation(line: 82, column: 10, scope: !1021)
!1065 = !DILocation(line: 82, column: 19, scope: !1021)
!1066 = !DILocation(line: 83, column: 25, scope: !1021)
!1067 = !DILocation(line: 83, column: 5, scope: !1021)
!1068 = !DILocation(line: 85, column: 12, scope: !1021)
!1069 = !DILocation(line: 85, column: 5, scope: !1021)
!1070 = !DILocation(line: 86, column: 1, scope: !1021)
!1071 = distinct !DISubprogram(name: "avcodec_dct_init", scope: !920, file: !920, line: 88, type: !1072, isLocal: false, isDefinition: true, scopeLine: 89, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1019)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!942, !1024}
!1074 = !DILocalVariable(name: "dsp", arg: 1, scope: !1071, file: !920, line: 88, type: !1024)
!1075 = !DILocation(line: 88, column: 29, scope: !1071)
!1076 = !DILocalVariable(name: "avctx", scope: !1071, file: !920, line: 90, type: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1344, !1345, !1346, !1347, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1373, !1377, !1378, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1557, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1079, file: !57, line: 1561, baseType: !1018, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1079, file: !57, line: 1562, baseType: !942, size: 32, align: 32, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1079, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1079, file: !57, line: 1565, baseType: !1085, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1097, !1100, !1103, !1106, !1111, !1112, !1113, !1121, !1122, !1123, !1125, !1129, !1135, !1140, !1144, !1145, !1195, !1315, !1319, !1320, !1324, !1328, !1333, !1337, !1338, !1339}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !57, line: 3475, baseType: !926, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1087, file: !57, line: 3480, baseType: !926, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1087, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1087, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1087, file: !57, line: 3487, baseType: !942, size: 32, align: 32, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1087, file: !57, line: 3488, baseType: !1095, size: 64, align: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1087, file: !57, line: 3489, baseType: !1098, size: 64, align: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1087, file: !57, line: 3490, baseType: !1101, size: 64, align: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1087, file: !57, line: 3491, baseType: !1104, size: 64, align: 64, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1087, file: !57, line: 3492, baseType: !1107, size: 64, align: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !949, line: 55, baseType: !1110)
!1110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1087, file: !57, line: 3493, baseType: !1039, size: 8, align: 8, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1087, file: !57, line: 3494, baseType: !1018, size: 64, align: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1087, file: !57, line: 3495, baseType: !1114, size: 64, align: 64, offset: 704)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1117, file: !57, line: 3402, baseType: !942, size: 32, align: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1117, file: !57, line: 3403, baseType: !926, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1087, file: !57, line: 3507, baseType: !926, size: 64, align: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1087, file: !57, line: 3516, baseType: !942, size: 32, align: 32, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1087, file: !57, line: 3517, baseType: !1124, size: 64, align: 64, offset: 896)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1087, file: !57, line: 3527, baseType: !1126, size: 64, align: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!942, !1077}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1087, file: !57, line: 3535, baseType: !1130, size: 64, align: 64, offset: 1024)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!942, !1077, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1087, file: !57, line: 3541, baseType: !1136, size: 64, align: 64, offset: 1088)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1139)
!1139 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !57, line: 3461, flags: DIFlagFwdDecl)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1087, file: !57, line: 3549, baseType: !1141, size: 64, align: 64, offset: 1152)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !1124}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1087, file: !57, line: 3551, baseType: !1126, size: 64, align: 64, offset: 1216)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1087, file: !57, line: 3552, baseType: !1146, size: 64, align: 64, offset: 1280)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{!942, !1077, !1149, !942, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1153)
!1153 = !{!1154, !1157, !1160, !1161, !1162, !1194}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1152, file: !57, line: 3921, baseType: !1155, size: 16, align: 16)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !949, line: 49, baseType: !1156)
!1156 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1152, file: !57, line: 3922, baseType: !1158, size: 32, align: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !949, line: 51, baseType: !1159)
!1159 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1152, file: !57, line: 3923, baseType: !1158, size: 32, align: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1152, file: !57, line: 3924, baseType: !1159, size: 32, align: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1152, file: !57, line: 3925, baseType: !1163, size: 64, align: 64, offset: 128)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1183, !1187, !1189, !1190, !1192, !1193}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1166, file: !57, line: 3886, baseType: !942, size: 32, align: 32)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1166, file: !57, line: 3887, baseType: !942, size: 32, align: 32, offset: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1166, file: !57, line: 3888, baseType: !942, size: 32, align: 32, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1166, file: !57, line: 3889, baseType: !942, size: 32, align: 32, offset: 96)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1166, file: !57, line: 3890, baseType: !942, size: 32, align: 32, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1166, file: !57, line: 3897, baseType: !1174, size: 768, align: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1176)
!1176 = !{!1177, !1181}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1175, file: !57, line: 3855, baseType: !1178, size: 512, align: 64)
!1178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 512, align: 64, elements: !1179)
!1179 = !{!1180}
!1180 = !DISubrange(count: 8)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1175, file: !57, line: 3857, baseType: !1182, size: 256, align: 32, offset: 512)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 256, align: 32, elements: !1179)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1166, file: !57, line: 3903, baseType: !1184, size: 256, align: 64, offset: 960)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1149, size: 256, align: 64, elements: !1185)
!1185 = !{!1186}
!1186 = !DISubrange(count: 4)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1166, file: !57, line: 3904, baseType: !1188, size: 128, align: 32, offset: 1216)
!1188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !942, size: 128, align: 32, elements: !1185)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1166, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1166, file: !57, line: 3908, baseType: !1191, size: 64, align: 64, offset: 1408)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1166, file: !57, line: 3915, baseType: !1191, size: 64, align: 64, offset: 1472)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1166, file: !57, line: 3917, baseType: !942, size: 32, align: 32, offset: 1536)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1152, file: !57, line: 3926, baseType: !948, size: 64, align: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1087, file: !57, line: 3564, baseType: !1196, size: 64, align: 64, offset: 1344)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64, align: 64)
!1197 = !DISubroutineType(types: !1198)
!1198 = !{!942, !1077, !1199, !1233, !1314}
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1201)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1202)
!1202 = !{!1203, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1229, !1230, !1231, !1232}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1201, file: !57, line: 1451, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1206, line: 94, baseType: !1207)
!1206 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1206, line: 81, size: 192, align: 64, elements: !1208)
!1208 = !{!1209, !1213, !1214}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1207, file: !1206, line: 82, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1206, line: 73, baseType: !1212)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1206, line: 73, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1207, file: !1206, line: 89, baseType: !1149, size: 64, align: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1207, file: !1206, line: 93, baseType: !942, size: 32, align: 32, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1201, file: !57, line: 1461, baseType: !948, size: 64, align: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1201, file: !57, line: 1467, baseType: !948, size: 64, align: 64, offset: 128)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1201, file: !57, line: 1468, baseType: !1149, size: 64, align: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1201, file: !57, line: 1469, baseType: !942, size: 32, align: 32, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1201, file: !57, line: 1470, baseType: !942, size: 32, align: 32, offset: 288)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1201, file: !57, line: 1474, baseType: !942, size: 32, align: 32, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1201, file: !57, line: 1479, baseType: !1222, size: 64, align: 64, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1224)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1225)
!1225 = !{!1226, !1227, !1228}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1224, file: !57, line: 1412, baseType: !1149, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1224, file: !57, line: 1413, baseType: !942, size: 32, align: 32, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1224, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1201, file: !57, line: 1480, baseType: !942, size: 32, align: 32, offset: 448)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1201, file: !57, line: 1486, baseType: !948, size: 64, align: 64, offset: 512)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1201, file: !57, line: 1488, baseType: !948, size: 64, align: 64, offset: 576)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1201, file: !57, line: 1497, baseType: !948, size: 64, align: 64, offset: 640)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1267, !1269, !1270, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1303, !1304, !1305, !1306, !1307, !1308, !1310, !1311, !1312, !1313}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1236, file: !780, line: 282, baseType: !1178, size: 512, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1236, file: !780, line: 299, baseType: !1182, size: 256, align: 32, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1236, file: !780, line: 315, baseType: !1241, size: 64, align: 64, offset: 768)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1236, file: !780, line: 326, baseType: !942, size: 32, align: 32, offset: 832)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1236, file: !780, line: 326, baseType: !942, size: 32, align: 32, offset: 864)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1236, file: !780, line: 334, baseType: !942, size: 32, align: 32, offset: 896)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1236, file: !780, line: 341, baseType: !942, size: 32, align: 32, offset: 928)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1236, file: !780, line: 346, baseType: !942, size: 32, align: 32, offset: 960)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1236, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1236, file: !780, line: 356, baseType: !955, size: 64, align: 32, offset: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1236, file: !780, line: 361, baseType: !948, size: 64, align: 64, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1236, file: !780, line: 369, baseType: !948, size: 64, align: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1236, file: !780, line: 377, baseType: !948, size: 64, align: 64, offset: 1216)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1236, file: !780, line: 382, baseType: !942, size: 32, align: 32, offset: 1280)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1236, file: !780, line: 386, baseType: !942, size: 32, align: 32, offset: 1312)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1236, file: !780, line: 391, baseType: !942, size: 32, align: 32, offset: 1344)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1236, file: !780, line: 396, baseType: !933, size: 64, align: 64, offset: 1408)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1236, file: !780, line: 403, baseType: !1257, size: 512, align: 64, offset: 1472)
!1257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 512, align: 64, elements: !1179)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1236, file: !780, line: 410, baseType: !942, size: 32, align: 32, offset: 1984)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1236, file: !780, line: 415, baseType: !942, size: 32, align: 32, offset: 2016)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1236, file: !780, line: 420, baseType: !942, size: 32, align: 32, offset: 2048)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1236, file: !780, line: 425, baseType: !942, size: 32, align: 32, offset: 2080)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1236, file: !780, line: 435, baseType: !948, size: 64, align: 64, offset: 2112)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1236, file: !780, line: 440, baseType: !942, size: 32, align: 32, offset: 2176)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1236, file: !780, line: 445, baseType: !1109, size: 64, align: 64, offset: 2240)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1236, file: !780, line: 459, baseType: !1266, size: 512, align: 64, offset: 2304)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1204, size: 512, align: 64, elements: !1179)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1236, file: !780, line: 473, baseType: !1268, size: 64, align: 64, offset: 2816)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1236, file: !780, line: 477, baseType: !942, size: 32, align: 32, offset: 2880)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1236, file: !780, line: 479, baseType: !1271, size: 64, align: 64, offset: 2944)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1284}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1274, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1274, file: !780, line: 203, baseType: !1149, size: 64, align: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1274, file: !780, line: 204, baseType: !942, size: 32, align: 32, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1274, file: !780, line: 205, baseType: !1280, size: 64, align: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1282, line: 86, baseType: !1283)
!1282 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1283 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1282, line: 86, flags: DIFlagFwdDecl)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1274, file: !780, line: 206, baseType: !1204, size: 64, align: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1236, file: !780, line: 480, baseType: !942, size: 32, align: 32, offset: 3008)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1236, file: !780, line: 505, baseType: !942, size: 32, align: 32, offset: 3040)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1236, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1236, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1236, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1236, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1236, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1236, file: !780, line: 532, baseType: !948, size: 64, align: 64, offset: 3264)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1236, file: !780, line: 539, baseType: !948, size: 64, align: 64, offset: 3328)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1236, file: !780, line: 547, baseType: !948, size: 64, align: 64, offset: 3392)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1236, file: !780, line: 554, baseType: !1280, size: 64, align: 64, offset: 3456)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1236, file: !780, line: 563, baseType: !942, size: 32, align: 32, offset: 3520)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1236, file: !780, line: 572, baseType: !942, size: 32, align: 32, offset: 3552)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1236, file: !780, line: 581, baseType: !942, size: 32, align: 32, offset: 3584)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1236, file: !780, line: 588, baseType: !1300, size: 64, align: 64, offset: 3648)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !949, line: 36, baseType: !1302)
!1302 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1236, file: !780, line: 593, baseType: !942, size: 32, align: 32, offset: 3712)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1236, file: !780, line: 596, baseType: !942, size: 32, align: 32, offset: 3744)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1236, file: !780, line: 599, baseType: !1204, size: 64, align: 64, offset: 3776)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1236, file: !780, line: 605, baseType: !1204, size: 64, align: 64, offset: 3840)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1236, file: !780, line: 616, baseType: !1204, size: 64, align: 64, offset: 3904)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1236, file: !780, line: 626, baseType: !1309, size: 64, align: 64, offset: 3968)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1053, line: 216, baseType: !1110)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1236, file: !780, line: 627, baseType: !1309, size: 64, align: 64, offset: 4032)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1236, file: !780, line: 628, baseType: !1309, size: 64, align: 64, offset: 4096)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1236, file: !780, line: 629, baseType: !1309, size: 64, align: 64, offset: 4160)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1236, file: !780, line: 645, baseType: !1204, size: 64, align: 64, offset: 4224)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1087, file: !57, line: 3566, baseType: !1316, size: 64, align: 64, offset: 1408)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!942, !1077, !933, !1314, !1199}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1087, file: !57, line: 3567, baseType: !1126, size: 64, align: 64, offset: 1472)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1087, file: !57, line: 3576, baseType: !1321, size: 64, align: 64, offset: 1536)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DISubroutineType(types: !1323)
!1323 = !{!942, !1077, !1233}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1087, file: !57, line: 3577, baseType: !1325, size: 64, align: 64, offset: 1600)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!942, !1077, !1199}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1087, file: !57, line: 3584, baseType: !1329, size: 64, align: 64, offset: 1664)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!942, !1077, !1332}
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1087, file: !57, line: 3589, baseType: !1334, size: 64, align: 64, offset: 1728)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{null, !1077}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1087, file: !57, line: 3594, baseType: !942, size: 32, align: 32, offset: 1792)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1087, file: !57, line: 3600, baseType: !926, size: 64, align: 64, offset: 1856)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1087, file: !57, line: 3609, baseType: !1340, size: 64, align: 64, offset: 1920)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1079, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1079, file: !57, line: 1581, baseType: !1159, size: 32, align: 32, offset: 224)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1079, file: !57, line: 1583, baseType: !933, size: 64, align: 64, offset: 256)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1079, file: !57, line: 1591, baseType: !1348, size: 64, align: 64, offset: 320)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !57, line: 1532, flags: DIFlagFwdDecl)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1079, file: !57, line: 1598, baseType: !933, size: 64, align: 64, offset: 384)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1079, file: !57, line: 1606, baseType: !948, size: 64, align: 64, offset: 448)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1079, file: !57, line: 1614, baseType: !942, size: 32, align: 32, offset: 512)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1079, file: !57, line: 1622, baseType: !942, size: 32, align: 32, offset: 544)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1079, file: !57, line: 1628, baseType: !942, size: 32, align: 32, offset: 576)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1079, file: !57, line: 1636, baseType: !942, size: 32, align: 32, offset: 608)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1079, file: !57, line: 1643, baseType: !942, size: 32, align: 32, offset: 640)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1079, file: !57, line: 1657, baseType: !1149, size: 64, align: 64, offset: 704)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1079, file: !57, line: 1658, baseType: !942, size: 32, align: 32, offset: 768)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1079, file: !57, line: 1679, baseType: !955, size: 64, align: 32, offset: 800)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1079, file: !57, line: 1688, baseType: !942, size: 32, align: 32, offset: 864)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1079, file: !57, line: 1712, baseType: !942, size: 32, align: 32, offset: 896)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1079, file: !57, line: 1729, baseType: !942, size: 32, align: 32, offset: 928)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1079, file: !57, line: 1729, baseType: !942, size: 32, align: 32, offset: 960)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1079, file: !57, line: 1744, baseType: !942, size: 32, align: 32, offset: 992)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1079, file: !57, line: 1744, baseType: !942, size: 32, align: 32, offset: 1024)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1079, file: !57, line: 1751, baseType: !942, size: 32, align: 32, offset: 1056)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1079, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1079, file: !57, line: 1791, baseType: !1369, size: 64, align: 64, offset: 1152)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DISubroutineType(types: !1371)
!1371 = !{null, !1372, !1233, !1314, !942, !942, !942}
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1079, file: !57, line: 1808, baseType: !1374, size: 64, align: 64, offset: 1216)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DISubroutineType(types: !1376)
!1376 = !{!516, !1372, !1098}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1079, file: !57, line: 1816, baseType: !942, size: 32, align: 32, offset: 1280)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1079, file: !57, line: 1825, baseType: !1379, size: 32, align: 32, offset: 1312)
!1379 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1079, file: !57, line: 1830, baseType: !942, size: 32, align: 32, offset: 1344)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1079, file: !57, line: 1838, baseType: !1379, size: 32, align: 32, offset: 1376)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1079, file: !57, line: 1846, baseType: !942, size: 32, align: 32, offset: 1408)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1079, file: !57, line: 1851, baseType: !942, size: 32, align: 32, offset: 1440)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1079, file: !57, line: 1861, baseType: !1379, size: 32, align: 32, offset: 1472)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1079, file: !57, line: 1868, baseType: !1379, size: 32, align: 32, offset: 1504)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1079, file: !57, line: 1875, baseType: !1379, size: 32, align: 32, offset: 1536)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1079, file: !57, line: 1882, baseType: !1379, size: 32, align: 32, offset: 1568)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1079, file: !57, line: 1889, baseType: !1379, size: 32, align: 32, offset: 1600)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1079, file: !57, line: 1896, baseType: !1379, size: 32, align: 32, offset: 1632)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1079, file: !57, line: 1903, baseType: !1379, size: 32, align: 32, offset: 1664)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1079, file: !57, line: 1910, baseType: !942, size: 32, align: 32, offset: 1696)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1079, file: !57, line: 1915, baseType: !942, size: 32, align: 32, offset: 1728)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1079, file: !57, line: 1926, baseType: !1314, size: 64, align: 64, offset: 1792)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1079, file: !57, line: 1935, baseType: !955, size: 64, align: 32, offset: 1856)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1079, file: !57, line: 1942, baseType: !942, size: 32, align: 32, offset: 1920)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1079, file: !57, line: 1948, baseType: !942, size: 32, align: 32, offset: 1952)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1079, file: !57, line: 1954, baseType: !942, size: 32, align: 32, offset: 1984)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1079, file: !57, line: 1960, baseType: !942, size: 32, align: 32, offset: 2016)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1079, file: !57, line: 1984, baseType: !942, size: 32, align: 32, offset: 2048)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1079, file: !57, line: 1991, baseType: !942, size: 32, align: 32, offset: 2080)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1079, file: !57, line: 1996, baseType: !942, size: 32, align: 32, offset: 2112)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1079, file: !57, line: 2004, baseType: !942, size: 32, align: 32, offset: 2144)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1079, file: !57, line: 2011, baseType: !942, size: 32, align: 32, offset: 2176)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1079, file: !57, line: 2018, baseType: !942, size: 32, align: 32, offset: 2208)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1079, file: !57, line: 2027, baseType: !942, size: 32, align: 32, offset: 2240)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1079, file: !57, line: 2034, baseType: !942, size: 32, align: 32, offset: 2272)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1079, file: !57, line: 2044, baseType: !942, size: 32, align: 32, offset: 2304)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1079, file: !57, line: 2054, baseType: !1409, size: 64, align: 64, offset: 2368)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1079, file: !57, line: 2061, baseType: !1409, size: 64, align: 64, offset: 2432)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1079, file: !57, line: 2066, baseType: !942, size: 32, align: 32, offset: 2496)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1079, file: !57, line: 2070, baseType: !942, size: 32, align: 32, offset: 2528)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1079, file: !57, line: 2078, baseType: !942, size: 32, align: 32, offset: 2560)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1079, file: !57, line: 2085, baseType: !942, size: 32, align: 32, offset: 2592)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1079, file: !57, line: 2092, baseType: !942, size: 32, align: 32, offset: 2624)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1079, file: !57, line: 2099, baseType: !942, size: 32, align: 32, offset: 2656)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1079, file: !57, line: 2106, baseType: !942, size: 32, align: 32, offset: 2688)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1079, file: !57, line: 2113, baseType: !942, size: 32, align: 32, offset: 2720)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1079, file: !57, line: 2120, baseType: !942, size: 32, align: 32, offset: 2752)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1079, file: !57, line: 2125, baseType: !942, size: 32, align: 32, offset: 2784)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1079, file: !57, line: 2133, baseType: !942, size: 32, align: 32, offset: 2816)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1079, file: !57, line: 2140, baseType: !942, size: 32, align: 32, offset: 2848)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1079, file: !57, line: 2145, baseType: !942, size: 32, align: 32, offset: 2880)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1079, file: !57, line: 2153, baseType: !942, size: 32, align: 32, offset: 2912)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1079, file: !57, line: 2158, baseType: !942, size: 32, align: 32, offset: 2944)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1079, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1079, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1079, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1079, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1079, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1079, file: !57, line: 2203, baseType: !942, size: 32, align: 32, offset: 3136)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1079, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1079, file: !57, line: 2212, baseType: !942, size: 32, align: 32, offset: 3200)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1079, file: !57, line: 2213, baseType: !942, size: 32, align: 32, offset: 3232)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1079, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1079, file: !57, line: 2232, baseType: !942, size: 32, align: 32, offset: 3296)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1079, file: !57, line: 2243, baseType: !942, size: 32, align: 32, offset: 3328)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1079, file: !57, line: 2249, baseType: !942, size: 32, align: 32, offset: 3360)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1079, file: !57, line: 2256, baseType: !942, size: 32, align: 32, offset: 3392)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1079, file: !57, line: 2263, baseType: !1109, size: 64, align: 64, offset: 3456)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1079, file: !57, line: 2270, baseType: !1109, size: 64, align: 64, offset: 3520)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1079, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1079, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1079, file: !57, line: 2367, baseType: !1445, size: 64, align: 64, offset: 3648)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DISubroutineType(types: !1447)
!1447 = !{!942, !1372, !1332, !942}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1079, file: !57, line: 2383, baseType: !942, size: 32, align: 32, offset: 3712)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1079, file: !57, line: 2386, baseType: !1379, size: 32, align: 32, offset: 3744)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1079, file: !57, line: 2387, baseType: !1379, size: 32, align: 32, offset: 3776)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1079, file: !57, line: 2394, baseType: !942, size: 32, align: 32, offset: 3808)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1079, file: !57, line: 2401, baseType: !942, size: 32, align: 32, offset: 3840)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1079, file: !57, line: 2408, baseType: !942, size: 32, align: 32, offset: 3872)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1079, file: !57, line: 2415, baseType: !942, size: 32, align: 32, offset: 3904)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1079, file: !57, line: 2422, baseType: !942, size: 32, align: 32, offset: 3936)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1079, file: !57, line: 2423, baseType: !1457, size: 64, align: 64, offset: 3968)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1459)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1460)
!1460 = !{!1461, !1462, !1463, !1464}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1459, file: !57, line: 827, baseType: !942, size: 32, align: 32)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1459, file: !57, line: 828, baseType: !942, size: 32, align: 32, offset: 32)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1459, file: !57, line: 829, baseType: !942, size: 32, align: 32, offset: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1459, file: !57, line: 830, baseType: !1379, size: 32, align: 32, offset: 96)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1079, file: !57, line: 2430, baseType: !948, size: 64, align: 64, offset: 4032)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1079, file: !57, line: 2437, baseType: !948, size: 64, align: 64, offset: 4096)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1079, file: !57, line: 2444, baseType: !1379, size: 32, align: 32, offset: 4160)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1079, file: !57, line: 2451, baseType: !1379, size: 32, align: 32, offset: 4192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1079, file: !57, line: 2458, baseType: !942, size: 32, align: 32, offset: 4224)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1079, file: !57, line: 2469, baseType: !942, size: 32, align: 32, offset: 4256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1079, file: !57, line: 2475, baseType: !942, size: 32, align: 32, offset: 4288)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1079, file: !57, line: 2481, baseType: !942, size: 32, align: 32, offset: 4320)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1079, file: !57, line: 2485, baseType: !942, size: 32, align: 32, offset: 4352)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1079, file: !57, line: 2489, baseType: !942, size: 32, align: 32, offset: 4384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1079, file: !57, line: 2493, baseType: !942, size: 32, align: 32, offset: 4416)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1079, file: !57, line: 2501, baseType: !942, size: 32, align: 32, offset: 4448)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1079, file: !57, line: 2506, baseType: !942, size: 32, align: 32, offset: 4480)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1079, file: !57, line: 2510, baseType: !942, size: 32, align: 32, offset: 4512)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1079, file: !57, line: 2514, baseType: !948, size: 64, align: 64, offset: 4544)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1079, file: !57, line: 2528, baseType: !1481, size: 64, align: 64, offset: 4608)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{null, !1372, !933, !942, !942}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1079, file: !57, line: 2534, baseType: !942, size: 32, align: 32, offset: 4672)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1079, file: !57, line: 2545, baseType: !942, size: 32, align: 32, offset: 4704)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1079, file: !57, line: 2547, baseType: !942, size: 32, align: 32, offset: 4736)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1079, file: !57, line: 2549, baseType: !942, size: 32, align: 32, offset: 4768)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1079, file: !57, line: 2551, baseType: !942, size: 32, align: 32, offset: 4800)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1079, file: !57, line: 2553, baseType: !942, size: 32, align: 32, offset: 4832)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1079, file: !57, line: 2555, baseType: !942, size: 32, align: 32, offset: 4864)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1079, file: !57, line: 2557, baseType: !942, size: 32, align: 32, offset: 4896)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1079, file: !57, line: 2559, baseType: !942, size: 32, align: 32, offset: 4928)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1079, file: !57, line: 2563, baseType: !942, size: 32, align: 32, offset: 4960)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1079, file: !57, line: 2571, baseType: !1191, size: 64, align: 64, offset: 4992)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1079, file: !57, line: 2579, baseType: !1191, size: 64, align: 64, offset: 5056)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1079, file: !57, line: 2586, baseType: !942, size: 32, align: 32, offset: 5120)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1079, file: !57, line: 2615, baseType: !942, size: 32, align: 32, offset: 5152)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1079, file: !57, line: 2627, baseType: !942, size: 32, align: 32, offset: 5184)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1079, file: !57, line: 2637, baseType: !942, size: 32, align: 32, offset: 5216)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1079, file: !57, line: 2681, baseType: !942, size: 32, align: 32, offset: 5248)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1079, file: !57, line: 2709, baseType: !948, size: 64, align: 64, offset: 5312)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1079, file: !57, line: 2716, baseType: !1503, size: 64, align: 64, offset: 5376)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1506)
!1506 = !{!1507, !1508, !1509, !1510, !1511, !1512, !1513, !1517, !1521, !1522, !1523, !1524, !1530, !1531, !1532, !1533, !1534}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1505, file: !57, line: 3642, baseType: !926, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1505, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1505, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1505, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1505, file: !57, line: 3669, baseType: !942, size: 32, align: 32, offset: 160)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1505, file: !57, line: 3682, baseType: !1329, size: 64, align: 64, offset: 192)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1505, file: !57, line: 3698, baseType: !1514, size: 64, align: 64, offset: 256)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!942, !1077, !1050, !1158}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1505, file: !57, line: 3712, baseType: !1518, size: 64, align: 64, offset: 320)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!942, !1077, !942, !1050, !1158}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1505, file: !57, line: 3726, baseType: !1514, size: 64, align: 64, offset: 384)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1505, file: !57, line: 3737, baseType: !1126, size: 64, align: 64, offset: 448)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1505, file: !57, line: 3746, baseType: !942, size: 32, align: 32, offset: 512)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1505, file: !57, line: 3757, baseType: !1525, size: 64, align: 64, offset: 576)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DISubroutineType(types: !1527)
!1527 = !{null, !1528}
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1505, file: !57, line: 3766, baseType: !1126, size: 64, align: 64, offset: 640)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1505, file: !57, line: 3774, baseType: !1126, size: 64, align: 64, offset: 704)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1505, file: !57, line: 3780, baseType: !942, size: 32, align: 32, offset: 768)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1505, file: !57, line: 3785, baseType: !942, size: 32, align: 32, offset: 800)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1505, file: !57, line: 3795, baseType: !1535, size: 64, align: 64, offset: 832)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{!942, !1077, !1204}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1079, file: !57, line: 2728, baseType: !933, size: 64, align: 64, offset: 5440)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1079, file: !57, line: 2735, baseType: !1257, size: 512, align: 64, offset: 5504)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1079, file: !57, line: 2742, baseType: !942, size: 32, align: 32, offset: 6016)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1079, file: !57, line: 2755, baseType: !942, size: 32, align: 32, offset: 6048)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1079, file: !57, line: 2776, baseType: !942, size: 32, align: 32, offset: 6080)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1079, file: !57, line: 2783, baseType: !942, size: 32, align: 32, offset: 6112)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1079, file: !57, line: 2791, baseType: !942, size: 32, align: 32, offset: 6144)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1079, file: !57, line: 2802, baseType: !1332, size: 64, align: 64, offset: 6208)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1079, file: !57, line: 2811, baseType: !942, size: 32, align: 32, offset: 6272)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1079, file: !57, line: 2821, baseType: !942, size: 32, align: 32, offset: 6304)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1079, file: !57, line: 2830, baseType: !942, size: 32, align: 32, offset: 6336)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1079, file: !57, line: 2840, baseType: !942, size: 32, align: 32, offset: 6368)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1079, file: !57, line: 2851, baseType: !1551, size: 64, align: 64, offset: 6400)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!942, !1372, !1554, !933, !1314, !942, !942}
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DISubroutineType(types: !1556)
!1556 = !{!942, !1372, !933}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1079, file: !57, line: 2871, baseType: !1558, size: 64, align: 64, offset: 6464)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!942, !1372, !1561, !933, !1314, !942}
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DISubroutineType(types: !1563)
!1563 = !{!942, !1372, !933, !942, !942}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1079, file: !57, line: 2878, baseType: !942, size: 32, align: 32, offset: 6528)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1079, file: !57, line: 2885, baseType: !942, size: 32, align: 32, offset: 6560)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1079, file: !57, line: 3005, baseType: !942, size: 32, align: 32, offset: 6592)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1079, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1079, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1079, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1079, file: !57, line: 3037, baseType: !1149, size: 64, align: 64, offset: 6720)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1079, file: !57, line: 3038, baseType: !942, size: 32, align: 32, offset: 6784)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1079, file: !57, line: 3050, baseType: !1109, size: 64, align: 64, offset: 6848)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1079, file: !57, line: 3065, baseType: !942, size: 32, align: 32, offset: 6912)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1079, file: !57, line: 3083, baseType: !942, size: 32, align: 32, offset: 6944)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1079, file: !57, line: 3092, baseType: !955, size: 64, align: 32, offset: 6976)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1079, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1079, file: !57, line: 3106, baseType: !955, size: 64, align: 32, offset: 7072)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1079, file: !57, line: 3113, baseType: !1579, size: 64, align: 64, offset: 7168)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1581)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1583)
!1583 = !{!1584, !1585, !1586, !1587, !1588, !1589, !1592}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1582, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1582, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1582, file: !57, line: 720, baseType: !926, size: 64, align: 64, offset: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1582, file: !57, line: 724, baseType: !926, size: 64, align: 64, offset: 128)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1582, file: !57, line: 728, baseType: !942, size: 32, align: 32, offset: 192)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1582, file: !57, line: 734, baseType: !1590, size: 64, align: 64, offset: 256)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !926)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1582, file: !57, line: 739, baseType: !1593, size: 64, align: 64, offset: 320)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1079, file: !57, line: 3129, baseType: !948, size: 64, align: 64, offset: 7232)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1079, file: !57, line: 3130, baseType: !948, size: 64, align: 64, offset: 7296)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1079, file: !57, line: 3131, baseType: !948, size: 64, align: 64, offset: 7360)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1079, file: !57, line: 3132, baseType: !948, size: 64, align: 64, offset: 7424)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1079, file: !57, line: 3139, baseType: !1191, size: 64, align: 64, offset: 7488)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1079, file: !57, line: 3147, baseType: !942, size: 32, align: 32, offset: 7552)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1079, file: !57, line: 3165, baseType: !942, size: 32, align: 32, offset: 7584)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1079, file: !57, line: 3172, baseType: !942, size: 32, align: 32, offset: 7616)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1079, file: !57, line: 3180, baseType: !942, size: 32, align: 32, offset: 7648)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1079, file: !57, line: 3191, baseType: !1409, size: 64, align: 64, offset: 7680)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1079, file: !57, line: 3199, baseType: !1149, size: 64, align: 64, offset: 7744)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1079, file: !57, line: 3207, baseType: !1191, size: 64, align: 64, offset: 7808)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1079, file: !57, line: 3214, baseType: !1159, size: 32, align: 32, offset: 7872)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1079, file: !57, line: 3224, baseType: !1222, size: 64, align: 64, offset: 7936)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1079, file: !57, line: 3225, baseType: !942, size: 32, align: 32, offset: 8000)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1079, file: !57, line: 3249, baseType: !1204, size: 64, align: 64, offset: 8064)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1079, file: !57, line: 3256, baseType: !942, size: 32, align: 32, offset: 8128)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1079, file: !57, line: 3271, baseType: !942, size: 32, align: 32, offset: 8160)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1079, file: !57, line: 3279, baseType: !948, size: 64, align: 64, offset: 8192)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1079, file: !57, line: 3301, baseType: !1204, size: 64, align: 64, offset: 8256)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1079, file: !57, line: 3310, baseType: !942, size: 32, align: 32, offset: 8320)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1079, file: !57, line: 3337, baseType: !942, size: 32, align: 32, offset: 8352)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1079, file: !57, line: 3351, baseType: !942, size: 32, align: 32, offset: 8384)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1079, file: !57, line: 3359, baseType: !942, size: 32, align: 32, offset: 8416)
!1619 = !DILocation(line: 90, column: 21, scope: !1071)
!1620 = !DILocation(line: 90, column: 29, scope: !1071)
!1621 = !DILocation(line: 92, column: 10, scope: !1622)
!1622 = distinct !DILexicalBlock(scope: !1071, file: !920, line: 92, column: 9)
!1623 = !DILocation(line: 92, column: 9, scope: !1071)
!1624 = !DILocation(line: 93, column: 9, scope: !1622)
!1625 = !DILocation(line: 95, column: 24, scope: !1071)
!1626 = !DILocation(line: 95, column: 29, scope: !1071)
!1627 = !DILocation(line: 95, column: 5, scope: !1071)
!1628 = !DILocation(line: 95, column: 12, scope: !1071)
!1629 = !DILocation(line: 95, column: 22, scope: !1071)
!1630 = !DILocation(line: 96, column: 23, scope: !1071)
!1631 = !DILocation(line: 96, column: 28, scope: !1071)
!1632 = !DILocation(line: 96, column: 5, scope: !1071)
!1633 = !DILocation(line: 96, column: 12, scope: !1071)
!1634 = !DILocation(line: 96, column: 21, scope: !1071)
!1635 = !DILocation(line: 97, column: 34, scope: !1071)
!1636 = !DILocation(line: 97, column: 39, scope: !1071)
!1637 = !DILocation(line: 97, column: 5, scope: !1071)
!1638 = !DILocation(line: 97, column: 12, scope: !1071)
!1639 = !DILocation(line: 97, column: 32, scope: !1071)
!1640 = !DILocalVariable(name: "idsp", scope: !1641, file: !920, line: 103, type: !1642)
!1641 = distinct !DILexicalBlock(scope: !1071, file: !920, line: 102, column: 5)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDCTDSPContext", file: !910, line: 100, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDCTDSPContext", file: !910, line: 53, size: 960, align: 64, elements: !1644)
!1644 = !{!1645, !1652, !1653, !1654, !1655, !1659, !1660, !1661, !1662}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_clamped", scope: !1643, file: !910, line: 55, baseType: !1646, size: 64, align: 64)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{null, !1649, !1651, !1052}
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64, align: 64)
!1650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1651 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1149)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_pixels_clamped", scope: !1643, file: !910, line: 58, baseType: !1646, size: 64, align: 64, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixels_clamped", scope: !1643, file: !910, line: 61, baseType: !1646, size: 64, align: 64, offset: 128)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !1643, file: !910, line: 65, baseType: !1031, size: 64, align: 64, offset: 192)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !1643, file: !910, line: 72, baseType: !1656, size: 64, align: 64, offset: 256)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
!1657 = !DISubroutineType(types: !1658)
!1658 = !{null, !1149, !1052, !1034}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !1643, file: !910, line: 79, baseType: !1656, size: 64, align: 64, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !1643, file: !910, line: 96, baseType: !1038, size: 512, align: 8, offset: 384)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "perm_type", scope: !1643, file: !910, line: 97, baseType: !909, size: 32, align: 32, offset: 896)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg4_studio_profile", scope: !1643, file: !910, line: 99, baseType: !942, size: 32, align: 32, offset: 928)
!1663 = !DILocation(line: 103, column: 24, scope: !1641)
!1664 = !DILocation(line: 104, column: 32, scope: !1641)
!1665 = !DILocation(line: 104, column: 9, scope: !1641)
!1666 = !DILocation(line: 105, column: 17, scope: !1641)
!1667 = !DILocation(line: 105, column: 22, scope: !1641)
!1668 = !DILocation(line: 105, column: 9, scope: !1641)
!1669 = !DILocation(line: 105, column: 34, scope: !1641)
!1670 = !DILocation(line: 106, column: 17, scope: !1641)
!1671 = !DILocation(line: 106, column: 22, scope: !1641)
!1672 = !DILocation(line: 106, column: 9, scope: !1641)
!1673 = !DILocation(line: 106, column: 46, scope: !1641)
!1674 = !DILocalVariable(name: "fdsp", scope: !1675, file: !920, line: 112, type: !1676)
!1675 = distinct !DILexicalBlock(scope: !1071, file: !920, line: 111, column: 5)
!1676 = !DIDerivedType(tag: DW_TAG_typedef, name: "FDCTDSPContext", file: !1677, line: 29, baseType: !1678)
!1677 = !DIFile(filename: "libavcodec/fdctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FDCTDSPContext", file: !1677, line: 26, size: 128, align: 64, elements: !1679)
!1679 = !{!1680, !1681}
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "fdct", scope: !1678, file: !1677, line: 27, baseType: !1031, size: 64, align: 64)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "fdct248", scope: !1678, file: !1677, line: 28, baseType: !1031, size: 64, align: 64, offset: 64)
!1682 = !DILocation(line: 112, column: 24, scope: !1675)
!1683 = !DILocation(line: 113, column: 32, scope: !1675)
!1684 = !DILocation(line: 113, column: 9, scope: !1675)
!1685 = !DILocation(line: 114, column: 17, scope: !1675)
!1686 = !DILocation(line: 114, column: 22, scope: !1675)
!1687 = !DILocation(line: 114, column: 9, scope: !1675)
!1688 = !DILocation(line: 114, column: 34, scope: !1675)
!1689 = !DILocalVariable(name: "pdsp", scope: !1690, file: !920, line: 120, type: !1691)
!1690 = distinct !DILexicalBlock(scope: !1071, file: !920, line: 119, column: 5)
!1691 = !DIDerivedType(tag: DW_TAG_typedef, name: "PixblockDSPContext", file: !1692, line: 41, baseType: !1693)
!1692 = !DIFile(filename: "libavcodec/pixblockdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PixblockDSPContext", file: !1692, line: 28, size: 192, align: 64, elements: !1694)
!1694 = !{!1695, !1700, !1704}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "get_pixels", scope: !1693, file: !1692, line: 29, baseType: !1696, size: 64, align: 64)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{null, !1699, !1050, !1052}
!1699 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1034)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "diff_pixels", scope: !1693, file: !1692, line: 32, baseType: !1701, size: 64, align: 64, offset: 64)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{null, !1699, !1050, !1050, !1052}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "diff_pixels_unaligned", scope: !1693, file: !1692, line: 36, baseType: !1701, size: 64, align: 64, offset: 128)
!1705 = !DILocation(line: 120, column: 28, scope: !1690)
!1706 = !DILocation(line: 121, column: 36, scope: !1690)
!1707 = !DILocation(line: 121, column: 9, scope: !1690)
!1708 = !DILocation(line: 122, column: 17, scope: !1690)
!1709 = !DILocation(line: 122, column: 22, scope: !1690)
!1710 = !DILocation(line: 122, column: 9, scope: !1690)
!1711 = !DILocation(line: 122, column: 40, scope: !1690)
!1712 = !DILocation(line: 126, column: 5, scope: !1071)
!1713 = !DILocation(line: 128, column: 5, scope: !1071)
!1714 = !DILocation(line: 129, column: 1, scope: !1071)
