; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mpegenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--mpegenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878}
!862 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!863 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!864 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!865 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!866 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!867 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!868 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!869 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!870 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!871 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!872 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!873 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!874 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!875 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!876 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!877 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!878 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !556, line: 538, size: 32, align: 32, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888}
!881 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!882 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!883 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!884 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!885 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!886 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!887 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!888 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !952, !983, !1002, !1003, !972, !971, !949, !1006, !1011, !1015, !944}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCPBProperties", file: !4, line: 1162, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCPBProperties", file: !4, line: 1119, size: 192, align: 64, elements: !942)
!942 = !{!943, !945, !946, !947, !948}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "max_bitrate", scope: !941, file: !4, line: 1125, baseType: !944, size: 32, align: 32)
!944 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "min_bitrate", scope: !941, file: !4, line: 1134, baseType: !944, size: 32, align: 32, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "avg_bitrate", scope: !941, file: !4, line: 1143, baseType: !944, size: 32, align: 32, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !941, file: !4, line: 1152, baseType: !944, size: 32, align: 32, offset: 96)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !941, file: !4, line: 1161, baseType: !949, size: 64, align: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !950, line: 55, baseType: !951)
!950 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "StreamInfo", file: !954, line: 60, baseType: !955)
!954 = !DIFile(filename: "libavformat/mpegenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StreamInfo", file: !954, line: 46, size: 640, align: 64, elements: !956)
!956 = !{!957, !974, !975, !976, !977, !990, !991, !993, !994, !998, !999, !1000, !1001}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !955, file: !954, line: 47, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFifoBuffer", file: !960, line: 35, baseType: !961)
!960 = !DIFile(filename: "./libavutil/fifo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFifoBuffer", file: !960, line: 31, size: 320, align: 64, elements: !962)
!962 = !{!963, !967, !968, !969, !970, !973}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !961, file: !960, line: 32, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !950, line: 48, baseType: !966)
!966 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rptr", scope: !961, file: !960, line: 33, baseType: !964, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "wptr", scope: !961, file: !960, line: 33, baseType: !964, size: 64, align: 64, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !961, file: !960, line: 33, baseType: !964, size: 64, align: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "rndx", scope: !961, file: !960, line: 34, baseType: !971, size: 32, align: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !950, line: 51, baseType: !972)
!972 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "wndx", scope: !961, file: !960, line: 34, baseType: !971, size: 32, align: 32, offset: 288)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !955, file: !954, line: 48, baseType: !965, size: 8, align: 8, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "max_buffer_size", scope: !955, file: !954, line: 49, baseType: !944, size: 32, align: 32, offset: 96)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_index", scope: !955, file: !954, line: 50, baseType: !944, size: 32, align: 32, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "predecode_packet", scope: !955, file: !954, line: 51, baseType: !978, size: 64, align: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "PacketDesc", file: !954, line: 44, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PacketDesc", file: !954, line: 38, size: 256, align: 64, elements: !981)
!981 = !{!982, !985, !986, !987, !988}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !980, file: !954, line: 39, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !950, line: 40, baseType: !984)
!984 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !980, file: !954, line: 40, baseType: !983, size: 64, align: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !980, file: !954, line: 41, baseType: !944, size: 32, align: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "unwritten_size", scope: !980, file: !954, line: 42, baseType: !944, size: 32, align: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !980, file: !954, line: 43, baseType: !989, size: 64, align: 64, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "premux_packet", scope: !955, file: !954, line: 52, baseType: !978, size: 64, align: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next_packet", scope: !955, file: !954, line: 53, baseType: !992, size: 64, align: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "packet_number", scope: !955, file: !954, line: 54, baseType: !944, size: 32, align: 32, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lpcm_header", scope: !955, file: !954, line: 55, baseType: !995, size: 24, align: 8, offset: 416)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 24, align: 8, elements: !996)
!996 = !{!997}
!997 = !DISubrange(count: 3)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lpcm_align", scope: !955, file: !954, line: 56, baseType: !944, size: 32, align: 32, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_to_iframe", scope: !955, file: !954, line: 57, baseType: !944, size: 32, align: 32, offset: 480)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "align_iframe", scope: !955, file: !954, line: 58, baseType: !944, size: 32, align: 32, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "vobu_start_pts", scope: !955, file: !954, line: 59, baseType: !983, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{null, !1002, !1002, !944}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1008, line: 221, size: 32, align: 8, elements: !1009)
!1008 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1009 = !{!1010}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1007, file: !1008, line: 221, baseType: !971, size: 32, align: 32)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1008, line: 222, size: 16, align: 8, elements: !1013)
!1013 = !{!1014}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1012, file: !1008, line: 222, baseType: !1015, size: 16, align: 16)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !950, line: 49, baseType: !1016)
!1016 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1017 = !{!1018, !2253, !2254, !2255, !2256, !2257, !2258, !2262, !2265, !2266, !2267, !2268}
!1018 = distinct !DIGlobalVariable(name: "ff_mpeg1system_muxer", scope: !0, file: !954, line: 1271, type: !1019, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_mpeg1system_muxer)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !919, line: 624, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1021)
!1021 = !{!1022, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1043, !1122, !1124, !1125, !2218, !2219, !2220, !2224, !2228, !2232, !2233, !2238, !2239, !2240, !2241, !2242, !2243, !2247}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1020, file: !919, line: 498, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1020, file: !919, line: 504, baseType: !1023, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1020, file: !919, line: 505, baseType: !1023, size: 64, align: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1020, file: !919, line: 506, baseType: !1023, size: 64, align: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1020, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1020, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1020, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1020, file: !919, line: 517, baseType: !944, size: 32, align: 32, offset: 352)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1020, file: !919, line: 523, baseType: !1034, size: 64, align: 64, offset: 384)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1039, line: 44, size: 64, align: 32, elements: !1040)
!1039 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1038, file: !1039, line: 45, baseType: !3, size: 32, align: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1038, file: !1039, line: 46, baseType: !972, size: 32, align: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1020, file: !919, line: 526, baseType: !1044, size: 64, align: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !1048)
!1048 = !{!1049, !1050, !1054, !1081, !1082, !1083, !1084, !1088, !1094, !1096, !1100}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1047, file: !486, line: 72, baseType: !1023, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1047, file: !486, line: 78, baseType: !1051, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!1023, !1002}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1047, file: !486, line: 85, baseType: !1055, size: 64, align: 64, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1077, !1078, !1079, !1080}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1057, file: !464, line: 247, baseType: !1023, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1057, file: !464, line: 253, baseType: !1023, size: 64, align: 64, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1057, file: !464, line: 259, baseType: !944, size: 32, align: 32, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1057, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1057, file: !464, line: 271, baseType: !1064, size: 64, align: 64, offset: 192)
!1064 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1057, file: !464, line: 265, size: 64, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1069, !1070}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1064, file: !464, line: 266, baseType: !983, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1064, file: !464, line: 267, baseType: !1068, size: 64, align: 64)
!1068 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1064, file: !464, line: 268, baseType: !1023, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1064, file: !464, line: 270, baseType: !1071, size: 64, align: 32)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1072, line: 61, baseType: !1073)
!1072 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1072, line: 58, size: 64, align: 32, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1073, file: !1072, line: 59, baseType: !944, size: 32, align: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1073, file: !1072, line: 60, baseType: !944, size: 32, align: 32, offset: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1057, file: !464, line: 272, baseType: !1068, size: 64, align: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1057, file: !464, line: 273, baseType: !1068, size: 64, align: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1057, file: !464, line: 275, baseType: !944, size: 32, align: 32, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1057, file: !464, line: 300, baseType: !1023, size: 64, align: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1047, file: !486, line: 93, baseType: !944, size: 32, align: 32, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1047, file: !486, line: 99, baseType: !944, size: 32, align: 32, offset: 224)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1047, file: !486, line: 108, baseType: !944, size: 32, align: 32, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1047, file: !486, line: 113, baseType: !1085, size: 64, align: 64, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!1002, !1002, !1002}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1047, file: !486, line: 123, baseType: !1089, size: 64, align: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{!1092, !1092}
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1047, file: !486, line: 130, baseType: !1095, size: 32, align: 32, offset: 448)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1047, file: !486, line: 136, baseType: !1097, size: 64, align: 64, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!1095, !1002}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1047, file: !486, line: 142, baseType: !1101, size: 64, align: 64, offset: 576)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!944, !1104, !1002, !1023, !944}
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1107)
!1107 = !{!1108, !1120, !1121}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1106, file: !464, line: 360, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116, !1117, !1118, !1119}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1112, file: !464, line: 307, baseType: !1023, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1112, file: !464, line: 313, baseType: !1068, size: 64, align: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1112, file: !464, line: 313, baseType: !1068, size: 64, align: 64, offset: 128)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1112, file: !464, line: 318, baseType: !1068, size: 64, align: 64, offset: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1112, file: !464, line: 318, baseType: !1068, size: 64, align: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1112, file: !464, line: 323, baseType: !944, size: 32, align: 32, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1106, file: !464, line: 364, baseType: !944, size: 32, align: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1106, file: !464, line: 368, baseType: !944, size: 32, align: 32, offset: 96)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1020, file: !919, line: 535, baseType: !1123, size: 64, align: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1020, file: !919, line: 539, baseType: !944, size: 32, align: 32, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1020, file: !919, line: 541, baseType: !1126, size: 64, align: 64, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!944, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1131)
!1131 = !{!1132, !1133, !1228, !1229, !1230, !1295, !1296, !1297, !2072, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2126, !2127, !2128, !2129, !2130, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2181, !2182, !2185, !2186, !2187, !2188, !2189, !2190, !2195, !2196, !2197, !2198, !2206, !2207, !2211, !2215, !2216, !2217}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1130, file: !919, line: 1342, baseType: !1044, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1130, file: !919, line: 1349, baseType: !1134, size: 64, align: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1160, !1161, !1199, !1200, !1204, !1209, !1210, !1211, !1215, !1221, !1227}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1135, file: !919, line: 638, baseType: !1023, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1135, file: !919, line: 645, baseType: !1023, size: 64, align: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !919, line: 652, baseType: !944, size: 32, align: 32, offset: 128)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1135, file: !919, line: 659, baseType: !1023, size: 64, align: 64, offset: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1135, file: !919, line: 661, baseType: !1034, size: 64, align: 64, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1135, file: !919, line: 663, baseType: !1044, size: 64, align: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1135, file: !919, line: 670, baseType: !1023, size: 64, align: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1135, file: !919, line: 679, baseType: !1134, size: 64, align: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1135, file: !919, line: 684, baseType: !944, size: 32, align: 32, offset: 512)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1135, file: !919, line: 689, baseType: !944, size: 32, align: 32, offset: 544)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1135, file: !919, line: 696, baseType: !1148, size: 64, align: 64, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!944, !1151}
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1154)
!1154 = !{!1155, !1156, !1158, !1159}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1153, file: !919, line: 449, baseType: !1023, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1153, file: !919, line: 450, baseType: !1157, size: 64, align: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1153, file: !919, line: 451, baseType: !944, size: 32, align: 32, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1153, file: !919, line: 452, baseType: !1023, size: 64, align: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1135, file: !919, line: 703, baseType: !1126, size: 64, align: 64, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1135, file: !919, line: 714, baseType: !1162, size: 64, align: 64, offset: 704)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!944, !1129, !1165}
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1168)
!1168 = !{!1169, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1195, !1196, !1197, !1198}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1167, file: !4, line: 1451, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1172, line: 94, baseType: !1173)
!1172 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1172, line: 81, size: 192, align: 64, elements: !1174)
!1174 = !{!1175, !1179, !1180}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1173, file: !1172, line: 82, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1172, line: 73, baseType: !1178)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1172, line: 73, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1173, file: !1172, line: 89, baseType: !964, size: 64, align: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1173, file: !1172, line: 93, baseType: !944, size: 32, align: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1167, file: !4, line: 1461, baseType: !983, size: 64, align: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1167, file: !4, line: 1467, baseType: !983, size: 64, align: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1167, file: !4, line: 1468, baseType: !964, size: 64, align: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !4, line: 1469, baseType: !944, size: 32, align: 32, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1167, file: !4, line: 1470, baseType: !944, size: 32, align: 32, offset: 288)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1167, file: !4, line: 1474, baseType: !944, size: 32, align: 32, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1167, file: !4, line: 1479, baseType: !1188, size: 64, align: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1190, file: !4, line: 1412, baseType: !964, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1190, file: !4, line: 1413, baseType: !944, size: 32, align: 32, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1190, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1167, file: !4, line: 1480, baseType: !944, size: 32, align: 32, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1167, file: !4, line: 1486, baseType: !983, size: 64, align: 64, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1167, file: !4, line: 1488, baseType: !983, size: 64, align: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1167, file: !4, line: 1497, baseType: !983, size: 64, align: 64, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1135, file: !919, line: 720, baseType: !1126, size: 64, align: 64, offset: 768)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1135, file: !919, line: 730, baseType: !1201, size: 64, align: 64, offset: 832)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DISubroutineType(types: !1203)
!1203 = !{!944, !1129, !944, !983, !944}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1135, file: !919, line: 737, baseType: !1205, size: 64, align: 64, offset: 896)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!983, !1129, !944, !1208, !983}
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1135, file: !919, line: 744, baseType: !1126, size: 64, align: 64, offset: 960)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1135, file: !919, line: 750, baseType: !1126, size: 64, align: 64, offset: 1024)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1135, file: !919, line: 758, baseType: !1212, size: 64, align: 64, offset: 1088)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DISubroutineType(types: !1214)
!1214 = !{!944, !1129, !944, !983, !983, !983, !944}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1135, file: !919, line: 764, baseType: !1216, size: 64, align: 64, offset: 1152)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DISubroutineType(types: !1218)
!1218 = !{!944, !1129, !1219}
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1135, file: !919, line: 770, baseType: !1222, size: 64, align: 64, offset: 1216)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!944, !1129, !1225}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1135, file: !919, line: 776, baseType: !1222, size: 64, align: 64, offset: 1280)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1130, file: !919, line: 1356, baseType: !1123, size: 64, align: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1130, file: !919, line: 1365, baseType: !1002, size: 64, align: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1130, file: !919, line: 1379, baseType: !1231, size: 64, align: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1233)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238, !1239, !1240, !1241, !1245, !1246, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1262, !1263, !1267, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1285, !1286, !1287, !1288, !1292, !1293, !1294}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1233, file: !537, line: 174, baseType: !1044, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1233, file: !537, line: 226, baseType: !1157, size: 64, align: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1233, file: !537, line: 227, baseType: !944, size: 32, align: 32, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1233, file: !537, line: 228, baseType: !1157, size: 64, align: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1233, file: !537, line: 229, baseType: !1157, size: 64, align: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1233, file: !537, line: 233, baseType: !1002, size: 64, align: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1233, file: !537, line: 235, baseType: !1242, size: 64, align: 64, offset: 384)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!944, !1002, !964, !944}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1233, file: !537, line: 236, baseType: !1242, size: 64, align: 64, offset: 448)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1233, file: !537, line: 237, baseType: !1247, size: 64, align: 64, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!983, !1002, !983, !944}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1233, file: !537, line: 238, baseType: !983, size: 64, align: 64, offset: 576)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1233, file: !537, line: 239, baseType: !944, size: 32, align: 32, offset: 640)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1233, file: !537, line: 240, baseType: !944, size: 32, align: 32, offset: 672)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1233, file: !537, line: 241, baseType: !944, size: 32, align: 32, offset: 704)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1233, file: !537, line: 242, baseType: !951, size: 64, align: 64, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1233, file: !537, line: 243, baseType: !1157, size: 64, align: 64, offset: 832)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1233, file: !537, line: 244, baseType: !1257, size: 64, align: 64, offset: 896)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!951, !951, !1260, !972}
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1233, file: !537, line: 245, baseType: !944, size: 32, align: 32, offset: 960)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1233, file: !537, line: 249, baseType: !1264, size: 64, align: 64, offset: 1024)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!944, !1002, !944}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1233, file: !537, line: 255, baseType: !1268, size: 64, align: 64, offset: 1088)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!983, !1002, !944, !983, !944}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1233, file: !537, line: 260, baseType: !944, size: 32, align: 32, offset: 1152)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1233, file: !537, line: 266, baseType: !983, size: 64, align: 64, offset: 1216)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1233, file: !537, line: 273, baseType: !944, size: 32, align: 32, offset: 1280)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1233, file: !537, line: 279, baseType: !983, size: 64, align: 64, offset: 1344)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1233, file: !537, line: 285, baseType: !944, size: 32, align: 32, offset: 1408)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1233, file: !537, line: 291, baseType: !944, size: 32, align: 32, offset: 1440)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1233, file: !537, line: 298, baseType: !944, size: 32, align: 32, offset: 1472)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1233, file: !537, line: 304, baseType: !944, size: 32, align: 32, offset: 1504)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1233, file: !537, line: 309, baseType: !1023, size: 64, align: 64, offset: 1536)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1233, file: !537, line: 314, baseType: !1023, size: 64, align: 64, offset: 1600)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1233, file: !537, line: 319, baseType: !1282, size: 64, align: 64, offset: 1664)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!944, !1002, !964, !944, !536, !983}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1233, file: !537, line: 326, baseType: !944, size: 32, align: 32, offset: 1728)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1233, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1233, file: !537, line: 332, baseType: !983, size: 64, align: 64, offset: 1792)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1233, file: !537, line: 338, baseType: !1289, size: 64, align: 64, offset: 1856)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!944, !1002}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1233, file: !537, line: 340, baseType: !983, size: 64, align: 64, offset: 1920)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1233, file: !537, line: 346, baseType: !1157, size: 64, align: 64, offset: 1984)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1233, file: !537, line: 351, baseType: !944, size: 32, align: 32, offset: 2048)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1130, file: !919, line: 1386, baseType: !944, size: 32, align: 32, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1130, file: !919, line: 1393, baseType: !972, size: 32, align: 32, offset: 352)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1130, file: !919, line: 1405, baseType: !1298, size: 64, align: 64, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1858, !1881, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1958, !1964, !1965, !1969, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1991, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2001, !2002, !2003, !2004, !2005, !2006}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1301, file: !919, line: 866, baseType: !944, size: 32, align: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1301, file: !919, line: 872, baseType: !944, size: 32, align: 32, offset: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1301, file: !919, line: 878, baseType: !1306, size: 64, align: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1309)
!1309 = !{!1310, !1311, !1312, !1313, !1533, !1534, !1535, !1536, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1562, !1566, !1567, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1746, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1308, file: !4, line: 1561, baseType: !1044, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1308, file: !4, line: 1562, baseType: !944, size: 32, align: 32, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1308, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1308, file: !4, line: 1565, baseType: !1314, size: 64, align: 64, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1317)
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1323, !1326, !1329, !1332, !1335, !1338, !1339, !1340, !1348, !1349, !1350, !1352, !1356, !1362, !1367, !1371, !1372, !1417, !1504, !1508, !1509, !1513, !1517, !1522, !1526, !1527, !1528}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1316, file: !4, line: 3475, baseType: !1023, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1316, file: !4, line: 3480, baseType: !1023, size: 64, align: 64, offset: 64)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1316, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1316, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1316, file: !4, line: 3487, baseType: !944, size: 32, align: 32, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1316, file: !4, line: 3488, baseType: !1324, size: 64, align: 64, offset: 256)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1316, file: !4, line: 3489, baseType: !1327, size: 64, align: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1316, file: !4, line: 3490, baseType: !1330, size: 64, align: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1316, file: !4, line: 3491, baseType: !1333, size: 64, align: 64, offset: 448)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1316, file: !4, line: 3492, baseType: !1336, size: 64, align: 64, offset: 512)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1316, file: !4, line: 3493, baseType: !965, size: 8, align: 8, offset: 576)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1316, file: !4, line: 3494, baseType: !1044, size: 64, align: 64, offset: 640)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1316, file: !4, line: 3495, baseType: !1341, size: 64, align: 64, offset: 704)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1345)
!1345 = !{!1346, !1347}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1344, file: !4, line: 3402, baseType: !944, size: 32, align: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1344, file: !4, line: 3403, baseType: !1023, size: 64, align: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1316, file: !4, line: 3507, baseType: !1023, size: 64, align: 64, offset: 768)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1316, file: !4, line: 3516, baseType: !944, size: 32, align: 32, offset: 832)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1316, file: !4, line: 3517, baseType: !1351, size: 64, align: 64, offset: 896)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1316, file: !4, line: 3527, baseType: !1353, size: 64, align: 64, offset: 960)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DISubroutineType(types: !1355)
!1355 = !{!944, !1306}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1316, file: !4, line: 3535, baseType: !1357, size: 64, align: 64, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!944, !1306, !1360}
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1307)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1316, file: !4, line: 3541, baseType: !1363, size: 64, align: 64, offset: 1088)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1366)
!1366 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1316, file: !4, line: 3549, baseType: !1368, size: 64, align: 64, offset: 1152)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DISubroutineType(types: !1370)
!1370 = !{null, !1351}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1316, file: !4, line: 3551, baseType: !1353, size: 64, align: 64, offset: 1216)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1316, file: !4, line: 3552, baseType: !1373, size: 64, align: 64, offset: 1280)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!944, !1306, !964, !944, !1376}
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1384, !1416}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1378, file: !4, line: 3921, baseType: !1015, size: 16, align: 16)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1378, file: !4, line: 3922, baseType: !971, size: 32, align: 32, offset: 32)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1378, file: !4, line: 3923, baseType: !971, size: 32, align: 32, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1378, file: !4, line: 3924, baseType: !972, size: 32, align: 32, offset: 96)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1378, file: !4, line: 3925, baseType: !1385, size: 64, align: 64, offset: 128)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1388)
!1388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1389)
!1389 = !{!1390, !1391, !1392, !1393, !1394, !1395, !1405, !1409, !1411, !1412, !1414, !1415}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1388, file: !4, line: 3886, baseType: !944, size: 32, align: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1388, file: !4, line: 3887, baseType: !944, size: 32, align: 32, offset: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1388, file: !4, line: 3888, baseType: !944, size: 32, align: 32, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1388, file: !4, line: 3889, baseType: !944, size: 32, align: 32, offset: 96)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1388, file: !4, line: 3890, baseType: !944, size: 32, align: 32, offset: 128)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1388, file: !4, line: 3897, baseType: !1396, size: 768, align: 64, offset: 192)
!1396 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1397)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1398)
!1398 = !{!1399, !1403}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1397, file: !4, line: 3855, baseType: !1400, size: 512, align: 64)
!1400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 512, align: 64, elements: !1401)
!1401 = !{!1402}
!1402 = !DISubrange(count: 8)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1397, file: !4, line: 3857, baseType: !1404, size: 256, align: 32, offset: 512)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 256, align: 32, elements: !1401)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1388, file: !4, line: 3903, baseType: !1406, size: 256, align: 64, offset: 960)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 256, align: 64, elements: !1407)
!1407 = !{!1408}
!1408 = !DISubrange(count: 4)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1388, file: !4, line: 3904, baseType: !1410, size: 128, align: 32, offset: 1216)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !944, size: 128, align: 32, elements: !1407)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1388, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1388, file: !4, line: 3908, baseType: !1413, size: 64, align: 64, offset: 1408)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1388, file: !4, line: 3915, baseType: !1413, size: 64, align: 64, offset: 1472)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1388, file: !4, line: 3917, baseType: !944, size: 32, align: 32, offset: 1536)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1378, file: !4, line: 3926, baseType: !983, size: 64, align: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1316, file: !4, line: 3564, baseType: !1418, size: 64, align: 64, offset: 1344)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!944, !1306, !1165, !1421, !1503}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1423)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1424)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1425)
!1425 = !{!1426, !1427, !1428, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1455, !1457, !1458, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1491, !1492, !1493, !1494, !1495, !1496, !1499, !1500, !1501, !1502}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1424, file: !789, line: 282, baseType: !1400, size: 512, align: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1424, file: !789, line: 299, baseType: !1404, size: 256, align: 32, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1424, file: !789, line: 315, baseType: !1429, size: 64, align: 64, offset: 768)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1424, file: !789, line: 326, baseType: !944, size: 32, align: 32, offset: 832)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1424, file: !789, line: 326, baseType: !944, size: 32, align: 32, offset: 864)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1424, file: !789, line: 334, baseType: !944, size: 32, align: 32, offset: 896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1424, file: !789, line: 341, baseType: !944, size: 32, align: 32, offset: 928)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1424, file: !789, line: 346, baseType: !944, size: 32, align: 32, offset: 960)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1424, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1424, file: !789, line: 356, baseType: !1071, size: 64, align: 32, offset: 1024)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1424, file: !789, line: 361, baseType: !983, size: 64, align: 64, offset: 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1424, file: !789, line: 369, baseType: !983, size: 64, align: 64, offset: 1152)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1424, file: !789, line: 377, baseType: !983, size: 64, align: 64, offset: 1216)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1424, file: !789, line: 382, baseType: !944, size: 32, align: 32, offset: 1280)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1424, file: !789, line: 386, baseType: !944, size: 32, align: 32, offset: 1312)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1424, file: !789, line: 391, baseType: !944, size: 32, align: 32, offset: 1344)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1424, file: !789, line: 396, baseType: !1002, size: 64, align: 64, offset: 1408)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1424, file: !789, line: 403, baseType: !1445, size: 512, align: 64, offset: 1472)
!1445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 512, align: 64, elements: !1401)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1424, file: !789, line: 410, baseType: !944, size: 32, align: 32, offset: 1984)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1424, file: !789, line: 415, baseType: !944, size: 32, align: 32, offset: 2016)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1424, file: !789, line: 420, baseType: !944, size: 32, align: 32, offset: 2048)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1424, file: !789, line: 425, baseType: !944, size: 32, align: 32, offset: 2080)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1424, file: !789, line: 435, baseType: !983, size: 64, align: 64, offset: 2112)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1424, file: !789, line: 440, baseType: !944, size: 32, align: 32, offset: 2176)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1424, file: !789, line: 445, baseType: !949, size: 64, align: 64, offset: 2240)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1424, file: !789, line: 459, baseType: !1454, size: 512, align: 64, offset: 2304)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 512, align: 64, elements: !1401)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1424, file: !789, line: 473, baseType: !1456, size: 64, align: 64, offset: 2816)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1424, file: !789, line: 477, baseType: !944, size: 32, align: 32, offset: 2880)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1424, file: !789, line: 479, baseType: !1459, size: 64, align: 64, offset: 2944)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1462)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1463)
!1463 = !{!1464, !1465, !1466, !1467, !1472}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1462, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1462, file: !789, line: 203, baseType: !964, size: 64, align: 64, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1462, file: !789, line: 204, baseType: !944, size: 32, align: 32, offset: 128)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1462, file: !789, line: 205, baseType: !1468, size: 64, align: 64, offset: 192)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1470, line: 86, baseType: !1471)
!1470 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1471 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1470, line: 86, flags: DIFlagFwdDecl)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1462, file: !789, line: 206, baseType: !1170, size: 64, align: 64, offset: 256)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1424, file: !789, line: 480, baseType: !944, size: 32, align: 32, offset: 3008)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1424, file: !789, line: 505, baseType: !944, size: 32, align: 32, offset: 3040)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1424, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1424, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1424, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1424, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1424, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1424, file: !789, line: 532, baseType: !983, size: 64, align: 64, offset: 3264)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1424, file: !789, line: 539, baseType: !983, size: 64, align: 64, offset: 3328)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1424, file: !789, line: 547, baseType: !983, size: 64, align: 64, offset: 3392)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1424, file: !789, line: 554, baseType: !1468, size: 64, align: 64, offset: 3456)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1424, file: !789, line: 563, baseType: !944, size: 32, align: 32, offset: 3520)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1424, file: !789, line: 572, baseType: !944, size: 32, align: 32, offset: 3552)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1424, file: !789, line: 581, baseType: !944, size: 32, align: 32, offset: 3584)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1424, file: !789, line: 588, baseType: !1488, size: 64, align: 64, offset: 3648)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !950, line: 36, baseType: !1490)
!1490 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1424, file: !789, line: 593, baseType: !944, size: 32, align: 32, offset: 3712)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1424, file: !789, line: 596, baseType: !944, size: 32, align: 32, offset: 3744)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1424, file: !789, line: 599, baseType: !1170, size: 64, align: 64, offset: 3776)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1424, file: !789, line: 605, baseType: !1170, size: 64, align: 64, offset: 3840)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1424, file: !789, line: 616, baseType: !1170, size: 64, align: 64, offset: 3904)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1424, file: !789, line: 626, baseType: !1497, size: 64, align: 64, offset: 3968)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1498, line: 216, baseType: !951)
!1498 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1424, file: !789, line: 627, baseType: !1497, size: 64, align: 64, offset: 4032)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1424, file: !789, line: 628, baseType: !1497, size: 64, align: 64, offset: 4096)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1424, file: !789, line: 629, baseType: !1497, size: 64, align: 64, offset: 4160)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1424, file: !789, line: 645, baseType: !1170, size: 64, align: 64, offset: 4224)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1316, file: !4, line: 3566, baseType: !1505, size: 64, align: 64, offset: 1408)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DISubroutineType(types: !1507)
!1507 = !{!944, !1306, !1002, !1503, !1165}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1316, file: !4, line: 3567, baseType: !1353, size: 64, align: 64, offset: 1472)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1316, file: !4, line: 3576, baseType: !1510, size: 64, align: 64, offset: 1536)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DISubroutineType(types: !1512)
!1512 = !{!944, !1306, !1421}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1316, file: !4, line: 3577, baseType: !1514, size: 64, align: 64, offset: 1600)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DISubroutineType(types: !1516)
!1516 = !{!944, !1306, !1165}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1316, file: !4, line: 3584, baseType: !1518, size: 64, align: 64, offset: 1664)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!944, !1306, !1521}
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1316, file: !4, line: 3589, baseType: !1523, size: 64, align: 64, offset: 1728)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DISubroutineType(types: !1525)
!1525 = !{null, !1306}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1316, file: !4, line: 3594, baseType: !944, size: 32, align: 32, offset: 1792)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1316, file: !4, line: 3600, baseType: !1023, size: 64, align: 64, offset: 1856)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1316, file: !4, line: 3609, baseType: !1529, size: 64, align: 64, offset: 1920)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1532)
!1532 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1308, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1308, file: !4, line: 1581, baseType: !972, size: 32, align: 32, offset: 224)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1308, file: !4, line: 1583, baseType: !1002, size: 64, align: 64, offset: 256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1308, file: !4, line: 1591, baseType: !1537, size: 64, align: 64, offset: 320)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1308, file: !4, line: 1598, baseType: !1002, size: 64, align: 64, offset: 384)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1308, file: !4, line: 1606, baseType: !983, size: 64, align: 64, offset: 448)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1308, file: !4, line: 1614, baseType: !944, size: 32, align: 32, offset: 512)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1308, file: !4, line: 1622, baseType: !944, size: 32, align: 32, offset: 544)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1308, file: !4, line: 1628, baseType: !944, size: 32, align: 32, offset: 576)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1308, file: !4, line: 1636, baseType: !944, size: 32, align: 32, offset: 608)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1308, file: !4, line: 1643, baseType: !944, size: 32, align: 32, offset: 640)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1308, file: !4, line: 1657, baseType: !964, size: 64, align: 64, offset: 704)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1308, file: !4, line: 1658, baseType: !944, size: 32, align: 32, offset: 768)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1308, file: !4, line: 1679, baseType: !1071, size: 64, align: 32, offset: 800)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1308, file: !4, line: 1688, baseType: !944, size: 32, align: 32, offset: 864)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1308, file: !4, line: 1712, baseType: !944, size: 32, align: 32, offset: 896)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1308, file: !4, line: 1729, baseType: !944, size: 32, align: 32, offset: 928)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1308, file: !4, line: 1729, baseType: !944, size: 32, align: 32, offset: 960)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1308, file: !4, line: 1744, baseType: !944, size: 32, align: 32, offset: 992)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1308, file: !4, line: 1744, baseType: !944, size: 32, align: 32, offset: 1024)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1308, file: !4, line: 1751, baseType: !944, size: 32, align: 32, offset: 1056)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1308, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1308, file: !4, line: 1791, baseType: !1558, size: 64, align: 64, offset: 1152)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{null, !1561, !1421, !1503, !944, !944, !944}
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1308, file: !4, line: 1808, baseType: !1563, size: 64, align: 64, offset: 1216)
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DISubroutineType(types: !1565)
!1565 = !{!555, !1561, !1327}
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1308, file: !4, line: 1816, baseType: !944, size: 32, align: 32, offset: 1280)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1308, file: !4, line: 1825, baseType: !1568, size: 32, align: 32, offset: 1312)
!1568 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1308, file: !4, line: 1830, baseType: !944, size: 32, align: 32, offset: 1344)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1308, file: !4, line: 1838, baseType: !1568, size: 32, align: 32, offset: 1376)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1308, file: !4, line: 1846, baseType: !944, size: 32, align: 32, offset: 1408)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1308, file: !4, line: 1851, baseType: !944, size: 32, align: 32, offset: 1440)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1308, file: !4, line: 1861, baseType: !1568, size: 32, align: 32, offset: 1472)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1308, file: !4, line: 1868, baseType: !1568, size: 32, align: 32, offset: 1504)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1308, file: !4, line: 1875, baseType: !1568, size: 32, align: 32, offset: 1536)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1308, file: !4, line: 1882, baseType: !1568, size: 32, align: 32, offset: 1568)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1308, file: !4, line: 1889, baseType: !1568, size: 32, align: 32, offset: 1600)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1308, file: !4, line: 1896, baseType: !1568, size: 32, align: 32, offset: 1632)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1308, file: !4, line: 1903, baseType: !1568, size: 32, align: 32, offset: 1664)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1308, file: !4, line: 1910, baseType: !944, size: 32, align: 32, offset: 1696)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1308, file: !4, line: 1915, baseType: !944, size: 32, align: 32, offset: 1728)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1308, file: !4, line: 1926, baseType: !1503, size: 64, align: 64, offset: 1792)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1308, file: !4, line: 1935, baseType: !1071, size: 64, align: 32, offset: 1856)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1308, file: !4, line: 1942, baseType: !944, size: 32, align: 32, offset: 1920)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1308, file: !4, line: 1948, baseType: !944, size: 32, align: 32, offset: 1952)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1308, file: !4, line: 1954, baseType: !944, size: 32, align: 32, offset: 1984)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1308, file: !4, line: 1960, baseType: !944, size: 32, align: 32, offset: 2016)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1308, file: !4, line: 1984, baseType: !944, size: 32, align: 32, offset: 2048)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1308, file: !4, line: 1991, baseType: !944, size: 32, align: 32, offset: 2080)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1308, file: !4, line: 1996, baseType: !944, size: 32, align: 32, offset: 2112)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1308, file: !4, line: 2004, baseType: !944, size: 32, align: 32, offset: 2144)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1308, file: !4, line: 2011, baseType: !944, size: 32, align: 32, offset: 2176)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1308, file: !4, line: 2018, baseType: !944, size: 32, align: 32, offset: 2208)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1308, file: !4, line: 2027, baseType: !944, size: 32, align: 32, offset: 2240)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1308, file: !4, line: 2034, baseType: !944, size: 32, align: 32, offset: 2272)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1308, file: !4, line: 2044, baseType: !944, size: 32, align: 32, offset: 2304)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1308, file: !4, line: 2054, baseType: !1598, size: 64, align: 64, offset: 2368)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1308, file: !4, line: 2061, baseType: !1598, size: 64, align: 64, offset: 2432)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1308, file: !4, line: 2066, baseType: !944, size: 32, align: 32, offset: 2496)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1308, file: !4, line: 2070, baseType: !944, size: 32, align: 32, offset: 2528)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1308, file: !4, line: 2078, baseType: !944, size: 32, align: 32, offset: 2560)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1308, file: !4, line: 2085, baseType: !944, size: 32, align: 32, offset: 2592)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1308, file: !4, line: 2092, baseType: !944, size: 32, align: 32, offset: 2624)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1308, file: !4, line: 2099, baseType: !944, size: 32, align: 32, offset: 2656)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1308, file: !4, line: 2106, baseType: !944, size: 32, align: 32, offset: 2688)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1308, file: !4, line: 2113, baseType: !944, size: 32, align: 32, offset: 2720)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1308, file: !4, line: 2120, baseType: !944, size: 32, align: 32, offset: 2752)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1308, file: !4, line: 2125, baseType: !944, size: 32, align: 32, offset: 2784)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1308, file: !4, line: 2133, baseType: !944, size: 32, align: 32, offset: 2816)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1308, file: !4, line: 2140, baseType: !944, size: 32, align: 32, offset: 2848)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1308, file: !4, line: 2145, baseType: !944, size: 32, align: 32, offset: 2880)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1308, file: !4, line: 2153, baseType: !944, size: 32, align: 32, offset: 2912)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1308, file: !4, line: 2158, baseType: !944, size: 32, align: 32, offset: 2944)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1308, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1308, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1308, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1308, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1308, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1308, file: !4, line: 2203, baseType: !944, size: 32, align: 32, offset: 3136)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1308, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1308, file: !4, line: 2212, baseType: !944, size: 32, align: 32, offset: 3200)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1308, file: !4, line: 2213, baseType: !944, size: 32, align: 32, offset: 3232)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1308, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1308, file: !4, line: 2232, baseType: !944, size: 32, align: 32, offset: 3296)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1308, file: !4, line: 2243, baseType: !944, size: 32, align: 32, offset: 3328)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1308, file: !4, line: 2249, baseType: !944, size: 32, align: 32, offset: 3360)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1308, file: !4, line: 2256, baseType: !944, size: 32, align: 32, offset: 3392)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1308, file: !4, line: 2263, baseType: !949, size: 64, align: 64, offset: 3456)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1308, file: !4, line: 2270, baseType: !949, size: 64, align: 64, offset: 3520)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1308, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1308, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1308, file: !4, line: 2367, baseType: !1634, size: 64, align: 64, offset: 3648)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{!944, !1561, !1521, !944}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1308, file: !4, line: 2383, baseType: !944, size: 32, align: 32, offset: 3712)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1308, file: !4, line: 2386, baseType: !1568, size: 32, align: 32, offset: 3744)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1308, file: !4, line: 2387, baseType: !1568, size: 32, align: 32, offset: 3776)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1308, file: !4, line: 2394, baseType: !944, size: 32, align: 32, offset: 3808)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1308, file: !4, line: 2401, baseType: !944, size: 32, align: 32, offset: 3840)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1308, file: !4, line: 2408, baseType: !944, size: 32, align: 32, offset: 3872)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1308, file: !4, line: 2415, baseType: !944, size: 32, align: 32, offset: 3904)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1308, file: !4, line: 2422, baseType: !944, size: 32, align: 32, offset: 3936)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1308, file: !4, line: 2423, baseType: !1646, size: 64, align: 64, offset: 3968)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1648)
!1648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1649)
!1649 = !{!1650, !1651, !1652, !1653}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1648, file: !4, line: 827, baseType: !944, size: 32, align: 32)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1648, file: !4, line: 828, baseType: !944, size: 32, align: 32, offset: 32)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1648, file: !4, line: 829, baseType: !944, size: 32, align: 32, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1648, file: !4, line: 830, baseType: !1568, size: 32, align: 32, offset: 96)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1308, file: !4, line: 2430, baseType: !983, size: 64, align: 64, offset: 4032)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1308, file: !4, line: 2437, baseType: !983, size: 64, align: 64, offset: 4096)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1308, file: !4, line: 2444, baseType: !1568, size: 32, align: 32, offset: 4160)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1308, file: !4, line: 2451, baseType: !1568, size: 32, align: 32, offset: 4192)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1308, file: !4, line: 2458, baseType: !944, size: 32, align: 32, offset: 4224)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1308, file: !4, line: 2469, baseType: !944, size: 32, align: 32, offset: 4256)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1308, file: !4, line: 2475, baseType: !944, size: 32, align: 32, offset: 4288)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1308, file: !4, line: 2481, baseType: !944, size: 32, align: 32, offset: 4320)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1308, file: !4, line: 2485, baseType: !944, size: 32, align: 32, offset: 4352)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1308, file: !4, line: 2489, baseType: !944, size: 32, align: 32, offset: 4384)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1308, file: !4, line: 2493, baseType: !944, size: 32, align: 32, offset: 4416)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1308, file: !4, line: 2501, baseType: !944, size: 32, align: 32, offset: 4448)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1308, file: !4, line: 2506, baseType: !944, size: 32, align: 32, offset: 4480)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1308, file: !4, line: 2510, baseType: !944, size: 32, align: 32, offset: 4512)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1308, file: !4, line: 2514, baseType: !983, size: 64, align: 64, offset: 4544)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1308, file: !4, line: 2528, baseType: !1670, size: 64, align: 64, offset: 4608)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DISubroutineType(types: !1672)
!1672 = !{null, !1561, !1002, !944, !944}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1308, file: !4, line: 2534, baseType: !944, size: 32, align: 32, offset: 4672)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1308, file: !4, line: 2545, baseType: !944, size: 32, align: 32, offset: 4704)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1308, file: !4, line: 2547, baseType: !944, size: 32, align: 32, offset: 4736)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1308, file: !4, line: 2549, baseType: !944, size: 32, align: 32, offset: 4768)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1308, file: !4, line: 2551, baseType: !944, size: 32, align: 32, offset: 4800)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1308, file: !4, line: 2553, baseType: !944, size: 32, align: 32, offset: 4832)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1308, file: !4, line: 2555, baseType: !944, size: 32, align: 32, offset: 4864)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1308, file: !4, line: 2557, baseType: !944, size: 32, align: 32, offset: 4896)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1308, file: !4, line: 2559, baseType: !944, size: 32, align: 32, offset: 4928)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1308, file: !4, line: 2563, baseType: !944, size: 32, align: 32, offset: 4960)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1308, file: !4, line: 2571, baseType: !1413, size: 64, align: 64, offset: 4992)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1308, file: !4, line: 2579, baseType: !1413, size: 64, align: 64, offset: 5056)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1308, file: !4, line: 2586, baseType: !944, size: 32, align: 32, offset: 5120)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1308, file: !4, line: 2615, baseType: !944, size: 32, align: 32, offset: 5152)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1308, file: !4, line: 2627, baseType: !944, size: 32, align: 32, offset: 5184)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1308, file: !4, line: 2637, baseType: !944, size: 32, align: 32, offset: 5216)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1308, file: !4, line: 2681, baseType: !944, size: 32, align: 32, offset: 5248)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1308, file: !4, line: 2709, baseType: !983, size: 64, align: 64, offset: 5312)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1308, file: !4, line: 2716, baseType: !1692, size: 64, align: 64, offset: 5376)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1694)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1695)
!1695 = !{!1696, !1697, !1698, !1699, !1700, !1701, !1702, !1706, !1710, !1711, !1712, !1713, !1719, !1720, !1721, !1722, !1723}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1694, file: !4, line: 3642, baseType: !1023, size: 64, align: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1694, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1694, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1694, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1694, file: !4, line: 3669, baseType: !944, size: 32, align: 32, offset: 160)
