; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--webmdashenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--webmdashenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !940, file: !939, line: 457, size: 32, align: 32, elements: !2193)
!939 = !DIFile(filename: "libavformat/webmdashenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = distinct !DISubprogram(name: "parse_adaptation_sets", scope: !939, file: !939, line: 452, type: !941, isLocal: true, isDefinition: true, scopeLine: 453, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2192)
!941 = !DISubroutineType(types: !942)
!942 = !{!943, !944}
!943 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !947)
!947 = !{!948, !1034, !1146, !1288, !1289, !1354, !1355, !1356, !2049, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2103, !2104, !2105, !2106, !2107, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2158, !2159, !2162, !2163, !2164, !2165, !2166, !2167, !2169, !2170, !2171, !2172, !2180, !2181, !2185, !2189, !2190, !2191}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !946, file: !919, line: 1342, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !953)
!953 = !{!954, !958, !963, !993, !994, !995, !996, !1000, !1006, !1008, !1012}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !952, file: !486, line: 72, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !952, file: !486, line: 78, baseType: !959, size: 64, align: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64, align: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!955, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !952, file: !486, line: 85, baseType: !964, size: 64, align: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !989, !990, !991, !992}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !966, file: !464, line: 247, baseType: !955, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !966, file: !464, line: 253, baseType: !955, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !966, file: !464, line: 259, baseType: !943, size: 32, align: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !966, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !966, file: !464, line: 271, baseType: !973, size: 64, align: 64, offset: 192)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !966, file: !464, line: 265, size: 64, align: 64, elements: !974)
!974 = !{!975, !979, !981, !982}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !973, file: !464, line: 266, baseType: !976, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !977, line: 40, baseType: !978)
!977 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!978 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !973, file: !464, line: 267, baseType: !980, size: 64, align: 64)
!980 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !973, file: !464, line: 268, baseType: !955, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !973, file: !464, line: 270, baseType: !983, size: 64, align: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !984, line: 61, baseType: !985)
!984 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !984, line: 58, size: 64, align: 32, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !985, file: !984, line: 59, baseType: !943, size: 32, align: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !985, file: !984, line: 60, baseType: !943, size: 32, align: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !966, file: !464, line: 272, baseType: !980, size: 64, align: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !966, file: !464, line: 273, baseType: !980, size: 64, align: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !464, line: 275, baseType: !943, size: 32, align: 32, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !966, file: !464, line: 300, baseType: !955, size: 64, align: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !952, file: !486, line: 93, baseType: !943, size: 32, align: 32, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !952, file: !486, line: 99, baseType: !943, size: 32, align: 32, offset: 224)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !952, file: !486, line: 108, baseType: !943, size: 32, align: 32, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !952, file: !486, line: 113, baseType: !997, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!962, !962, !962}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !952, file: !486, line: 123, baseType: !1001, size: 64, align: 64, offset: 384)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004, !1004}
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !952, file: !486, line: 130, baseType: !1007, size: 32, align: 32, offset: 448)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !952, file: !486, line: 136, baseType: !1009, size: 64, align: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!1007, !962}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !952, file: !486, line: 142, baseType: !1013, size: 64, align: 64, offset: 576)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!943, !1016, !962, !955, !943}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1019)
!1019 = !{!1020, !1032, !1033}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1018, file: !464, line: 360, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1024, file: !464, line: 307, baseType: !955, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1024, file: !464, line: 313, baseType: !980, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1024, file: !464, line: 313, baseType: !980, size: 64, align: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1024, file: !464, line: 318, baseType: !980, size: 64, align: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1024, file: !464, line: 318, baseType: !980, size: 64, align: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1024, file: !464, line: 323, baseType: !943, size: 32, align: 32, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1018, file: !464, line: 364, baseType: !943, size: 32, align: 32, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1018, file: !464, line: 368, baseType: !943, size: 32, align: 32, offset: 96)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !946, file: !919, line: 1349, baseType: !1035, size: 64, align: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1053, !1054, !1055, !1056, !1057, !1058, !1072, !1077, !1117, !1118, !1122, !1127, !1128, !1129, !1133, !1139, !1145}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1036, file: !919, line: 638, baseType: !955, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1036, file: !919, line: 645, baseType: !955, size: 64, align: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1036, file: !919, line: 652, baseType: !943, size: 32, align: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1036, file: !919, line: 659, baseType: !955, size: 64, align: 64, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1036, file: !919, line: 661, baseType: !1043, size: 64, align: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1048, line: 44, size: 64, align: 32, elements: !1049)
!1048 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1047, file: !1048, line: 45, baseType: !3, size: 32, align: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1047, file: !1048, line: 46, baseType: !1052, size: 32, align: 32, offset: 32)
!1052 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1036, file: !919, line: 663, baseType: !949, size: 64, align: 64, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1036, file: !919, line: 670, baseType: !955, size: 64, align: 64, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1036, file: !919, line: 679, baseType: !1035, size: 64, align: 64, offset: 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1036, file: !919, line: 684, baseType: !943, size: 32, align: 32, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1036, file: !919, line: 689, baseType: !943, size: 32, align: 32, offset: 544)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1036, file: !919, line: 696, baseType: !1059, size: 64, align: 64, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!943, !1062}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1070, !1071}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1064, file: !919, line: 449, baseType: !955, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1064, file: !919, line: 450, baseType: !1068, size: 64, align: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1064, file: !919, line: 451, baseType: !943, size: 32, align: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1064, file: !919, line: 452, baseType: !955, size: 64, align: 64, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1036, file: !919, line: 703, baseType: !1073, size: 64, align: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!943, !1076}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1036, file: !919, line: 714, baseType: !1078, size: 64, align: 64, offset: 704)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!943, !1076, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1084)
!1084 = !{!1085, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1113, !1114, !1115, !1116}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1083, file: !4, line: 1451, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1088, line: 94, baseType: !1089)
!1088 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1088, line: 81, size: 192, align: 64, elements: !1090)
!1090 = !{!1091, !1095, !1098}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1089, file: !1088, line: 82, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1088, line: 73, baseType: !1094)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1088, line: 73, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !1088, line: 89, baseType: !1096, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !977, line: 48, baseType: !1069)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !1088, line: 93, baseType: !943, size: 32, align: 32, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1083, file: !4, line: 1461, baseType: !976, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1083, file: !4, line: 1467, baseType: !976, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1083, file: !4, line: 1468, baseType: !1096, size: 64, align: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1083, file: !4, line: 1469, baseType: !943, size: 32, align: 32, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1083, file: !4, line: 1470, baseType: !943, size: 32, align: 32, offset: 288)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1083, file: !4, line: 1474, baseType: !943, size: 32, align: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1083, file: !4, line: 1479, baseType: !1106, size: 64, align: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !4, line: 1412, baseType: !1096, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !4, line: 1413, baseType: !943, size: 32, align: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1108, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1083, file: !4, line: 1480, baseType: !943, size: 32, align: 32, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1083, file: !4, line: 1486, baseType: !976, size: 64, align: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1083, file: !4, line: 1488, baseType: !976, size: 64, align: 64, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1083, file: !4, line: 1497, baseType: !976, size: 64, align: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1036, file: !919, line: 720, baseType: !1073, size: 64, align: 64, offset: 768)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1036, file: !919, line: 730, baseType: !1119, size: 64, align: 64, offset: 832)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!943, !1076, !943, !976, !943}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1036, file: !919, line: 737, baseType: !1123, size: 64, align: 64, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64)
!1124 = !DISubroutineType(types: !1125)
!1125 = !{!976, !1076, !943, !1126, !976}
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1036, file: !919, line: 744, baseType: !1073, size: 64, align: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1036, file: !919, line: 750, baseType: !1073, size: 64, align: 64, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1036, file: !919, line: 758, baseType: !1130, size: 64, align: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!943, !1076, !943, !976, !976, !976, !943}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1036, file: !919, line: 764, baseType: !1134, size: 64, align: 64, offset: 1152)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!943, !1076, !1137}
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1036, file: !919, line: 770, baseType: !1140, size: 64, align: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!943, !1076, !1143}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1036, file: !919, line: 776, baseType: !1140, size: 64, align: 64, offset: 1280)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !946, file: !919, line: 1356, baseType: !1147, size: 64, align: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1169, !1173, !1177, !1184, !1273, !1274, !1275, !1276, !1277, !1278, !1282}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1148, file: !919, line: 498, baseType: !955, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1148, file: !919, line: 504, baseType: !955, size: 64, align: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1148, file: !919, line: 505, baseType: !955, size: 64, align: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1148, file: !919, line: 506, baseType: !955, size: 64, align: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1148, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1148, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1148, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !919, line: 517, baseType: !943, size: 32, align: 32, offset: 352)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1148, file: !919, line: 523, baseType: !1043, size: 64, align: 64, offset: 384)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1148, file: !919, line: 526, baseType: !949, size: 64, align: 64, offset: 448)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1148, file: !919, line: 535, baseType: !1147, size: 64, align: 64, offset: 512)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1148, file: !919, line: 539, baseType: !943, size: 32, align: 32, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1148, file: !919, line: 541, baseType: !1073, size: 64, align: 64, offset: 640)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1148, file: !919, line: 549, baseType: !1078, size: 64, align: 64, offset: 704)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1148, file: !919, line: 550, baseType: !1073, size: 64, align: 64, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1148, file: !919, line: 554, baseType: !1166, size: 64, align: 64, offset: 832)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!943, !1076, !1081, !1081, !943}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1148, file: !919, line: 563, baseType: !1170, size: 64, align: 64, offset: 896)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!943, !3, !943}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1148, file: !919, line: 565, baseType: !1174, size: 64, align: 64, offset: 960)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{null, !1076, !943, !1126, !1126}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1148, file: !919, line: 570, baseType: !1178, size: 64, align: 64, offset: 1024)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!943, !1076, !943, !962, !1181}
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1182, line: 216, baseType: !1183)
!1182 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1183 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1148, file: !919, line: 581, baseType: !1185, size: 64, align: 64, offset: 1088)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!943, !1076, !943, !1188, !1052}
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !789, line: 646, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !789, line: 268, size: 4288, align: 64, elements: !1192)
!1192 = !{!1193, !1197, !1199, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1227, !1229, !1230, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1191, file: !789, line: 282, baseType: !1194, size: 512, align: 64)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 512, align: 64, elements: !1195)
!1195 = !{!1196}
!1196 = !DISubrange(count: 8)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1191, file: !789, line: 299, baseType: !1198, size: 256, align: 32, offset: 512)
!1198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 256, align: 32, elements: !1195)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1191, file: !789, line: 315, baseType: !1200, size: 64, align: 64, offset: 768)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1191, file: !789, line: 326, baseType: !943, size: 32, align: 32, offset: 832)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1191, file: !789, line: 326, baseType: !943, size: 32, align: 32, offset: 864)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1191, file: !789, line: 334, baseType: !943, size: 32, align: 32, offset: 896)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1191, file: !789, line: 341, baseType: !943, size: 32, align: 32, offset: 928)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1191, file: !789, line: 346, baseType: !943, size: 32, align: 32, offset: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1191, file: !789, line: 351, baseType: !778, size: 32, align: 32, offset: 992)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1191, file: !789, line: 356, baseType: !983, size: 64, align: 32, offset: 1024)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1191, file: !789, line: 361, baseType: !976, size: 64, align: 64, offset: 1088)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1191, file: !789, line: 369, baseType: !976, size: 64, align: 64, offset: 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1191, file: !789, line: 377, baseType: !976, size: 64, align: 64, offset: 1216)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1191, file: !789, line: 382, baseType: !943, size: 32, align: 32, offset: 1280)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1191, file: !789, line: 386, baseType: !943, size: 32, align: 32, offset: 1312)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1191, file: !789, line: 391, baseType: !943, size: 32, align: 32, offset: 1344)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1191, file: !789, line: 396, baseType: !962, size: 64, align: 64, offset: 1408)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1191, file: !789, line: 403, baseType: !1216, size: 512, align: 64, offset: 1472)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1217, size: 512, align: 64, elements: !1195)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !977, line: 55, baseType: !1183)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1191, file: !789, line: 410, baseType: !943, size: 32, align: 32, offset: 1984)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1191, file: !789, line: 415, baseType: !943, size: 32, align: 32, offset: 2016)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1191, file: !789, line: 420, baseType: !943, size: 32, align: 32, offset: 2048)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1191, file: !789, line: 425, baseType: !943, size: 32, align: 32, offset: 2080)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1191, file: !789, line: 435, baseType: !976, size: 64, align: 64, offset: 2112)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1191, file: !789, line: 440, baseType: !943, size: 32, align: 32, offset: 2176)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1191, file: !789, line: 445, baseType: !1217, size: 64, align: 64, offset: 2240)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1191, file: !789, line: 459, baseType: !1226, size: 512, align: 64, offset: 2304)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 512, align: 64, elements: !1195)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1191, file: !789, line: 473, baseType: !1228, size: 64, align: 64, offset: 2816)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1191, file: !789, line: 477, baseType: !943, size: 32, align: 32, offset: 2880)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1191, file: !789, line: 479, baseType: !1231, size: 64, align: 64, offset: 2944)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64, align: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !789, line: 207, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !789, line: 201, size: 320, align: 64, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1244}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1234, file: !789, line: 202, baseType: !788, size: 32, align: 32)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1234, file: !789, line: 203, baseType: !1096, size: 64, align: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !789, line: 204, baseType: !943, size: 32, align: 32, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1234, file: !789, line: 205, baseType: !1240, size: 64, align: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1242, line: 86, baseType: !1243)
!1242 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1242, line: 86, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1234, file: !789, line: 206, baseType: !1086, size: 64, align: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1191, file: !789, line: 480, baseType: !943, size: 32, align: 32, offset: 3008)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1191, file: !789, line: 505, baseType: !943, size: 32, align: 32, offset: 3040)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1191, file: !789, line: 512, baseType: !812, size: 32, align: 32, offset: 3072)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1191, file: !789, line: 514, baseType: !818, size: 32, align: 32, offset: 3104)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1191, file: !789, line: 516, baseType: !836, size: 32, align: 32, offset: 3136)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1191, file: !789, line: 523, baseType: !860, size: 32, align: 32, offset: 3168)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1191, file: !789, line: 525, baseType: !879, size: 32, align: 32, offset: 3200)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1191, file: !789, line: 532, baseType: !976, size: 64, align: 64, offset: 3264)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1191, file: !789, line: 539, baseType: !976, size: 64, align: 64, offset: 3328)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1191, file: !789, line: 547, baseType: !976, size: 64, align: 64, offset: 3392)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1191, file: !789, line: 554, baseType: !1240, size: 64, align: 64, offset: 3456)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1191, file: !789, line: 563, baseType: !943, size: 32, align: 32, offset: 3520)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1191, file: !789, line: 572, baseType: !943, size: 32, align: 32, offset: 3552)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1191, file: !789, line: 581, baseType: !943, size: 32, align: 32, offset: 3584)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1191, file: !789, line: 588, baseType: !1260, size: 64, align: 64, offset: 3648)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !977, line: 36, baseType: !1262)
!1262 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1191, file: !789, line: 593, baseType: !943, size: 32, align: 32, offset: 3712)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1191, file: !789, line: 596, baseType: !943, size: 32, align: 32, offset: 3744)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1191, file: !789, line: 599, baseType: !1086, size: 64, align: 64, offset: 3776)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1191, file: !789, line: 605, baseType: !1086, size: 64, align: 64, offset: 3840)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1191, file: !789, line: 616, baseType: !1086, size: 64, align: 64, offset: 3904)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1191, file: !789, line: 626, baseType: !1181, size: 64, align: 64, offset: 3968)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1191, file: !789, line: 627, baseType: !1181, size: 64, align: 64, offset: 4032)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1191, file: !789, line: 628, baseType: !1181, size: 64, align: 64, offset: 4096)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1191, file: !789, line: 629, baseType: !1181, size: 64, align: 64, offset: 4160)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1191, file: !789, line: 645, baseType: !1086, size: 64, align: 64, offset: 4224)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1148, file: !919, line: 587, baseType: !1134, size: 64, align: 64, offset: 1152)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1148, file: !919, line: 592, baseType: !1140, size: 64, align: 64, offset: 1216)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1148, file: !919, line: 597, baseType: !1140, size: 64, align: 64, offset: 1280)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1148, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1148, file: !919, line: 608, baseType: !1073, size: 64, align: 64, offset: 1408)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1148, file: !919, line: 617, baseType: !1279, size: 64, align: 64, offset: 1472)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{null, !1076}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1148, file: !919, line: 623, baseType: !1283, size: 64, align: 64, offset: 1536)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!943, !1076, !1286}
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1082)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !946, file: !919, line: 1365, baseType: !962, size: 64, align: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !946, file: !919, line: 1379, baseType: !1290, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !537, line: 352, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !537, line: 161, size: 2112, align: 64, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304, !1305, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1321, !1322, !1326, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1344, !1345, !1346, !1347, !1351, !1352, !1353}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1292, file: !537, line: 174, baseType: !949, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1292, file: !537, line: 226, baseType: !1068, size: 64, align: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1292, file: !537, line: 227, baseType: !943, size: 32, align: 32, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1292, file: !537, line: 228, baseType: !1068, size: 64, align: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1292, file: !537, line: 229, baseType: !1068, size: 64, align: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1292, file: !537, line: 233, baseType: !962, size: 64, align: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1292, file: !537, line: 235, baseType: !1301, size: 64, align: 64, offset: 384)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!943, !962, !1096, !943}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1292, file: !537, line: 236, baseType: !1301, size: 64, align: 64, offset: 448)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1292, file: !537, line: 237, baseType: !1306, size: 64, align: 64, offset: 512)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!976, !962, !976, !943}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1292, file: !537, line: 238, baseType: !976, size: 64, align: 64, offset: 576)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1292, file: !537, line: 239, baseType: !943, size: 32, align: 32, offset: 640)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1292, file: !537, line: 240, baseType: !943, size: 32, align: 32, offset: 672)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1292, file: !537, line: 241, baseType: !943, size: 32, align: 32, offset: 704)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1292, file: !537, line: 242, baseType: !1183, size: 64, align: 64, offset: 768)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1292, file: !537, line: 243, baseType: !1068, size: 64, align: 64, offset: 832)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1292, file: !537, line: 244, baseType: !1316, size: 64, align: 64, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64, align: 64)
!1317 = !DISubroutineType(types: !1318)
!1318 = !{!1183, !1183, !1319, !1052}
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1292, file: !537, line: 245, baseType: !943, size: 32, align: 32, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1292, file: !537, line: 249, baseType: !1323, size: 64, align: 64, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!943, !962, !943}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1292, file: !537, line: 255, baseType: !1327, size: 64, align: 64, offset: 1088)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!976, !962, !943, !976, !943}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1292, file: !537, line: 260, baseType: !943, size: 32, align: 32, offset: 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1292, file: !537, line: 266, baseType: !976, size: 64, align: 64, offset: 1216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1292, file: !537, line: 273, baseType: !943, size: 32, align: 32, offset: 1280)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1292, file: !537, line: 279, baseType: !976, size: 64, align: 64, offset: 1344)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1292, file: !537, line: 285, baseType: !943, size: 32, align: 32, offset: 1408)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1292, file: !537, line: 291, baseType: !943, size: 32, align: 32, offset: 1440)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1292, file: !537, line: 298, baseType: !943, size: 32, align: 32, offset: 1472)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1292, file: !537, line: 304, baseType: !943, size: 32, align: 32, offset: 1504)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1292, file: !537, line: 309, baseType: !955, size: 64, align: 64, offset: 1536)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1292, file: !537, line: 314, baseType: !955, size: 64, align: 64, offset: 1600)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1292, file: !537, line: 319, baseType: !1341, size: 64, align: 64, offset: 1664)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!943, !962, !1096, !943, !536, !976}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1292, file: !537, line: 326, baseType: !943, size: 32, align: 32, offset: 1728)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1292, file: !537, line: 331, baseType: !536, size: 32, align: 32, offset: 1760)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1292, file: !537, line: 332, baseType: !976, size: 64, align: 64, offset: 1792)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1292, file: !537, line: 338, baseType: !1348, size: 64, align: 64, offset: 1856)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{!943, !962}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1292, file: !537, line: 340, baseType: !976, size: 64, align: 64, offset: 1920)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1292, file: !537, line: 346, baseType: !1068, size: 64, align: 64, offset: 1984)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1292, file: !537, line: 351, baseType: !943, size: 32, align: 32, offset: 2048)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !946, file: !919, line: 1386, baseType: !943, size: 32, align: 32, offset: 320)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !946, file: !919, line: 1393, baseType: !1052, size: 32, align: 32, offset: 352)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !946, file: !919, line: 1405, baseType: !1357, size: 64, align: 64, offset: 384)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64, align: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1361)
!1361 = !{!1362, !1363, !1364, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1835, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1935, !1941, !1942, !1946, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1978, !1979, !1980, !1981, !1982, !1983}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1360, file: !919, line: 866, baseType: !943, size: 32, align: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1360, file: !919, line: 872, baseType: !943, size: 32, align: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1360, file: !919, line: 878, baseType: !1365, size: 64, align: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372, !1510, !1511, !1512, !1513, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1539, !1543, !1544, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1723, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1367, file: !4, line: 1561, baseType: !949, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1367, file: !4, line: 1562, baseType: !943, size: 32, align: 32, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1367, file: !4, line: 1564, baseType: !545, size: 32, align: 32, offset: 96)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1367, file: !4, line: 1565, baseType: !1373, size: 64, align: 64, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382, !1385, !1388, !1391, !1394, !1397, !1398, !1399, !1407, !1408, !1409, !1411, !1415, !1421, !1426, !1430, !1431, !1475, !1482, !1486, !1487, !1491, !1495, !1499, !1503, !1504, !1505}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1375, file: !4, line: 3475, baseType: !955, size: 64, align: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1375, file: !4, line: 3480, baseType: !955, size: 64, align: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1375, file: !4, line: 3481, baseType: !545, size: 32, align: 32, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1375, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1375, file: !4, line: 3487, baseType: !943, size: 32, align: 32, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1375, file: !4, line: 3488, baseType: !1383, size: 64, align: 64, offset: 256)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1375, file: !4, line: 3489, baseType: !1386, size: 64, align: 64, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1375, file: !4, line: 3490, baseType: !1389, size: 64, align: 64, offset: 384)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1375, file: !4, line: 3491, baseType: !1392, size: 64, align: 64, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1375, file: !4, line: 3492, baseType: !1395, size: 64, align: 64, offset: 512)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1217)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1375, file: !4, line: 3493, baseType: !1097, size: 8, align: 8, offset: 576)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1375, file: !4, line: 3494, baseType: !949, size: 64, align: 64, offset: 640)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1375, file: !4, line: 3495, baseType: !1400, size: 64, align: 64, offset: 704)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1402)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1404)
!1404 = !{!1405, !1406}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1403, file: !4, line: 3402, baseType: !943, size: 32, align: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1403, file: !4, line: 3403, baseType: !955, size: 64, align: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1375, file: !4, line: 3507, baseType: !955, size: 64, align: 64, offset: 768)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1375, file: !4, line: 3516, baseType: !943, size: 32, align: 32, offset: 832)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1375, file: !4, line: 3517, baseType: !1410, size: 64, align: 64, offset: 896)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1375, file: !4, line: 3527, baseType: !1412, size: 64, align: 64, offset: 960)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!943, !1365}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1375, file: !4, line: 3535, baseType: !1416, size: 64, align: 64, offset: 1024)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{!943, !1365, !1419}
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1366)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1375, file: !4, line: 3541, baseType: !1422, size: 64, align: 64, offset: 1088)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64, align: 64)
!1423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1424)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1425)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1375, file: !4, line: 3549, baseType: !1427, size: 64, align: 64, offset: 1152)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64, align: 64)
!1428 = !DISubroutineType(types: !1429)
!1429 = !{null, !1410}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1375, file: !4, line: 3551, baseType: !1412, size: 64, align: 64, offset: 1216)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1375, file: !4, line: 3552, baseType: !1432, size: 64, align: 64, offset: 1280)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64, align: 64)
!1433 = !DISubroutineType(types: !1434)
!1434 = !{!943, !1365, !1096, !943, !1435}
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1437)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1438)
!1438 = !{!1439, !1442, !1444, !1445, !1446, !1474}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1437, file: !4, line: 3921, baseType: !1440, size: 16, align: 16)
!1440 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !977, line: 49, baseType: !1441)
!1441 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1437, file: !4, line: 3922, baseType: !1443, size: 32, align: 32, offset: 32)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !977, line: 51, baseType: !1052)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1437, file: !4, line: 3923, baseType: !1443, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1437, file: !4, line: 3924, baseType: !1052, size: 32, align: 32, offset: 96)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1437, file: !4, line: 3925, baseType: !1447, size: 64, align: 64, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1450)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1451)
!1451 = !{!1452, !1453, !1454, !1455, !1456, !1457, !1463, !1467, !1469, !1470, !1472, !1473}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1450, file: !4, line: 3886, baseType: !943, size: 32, align: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1450, file: !4, line: 3887, baseType: !943, size: 32, align: 32, offset: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1450, file: !4, line: 3888, baseType: !943, size: 32, align: 32, offset: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1450, file: !4, line: 3889, baseType: !943, size: 32, align: 32, offset: 96)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1450, file: !4, line: 3890, baseType: !943, size: 32, align: 32, offset: 128)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1450, file: !4, line: 3897, baseType: !1458, size: 768, align: 64, offset: 192)
!1458 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1459)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1460)
!1460 = !{!1461, !1462}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1459, file: !4, line: 3855, baseType: !1194, size: 512, align: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1459, file: !4, line: 3857, baseType: !1198, size: 256, align: 32, offset: 512)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1450, file: !4, line: 3903, baseType: !1464, size: 256, align: 64, offset: 960)
!1464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 256, align: 64, elements: !1465)
!1465 = !{!1466}
!1466 = !DISubrange(count: 4)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1450, file: !4, line: 3904, baseType: !1468, size: 128, align: 32, offset: 1216)
!1468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 128, align: 32, elements: !1465)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1450, file: !4, line: 3906, baseType: !772, size: 32, align: 32, offset: 1344)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1450, file: !4, line: 3908, baseType: !1471, size: 64, align: 64, offset: 1408)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1450, file: !4, line: 3915, baseType: !1471, size: 64, align: 64, offset: 1472)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1450, file: !4, line: 3917, baseType: !943, size: 32, align: 32, offset: 1536)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1437, file: !4, line: 3926, baseType: !976, size: 64, align: 64, offset: 192)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1375, file: !4, line: 3564, baseType: !1476, size: 64, align: 64, offset: 1344)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{!943, !1365, !1081, !1479, !1481}
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1190)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1375, file: !4, line: 3566, baseType: !1483, size: 64, align: 64, offset: 1408)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64, align: 64)
!1484 = !DISubroutineType(types: !1485)
!1485 = !{!943, !1365, !962, !1481, !1081}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1375, file: !4, line: 3567, baseType: !1412, size: 64, align: 64, offset: 1472)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1375, file: !4, line: 3576, baseType: !1488, size: 64, align: 64, offset: 1536)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!943, !1365, !1479}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1375, file: !4, line: 3577, baseType: !1492, size: 64, align: 64, offset: 1600)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!943, !1365, !1081}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1375, file: !4, line: 3584, baseType: !1496, size: 64, align: 64, offset: 1664)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{!943, !1365, !1189}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1375, file: !4, line: 3589, baseType: !1500, size: 64, align: 64, offset: 1728)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DISubroutineType(types: !1502)
!1502 = !{null, !1365}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1375, file: !4, line: 3594, baseType: !943, size: 32, align: 32, offset: 1792)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1375, file: !4, line: 3600, baseType: !955, size: 64, align: 64, offset: 1856)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1375, file: !4, line: 3609, baseType: !1506, size: 64, align: 64, offset: 1920)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1509)
!1509 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1367, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1367, file: !4, line: 1581, baseType: !1052, size: 32, align: 32, offset: 224)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1367, file: !4, line: 1583, baseType: !962, size: 64, align: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1367, file: !4, line: 1591, baseType: !1514, size: 64, align: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1367, file: !4, line: 1598, baseType: !962, size: 64, align: 64, offset: 384)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1367, file: !4, line: 1606, baseType: !976, size: 64, align: 64, offset: 448)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1367, file: !4, line: 1614, baseType: !943, size: 32, align: 32, offset: 512)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1367, file: !4, line: 1622, baseType: !943, size: 32, align: 32, offset: 544)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1367, file: !4, line: 1628, baseType: !943, size: 32, align: 32, offset: 576)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1367, file: !4, line: 1636, baseType: !943, size: 32, align: 32, offset: 608)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1367, file: !4, line: 1643, baseType: !943, size: 32, align: 32, offset: 640)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1367, file: !4, line: 1657, baseType: !1096, size: 64, align: 64, offset: 704)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1367, file: !4, line: 1658, baseType: !943, size: 32, align: 32, offset: 768)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1367, file: !4, line: 1679, baseType: !983, size: 64, align: 32, offset: 800)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1367, file: !4, line: 1688, baseType: !943, size: 32, align: 32, offset: 864)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1367, file: !4, line: 1712, baseType: !943, size: 32, align: 32, offset: 896)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1367, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 928)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1367, file: !4, line: 1729, baseType: !943, size: 32, align: 32, offset: 960)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1367, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 992)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1367, file: !4, line: 1744, baseType: !943, size: 32, align: 32, offset: 1024)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1367, file: !4, line: 1751, baseType: !943, size: 32, align: 32, offset: 1056)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1367, file: !4, line: 1766, baseType: !555, size: 32, align: 32, offset: 1088)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1367, file: !4, line: 1791, baseType: !1535, size: 64, align: 64, offset: 1152)
!1535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1536, size: 64, align: 64)
!1536 = !DISubroutineType(types: !1537)
!1537 = !{null, !1538, !1479, !1481, !943, !943, !943}
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1367, file: !4, line: 1808, baseType: !1540, size: 64, align: 64, offset: 1216)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DISubroutineType(types: !1542)
!1542 = !{!555, !1538, !1386}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1367, file: !4, line: 1816, baseType: !943, size: 32, align: 32, offset: 1280)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1367, file: !4, line: 1825, baseType: !1545, size: 32, align: 32, offset: 1312)
!1545 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1367, file: !4, line: 1830, baseType: !943, size: 32, align: 32, offset: 1344)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1367, file: !4, line: 1838, baseType: !1545, size: 32, align: 32, offset: 1376)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1367, file: !4, line: 1846, baseType: !943, size: 32, align: 32, offset: 1408)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1367, file: !4, line: 1851, baseType: !943, size: 32, align: 32, offset: 1440)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1367, file: !4, line: 1861, baseType: !1545, size: 32, align: 32, offset: 1472)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1367, file: !4, line: 1868, baseType: !1545, size: 32, align: 32, offset: 1504)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1367, file: !4, line: 1875, baseType: !1545, size: 32, align: 32, offset: 1536)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1367, file: !4, line: 1882, baseType: !1545, size: 32, align: 32, offset: 1568)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1367, file: !4, line: 1889, baseType: !1545, size: 32, align: 32, offset: 1600)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1367, file: !4, line: 1896, baseType: !1545, size: 32, align: 32, offset: 1632)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1367, file: !4, line: 1903, baseType: !1545, size: 32, align: 32, offset: 1664)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1367, file: !4, line: 1910, baseType: !943, size: 32, align: 32, offset: 1696)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1367, file: !4, line: 1915, baseType: !943, size: 32, align: 32, offset: 1728)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1367, file: !4, line: 1926, baseType: !1481, size: 64, align: 64, offset: 1792)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1367, file: !4, line: 1935, baseType: !983, size: 64, align: 32, offset: 1856)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1367, file: !4, line: 1942, baseType: !943, size: 32, align: 32, offset: 1920)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1367, file: !4, line: 1948, baseType: !943, size: 32, align: 32, offset: 1952)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1367, file: !4, line: 1954, baseType: !943, size: 32, align: 32, offset: 1984)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1367, file: !4, line: 1960, baseType: !943, size: 32, align: 32, offset: 2016)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1367, file: !4, line: 1984, baseType: !943, size: 32, align: 32, offset: 2048)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1367, file: !4, line: 1991, baseType: !943, size: 32, align: 32, offset: 2080)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1367, file: !4, line: 1996, baseType: !943, size: 32, align: 32, offset: 2112)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1367, file: !4, line: 2004, baseType: !943, size: 32, align: 32, offset: 2144)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1367, file: !4, line: 2011, baseType: !943, size: 32, align: 32, offset: 2176)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1367, file: !4, line: 2018, baseType: !943, size: 32, align: 32, offset: 2208)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1367, file: !4, line: 2027, baseType: !943, size: 32, align: 32, offset: 2240)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1367, file: !4, line: 2034, baseType: !943, size: 32, align: 32, offset: 2272)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1367, file: !4, line: 2044, baseType: !943, size: 32, align: 32, offset: 2304)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1367, file: !4, line: 2054, baseType: !1575, size: 64, align: 64, offset: 2368)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1367, file: !4, line: 2061, baseType: !1575, size: 64, align: 64, offset: 2432)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1367, file: !4, line: 2066, baseType: !943, size: 32, align: 32, offset: 2496)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1367, file: !4, line: 2070, baseType: !943, size: 32, align: 32, offset: 2528)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1367, file: !4, line: 2078, baseType: !943, size: 32, align: 32, offset: 2560)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1367, file: !4, line: 2085, baseType: !943, size: 32, align: 32, offset: 2592)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1367, file: !4, line: 2092, baseType: !943, size: 32, align: 32, offset: 2624)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1367, file: !4, line: 2099, baseType: !943, size: 32, align: 32, offset: 2656)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1367, file: !4, line: 2106, baseType: !943, size: 32, align: 32, offset: 2688)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1367, file: !4, line: 2113, baseType: !943, size: 32, align: 32, offset: 2720)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1367, file: !4, line: 2120, baseType: !943, size: 32, align: 32, offset: 2752)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1367, file: !4, line: 2125, baseType: !943, size: 32, align: 32, offset: 2784)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1367, file: !4, line: 2133, baseType: !943, size: 32, align: 32, offset: 2816)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1367, file: !4, line: 2140, baseType: !943, size: 32, align: 32, offset: 2848)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1367, file: !4, line: 2145, baseType: !943, size: 32, align: 32, offset: 2880)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1367, file: !4, line: 2153, baseType: !943, size: 32, align: 32, offset: 2912)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1367, file: !4, line: 2158, baseType: !943, size: 32, align: 32, offset: 2944)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1367, file: !4, line: 2166, baseType: !818, size: 32, align: 32, offset: 2976)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1367, file: !4, line: 2173, baseType: !836, size: 32, align: 32, offset: 3008)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1367, file: !4, line: 2180, baseType: !860, size: 32, align: 32, offset: 3040)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1367, file: !4, line: 2187, baseType: !812, size: 32, align: 32, offset: 3072)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1367, file: !4, line: 2194, baseType: !879, size: 32, align: 32, offset: 3104)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1367, file: !4, line: 2203, baseType: !943, size: 32, align: 32, offset: 3136)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1367, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1367, file: !4, line: 2212, baseType: !943, size: 32, align: 32, offset: 3200)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1367, file: !4, line: 2213, baseType: !943, size: 32, align: 32, offset: 3232)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1367, file: !4, line: 2220, baseType: !755, size: 32, align: 32, offset: 3264)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1367, file: !4, line: 2232, baseType: !943, size: 32, align: 32, offset: 3296)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1367, file: !4, line: 2243, baseType: !943, size: 32, align: 32, offset: 3328)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1367, file: !4, line: 2249, baseType: !943, size: 32, align: 32, offset: 3360)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1367, file: !4, line: 2256, baseType: !943, size: 32, align: 32, offset: 3392)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1367, file: !4, line: 2263, baseType: !1217, size: 64, align: 64, offset: 3456)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1367, file: !4, line: 2270, baseType: !1217, size: 64, align: 64, offset: 3520)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1367, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1367, file: !4, line: 2285, baseType: !755, size: 32, align: 32, offset: 3616)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1367, file: !4, line: 2367, baseType: !1611, size: 64, align: 64, offset: 3648)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DISubroutineType(types: !1613)
!1613 = !{!943, !1538, !1189, !943}
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1367, file: !4, line: 2383, baseType: !943, size: 32, align: 32, offset: 3712)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1367, file: !4, line: 2386, baseType: !1545, size: 32, align: 32, offset: 3744)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1367, file: !4, line: 2387, baseType: !1545, size: 32, align: 32, offset: 3776)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1367, file: !4, line: 2394, baseType: !943, size: 32, align: 32, offset: 3808)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1367, file: !4, line: 2401, baseType: !943, size: 32, align: 32, offset: 3840)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1367, file: !4, line: 2408, baseType: !943, size: 32, align: 32, offset: 3872)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1367, file: !4, line: 2415, baseType: !943, size: 32, align: 32, offset: 3904)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1367, file: !4, line: 2422, baseType: !943, size: 32, align: 32, offset: 3936)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1367, file: !4, line: 2423, baseType: !1623, size: 64, align: 64, offset: 3968)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1625)
!1625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1626)
!1626 = !{!1627, !1628, !1629, !1630}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1625, file: !4, line: 827, baseType: !943, size: 32, align: 32)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1625, file: !4, line: 828, baseType: !943, size: 32, align: 32, offset: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1625, file: !4, line: 829, baseType: !943, size: 32, align: 32, offset: 64)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1625, file: !4, line: 830, baseType: !1545, size: 32, align: 32, offset: 96)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1367, file: !4, line: 2430, baseType: !976, size: 64, align: 64, offset: 4032)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1367, file: !4, line: 2437, baseType: !976, size: 64, align: 64, offset: 4096)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1367, file: !4, line: 2444, baseType: !1545, size: 32, align: 32, offset: 4160)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1367, file: !4, line: 2451, baseType: !1545, size: 32, align: 32, offset: 4192)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1367, file: !4, line: 2458, baseType: !943, size: 32, align: 32, offset: 4224)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1367, file: !4, line: 2469, baseType: !943, size: 32, align: 32, offset: 4256)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1367, file: !4, line: 2475, baseType: !943, size: 32, align: 32, offset: 4288)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1367, file: !4, line: 2481, baseType: !943, size: 32, align: 32, offset: 4320)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1367, file: !4, line: 2485, baseType: !943, size: 32, align: 32, offset: 4352)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1367, file: !4, line: 2489, baseType: !943, size: 32, align: 32, offset: 4384)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1367, file: !4, line: 2493, baseType: !943, size: 32, align: 32, offset: 4416)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1367, file: !4, line: 2501, baseType: !943, size: 32, align: 32, offset: 4448)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1367, file: !4, line: 2506, baseType: !943, size: 32, align: 32, offset: 4480)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1367, file: !4, line: 2510, baseType: !943, size: 32, align: 32, offset: 4512)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1367, file: !4, line: 2514, baseType: !976, size: 64, align: 64, offset: 4544)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1367, file: !4, line: 2528, baseType: !1647, size: 64, align: 64, offset: 4608)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{null, !1538, !962, !943, !943}
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1367, file: !4, line: 2534, baseType: !943, size: 32, align: 32, offset: 4672)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1367, file: !4, line: 2545, baseType: !943, size: 32, align: 32, offset: 4704)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1367, file: !4, line: 2547, baseType: !943, size: 32, align: 32, offset: 4736)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1367, file: !4, line: 2549, baseType: !943, size: 32, align: 32, offset: 4768)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1367, file: !4, line: 2551, baseType: !943, size: 32, align: 32, offset: 4800)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1367, file: !4, line: 2553, baseType: !943, size: 32, align: 32, offset: 4832)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1367, file: !4, line: 2555, baseType: !943, size: 32, align: 32, offset: 4864)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1367, file: !4, line: 2557, baseType: !943, size: 32, align: 32, offset: 4896)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1367, file: !4, line: 2559, baseType: !943, size: 32, align: 32, offset: 4928)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1367, file: !4, line: 2563, baseType: !943, size: 32, align: 32, offset: 4960)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1367, file: !4, line: 2571, baseType: !1471, size: 64, align: 64, offset: 4992)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1367, file: !4, line: 2579, baseType: !1471, size: 64, align: 64, offset: 5056)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1367, file: !4, line: 2586, baseType: !943, size: 32, align: 32, offset: 5120)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1367, file: !4, line: 2615, baseType: !943, size: 32, align: 32, offset: 5152)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1367, file: !4, line: 2627, baseType: !943, size: 32, align: 32, offset: 5184)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1367, file: !4, line: 2637, baseType: !943, size: 32, align: 32, offset: 5216)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1367, file: !4, line: 2681, baseType: !943, size: 32, align: 32, offset: 5248)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1367, file: !4, line: 2709, baseType: !976, size: 64, align: 64, offset: 5312)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1367, file: !4, line: 2716, baseType: !1669, size: 64, align: 64, offset: 5376)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1672)
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678, !1679, !1683, !1687, !1688, !1689, !1690, !1696, !1697, !1698, !1699, !1700}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1671, file: !4, line: 3642, baseType: !955, size: 64, align: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1671, file: !4, line: 3649, baseType: !545, size: 32, align: 32, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1671, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1671, file: !4, line: 3663, baseType: !555, size: 32, align: 32, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1671, file: !4, line: 3669, baseType: !943, size: 32, align: 32, offset: 160)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1671, file: !4, line: 3682, baseType: !1496, size: 64, align: 64, offset: 192)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1671, file: !4, line: 3698, baseType: !1680, size: 64, align: 64, offset: 256)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!943, !1365, !1319, !1443}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1671, file: !4, line: 3712, baseType: !1684, size: 64, align: 64, offset: 320)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!943, !1365, !943, !1319, !1443}
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1671, file: !4, line: 3726, baseType: !1680, size: 64, align: 64, offset: 384)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1671, file: !4, line: 3737, baseType: !1412, size: 64, align: 64, offset: 448)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1671, file: !4, line: 3746, baseType: !943, size: 32, align: 32, offset: 512)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1671, file: !4, line: 3757, baseType: !1691, size: 64, align: 64, offset: 576)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64, align: 64)
!1692 = !DISubroutineType(types: !1693)
!1693 = !{null, !1694}
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64, align: 64)
!1695 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1671, file: !4, line: 3766, baseType: !1412, size: 64, align: 64, offset: 640)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1671, file: !4, line: 3774, baseType: !1412, size: 64, align: 64, offset: 704)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1671, file: !4, line: 3780, baseType: !943, size: 32, align: 32, offset: 768)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1671, file: !4, line: 3785, baseType: !943, size: 32, align: 32, offset: 800)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1671, file: !4, line: 3795, baseType: !1701, size: 64, align: 64, offset: 832)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DISubroutineType(types: !1703)
!1703 = !{!943, !1365, !1086}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1367, file: !4, line: 2728, baseType: !962, size: 64, align: 64, offset: 5440)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1367, file: !4, line: 2735, baseType: !1216, size: 512, align: 64, offset: 5504)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1367, file: !4, line: 2742, baseType: !943, size: 32, align: 32, offset: 6016)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1367, file: !4, line: 2755, baseType: !943, size: 32, align: 32, offset: 6048)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1367, file: !4, line: 2776, baseType: !943, size: 32, align: 32, offset: 6080)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1367, file: !4, line: 2783, baseType: !943, size: 32, align: 32, offset: 6112)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1367, file: !4, line: 2791, baseType: !943, size: 32, align: 32, offset: 6144)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1367, file: !4, line: 2802, baseType: !1189, size: 64, align: 64, offset: 6208)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1367, file: !4, line: 2811, baseType: !943, size: 32, align: 32, offset: 6272)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1367, file: !4, line: 2821, baseType: !943, size: 32, align: 32, offset: 6304)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1367, file: !4, line: 2830, baseType: !943, size: 32, align: 32, offset: 6336)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1367, file: !4, line: 2840, baseType: !943, size: 32, align: 32, offset: 6368)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1367, file: !4, line: 2851, baseType: !1717, size: 64, align: 64, offset: 6400)
!1717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1718, size: 64, align: 64)
!1718 = !DISubroutineType(types: !1719)
!1719 = !{!943, !1538, !1720, !962, !1481, !943, !943}
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DISubroutineType(types: !1722)
!1722 = !{!943, !1538, !962}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1367, file: !4, line: 2871, baseType: !1724, size: 64, align: 64, offset: 6464)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64, align: 64)
!1725 = !DISubroutineType(types: !1726)
!1726 = !{!943, !1538, !1727, !962, !1481, !943}
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64, align: 64)
!1728 = !DISubroutineType(types: !1729)
