; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--jpeg2000dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--jpeg2000dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }

!910 = !DIFile(filename: "libavcodec/jpeg2000.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!912 = !DIEnumerator(name: "JPEG2000_SOC", value: 65359)
!913 = !DIEnumerator(name: "JPEG2000_SIZ", value: 65361)
!914 = !DIEnumerator(name: "JPEG2000_COD", value: 65362)
!915 = !DIEnumerator(name: "JPEG2000_COC", value: 65363)
!916 = !DIEnumerator(name: "JPEG2000_TLM", value: 65365)
!917 = !DIEnumerator(name: "JPEG2000_PLM", value: 65367)
!918 = !DIEnumerator(name: "JPEG2000_PLT", value: 65368)
!919 = !DIEnumerator(name: "JPEG2000_QCD", value: 65372)
!920 = !DIEnumerator(name: "JPEG2000_QCC", value: 65373)
!921 = !DIEnumerator(name: "JPEG2000_RGN", value: 65374)
!922 = !DIEnumerator(name: "JPEG2000_POC", value: 65375)
!923 = !DIEnumerator(name: "JPEG2000_PPM", value: 65376)
!924 = !DIEnumerator(name: "JPEG2000_PPT", value: 65377)
!925 = !DIEnumerator(name: "JPEG2000_CRG", value: 65379)
!926 = !DIEnumerator(name: "JPEG2000_COM", value: 65380)
!927 = !DIEnumerator(name: "JPEG2000_SOT", value: 65424)
!928 = !DIEnumerator(name: "JPEG2000_SOP", value: 65425)
!929 = !DIEnumerator(name: "JPEG2000_EPH", value: 65426)
!930 = !DIEnumerator(name: "JPEG2000_SOD", value: 65427)
!931 = !DIEnumerator(name: "JPEG2000_EOC", value: 65497)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DWTType", file: !933, line: 36, size: 32, align: 32, elements: !934)
!933 = !DIFile(filename: "libavcodec/jpeg2000dwt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!934 = !{!935, !936, !937, !938}
!935 = !DIEnumerator(name: "FF_DWT97", value: 0)
!936 = !DIEnumerator(name: "FF_DWT53", value: 1)
!937 = !DIEnumerator(name: "FF_DWT97_INT", value: 2)
!938 = !DIEnumerator(name: "FF_DWT_NB", value: 3)
!939 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Jpeg2000Quantsty", file: !910, line: 64, size: 32, align: 32, elements: !940)
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "JPEG2000_QSTY_NONE", value: 0)
!942 = !DIEnumerator(name: "JPEG2000_QSTY_SI", value: 1)
!943 = !DIEnumerator(name: "JPEG2000_QSTY_SE", value: 2)
!944 = !{!945, !946, !947, !948, !956, !960, !967, !969, !971, !972}
!945 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!946 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !951, line: 221, size: 32, align: 8, elements: !952)
!951 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !950, file: !951, line: 221, baseType: !954, size: 32, align: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !955, line: 51, baseType: !946)
!955 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !955, line: 48, baseType: !959)
!959 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !951, line: 222, size: 16, align: 8, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !962, file: !951, line: 222, baseType: !965, size: 16, align: 16)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !955, line: 49, baseType: !966)
!966 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !955, line: 40, baseType: !968)
!968 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !955, line: 55, baseType: !970)
!970 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!973 = !{!974, !1724, !1725, !1731, !1736, !1740, !1744, !1746, !1750, !1754}
!974 = distinct !DIGlobalVariable(name: "ff_jpeg2000_decoder", scope: !0, file: !975, line: 2264, type: !976, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_jpeg2000_decoder)
!975 = !DIFile(filename: "libavcodec/jpeg2000dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !978)
!978 = !{!979, !983, !984, !985, !986, !987, !996, !999, !1002, !1005, !1008, !1009, !1082, !1090, !1091, !1092, !1094, !1639, !1645, !1653, !1657, !1658, !1695, !1699, !1703, !1704, !1708, !1712, !1713, !1717, !1718, !1719}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !14, line: 3475, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !977, file: !14, line: 3480, baseType: !980, size: 64, align: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !977, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !977, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !977, file: !14, line: 3487, baseType: !945, size: 32, align: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !977, file: !14, line: 3488, baseType: !988, size: 64, align: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !991, line: 61, baseType: !992)
!991 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !991, line: 58, size: 64, align: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !992, file: !991, line: 59, baseType: !945, size: 32, align: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !992, file: !991, line: 60, baseType: !945, size: 32, align: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !977, file: !14, line: 3489, baseType: !997, size: 64, align: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !977, file: !14, line: 3490, baseType: !1000, size: 64, align: 64, offset: 384)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !977, file: !14, line: 3491, baseType: !1003, size: 64, align: 64, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !977, file: !14, line: 3492, baseType: !1006, size: 64, align: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !977, file: !14, line: 3493, baseType: !958, size: 8, align: 8, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !977, file: !14, line: 3494, baseType: !1010, size: 64, align: 64, offset: 640)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1020, !1041, !1042, !1043, !1044, !1048, !1054, !1056, !1060}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1013, file: !713, line: 72, baseType: !980, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1013, file: !713, line: 78, baseType: !1017, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!980, !947}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1013, file: !713, line: 85, baseType: !1021, size: 64, align: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1037, !1038, !1039, !1040}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !691, line: 247, baseType: !980, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1023, file: !691, line: 253, baseType: !980, size: 64, align: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1023, file: !691, line: 259, baseType: !945, size: 32, align: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1023, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1023, file: !691, line: 271, baseType: !1030, size: 64, align: 64, offset: 192)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1023, file: !691, line: 265, size: 64, align: 64, elements: !1031)
!1031 = !{!1032, !1033, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1030, file: !691, line: 266, baseType: !967, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1030, file: !691, line: 267, baseType: !1034, size: 64, align: 64)
!1034 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1030, file: !691, line: 268, baseType: !980, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1030, file: !691, line: 270, baseType: !990, size: 64, align: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1023, file: !691, line: 272, baseType: !1034, size: 64, align: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1023, file: !691, line: 273, baseType: !1034, size: 64, align: 64, offset: 320)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !691, line: 275, baseType: !945, size: 32, align: 32, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1023, file: !691, line: 300, baseType: !980, size: 64, align: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1013, file: !713, line: 93, baseType: !945, size: 32, align: 32, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1013, file: !713, line: 99, baseType: !945, size: 32, align: 32, offset: 224)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1013, file: !713, line: 108, baseType: !945, size: 32, align: 32, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1013, file: !713, line: 113, baseType: !1045, size: 64, align: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!947, !947, !947}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1013, file: !713, line: 123, baseType: !1049, size: 64, align: 64, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!1052, !1052}
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1013, file: !713, line: 130, baseType: !1055, size: 32, align: 32, offset: 448)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1013, file: !713, line: 136, baseType: !1057, size: 64, align: 64, offset: 512)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!1055, !947}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1013, file: !713, line: 142, baseType: !1061, size: 64, align: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!945, !1064, !947, !980, !945}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64, align: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1067)
!1067 = !{!1068, !1080, !1081}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1066, file: !691, line: 360, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1072, file: !691, line: 307, baseType: !980, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1072, file: !691, line: 313, baseType: !1034, size: 64, align: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1072, file: !691, line: 313, baseType: !1034, size: 64, align: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1072, file: !691, line: 318, baseType: !1034, size: 64, align: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1072, file: !691, line: 318, baseType: !1034, size: 64, align: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1072, file: !691, line: 323, baseType: !945, size: 32, align: 32, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1066, file: !691, line: 364, baseType: !945, size: 32, align: 32, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1066, file: !691, line: 368, baseType: !945, size: 32, align: 32, offset: 96)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !977, file: !14, line: 3495, baseType: !1083, size: 64, align: 64, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1086, file: !14, line: 3402, baseType: !945, size: 32, align: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1086, file: !14, line: 3403, baseType: !980, size: 64, align: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !977, file: !14, line: 3507, baseType: !980, size: 64, align: 64, offset: 768)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !977, file: !14, line: 3516, baseType: !945, size: 32, align: 32, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !14, line: 3517, baseType: !1093, size: 64, align: 64, offset: 896)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !977, file: !14, line: 3527, baseType: !1095, size: 64, align: 64, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!945, !1098}
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1108, !1109, !1110, !1111, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1390, !1394, !1395, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1577, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1100, file: !14, line: 1561, baseType: !1010, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1100, file: !14, line: 1562, baseType: !945, size: 32, align: 32, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1100, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1100, file: !14, line: 1565, baseType: !1106, size: 64, align: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1100, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1100, file: !14, line: 1581, baseType: !946, size: 32, align: 32, offset: 224)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1100, file: !14, line: 1583, baseType: !947, size: 64, align: 64, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1100, file: !14, line: 1591, baseType: !1112, size: 64, align: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1114, line: 129, size: 1664, align: 64, elements: !1115)
!1114 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1115 = !{!1116, !1117, !1118, !1119, !1216, !1237, !1238, !1267, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1113, file: !1114, line: 136, baseType: !945, size: 32, align: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1113, file: !1114, line: 151, baseType: !945, size: 32, align: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1113, file: !1114, line: 157, baseType: !945, size: 32, align: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1113, file: !1114, line: 159, baseType: !1120, size: 64, align: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1123)
!1123 = !{!1124, !1128, !1130, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1168, !1170, !1171, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1204, !1205, !1206, !1207, !1208, !1209, !1212, !1213, !1214, !1215}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !744, line: 282, baseType: !1125, size: 512, align: 64)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 512, align: 64, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 8)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1122, file: !744, line: 299, baseType: !1129, size: 256, align: 32, offset: 512)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 256, align: 32, elements: !1126)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1122, file: !744, line: 315, baseType: !1131, size: 64, align: 64, offset: 768)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1122, file: !744, line: 326, baseType: !945, size: 32, align: 32, offset: 832)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1122, file: !744, line: 326, baseType: !945, size: 32, align: 32, offset: 864)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1122, file: !744, line: 334, baseType: !945, size: 32, align: 32, offset: 896)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1122, file: !744, line: 341, baseType: !945, size: 32, align: 32, offset: 928)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1122, file: !744, line: 346, baseType: !945, size: 32, align: 32, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1122, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1122, file: !744, line: 356, baseType: !990, size: 64, align: 32, offset: 1024)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1122, file: !744, line: 361, baseType: !967, size: 64, align: 64, offset: 1088)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1122, file: !744, line: 369, baseType: !967, size: 64, align: 64, offset: 1152)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1122, file: !744, line: 377, baseType: !967, size: 64, align: 64, offset: 1216)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1122, file: !744, line: 382, baseType: !945, size: 32, align: 32, offset: 1280)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1122, file: !744, line: 386, baseType: !945, size: 32, align: 32, offset: 1312)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1122, file: !744, line: 391, baseType: !945, size: 32, align: 32, offset: 1344)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1122, file: !744, line: 396, baseType: !947, size: 64, align: 64, offset: 1408)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1122, file: !744, line: 403, baseType: !1147, size: 512, align: 64, offset: 1472)
!1147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 512, align: 64, elements: !1126)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1122, file: !744, line: 410, baseType: !945, size: 32, align: 32, offset: 1984)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1122, file: !744, line: 415, baseType: !945, size: 32, align: 32, offset: 2016)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1122, file: !744, line: 420, baseType: !945, size: 32, align: 32, offset: 2048)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1122, file: !744, line: 425, baseType: !945, size: 32, align: 32, offset: 2080)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1122, file: !744, line: 435, baseType: !967, size: 64, align: 64, offset: 2112)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1122, file: !744, line: 440, baseType: !945, size: 32, align: 32, offset: 2176)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1122, file: !744, line: 445, baseType: !969, size: 64, align: 64, offset: 2240)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1122, file: !744, line: 459, baseType: !1156, size: 512, align: 64, offset: 2304)
!1156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1157, size: 512, align: 64, elements: !1126)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1159, line: 94, baseType: !1160)
!1159 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1159, line: 81, size: 192, align: 64, elements: !1161)
!1161 = !{!1162, !1166, !1167}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1160, file: !1159, line: 82, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1159, line: 73, baseType: !1165)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1159, line: 73, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !1159, line: 89, baseType: !971, size: 64, align: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1160, file: !1159, line: 93, baseType: !945, size: 32, align: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1122, file: !744, line: 473, baseType: !1169, size: 64, align: 64, offset: 2816)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1122, file: !744, line: 477, baseType: !945, size: 32, align: 32, offset: 2880)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1122, file: !744, line: 479, baseType: !1172, size: 64, align: 64, offset: 2944)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1176)
!1176 = !{!1177, !1178, !1179, !1180, !1185}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1175, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1175, file: !744, line: 203, baseType: !971, size: 64, align: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1175, file: !744, line: 204, baseType: !945, size: 32, align: 32, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1175, file: !744, line: 205, baseType: !1181, size: 64, align: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1183, line: 86, baseType: !1184)
!1183 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1184 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1183, line: 86, flags: DIFlagFwdDecl)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1175, file: !744, line: 206, baseType: !1157, size: 64, align: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1122, file: !744, line: 480, baseType: !945, size: 32, align: 32, offset: 3008)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1122, file: !744, line: 505, baseType: !945, size: 32, align: 32, offset: 3040)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1122, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1122, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1122, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1122, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1122, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1122, file: !744, line: 532, baseType: !967, size: 64, align: 64, offset: 3264)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1122, file: !744, line: 539, baseType: !967, size: 64, align: 64, offset: 3328)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1122, file: !744, line: 547, baseType: !967, size: 64, align: 64, offset: 3392)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1122, file: !744, line: 554, baseType: !1181, size: 64, align: 64, offset: 3456)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1122, file: !744, line: 563, baseType: !945, size: 32, align: 32, offset: 3520)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1122, file: !744, line: 572, baseType: !945, size: 32, align: 32, offset: 3552)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1122, file: !744, line: 581, baseType: !945, size: 32, align: 32, offset: 3584)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1122, file: !744, line: 588, baseType: !1201, size: 64, align: 64, offset: 3648)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !955, line: 36, baseType: !1203)
!1203 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1122, file: !744, line: 593, baseType: !945, size: 32, align: 32, offset: 3712)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1122, file: !744, line: 596, baseType: !945, size: 32, align: 32, offset: 3744)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1122, file: !744, line: 599, baseType: !1157, size: 64, align: 64, offset: 3776)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1122, file: !744, line: 605, baseType: !1157, size: 64, align: 64, offset: 3840)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1122, file: !744, line: 616, baseType: !1157, size: 64, align: 64, offset: 3904)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1122, file: !744, line: 626, baseType: !1210, size: 64, align: 64, offset: 3968)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1211, line: 216, baseType: !970)
!1211 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1122, file: !744, line: 627, baseType: !1210, size: 64, align: 64, offset: 4032)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1122, file: !744, line: 628, baseType: !1210, size: 64, align: 64, offset: 4096)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1122, file: !744, line: 629, baseType: !1210, size: 64, align: 64, offset: 4160)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1122, file: !744, line: 645, baseType: !1157, size: 64, align: 64, offset: 4224)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1113, file: !1114, line: 161, baseType: !1217, size: 64, align: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1114, line: 117, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1114, line: 100, size: 832, align: 64, elements: !1220)
!1220 = !{!1221, !1228, !1229, !1230, !1231, !1232, !1234, !1235, !1236}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1219, file: !1114, line: 105, baseType: !1222, size: 256, align: 64)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1223, size: 256, align: 64, elements: !1226)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1159, line: 238, baseType: !1225)
!1225 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1159, line: 238, flags: DIFlagFwdDecl)
!1226 = !{!1227}
!1227 = !DISubrange(count: 4)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1219, file: !1114, line: 110, baseType: !945, size: 32, align: 32, offset: 256)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1219, file: !1114, line: 111, baseType: !945, size: 32, align: 32, offset: 288)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1219, file: !1114, line: 111, baseType: !945, size: 32, align: 32, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1219, file: !1114, line: 112, baseType: !1129, size: 256, align: 32, offset: 352)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1219, file: !1114, line: 113, baseType: !1233, size: 128, align: 32, offset: 608)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 128, align: 32, elements: !1226)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1219, file: !1114, line: 114, baseType: !945, size: 32, align: 32, offset: 736)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1219, file: !1114, line: 115, baseType: !945, size: 32, align: 32, offset: 768)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1219, file: !1114, line: 116, baseType: !945, size: 32, align: 32, offset: 800)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1113, file: !1114, line: 163, baseType: !947, size: 64, align: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1113, file: !1114, line: 165, baseType: !1239, size: 128, align: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1114, line: 122, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1114, line: 119, size: 128, align: 64, elements: !1241)
!1241 = !{!1242, !1266}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1240, file: !1114, line: 120, baseType: !1243, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1245)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1262, !1263, !1264, !1265}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1245, file: !14, line: 1451, baseType: !1157, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1245, file: !14, line: 1461, baseType: !967, size: 64, align: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1245, file: !14, line: 1467, baseType: !967, size: 64, align: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1245, file: !14, line: 1468, baseType: !971, size: 64, align: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1245, file: !14, line: 1469, baseType: !945, size: 32, align: 32, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1245, file: !14, line: 1470, baseType: !945, size: 32, align: 32, offset: 288)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1245, file: !14, line: 1474, baseType: !945, size: 32, align: 32, offset: 320)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1245, file: !14, line: 1479, baseType: !1255, size: 64, align: 64, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1258)
!1258 = !{!1259, !1260, !1261}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1257, file: !14, line: 1412, baseType: !971, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1257, file: !14, line: 1413, baseType: !945, size: 32, align: 32, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1257, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1245, file: !14, line: 1480, baseType: !945, size: 32, align: 32, offset: 448)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1245, file: !14, line: 1486, baseType: !967, size: 64, align: 64, offset: 512)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1245, file: !14, line: 1488, baseType: !967, size: 64, align: 64, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1245, file: !14, line: 1497, baseType: !967, size: 64, align: 64, offset: 640)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1240, file: !1114, line: 121, baseType: !1120, size: 64, align: 64, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1113, file: !1114, line: 166, baseType: !1268, size: 128, align: 64, offset: 448)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1114, line: 127, baseType: !1269)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1114, line: 124, size: 128, align: 64, elements: !1270)
!1270 = !{!1271, !1344}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1269, file: !1114, line: 125, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1302, !1306, !1307, !1341, !1342, !1343}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1275, file: !14, line: 5751, baseType: !1010, size: 64, align: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1275, file: !14, line: 5756, baseType: !1279, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1282)
!1282 = !{!1283, !1284, !1287, !1288, !1289, !1293, !1297, !1301}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1281, file: !14, line: 5797, baseType: !980, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1281, file: !14, line: 5804, baseType: !1285, size: 64, align: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1281, file: !14, line: 5815, baseType: !1010, size: 64, align: 64, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1281, file: !14, line: 5825, baseType: !945, size: 32, align: 32, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1281, file: !14, line: 5826, baseType: !1290, size: 64, align: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!945, !1273}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1281, file: !14, line: 5827, baseType: !1294, size: 64, align: 64, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{!945, !1273, !1243}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1281, file: !14, line: 5828, baseType: !1298, size: 64, align: 64, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !1273}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1281, file: !14, line: 5829, baseType: !1298, size: 64, align: 64, offset: 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1275, file: !14, line: 5762, baseType: !1303, size: 64, align: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1305)
!1305 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1275, file: !14, line: 5768, baseType: !947, size: 64, align: 64, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1275, file: !14, line: 5775, baseType: !1308, size: 64, align: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1310, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1310, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1310, file: !14, line: 3948, baseType: !954, size: 32, align: 32, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1310, file: !14, line: 3958, baseType: !971, size: 64, align: 64, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1310, file: !14, line: 3962, baseType: !945, size: 32, align: 32, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1310, file: !14, line: 3968, baseType: !945, size: 32, align: 32, offset: 224)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1310, file: !14, line: 3973, baseType: !967, size: 64, align: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1310, file: !14, line: 3986, baseType: !945, size: 32, align: 32, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1310, file: !14, line: 3999, baseType: !945, size: 32, align: 32, offset: 352)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1310, file: !14, line: 4004, baseType: !945, size: 32, align: 32, offset: 384)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1310, file: !14, line: 4005, baseType: !945, size: 32, align: 32, offset: 416)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1310, file: !14, line: 4010, baseType: !945, size: 32, align: 32, offset: 448)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1310, file: !14, line: 4011, baseType: !945, size: 32, align: 32, offset: 480)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1310, file: !14, line: 4020, baseType: !990, size: 64, align: 32, offset: 512)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1310, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1310, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1310, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1310, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1310, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1310, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1310, file: !14, line: 4039, baseType: !945, size: 32, align: 32, offset: 768)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1310, file: !14, line: 4046, baseType: !969, size: 64, align: 64, offset: 832)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1310, file: !14, line: 4050, baseType: !945, size: 32, align: 32, offset: 896)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1310, file: !14, line: 4054, baseType: !945, size: 32, align: 32, offset: 928)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1310, file: !14, line: 4061, baseType: !945, size: 32, align: 32, offset: 960)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1310, file: !14, line: 4065, baseType: !945, size: 32, align: 32, offset: 992)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1310, file: !14, line: 4073, baseType: !945, size: 32, align: 32, offset: 1024)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1310, file: !14, line: 4080, baseType: !945, size: 32, align: 32, offset: 1056)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1310, file: !14, line: 4084, baseType: !945, size: 32, align: 32, offset: 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1275, file: !14, line: 5781, baseType: !1308, size: 64, align: 64, offset: 320)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1275, file: !14, line: 5787, baseType: !990, size: 64, align: 32, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1275, file: !14, line: 5793, baseType: !990, size: 64, align: 32, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1269, file: !1114, line: 126, baseType: !945, size: 32, align: 32, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1113, file: !1114, line: 172, baseType: !1243, size: 64, align: 64, offset: 576)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1113, file: !1114, line: 177, baseType: !971, size: 64, align: 64, offset: 640)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1113, file: !1114, line: 178, baseType: !946, size: 32, align: 32, offset: 704)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1113, file: !1114, line: 180, baseType: !947, size: 64, align: 64, offset: 768)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1113, file: !1114, line: 185, baseType: !945, size: 32, align: 32, offset: 832)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1113, file: !1114, line: 190, baseType: !947, size: 64, align: 64, offset: 896)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1113, file: !1114, line: 195, baseType: !945, size: 32, align: 32, offset: 960)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1113, file: !1114, line: 200, baseType: !1243, size: 64, align: 64, offset: 1024)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1113, file: !1114, line: 201, baseType: !945, size: 32, align: 32, offset: 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1113, file: !1114, line: 202, baseType: !1120, size: 64, align: 64, offset: 1152)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1113, file: !1114, line: 203, baseType: !945, size: 32, align: 32, offset: 1216)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1113, file: !1114, line: 205, baseType: !945, size: 32, align: 32, offset: 1248)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1113, file: !1114, line: 206, baseType: !945, size: 32, align: 32, offset: 1280)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1113, file: !1114, line: 209, baseType: !1210, size: 64, align: 64, offset: 1344)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1113, file: !1114, line: 212, baseType: !1210, size: 64, align: 64, offset: 1408)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1113, file: !1114, line: 213, baseType: !1120, size: 64, align: 64, offset: 1472)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1113, file: !1114, line: 215, baseType: !945, size: 32, align: 32, offset: 1536)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1113, file: !1114, line: 217, baseType: !945, size: 32, align: 32, offset: 1568)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1113, file: !1114, line: 220, baseType: !945, size: 32, align: 32, offset: 1600)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1100, file: !14, line: 1598, baseType: !947, size: 64, align: 64, offset: 384)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1100, file: !14, line: 1606, baseType: !967, size: 64, align: 64, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1100, file: !14, line: 1614, baseType: !945, size: 32, align: 32, offset: 512)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1100, file: !14, line: 1622, baseType: !945, size: 32, align: 32, offset: 544)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1100, file: !14, line: 1628, baseType: !945, size: 32, align: 32, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1100, file: !14, line: 1636, baseType: !945, size: 32, align: 32, offset: 608)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1100, file: !14, line: 1643, baseType: !945, size: 32, align: 32, offset: 640)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1100, file: !14, line: 1657, baseType: !971, size: 64, align: 64, offset: 704)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1100, file: !14, line: 1658, baseType: !945, size: 32, align: 32, offset: 768)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1100, file: !14, line: 1679, baseType: !990, size: 64, align: 32, offset: 800)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1100, file: !14, line: 1688, baseType: !945, size: 32, align: 32, offset: 864)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1100, file: !14, line: 1712, baseType: !945, size: 32, align: 32, offset: 896)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1100, file: !14, line: 1729, baseType: !945, size: 32, align: 32, offset: 928)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1100, file: !14, line: 1729, baseType: !945, size: 32, align: 32, offset: 960)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1100, file: !14, line: 1744, baseType: !945, size: 32, align: 32, offset: 992)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1100, file: !14, line: 1744, baseType: !945, size: 32, align: 32, offset: 1024)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1100, file: !14, line: 1751, baseType: !945, size: 32, align: 32, offset: 1056)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1100, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1100, file: !14, line: 1791, baseType: !1383, size: 64, align: 64, offset: 1152)
!1383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1384, size: 64, align: 64)
!1384 = !DISubroutineType(types: !1385)
!1385 = !{null, !1386, !1387, !1389, !945, !945, !945}
!1386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1100, file: !14, line: 1808, baseType: !1391, size: 64, align: 64, offset: 1216)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!473, !1386, !997}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1100, file: !14, line: 1816, baseType: !945, size: 32, align: 32, offset: 1280)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1100, file: !14, line: 1825, baseType: !1396, size: 32, align: 32, offset: 1312)
!1396 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1100, file: !14, line: 1830, baseType: !945, size: 32, align: 32, offset: 1344)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1100, file: !14, line: 1838, baseType: !1396, size: 32, align: 32, offset: 1376)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1100, file: !14, line: 1846, baseType: !945, size: 32, align: 32, offset: 1408)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1100, file: !14, line: 1851, baseType: !945, size: 32, align: 32, offset: 1440)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1100, file: !14, line: 1861, baseType: !1396, size: 32, align: 32, offset: 1472)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1100, file: !14, line: 1868, baseType: !1396, size: 32, align: 32, offset: 1504)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1100, file: !14, line: 1875, baseType: !1396, size: 32, align: 32, offset: 1536)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1100, file: !14, line: 1882, baseType: !1396, size: 32, align: 32, offset: 1568)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1100, file: !14, line: 1889, baseType: !1396, size: 32, align: 32, offset: 1600)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1100, file: !14, line: 1896, baseType: !1396, size: 32, align: 32, offset: 1632)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1100, file: !14, line: 1903, baseType: !1396, size: 32, align: 32, offset: 1664)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1100, file: !14, line: 1910, baseType: !945, size: 32, align: 32, offset: 1696)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1100, file: !14, line: 1915, baseType: !945, size: 32, align: 32, offset: 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1100, file: !14, line: 1926, baseType: !1389, size: 64, align: 64, offset: 1792)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1100, file: !14, line: 1935, baseType: !990, size: 64, align: 32, offset: 1856)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1100, file: !14, line: 1942, baseType: !945, size: 32, align: 32, offset: 1920)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1100, file: !14, line: 1948, baseType: !945, size: 32, align: 32, offset: 1952)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1100, file: !14, line: 1954, baseType: !945, size: 32, align: 32, offset: 1984)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1100, file: !14, line: 1960, baseType: !945, size: 32, align: 32, offset: 2016)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1100, file: !14, line: 1984, baseType: !945, size: 32, align: 32, offset: 2048)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1100, file: !14, line: 1991, baseType: !945, size: 32, align: 32, offset: 2080)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1100, file: !14, line: 1996, baseType: !945, size: 32, align: 32, offset: 2112)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1100, file: !14, line: 2004, baseType: !945, size: 32, align: 32, offset: 2144)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1100, file: !14, line: 2011, baseType: !945, size: 32, align: 32, offset: 2176)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1100, file: !14, line: 2018, baseType: !945, size: 32, align: 32, offset: 2208)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1100, file: !14, line: 2027, baseType: !945, size: 32, align: 32, offset: 2240)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1100, file: !14, line: 2034, baseType: !945, size: 32, align: 32, offset: 2272)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1100, file: !14, line: 2044, baseType: !945, size: 32, align: 32, offset: 2304)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1100, file: !14, line: 2054, baseType: !972, size: 64, align: 64, offset: 2368)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1100, file: !14, line: 2061, baseType: !972, size: 64, align: 64, offset: 2432)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1100, file: !14, line: 2066, baseType: !945, size: 32, align: 32, offset: 2496)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1100, file: !14, line: 2070, baseType: !945, size: 32, align: 32, offset: 2528)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1100, file: !14, line: 2078, baseType: !945, size: 32, align: 32, offset: 2560)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1100, file: !14, line: 2085, baseType: !945, size: 32, align: 32, offset: 2592)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1100, file: !14, line: 2092, baseType: !945, size: 32, align: 32, offset: 2624)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1100, file: !14, line: 2099, baseType: !945, size: 32, align: 32, offset: 2656)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1100, file: !14, line: 2106, baseType: !945, size: 32, align: 32, offset: 2688)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1100, file: !14, line: 2113, baseType: !945, size: 32, align: 32, offset: 2720)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1100, file: !14, line: 2120, baseType: !945, size: 32, align: 32, offset: 2752)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1100, file: !14, line: 2125, baseType: !945, size: 32, align: 32, offset: 2784)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1100, file: !14, line: 2133, baseType: !945, size: 32, align: 32, offset: 2816)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1100, file: !14, line: 2140, baseType: !945, size: 32, align: 32, offset: 2848)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1100, file: !14, line: 2145, baseType: !945, size: 32, align: 32, offset: 2880)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1100, file: !14, line: 2153, baseType: !945, size: 32, align: 32, offset: 2912)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1100, file: !14, line: 2158, baseType: !945, size: 32, align: 32, offset: 2944)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1100, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1100, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1100, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1100, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1100, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1100, file: !14, line: 2203, baseType: !945, size: 32, align: 32, offset: 3136)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1100, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1100, file: !14, line: 2212, baseType: !945, size: 32, align: 32, offset: 3200)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1100, file: !14, line: 2213, baseType: !945, size: 32, align: 32, offset: 3232)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1100, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1100, file: !14, line: 2232, baseType: !945, size: 32, align: 32, offset: 3296)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1100, file: !14, line: 2243, baseType: !945, size: 32, align: 32, offset: 3328)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1100, file: !14, line: 2249, baseType: !945, size: 32, align: 32, offset: 3360)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1100, file: !14, line: 2256, baseType: !945, size: 32, align: 32, offset: 3392)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1100, file: !14, line: 2263, baseType: !969, size: 64, align: 64, offset: 3456)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1100, file: !14, line: 2270, baseType: !969, size: 64, align: 64, offset: 3520)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1100, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1100, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1100, file: !14, line: 2367, baseType: !1461, size: 64, align: 64, offset: 3648)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!945, !1386, !1120, !945}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1100, file: !14, line: 2383, baseType: !945, size: 32, align: 32, offset: 3712)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1100, file: !14, line: 2386, baseType: !1396, size: 32, align: 32, offset: 3744)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1100, file: !14, line: 2387, baseType: !1396, size: 32, align: 32, offset: 3776)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1100, file: !14, line: 2394, baseType: !945, size: 32, align: 32, offset: 3808)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1100, file: !14, line: 2401, baseType: !945, size: 32, align: 32, offset: 3840)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1100, file: !14, line: 2408, baseType: !945, size: 32, align: 32, offset: 3872)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1100, file: !14, line: 2415, baseType: !945, size: 32, align: 32, offset: 3904)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1100, file: !14, line: 2422, baseType: !945, size: 32, align: 32, offset: 3936)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1100, file: !14, line: 2423, baseType: !1473, size: 64, align: 64, offset: 3968)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1476)
!1476 = !{!1477, !1478, !1479, !1480}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1475, file: !14, line: 827, baseType: !945, size: 32, align: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1475, file: !14, line: 828, baseType: !945, size: 32, align: 32, offset: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1475, file: !14, line: 829, baseType: !945, size: 32, align: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1475, file: !14, line: 830, baseType: !1396, size: 32, align: 32, offset: 96)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1100, file: !14, line: 2430, baseType: !967, size: 64, align: 64, offset: 4032)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1100, file: !14, line: 2437, baseType: !967, size: 64, align: 64, offset: 4096)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1100, file: !14, line: 2444, baseType: !1396, size: 32, align: 32, offset: 4160)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1100, file: !14, line: 2451, baseType: !1396, size: 32, align: 32, offset: 4192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1100, file: !14, line: 2458, baseType: !945, size: 32, align: 32, offset: 4224)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1100, file: !14, line: 2469, baseType: !945, size: 32, align: 32, offset: 4256)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1100, file: !14, line: 2475, baseType: !945, size: 32, align: 32, offset: 4288)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1100, file: !14, line: 2481, baseType: !945, size: 32, align: 32, offset: 4320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1100, file: !14, line: 2485, baseType: !945, size: 32, align: 32, offset: 4352)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1100, file: !14, line: 2489, baseType: !945, size: 32, align: 32, offset: 4384)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1100, file: !14, line: 2493, baseType: !945, size: 32, align: 32, offset: 4416)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1100, file: !14, line: 2501, baseType: !945, size: 32, align: 32, offset: 4448)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1100, file: !14, line: 2506, baseType: !945, size: 32, align: 32, offset: 4480)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1100, file: !14, line: 2510, baseType: !945, size: 32, align: 32, offset: 4512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1100, file: !14, line: 2514, baseType: !967, size: 64, align: 64, offset: 4544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1100, file: !14, line: 2528, baseType: !1497, size: 64, align: 64, offset: 4608)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1386, !947, !945, !945}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1100, file: !14, line: 2534, baseType: !945, size: 32, align: 32, offset: 4672)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1100, file: !14, line: 2545, baseType: !945, size: 32, align: 32, offset: 4704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1100, file: !14, line: 2547, baseType: !945, size: 32, align: 32, offset: 4736)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1100, file: !14, line: 2549, baseType: !945, size: 32, align: 32, offset: 4768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1100, file: !14, line: 2551, baseType: !945, size: 32, align: 32, offset: 4800)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1100, file: !14, line: 2553, baseType: !945, size: 32, align: 32, offset: 4832)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1100, file: !14, line: 2555, baseType: !945, size: 32, align: 32, offset: 4864)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1100, file: !14, line: 2557, baseType: !945, size: 32, align: 32, offset: 4896)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1100, file: !14, line: 2559, baseType: !945, size: 32, align: 32, offset: 4928)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1100, file: !14, line: 2563, baseType: !945, size: 32, align: 32, offset: 4960)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1100, file: !14, line: 2571, baseType: !1511, size: 64, align: 64, offset: 4992)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1100, file: !14, line: 2579, baseType: !1511, size: 64, align: 64, offset: 5056)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1100, file: !14, line: 2586, baseType: !945, size: 32, align: 32, offset: 5120)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1100, file: !14, line: 2615, baseType: !945, size: 32, align: 32, offset: 5152)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1100, file: !14, line: 2627, baseType: !945, size: 32, align: 32, offset: 5184)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1100, file: !14, line: 2637, baseType: !945, size: 32, align: 32, offset: 5216)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1100, file: !14, line: 2681, baseType: !945, size: 32, align: 32, offset: 5248)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1100, file: !14, line: 2709, baseType: !967, size: 64, align: 64, offset: 5312)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1100, file: !14, line: 2716, baseType: !1520, size: 64, align: 64, offset: 5376)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1523)
!1523 = !{!1524, !1525, !1526, !1527, !1528, !1529, !1533, !1537, !1541, !1542, !1543, !1544, !1550, !1551, !1552, !1553, !1554}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1522, file: !14, line: 3642, baseType: !980, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1522, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1522, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1522, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1522, file: !14, line: 3669, baseType: !945, size: 32, align: 32, offset: 160)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1522, file: !14, line: 3682, baseType: !1530, size: 64, align: 64, offset: 192)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!945, !1098, !1120}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1522, file: !14, line: 3698, baseType: !1534, size: 64, align: 64, offset: 256)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!945, !1098, !956, !954}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1522, file: !14, line: 3712, baseType: !1538, size: 64, align: 64, offset: 320)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64, align: 64)
!1539 = !DISubroutineType(types: !1540)
!1540 = !{!945, !1098, !945, !956, !954}
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1522, file: !14, line: 3726, baseType: !1534, size: 64, align: 64, offset: 384)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1522, file: !14, line: 3737, baseType: !1095, size: 64, align: 64, offset: 448)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1522, file: !14, line: 3746, baseType: !945, size: 32, align: 32, offset: 512)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1522, file: !14, line: 3757, baseType: !1545, size: 64, align: 64, offset: 576)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{null, !1548}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1522, file: !14, line: 3766, baseType: !1095, size: 64, align: 64, offset: 640)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1522, file: !14, line: 3774, baseType: !1095, size: 64, align: 64, offset: 704)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1522, file: !14, line: 3780, baseType: !945, size: 32, align: 32, offset: 768)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1522, file: !14, line: 3785, baseType: !945, size: 32, align: 32, offset: 800)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1522, file: !14, line: 3795, baseType: !1555, size: 64, align: 64, offset: 832)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!945, !1098, !1157}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1100, file: !14, line: 2728, baseType: !947, size: 64, align: 64, offset: 5440)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1100, file: !14, line: 2735, baseType: !1147, size: 512, align: 64, offset: 5504)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1100, file: !14, line: 2742, baseType: !945, size: 32, align: 32, offset: 6016)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1100, file: !14, line: 2755, baseType: !945, size: 32, align: 32, offset: 6048)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1100, file: !14, line: 2776, baseType: !945, size: 32, align: 32, offset: 6080)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1100, file: !14, line: 2783, baseType: !945, size: 32, align: 32, offset: 6112)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1100, file: !14, line: 2791, baseType: !945, size: 32, align: 32, offset: 6144)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1100, file: !14, line: 2802, baseType: !1120, size: 64, align: 64, offset: 6208)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1100, file: !14, line: 2811, baseType: !945, size: 32, align: 32, offset: 6272)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1100, file: !14, line: 2821, baseType: !945, size: 32, align: 32, offset: 6304)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1100, file: !14, line: 2830, baseType: !945, size: 32, align: 32, offset: 6336)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1100, file: !14, line: 2840, baseType: !945, size: 32, align: 32, offset: 6368)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1100, file: !14, line: 2851, baseType: !1571, size: 64, align: 64, offset: 6400)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64, align: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{!945, !1386, !1574, !947, !1389, !945, !945}
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!945, !1386, !947}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1100, file: !14, line: 2871, baseType: !1578, size: 64, align: 64, offset: 6464)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DISubroutineType(types: !1580)
!1580 = !{!945, !1386, !1581, !947, !1389, !945}
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1582, size: 64, align: 64)
!1582 = !DISubroutineType(types: !1583)
!1583 = !{!945, !1386, !947, !945, !945}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1100, file: !14, line: 2878, baseType: !945, size: 32, align: 32, offset: 6528)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1100, file: !14, line: 2885, baseType: !945, size: 32, align: 32, offset: 6560)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1100, file: !14, line: 3005, baseType: !945, size: 32, align: 32, offset: 6592)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1100, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1100, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1100, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1100, file: !14, line: 3037, baseType: !971, size: 64, align: 64, offset: 6720)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1100, file: !14, line: 3038, baseType: !945, size: 32, align: 32, offset: 6784)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1100, file: !14, line: 3050, baseType: !969, size: 64, align: 64, offset: 6848)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1100, file: !14, line: 3065, baseType: !945, size: 32, align: 32, offset: 6912)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1100, file: !14, line: 3083, baseType: !945, size: 32, align: 32, offset: 6944)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1100, file: !14, line: 3092, baseType: !990, size: 64, align: 32, offset: 6976)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1100, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1100, file: !14, line: 3106, baseType: !990, size: 64, align: 32, offset: 7072)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1100, file: !14, line: 3113, baseType: !1599, size: 64, align: 64, offset: 7168)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1601)
!1601 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1602)
!1602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1603)
!1603 = !{!1604, !1605, !1606, !1607, !1608, !1609, !1612}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1602, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1602, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1602, file: !14, line: 720, baseType: !980, size: 64, align: 64, offset: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1602, file: !14, line: 724, baseType: !980, size: 64, align: 64, offset: 128)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1602, file: !14, line: 728, baseType: !945, size: 32, align: 32, offset: 192)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1602, file: !14, line: 734, baseType: !1610, size: 64, align: 64, offset: 256)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1602, file: !14, line: 739, baseType: !1613, size: 64, align: 64, offset: 320)
!1613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1614, size: 64, align: 64)
!1614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1100, file: !14, line: 3129, baseType: !967, size: 64, align: 64, offset: 7232)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1100, file: !14, line: 3130, baseType: !967, size: 64, align: 64, offset: 7296)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1100, file: !14, line: 3131, baseType: !967, size: 64, align: 64, offset: 7360)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1100, file: !14, line: 3132, baseType: !967, size: 64, align: 64, offset: 7424)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1100, file: !14, line: 3139, baseType: !1511, size: 64, align: 64, offset: 7488)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1100, file: !14, line: 3147, baseType: !945, size: 32, align: 32, offset: 7552)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1100, file: !14, line: 3165, baseType: !945, size: 32, align: 32, offset: 7584)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1100, file: !14, line: 3172, baseType: !945, size: 32, align: 32, offset: 7616)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1100, file: !14, line: 3180, baseType: !945, size: 32, align: 32, offset: 7648)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1100, file: !14, line: 3191, baseType: !972, size: 64, align: 64, offset: 7680)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1100, file: !14, line: 3199, baseType: !971, size: 64, align: 64, offset: 7744)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1100, file: !14, line: 3207, baseType: !1511, size: 64, align: 64, offset: 7808)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1100, file: !14, line: 3214, baseType: !946, size: 32, align: 32, offset: 7872)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1100, file: !14, line: 3224, baseType: !1255, size: 64, align: 64, offset: 7936)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1100, file: !14, line: 3225, baseType: !945, size: 32, align: 32, offset: 8000)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1100, file: !14, line: 3249, baseType: !1157, size: 64, align: 64, offset: 8064)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1100, file: !14, line: 3256, baseType: !945, size: 32, align: 32, offset: 8128)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1100, file: !14, line: 3271, baseType: !945, size: 32, align: 32, offset: 8160)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1100, file: !14, line: 3279, baseType: !967, size: 64, align: 64, offset: 8192)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1100, file: !14, line: 3301, baseType: !1157, size: 64, align: 64, offset: 8256)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1100, file: !14, line: 3310, baseType: !945, size: 32, align: 32, offset: 8320)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1100, file: !14, line: 3337, baseType: !945, size: 32, align: 32, offset: 8352)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1100, file: !14, line: 3351, baseType: !945, size: 32, align: 32, offset: 8384)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1100, file: !14, line: 3359, baseType: !945, size: 32, align: 32, offset: 8416)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !977, file: !14, line: 3535, baseType: !1640, size: 64, align: 64, offset: 1024)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!945, !1098, !1643}
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !977, file: !14, line: 3541, baseType: !1646, size: 64, align: 64, offset: 1088)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1648)
!1648 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1114, line: 223, size: 128, align: 64, elements: !1650)
!1650 = !{!1651, !1652}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1649, file: !1114, line: 224, baseType: !956, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1649, file: !1114, line: 225, baseType: !956, size: 64, align: 64, offset: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !977, file: !14, line: 3549, baseType: !1654, size: 64, align: 64, offset: 1152)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1093}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !977, file: !14, line: 3551, baseType: !1095, size: 64, align: 64, offset: 1216)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !977, file: !14, line: 3552, baseType: !1659, size: 64, align: 64, offset: 1280)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{!945, !1098, !971, !945, !1662}
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1664)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1665)
!1665 = !{!1666, !1667, !1668, !1669, !1670, !1694}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1664, file: !14, line: 3921, baseType: !965, size: 16, align: 16)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1664, file: !14, line: 3922, baseType: !954, size: 32, align: 32, offset: 32)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1664, file: !14, line: 3923, baseType: !954, size: 32, align: 32, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1664, file: !14, line: 3924, baseType: !946, size: 32, align: 32, offset: 96)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1664, file: !14, line: 3925, baseType: !1671, size: 64, align: 64, offset: 128)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1674)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1675)
!1675 = !{!1676, !1677, !1678, !1679, !1680, !1681, !1687, !1689, !1690, !1691, !1692, !1693}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1674, file: !14, line: 3886, baseType: !945, size: 32, align: 32)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1674, file: !14, line: 3887, baseType: !945, size: 32, align: 32, offset: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1674, file: !14, line: 3888, baseType: !945, size: 32, align: 32, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1674, file: !14, line: 3889, baseType: !945, size: 32, align: 32, offset: 96)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1674, file: !14, line: 3890, baseType: !945, size: 32, align: 32, offset: 128)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1674, file: !14, line: 3897, baseType: !1682, size: 768, align: 64, offset: 192)
!1682 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1683)
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1684)
!1684 = !{!1685, !1686}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1683, file: !14, line: 3855, baseType: !1125, size: 512, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1683, file: !14, line: 3857, baseType: !1129, size: 256, align: 32, offset: 512)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1674, file: !14, line: 3903, baseType: !1688, size: 256, align: 64, offset: 960)
!1688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 256, align: 64, elements: !1226)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1674, file: !14, line: 3904, baseType: !1233, size: 128, align: 32, offset: 1216)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1674, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1674, file: !14, line: 3908, baseType: !1511, size: 64, align: 64, offset: 1408)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1674, file: !14, line: 3915, baseType: !1511, size: 64, align: 64, offset: 1472)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1674, file: !14, line: 3917, baseType: !945, size: 32, align: 32, offset: 1536)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1664, file: !14, line: 3926, baseType: !967, size: 64, align: 64, offset: 192)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !977, file: !14, line: 3564, baseType: !1696, size: 64, align: 64, offset: 1344)
!1696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1697, size: 64, align: 64)
!1697 = !DISubroutineType(types: !1698)
!1698 = !{!945, !1098, !1243, !1387, !1389}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !977, file: !14, line: 3566, baseType: !1700, size: 64, align: 64, offset: 1408)
!1700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64, align: 64)
!1701 = !DISubroutineType(types: !1702)
!1702 = !{!945, !1098, !947, !1389, !1243}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !977, file: !14, line: 3567, baseType: !1095, size: 64, align: 64, offset: 1472)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !977, file: !14, line: 3576, baseType: !1705, size: 64, align: 64, offset: 1536)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DISubroutineType(types: !1707)
!1707 = !{!945, !1098, !1387}
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !977, file: !14, line: 3577, baseType: !1709, size: 64, align: 64, offset: 1600)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!945, !1098, !1243}
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !977, file: !14, line: 3584, baseType: !1530, size: 64, align: 64, offset: 1664)
