; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--options.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--options.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !47, line: 3865, size: 32, align: 32, elements: !884)
!884 = !{!885, !886, !887, !888}
!885 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!886 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!887 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!888 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !47, line: 1534, size: 32, align: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896}
!891 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!892 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!893 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!894 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!895 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!896 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !47, line: 810, size: 32, align: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!900 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!901 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!902 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!903 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!904 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!905 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!906 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !47, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !47, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !{!939, !942, !960}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !940, line: 40, baseType: !941)
!940 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!941 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !919, line: 1947, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !945)
!945 = !{!946, !1030, !1142, !1284, !1285, !1350, !1351, !1352, !2045, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2099, !2100, !2101, !2102, !2103, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2154, !2155, !2158, !2159, !2160, !2161, !2162, !2163, !2165, !2166, !2167, !2168, !2176, !2177, !2181, !2185, !2186, !2187}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !944, file: !919, line: 1342, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !951)
!951 = !{!952, !956, !961, !989, !990, !991, !992, !996, !1002, !1004, !1008}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !950, file: !26, line: 72, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !950, file: !26, line: 78, baseType: !957, size: 64, align: 64, offset: 64)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DISubroutineType(types: !959)
!959 = !{!953, !960}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !950, file: !26, line: 85, baseType: !962, size: 64, align: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !965)
!965 = !{!966, !967, !968, !970, !971, !985, !986, !987, !988}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !964, file: !4, line: 247, baseType: !953, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !964, file: !4, line: 253, baseType: !953, size: 64, align: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !964, file: !4, line: 259, baseType: !969, size: 32, align: 32, offset: 128)
!969 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !964, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !964, file: !4, line: 271, baseType: !972, size: 64, align: 64, offset: 192)
!972 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !964, file: !4, line: 265, size: 64, align: 64, elements: !973)
!973 = !{!974, !975, !977, !978}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !972, file: !4, line: 266, baseType: !939, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !972, file: !4, line: 267, baseType: !976, size: 64, align: 64)
!976 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !972, file: !4, line: 268, baseType: !953, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !972, file: !4, line: 270, baseType: !979, size: 64, align: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !980, line: 61, baseType: !981)
!980 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !980, line: 58, size: 64, align: 32, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !981, file: !980, line: 59, baseType: !969, size: 32, align: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !981, file: !980, line: 60, baseType: !969, size: 32, align: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !964, file: !4, line: 272, baseType: !976, size: 64, align: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !964, file: !4, line: 273, baseType: !976, size: 64, align: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !4, line: 275, baseType: !969, size: 32, align: 32, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !964, file: !4, line: 300, baseType: !953, size: 64, align: 64, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !950, file: !26, line: 93, baseType: !969, size: 32, align: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !950, file: !26, line: 99, baseType: !969, size: 32, align: 32, offset: 224)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !950, file: !26, line: 108, baseType: !969, size: 32, align: 32, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !950, file: !26, line: 113, baseType: !993, size: 64, align: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!960, !960, !960}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !950, file: !26, line: 123, baseType: !997, size: 64, align: 64, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!1000, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !950, file: !26, line: 130, baseType: !1003, size: 32, align: 32, offset: 448)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !950, file: !26, line: 136, baseType: !1005, size: 64, align: 64, offset: 512)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!1003, !960}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !950, file: !26, line: 142, baseType: !1009, size: 64, align: 64, offset: 576)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{!969, !1012, !960, !953, !969}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1015)
!1015 = !{!1016, !1028, !1029}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1014, file: !4, line: 360, baseType: !1017, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1021)
!1021 = !{!1022, !1023, !1024, !1025, !1026, !1027}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1020, file: !4, line: 307, baseType: !953, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1020, file: !4, line: 313, baseType: !976, size: 64, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1020, file: !4, line: 313, baseType: !976, size: 64, align: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1020, file: !4, line: 318, baseType: !976, size: 64, align: 64, offset: 192)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1020, file: !4, line: 318, baseType: !976, size: 64, align: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1020, file: !4, line: 323, baseType: !969, size: 32, align: 32, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1014, file: !4, line: 364, baseType: !969, size: 32, align: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1014, file: !4, line: 368, baseType: !969, size: 32, align: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !944, file: !919, line: 1349, baseType: !1031, size: 64, align: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1049, !1050, !1051, !1052, !1053, !1054, !1068, !1073, !1113, !1114, !1118, !1123, !1124, !1125, !1129, !1135, !1141}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1032, file: !919, line: 638, baseType: !953, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1032, file: !919, line: 645, baseType: !953, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1032, file: !919, line: 652, baseType: !969, size: 32, align: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1032, file: !919, line: 659, baseType: !953, size: 64, align: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1032, file: !919, line: 661, baseType: !1039, size: 64, align: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !1044, line: 44, size: 64, align: 32, elements: !1045)
!1044 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1043, file: !1044, line: 45, baseType: !46, size: 32, align: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1043, file: !1044, line: 46, baseType: !1048, size: 32, align: 32, offset: 32)
!1048 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1032, file: !919, line: 663, baseType: !947, size: 64, align: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1032, file: !919, line: 670, baseType: !953, size: 64, align: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1032, file: !919, line: 679, baseType: !1031, size: 64, align: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1032, file: !919, line: 684, baseType: !969, size: 32, align: 32, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1032, file: !919, line: 689, baseType: !969, size: 32, align: 32, offset: 544)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1032, file: !919, line: 696, baseType: !1055, size: 64, align: 64, offset: 576)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!969, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1061)
!1061 = !{!1062, !1063, !1066, !1067}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1060, file: !919, line: 449, baseType: !953, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1060, file: !919, line: 450, baseType: !1064, size: 64, align: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1060, file: !919, line: 451, baseType: !969, size: 32, align: 32, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1060, file: !919, line: 452, baseType: !953, size: 64, align: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1032, file: !919, line: 703, baseType: !1069, size: 64, align: 64, offset: 640)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64, align: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!969, !1072}
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1032, file: !919, line: 714, baseType: !1074, size: 64, align: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!969, !1072, !1077}
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !47, line: 1499, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !47, line: 1445, size: 704, align: 64, elements: !1080)
!1080 = !{!1081, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1109, !1110, !1111, !1112}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1079, file: !47, line: 1451, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1084, line: 94, baseType: !1085)
!1084 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1084, line: 81, size: 192, align: 64, elements: !1086)
!1086 = !{!1087, !1091, !1094}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1085, file: !1084, line: 82, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1084, line: 73, baseType: !1090)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1084, line: 73, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1085, file: !1084, line: 89, baseType: !1092, size: 64, align: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !940, line: 48, baseType: !1065)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1085, file: !1084, line: 93, baseType: !969, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1079, file: !47, line: 1461, baseType: !939, size: 64, align: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1079, file: !47, line: 1467, baseType: !939, size: 64, align: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1079, file: !47, line: 1468, baseType: !1092, size: 64, align: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1079, file: !47, line: 1469, baseType: !969, size: 32, align: 32, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1079, file: !47, line: 1470, baseType: !969, size: 32, align: 32, offset: 288)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1079, file: !47, line: 1474, baseType: !969, size: 32, align: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1079, file: !47, line: 1479, baseType: !1102, size: 64, align: 64, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !47, line: 1415, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !47, line: 1411, size: 128, align: 64, elements: !1105)
!1105 = !{!1106, !1107, !1108}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1104, file: !47, line: 1412, baseType: !1092, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1104, file: !47, line: 1413, baseType: !969, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1104, file: !47, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1079, file: !47, line: 1480, baseType: !969, size: 32, align: 32, offset: 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1079, file: !47, line: 1486, baseType: !939, size: 64, align: 64, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1079, file: !47, line: 1488, baseType: !939, size: 64, align: 64, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1079, file: !47, line: 1497, baseType: !939, size: 64, align: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1032, file: !919, line: 720, baseType: !1069, size: 64, align: 64, offset: 768)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1032, file: !919, line: 730, baseType: !1115, size: 64, align: 64, offset: 832)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!969, !1072, !969, !939, !969}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1032, file: !919, line: 737, baseType: !1119, size: 64, align: 64, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DISubroutineType(types: !1121)
!1121 = !{!939, !1072, !969, !1122, !939}
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1032, file: !919, line: 744, baseType: !1069, size: 64, align: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1032, file: !919, line: 750, baseType: !1069, size: 64, align: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1032, file: !919, line: 758, baseType: !1126, size: 64, align: 64, offset: 1088)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!969, !1072, !969, !939, !939, !939, !969}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1032, file: !919, line: 764, baseType: !1130, size: 64, align: 64, offset: 1152)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!969, !1072, !1133}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1032, file: !919, line: 770, baseType: !1136, size: 64, align: 64, offset: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!969, !1072, !1139}
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1032, file: !919, line: 776, baseType: !1136, size: 64, align: 64, offset: 1280)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !944, file: !919, line: 1356, baseType: !1143, size: 64, align: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1165, !1169, !1173, !1180, !1269, !1270, !1271, !1272, !1273, !1274, !1278}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1144, file: !919, line: 498, baseType: !953, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1144, file: !919, line: 504, baseType: !953, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1144, file: !919, line: 505, baseType: !953, size: 64, align: 64, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1144, file: !919, line: 506, baseType: !953, size: 64, align: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1144, file: !919, line: 508, baseType: !46, size: 32, align: 32, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1144, file: !919, line: 509, baseType: !46, size: 32, align: 32, offset: 288)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1144, file: !919, line: 510, baseType: !46, size: 32, align: 32, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1144, file: !919, line: 517, baseType: !969, size: 32, align: 32, offset: 352)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1144, file: !919, line: 523, baseType: !1039, size: 64, align: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1144, file: !919, line: 526, baseType: !947, size: 64, align: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1144, file: !919, line: 535, baseType: !1143, size: 64, align: 64, offset: 512)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1144, file: !919, line: 539, baseType: !969, size: 32, align: 32, offset: 576)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1144, file: !919, line: 541, baseType: !1069, size: 64, align: 64, offset: 640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1144, file: !919, line: 549, baseType: !1074, size: 64, align: 64, offset: 704)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1144, file: !919, line: 550, baseType: !1069, size: 64, align: 64, offset: 768)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1144, file: !919, line: 554, baseType: !1162, size: 64, align: 64, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!969, !1072, !1077, !1077, !969}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1144, file: !919, line: 563, baseType: !1166, size: 64, align: 64, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{!969, !46, !969}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1144, file: !919, line: 565, baseType: !1170, size: 64, align: 64, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{null, !1072, !969, !1122, !1122}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1144, file: !919, line: 570, baseType: !1174, size: 64, align: 64, offset: 1024)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!969, !1072, !969, !960, !1177}
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1178, line: 216, baseType: !1179)
!1178 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1179 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1144, file: !919, line: 581, baseType: !1181, size: 64, align: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!969, !1072, !969, !1184, !1048}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1188)
!1188 = !{!1189, !1193, !1195, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1223, !1225, !1226, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1187, file: !548, line: 282, baseType: !1190, size: 512, align: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 512, align: 64, elements: !1191)
!1191 = !{!1192}
!1192 = !DISubrange(count: 8)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1187, file: !548, line: 299, baseType: !1194, size: 256, align: 32, offset: 512)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 256, align: 32, elements: !1191)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1187, file: !548, line: 315, baseType: !1196, size: 64, align: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1187, file: !548, line: 326, baseType: !969, size: 32, align: 32, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1187, file: !548, line: 326, baseType: !969, size: 32, align: 32, offset: 864)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1187, file: !548, line: 334, baseType: !969, size: 32, align: 32, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1187, file: !548, line: 341, baseType: !969, size: 32, align: 32, offset: 928)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1187, file: !548, line: 346, baseType: !969, size: 32, align: 32, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1187, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1187, file: !548, line: 356, baseType: !979, size: 64, align: 32, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1187, file: !548, line: 361, baseType: !939, size: 64, align: 64, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1187, file: !548, line: 369, baseType: !939, size: 64, align: 64, offset: 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1187, file: !548, line: 377, baseType: !939, size: 64, align: 64, offset: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1187, file: !548, line: 382, baseType: !969, size: 32, align: 32, offset: 1280)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1187, file: !548, line: 386, baseType: !969, size: 32, align: 32, offset: 1312)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1187, file: !548, line: 391, baseType: !969, size: 32, align: 32, offset: 1344)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1187, file: !548, line: 396, baseType: !960, size: 64, align: 64, offset: 1408)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1187, file: !548, line: 403, baseType: !1212, size: 512, align: 64, offset: 1472)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1213, size: 512, align: 64, elements: !1191)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !940, line: 55, baseType: !1179)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1187, file: !548, line: 410, baseType: !969, size: 32, align: 32, offset: 1984)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1187, file: !548, line: 415, baseType: !969, size: 32, align: 32, offset: 2016)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1187, file: !548, line: 420, baseType: !969, size: 32, align: 32, offset: 2048)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1187, file: !548, line: 425, baseType: !969, size: 32, align: 32, offset: 2080)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1187, file: !548, line: 435, baseType: !939, size: 64, align: 64, offset: 2112)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1187, file: !548, line: 440, baseType: !969, size: 32, align: 32, offset: 2176)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1187, file: !548, line: 445, baseType: !1213, size: 64, align: 64, offset: 2240)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1187, file: !548, line: 459, baseType: !1222, size: 512, align: 64, offset: 2304)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 512, align: 64, elements: !1191)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1187, file: !548, line: 473, baseType: !1224, size: 64, align: 64, offset: 2816)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1187, file: !548, line: 477, baseType: !969, size: 32, align: 32, offset: 2880)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1187, file: !548, line: 479, baseType: !1227, size: 64, align: 64, offset: 2944)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1235, !1240}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1230, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1230, file: !548, line: 203, baseType: !1092, size: 64, align: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1230, file: !548, line: 204, baseType: !969, size: 32, align: 32, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1230, file: !548, line: 205, baseType: !1236, size: 64, align: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1238, line: 86, baseType: !1239)
!1238 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1238, line: 86, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1230, file: !548, line: 206, baseType: !1082, size: 64, align: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1187, file: !548, line: 480, baseType: !969, size: 32, align: 32, offset: 3008)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1187, file: !548, line: 505, baseType: !969, size: 32, align: 32, offset: 3040)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1187, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1187, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1187, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1187, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1187, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1187, file: !548, line: 532, baseType: !939, size: 64, align: 64, offset: 3264)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1187, file: !548, line: 539, baseType: !939, size: 64, align: 64, offset: 3328)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1187, file: !548, line: 547, baseType: !939, size: 64, align: 64, offset: 3392)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1187, file: !548, line: 554, baseType: !1236, size: 64, align: 64, offset: 3456)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1187, file: !548, line: 563, baseType: !969, size: 32, align: 32, offset: 3520)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1187, file: !548, line: 572, baseType: !969, size: 32, align: 32, offset: 3552)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1187, file: !548, line: 581, baseType: !969, size: 32, align: 32, offset: 3584)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1187, file: !548, line: 588, baseType: !1256, size: 64, align: 64, offset: 3648)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !940, line: 36, baseType: !1258)
!1258 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1187, file: !548, line: 593, baseType: !969, size: 32, align: 32, offset: 3712)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1187, file: !548, line: 596, baseType: !969, size: 32, align: 32, offset: 3744)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1187, file: !548, line: 599, baseType: !1082, size: 64, align: 64, offset: 3776)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1187, file: !548, line: 605, baseType: !1082, size: 64, align: 64, offset: 3840)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1187, file: !548, line: 616, baseType: !1082, size: 64, align: 64, offset: 3904)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1187, file: !548, line: 626, baseType: !1177, size: 64, align: 64, offset: 3968)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1187, file: !548, line: 627, baseType: !1177, size: 64, align: 64, offset: 4032)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1187, file: !548, line: 628, baseType: !1177, size: 64, align: 64, offset: 4096)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1187, file: !548, line: 629, baseType: !1177, size: 64, align: 64, offset: 4160)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1187, file: !548, line: 645, baseType: !1082, size: 64, align: 64, offset: 4224)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1144, file: !919, line: 587, baseType: !1130, size: 64, align: 64, offset: 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1144, file: !919, line: 592, baseType: !1136, size: 64, align: 64, offset: 1216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1144, file: !919, line: 597, baseType: !1136, size: 64, align: 64, offset: 1280)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1144, file: !919, line: 598, baseType: !46, size: 32, align: 32, offset: 1344)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1144, file: !919, line: 608, baseType: !1069, size: 64, align: 64, offset: 1408)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1144, file: !919, line: 617, baseType: !1275, size: 64, align: 64, offset: 1472)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{null, !1072}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1144, file: !919, line: 623, baseType: !1279, size: 64, align: 64, offset: 1536)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!969, !1072, !1282}
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1078)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !944, file: !919, line: 1365, baseType: !960, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !944, file: !919, line: 1379, baseType: !1286, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1289)
!1289 = !{!1290, !1291, !1292, !1293, !1294, !1295, !1296, !1300, !1301, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1317, !1318, !1322, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1340, !1341, !1342, !1343, !1347, !1348, !1349}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1288, file: !650, line: 174, baseType: !947, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1288, file: !650, line: 226, baseType: !1064, size: 64, align: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1288, file: !650, line: 227, baseType: !969, size: 32, align: 32, offset: 128)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1288, file: !650, line: 228, baseType: !1064, size: 64, align: 64, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1288, file: !650, line: 229, baseType: !1064, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1288, file: !650, line: 233, baseType: !960, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1288, file: !650, line: 235, baseType: !1297, size: 64, align: 64, offset: 384)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!969, !960, !1092, !969}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1288, file: !650, line: 236, baseType: !1297, size: 64, align: 64, offset: 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1288, file: !650, line: 237, baseType: !1302, size: 64, align: 64, offset: 512)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!939, !960, !939, !969}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1288, file: !650, line: 238, baseType: !939, size: 64, align: 64, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1288, file: !650, line: 239, baseType: !969, size: 32, align: 32, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1288, file: !650, line: 240, baseType: !969, size: 32, align: 32, offset: 672)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1288, file: !650, line: 241, baseType: !969, size: 32, align: 32, offset: 704)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1288, file: !650, line: 242, baseType: !1179, size: 64, align: 64, offset: 768)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1288, file: !650, line: 243, baseType: !1064, size: 64, align: 64, offset: 832)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1288, file: !650, line: 244, baseType: !1312, size: 64, align: 64, offset: 896)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{!1179, !1179, !1315, !1048}
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1093)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1288, file: !650, line: 245, baseType: !969, size: 32, align: 32, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1288, file: !650, line: 249, baseType: !1319, size: 64, align: 64, offset: 1024)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!969, !960, !969}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1288, file: !650, line: 255, baseType: !1323, size: 64, align: 64, offset: 1088)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!939, !960, !969, !939, !969}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1288, file: !650, line: 260, baseType: !969, size: 32, align: 32, offset: 1152)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1288, file: !650, line: 266, baseType: !939, size: 64, align: 64, offset: 1216)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1288, file: !650, line: 273, baseType: !969, size: 32, align: 32, offset: 1280)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1288, file: !650, line: 279, baseType: !939, size: 64, align: 64, offset: 1344)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1288, file: !650, line: 285, baseType: !969, size: 32, align: 32, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1288, file: !650, line: 291, baseType: !969, size: 32, align: 32, offset: 1440)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1288, file: !650, line: 298, baseType: !969, size: 32, align: 32, offset: 1472)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1288, file: !650, line: 304, baseType: !969, size: 32, align: 32, offset: 1504)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1288, file: !650, line: 309, baseType: !953, size: 64, align: 64, offset: 1536)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1288, file: !650, line: 314, baseType: !953, size: 64, align: 64, offset: 1600)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1288, file: !650, line: 319, baseType: !1337, size: 64, align: 64, offset: 1664)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!969, !960, !1092, !969, !649, !939}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1288, file: !650, line: 326, baseType: !969, size: 32, align: 32, offset: 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1288, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1288, file: !650, line: 332, baseType: !939, size: 64, align: 64, offset: 1792)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1288, file: !650, line: 338, baseType: !1344, size: 64, align: 64, offset: 1856)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!969, !960}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1288, file: !650, line: 340, baseType: !939, size: 64, align: 64, offset: 1920)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1288, file: !650, line: 346, baseType: !1064, size: 64, align: 64, offset: 1984)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1288, file: !650, line: 351, baseType: !969, size: 32, align: 32, offset: 2048)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !944, file: !919, line: 1386, baseType: !969, size: 32, align: 32, offset: 320)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !944, file: !919, line: 1393, baseType: !1048, size: 32, align: 32, offset: 352)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !944, file: !919, line: 1405, baseType: !1353, size: 64, align: 64, offset: 384)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1781, !1782, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1831, !1854, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1931, !1937, !1938, !1942, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1974, !1975, !1976, !1977, !1978, !1979}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1356, file: !919, line: 866, baseType: !969, size: 32, align: 32)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1356, file: !919, line: 872, baseType: !969, size: 32, align: 32, offset: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1356, file: !919, line: 878, baseType: !1361, size: 64, align: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !47, line: 3360, baseType: !1363)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !47, line: 1556, size: 8448, align: 64, elements: !1364)
!1364 = !{!1365, !1366, !1367, !1368, !1506, !1507, !1508, !1509, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1535, !1539, !1540, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1719, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1363, file: !47, line: 1561, baseType: !947, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1363, file: !47, line: 1562, baseType: !969, size: 32, align: 32, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1363, file: !47, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1363, file: !47, line: 1565, baseType: !1369, size: 64, align: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !47, line: 3468, size: 1984, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1381, !1384, !1387, !1390, !1393, !1394, !1395, !1403, !1404, !1405, !1407, !1411, !1417, !1422, !1426, !1427, !1471, !1478, !1482, !1483, !1487, !1491, !1495, !1499, !1500, !1501}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1371, file: !47, line: 3475, baseType: !953, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1371, file: !47, line: 3480, baseType: !953, size: 64, align: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1371, file: !47, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1371, file: !47, line: 3482, baseType: !46, size: 32, align: 32, offset: 160)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1371, file: !47, line: 3487, baseType: !969, size: 32, align: 32, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1371, file: !47, line: 3488, baseType: !1379, size: 64, align: 64, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1371, file: !47, line: 3489, baseType: !1382, size: 64, align: 64, offset: 320)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1371, file: !47, line: 3490, baseType: !1385, size: 64, align: 64, offset: 384)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1371, file: !47, line: 3491, baseType: !1388, size: 64, align: 64, offset: 448)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1371, file: !47, line: 3492, baseType: !1391, size: 64, align: 64, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1213)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1371, file: !47, line: 3493, baseType: !1093, size: 8, align: 8, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1371, file: !47, line: 3494, baseType: !947, size: 64, align: 64, offset: 640)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1371, file: !47, line: 3495, baseType: !1396, size: 64, align: 64, offset: 704)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1398)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !47, line: 3404, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !47, line: 3401, size: 128, align: 64, elements: !1400)
!1400 = !{!1401, !1402}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1399, file: !47, line: 3402, baseType: !969, size: 32, align: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1399, file: !47, line: 3403, baseType: !953, size: 64, align: 64, offset: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1371, file: !47, line: 3507, baseType: !953, size: 64, align: 64, offset: 768)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1371, file: !47, line: 3516, baseType: !969, size: 32, align: 32, offset: 832)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1371, file: !47, line: 3517, baseType: !1406, size: 64, align: 64, offset: 896)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1371, file: !47, line: 3527, baseType: !1408, size: 64, align: 64, offset: 960)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{!969, !1361}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1371, file: !47, line: 3535, baseType: !1412, size: 64, align: 64, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DISubroutineType(types: !1414)
!1414 = !{!969, !1361, !1415}
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1362)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1371, file: !47, line: 3541, baseType: !1418, size: 64, align: 64, offset: 1088)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1420)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !47, line: 3461, baseType: !1421)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !47, line: 3461, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1371, file: !47, line: 3549, baseType: !1423, size: 64, align: 64, offset: 1152)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DISubroutineType(types: !1425)
!1425 = !{null, !1406}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1371, file: !47, line: 3551, baseType: !1408, size: 64, align: 64, offset: 1216)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1371, file: !47, line: 3552, baseType: !1428, size: 64, align: 64, offset: 1280)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DISubroutineType(types: !1430)
!1430 = !{!969, !1361, !1092, !969, !1431}
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !47, line: 3920, size: 256, align: 64, elements: !1434)
!1434 = !{!1435, !1438, !1440, !1441, !1442, !1470}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1433, file: !47, line: 3921, baseType: !1436, size: 16, align: 16)
!1436 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !940, line: 49, baseType: !1437)
!1437 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1433, file: !47, line: 3922, baseType: !1439, size: 32, align: 32, offset: 32)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !940, line: 51, baseType: !1048)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1433, file: !47, line: 3923, baseType: !1439, size: 32, align: 32, offset: 64)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1433, file: !47, line: 3924, baseType: !1048, size: 32, align: 32, offset: 96)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1433, file: !47, line: 3925, baseType: !1443, size: 64, align: 64, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !47, line: 3918, baseType: !1446)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !47, line: 3885, size: 1600, align: 64, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1451, !1452, !1453, !1459, !1463, !1465, !1466, !1468, !1469}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1446, file: !47, line: 3886, baseType: !969, size: 32, align: 32)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1446, file: !47, line: 3887, baseType: !969, size: 32, align: 32, offset: 32)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1446, file: !47, line: 3888, baseType: !969, size: 32, align: 32, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1446, file: !47, line: 3889, baseType: !969, size: 32, align: 32, offset: 96)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1446, file: !47, line: 3890, baseType: !969, size: 32, align: 32, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1446, file: !47, line: 3897, baseType: !1454, size: 768, align: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !47, line: 3858, baseType: !1455)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !47, line: 3853, size: 768, align: 64, elements: !1456)
!1456 = !{!1457, !1458}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1455, file: !47, line: 3855, baseType: !1190, size: 512, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1455, file: !47, line: 3857, baseType: !1194, size: 256, align: 32, offset: 512)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1446, file: !47, line: 3903, baseType: !1460, size: 256, align: 64, offset: 960)
!1460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 256, align: 64, elements: !1461)
!1461 = !{!1462}
!1462 = !DISubrange(count: 4)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1446, file: !47, line: 3904, baseType: !1464, size: 128, align: 32, offset: 1216)
!1464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 128, align: 32, elements: !1461)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1446, file: !47, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1446, file: !47, line: 3908, baseType: !1467, size: 64, align: 64, offset: 1408)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1446, file: !47, line: 3915, baseType: !1467, size: 64, align: 64, offset: 1472)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1446, file: !47, line: 3917, baseType: !969, size: 32, align: 32, offset: 1536)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1433, file: !47, line: 3926, baseType: !939, size: 64, align: 64, offset: 192)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1371, file: !47, line: 3564, baseType: !1472, size: 64, align: 64, offset: 1344)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!969, !1361, !1077, !1475, !1477}
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1371, file: !47, line: 3566, baseType: !1479, size: 64, align: 64, offset: 1408)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!969, !1361, !960, !1477, !1077}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1371, file: !47, line: 3567, baseType: !1408, size: 64, align: 64, offset: 1472)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1371, file: !47, line: 3576, baseType: !1484, size: 64, align: 64, offset: 1536)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!969, !1361, !1475}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1371, file: !47, line: 3577, baseType: !1488, size: 64, align: 64, offset: 1600)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!969, !1361, !1077}
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1371, file: !47, line: 3584, baseType: !1492, size: 64, align: 64, offset: 1664)
!1492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1493, size: 64, align: 64)
!1493 = !DISubroutineType(types: !1494)
!1494 = !{!969, !1361, !1185}
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1371, file: !47, line: 3589, baseType: !1496, size: 64, align: 64, offset: 1728)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{null, !1361}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1371, file: !47, line: 3594, baseType: !969, size: 32, align: 32, offset: 1792)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1371, file: !47, line: 3600, baseType: !953, size: 64, align: 64, offset: 1856)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1371, file: !47, line: 3609, baseType: !1502, size: 64, align: 64, offset: 1920)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1505)
!1505 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !47, line: 3609, flags: DIFlagFwdDecl)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1363, file: !47, line: 1566, baseType: !46, size: 32, align: 32, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1363, file: !47, line: 1581, baseType: !1048, size: 32, align: 32, offset: 224)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1363, file: !47, line: 1583, baseType: !960, size: 64, align: 64, offset: 256)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1363, file: !47, line: 1591, baseType: !1510, size: 64, align: 64, offset: 320)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1511, size: 64, align: 64)
!1511 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !47, line: 1532, flags: DIFlagFwdDecl)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1363, file: !47, line: 1598, baseType: !960, size: 64, align: 64, offset: 384)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1363, file: !47, line: 1606, baseType: !939, size: 64, align: 64, offset: 448)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1363, file: !47, line: 1614, baseType: !969, size: 32, align: 32, offset: 512)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1363, file: !47, line: 1622, baseType: !969, size: 32, align: 32, offset: 544)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1363, file: !47, line: 1628, baseType: !969, size: 32, align: 32, offset: 576)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1363, file: !47, line: 1636, baseType: !969, size: 32, align: 32, offset: 608)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1363, file: !47, line: 1643, baseType: !969, size: 32, align: 32, offset: 640)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1363, file: !47, line: 1657, baseType: !1092, size: 64, align: 64, offset: 704)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1363, file: !47, line: 1658, baseType: !969, size: 32, align: 32, offset: 768)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1363, file: !47, line: 1679, baseType: !979, size: 64, align: 32, offset: 800)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1363, file: !47, line: 1688, baseType: !969, size: 32, align: 32, offset: 864)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1363, file: !47, line: 1712, baseType: !969, size: 32, align: 32, offset: 896)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1363, file: !47, line: 1729, baseType: !969, size: 32, align: 32, offset: 928)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1363, file: !47, line: 1729, baseType: !969, size: 32, align: 32, offset: 960)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1363, file: !47, line: 1744, baseType: !969, size: 32, align: 32, offset: 992)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1363, file: !47, line: 1744, baseType: !969, size: 32, align: 32, offset: 1024)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1363, file: !47, line: 1751, baseType: !969, size: 32, align: 32, offset: 1056)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1363, file: !47, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1363, file: !47, line: 1791, baseType: !1531, size: 64, align: 64, offset: 1152)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{null, !1534, !1475, !1477, !969, !969, !969}
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1363, file: !47, line: 1808, baseType: !1536, size: 64, align: 64, offset: 1216)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{!667, !1534, !1382}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1363, file: !47, line: 1816, baseType: !969, size: 32, align: 32, offset: 1280)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1363, file: !47, line: 1825, baseType: !1541, size: 32, align: 32, offset: 1312)
!1541 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1363, file: !47, line: 1830, baseType: !969, size: 32, align: 32, offset: 1344)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1363, file: !47, line: 1838, baseType: !1541, size: 32, align: 32, offset: 1376)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1363, file: !47, line: 1846, baseType: !969, size: 32, align: 32, offset: 1408)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1363, file: !47, line: 1851, baseType: !969, size: 32, align: 32, offset: 1440)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1363, file: !47, line: 1861, baseType: !1541, size: 32, align: 32, offset: 1472)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1363, file: !47, line: 1868, baseType: !1541, size: 32, align: 32, offset: 1504)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1363, file: !47, line: 1875, baseType: !1541, size: 32, align: 32, offset: 1536)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1363, file: !47, line: 1882, baseType: !1541, size: 32, align: 32, offset: 1568)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1363, file: !47, line: 1889, baseType: !1541, size: 32, align: 32, offset: 1600)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1363, file: !47, line: 1896, baseType: !1541, size: 32, align: 32, offset: 1632)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1363, file: !47, line: 1903, baseType: !1541, size: 32, align: 32, offset: 1664)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1363, file: !47, line: 1910, baseType: !969, size: 32, align: 32, offset: 1696)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1363, file: !47, line: 1915, baseType: !969, size: 32, align: 32, offset: 1728)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1363, file: !47, line: 1926, baseType: !1477, size: 64, align: 64, offset: 1792)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1363, file: !47, line: 1935, baseType: !979, size: 64, align: 32, offset: 1856)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1363, file: !47, line: 1942, baseType: !969, size: 32, align: 32, offset: 1920)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1363, file: !47, line: 1948, baseType: !969, size: 32, align: 32, offset: 1952)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1363, file: !47, line: 1954, baseType: !969, size: 32, align: 32, offset: 1984)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1363, file: !47, line: 1960, baseType: !969, size: 32, align: 32, offset: 2016)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1363, file: !47, line: 1984, baseType: !969, size: 32, align: 32, offset: 2048)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1363, file: !47, line: 1991, baseType: !969, size: 32, align: 32, offset: 2080)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1363, file: !47, line: 1996, baseType: !969, size: 32, align: 32, offset: 2112)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1363, file: !47, line: 2004, baseType: !969, size: 32, align: 32, offset: 2144)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1363, file: !47, line: 2011, baseType: !969, size: 32, align: 32, offset: 2176)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1363, file: !47, line: 2018, baseType: !969, size: 32, align: 32, offset: 2208)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1363, file: !47, line: 2027, baseType: !969, size: 32, align: 32, offset: 2240)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1363, file: !47, line: 2034, baseType: !969, size: 32, align: 32, offset: 2272)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1363, file: !47, line: 2044, baseType: !969, size: 32, align: 32, offset: 2304)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1363, file: !47, line: 2054, baseType: !1571, size: 64, align: 64, offset: 2368)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1363, file: !47, line: 2061, baseType: !1571, size: 64, align: 64, offset: 2432)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1363, file: !47, line: 2066, baseType: !969, size: 32, align: 32, offset: 2496)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1363, file: !47, line: 2070, baseType: !969, size: 32, align: 32, offset: 2528)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1363, file: !47, line: 2078, baseType: !969, size: 32, align: 32, offset: 2560)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1363, file: !47, line: 2085, baseType: !969, size: 32, align: 32, offset: 2592)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1363, file: !47, line: 2092, baseType: !969, size: 32, align: 32, offset: 2624)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1363, file: !47, line: 2099, baseType: !969, size: 32, align: 32, offset: 2656)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1363, file: !47, line: 2106, baseType: !969, size: 32, align: 32, offset: 2688)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1363, file: !47, line: 2113, baseType: !969, size: 32, align: 32, offset: 2720)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1363, file: !47, line: 2120, baseType: !969, size: 32, align: 32, offset: 2752)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1363, file: !47, line: 2125, baseType: !969, size: 32, align: 32, offset: 2784)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1363, file: !47, line: 2133, baseType: !969, size: 32, align: 32, offset: 2816)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1363, file: !47, line: 2140, baseType: !969, size: 32, align: 32, offset: 2848)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1363, file: !47, line: 2145, baseType: !969, size: 32, align: 32, offset: 2880)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1363, file: !47, line: 2153, baseType: !969, size: 32, align: 32, offset: 2912)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1363, file: !47, line: 2158, baseType: !969, size: 32, align: 32, offset: 2944)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1363, file: !47, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1363, file: !47, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1363, file: !47, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1363, file: !47, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1363, file: !47, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1363, file: !47, line: 2203, baseType: !969, size: 32, align: 32, offset: 3136)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1363, file: !47, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1363, file: !47, line: 2212, baseType: !969, size: 32, align: 32, offset: 3200)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1363, file: !47, line: 2213, baseType: !969, size: 32, align: 32, offset: 3232)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1363, file: !47, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1363, file: !47, line: 2232, baseType: !969, size: 32, align: 32, offset: 3296)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1363, file: !47, line: 2243, baseType: !969, size: 32, align: 32, offset: 3328)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1363, file: !47, line: 2249, baseType: !969, size: 32, align: 32, offset: 3360)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1363, file: !47, line: 2256, baseType: !969, size: 32, align: 32, offset: 3392)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1363, file: !47, line: 2263, baseType: !1213, size: 64, align: 64, offset: 3456)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1363, file: !47, line: 2270, baseType: !1213, size: 64, align: 64, offset: 3520)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1363, file: !47, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1363, file: !47, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1363, file: !47, line: 2367, baseType: !1607, size: 64, align: 64, offset: 3648)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!969, !1534, !1185, !969}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1363, file: !47, line: 2383, baseType: !969, size: 32, align: 32, offset: 3712)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1363, file: !47, line: 2386, baseType: !1541, size: 32, align: 32, offset: 3744)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1363, file: !47, line: 2387, baseType: !1541, size: 32, align: 32, offset: 3776)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1363, file: !47, line: 2394, baseType: !969, size: 32, align: 32, offset: 3808)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1363, file: !47, line: 2401, baseType: !969, size: 32, align: 32, offset: 3840)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1363, file: !47, line: 2408, baseType: !969, size: 32, align: 32, offset: 3872)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1363, file: !47, line: 2415, baseType: !969, size: 32, align: 32, offset: 3904)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1363, file: !47, line: 2422, baseType: !969, size: 32, align: 32, offset: 3936)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1363, file: !47, line: 2423, baseType: !1619, size: 64, align: 64, offset: 3968)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !47, line: 831, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !47, line: 826, size: 128, align: 32, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1621, file: !47, line: 827, baseType: !969, size: 32, align: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1621, file: !47, line: 828, baseType: !969, size: 32, align: 32, offset: 32)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1621, file: !47, line: 829, baseType: !969, size: 32, align: 32, offset: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1621, file: !47, line: 830, baseType: !1541, size: 32, align: 32, offset: 96)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1363, file: !47, line: 2430, baseType: !939, size: 64, align: 64, offset: 4032)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1363, file: !47, line: 2437, baseType: !939, size: 64, align: 64, offset: 4096)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1363, file: !47, line: 2444, baseType: !1541, size: 32, align: 32, offset: 4160)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1363, file: !47, line: 2451, baseType: !1541, size: 32, align: 32, offset: 4192)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1363, file: !47, line: 2458, baseType: !969, size: 32, align: 32, offset: 4224)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1363, file: !47, line: 2469, baseType: !969, size: 32, align: 32, offset: 4256)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1363, file: !47, line: 2475, baseType: !969, size: 32, align: 32, offset: 4288)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1363, file: !47, line: 2481, baseType: !969, size: 32, align: 32, offset: 4320)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1363, file: !47, line: 2485, baseType: !969, size: 32, align: 32, offset: 4352)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1363, file: !47, line: 2489, baseType: !969, size: 32, align: 32, offset: 4384)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1363, file: !47, line: 2493, baseType: !969, size: 32, align: 32, offset: 4416)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1363, file: !47, line: 2501, baseType: !969, size: 32, align: 32, offset: 4448)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1363, file: !47, line: 2506, baseType: !969, size: 32, align: 32, offset: 4480)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1363, file: !47, line: 2510, baseType: !969, size: 32, align: 32, offset: 4512)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1363, file: !47, line: 2514, baseType: !939, size: 64, align: 64, offset: 4544)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1363, file: !47, line: 2528, baseType: !1643, size: 64, align: 64, offset: 4608)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{null, !1534, !960, !969, !969}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1363, file: !47, line: 2534, baseType: !969, size: 32, align: 32, offset: 4672)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1363, file: !47, line: 2545, baseType: !969, size: 32, align: 32, offset: 4704)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1363, file: !47, line: 2547, baseType: !969, size: 32, align: 32, offset: 4736)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1363, file: !47, line: 2549, baseType: !969, size: 32, align: 32, offset: 4768)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1363, file: !47, line: 2551, baseType: !969, size: 32, align: 32, offset: 4800)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1363, file: !47, line: 2553, baseType: !969, size: 32, align: 32, offset: 4832)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1363, file: !47, line: 2555, baseType: !969, size: 32, align: 32, offset: 4864)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1363, file: !47, line: 2557, baseType: !969, size: 32, align: 32, offset: 4896)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1363, file: !47, line: 2559, baseType: !969, size: 32, align: 32, offset: 4928)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1363, file: !47, line: 2563, baseType: !969, size: 32, align: 32, offset: 4960)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1363, file: !47, line: 2571, baseType: !1467, size: 64, align: 64, offset: 4992)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1363, file: !47, line: 2579, baseType: !1467, size: 64, align: 64, offset: 5056)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1363, file: !47, line: 2586, baseType: !969, size: 32, align: 32, offset: 5120)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1363, file: !47, line: 2615, baseType: !969, size: 32, align: 32, offset: 5152)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1363, file: !47, line: 2627, baseType: !969, size: 32, align: 32, offset: 5184)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1363, file: !47, line: 2637, baseType: !969, size: 32, align: 32, offset: 5216)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1363, file: !47, line: 2681, baseType: !969, size: 32, align: 32, offset: 5248)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1363, file: !47, line: 2709, baseType: !939, size: 64, align: 64, offset: 5312)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1363, file: !47, line: 2716, baseType: !1665, size: 64, align: 64, offset: 5376)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1667)
!1667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !47, line: 3636, size: 896, align: 64, elements: !1668)
!1668 = !{!1669, !1670, !1671, !1672, !1673, !1674, !1675, !1679, !1683, !1684, !1685, !1686, !1692, !1693, !1694, !1695, !1696}
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1667, file: !47, line: 3642, baseType: !953, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1667, file: !47, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1667, file: !47, line: 3656, baseType: !46, size: 32, align: 32, offset: 96)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1667, file: !47, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1667, file: !47, line: 3669, baseType: !969, size: 32, align: 32, offset: 160)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1667, file: !47, line: 3682, baseType: !1492, size: 64, align: 64, offset: 192)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1667, file: !47, line: 3698, baseType: !1676, size: 64, align: 64, offset: 256)
!1676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1677, size: 64, align: 64)
!1677 = !DISubroutineType(types: !1678)
!1678 = !{!969, !1361, !1315, !1439}
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1667, file: !47, line: 3712, baseType: !1680, size: 64, align: 64, offset: 320)
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!969, !1361, !969, !1315, !1439}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1667, file: !47, line: 3726, baseType: !1676, size: 64, align: 64, offset: 384)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1667, file: !47, line: 3737, baseType: !1408, size: 64, align: 64, offset: 448)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1667, file: !47, line: 3746, baseType: !969, size: 32, align: 32, offset: 512)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1667, file: !47, line: 3757, baseType: !1687, size: 64, align: 64, offset: 576)
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{null, !1690}
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !47, line: 3617, flags: DIFlagFwdDecl)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1667, file: !47, line: 3766, baseType: !1408, size: 64, align: 64, offset: 640)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1667, file: !47, line: 3774, baseType: !1408, size: 64, align: 64, offset: 704)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1667, file: !47, line: 3780, baseType: !969, size: 32, align: 32, offset: 768)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1667, file: !47, line: 3785, baseType: !969, size: 32, align: 32, offset: 800)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1667, file: !47, line: 3795, baseType: !1697, size: 64, align: 64, offset: 832)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DISubroutineType(types: !1699)
!1699 = !{!969, !1361, !1082}
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1363, file: !47, line: 2728, baseType: !960, size: 64, align: 64, offset: 5440)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1363, file: !47, line: 2735, baseType: !1212, size: 512, align: 64, offset: 5504)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1363, file: !47, line: 2742, baseType: !969, size: 32, align: 32, offset: 6016)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1363, file: !47, line: 2755, baseType: !969, size: 32, align: 32, offset: 6048)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1363, file: !47, line: 2776, baseType: !969, size: 32, align: 32, offset: 6080)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1363, file: !47, line: 2783, baseType: !969, size: 32, align: 32, offset: 6112)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1363, file: !47, line: 2791, baseType: !969, size: 32, align: 32, offset: 6144)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1363, file: !47, line: 2802, baseType: !1185, size: 64, align: 64, offset: 6208)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1363, file: !47, line: 2811, baseType: !969, size: 32, align: 32, offset: 6272)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1363, file: !47, line: 2821, baseType: !969, size: 32, align: 32, offset: 6304)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1363, file: !47, line: 2830, baseType: !969, size: 32, align: 32, offset: 6336)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1363, file: !47, line: 2840, baseType: !969, size: 32, align: 32, offset: 6368)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1363, file: !47, line: 2851, baseType: !1713, size: 64, align: 64, offset: 6400)
!1713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1714, size: 64, align: 64)
!1714 = !DISubroutineType(types: !1715)
!1715 = !{!969, !1534, !1716, !960, !1477, !969, !969}
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DISubroutineType(types: !1718)
!1718 = !{!969, !1534, !960}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1363, file: !47, line: 2871, baseType: !1720, size: 64, align: 64, offset: 6464)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64, align: 64)
!1721 = !DISubroutineType(types: !1722)
!1722 = !{!969, !1534, !1723, !960, !1477, !969}
