; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--indeo4.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--indeo4.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!845 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!846 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!847 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!848 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!849 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!850 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!851 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 39, size: 32, align: 32, elements: !889)
!888 = !DIFile(filename: "libavcodec/ivi.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!889 = !{!890, !891, !892, !893, !894, !895, !896}
!890 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTRA", value: 0)
!891 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTRA1", value: 1)
!892 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTER", value: 2)
!893 = !DIEnumerator(name: "IVI4_FRAMETYPE_BIDIR", value: 3)
!894 = !DIEnumerator(name: "IVI4_FRAMETYPE_INTER_NOREF", value: 4)
!895 = !DIEnumerator(name: "IVI4_FRAMETYPE_NULL_FIRST", value: 5)
!896 = !DIEnumerator(name: "IVI4_FRAMETYPE_NULL_LAST", value: 6)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !888, line: 73, size: 32, align: 32, elements: !898)
!898 = !{!899, !900}
!899 = !DIEnumerator(name: "IVI_MB_HUFF", value: 0)
!900 = !DIEnumerator(name: "IVI_BLK_HUFF", value: 1)
!901 = !{!902, !903, !904}
!902 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!903 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64, align: 64)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !907, line: 221, size: 32, align: 8, elements: !908)
!907 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!908 = !{!909}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !906, file: !907, line: 221, baseType: !910, size: 32, align: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !911, line: 51, baseType: !903)
!911 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!912 = !{!913, !1644, !1650, !1675, !1680, !1684, !1688, !1689, !1690, !1694, !1698, !1699, !1703}
!913 = distinct !DIGlobalVariable(name: "ff_indeo4_decoder", scope: !0, file: !914, line: 706, type: !915, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_indeo4_decoder)
!914 = !DIFile(filename: "libavcodec/indeo4.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !917)
!917 = !{!918, !922, !923, !924, !925, !926, !935, !938, !941, !944, !949, !952, !994, !1002, !1003, !1004, !1006, !1559, !1565, !1573, !1577, !1578, !1615, !1619, !1623, !1624, !1628, !1632, !1633, !1637, !1638, !1639}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !916, file: !14, line: 3475, baseType: !919, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !916, file: !14, line: 3480, baseType: !919, size: 64, align: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !916, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !916, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !916, file: !14, line: 3487, baseType: !902, size: 32, align: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !916, file: !14, line: 3488, baseType: !927, size: 64, align: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !930, line: 61, baseType: !931)
!930 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !930, line: 58, size: 64, align: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !931, file: !930, line: 59, baseType: !902, size: 32, align: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !931, file: !930, line: 60, baseType: !902, size: 32, align: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !916, file: !14, line: 3489, baseType: !936, size: 64, align: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !916, file: !14, line: 3490, baseType: !939, size: 64, align: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !916, file: !14, line: 3491, baseType: !942, size: 64, align: 64, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !916, file: !14, line: 3492, baseType: !945, size: 64, align: 64, offset: 512)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !911, line: 55, baseType: !948)
!948 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !916, file: !14, line: 3493, baseType: !950, size: 8, align: 8, offset: 576)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !911, line: 48, baseType: !951)
!951 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !916, file: !14, line: 3494, baseType: !953, size: 64, align: 64, offset: 640)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !957)
!957 = !{!958, !959, !964, !968, !969, !970, !971, !975, !981, !983, !987}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !956, file: !691, line: 72, baseType: !919, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !956, file: !691, line: 78, baseType: !960, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!919, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !956, file: !691, line: 85, baseType: !965, size: 64, align: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !956, file: !691, line: 93, baseType: !902, size: 32, align: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !956, file: !691, line: 99, baseType: !902, size: 32, align: 32, offset: 224)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !956, file: !691, line: 108, baseType: !902, size: 32, align: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !956, file: !691, line: 113, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!963, !963, !963}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !956, file: !691, line: 123, baseType: !976, size: 64, align: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!979, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !956, file: !691, line: 130, baseType: !982, size: 32, align: 32, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !956, file: !691, line: 136, baseType: !984, size: 64, align: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!982, !963}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !956, file: !691, line: 142, baseType: !988, size: 64, align: 64, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!902, !991, !963, !919, !902}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !916, file: !14, line: 3495, baseType: !995, size: 64, align: 64, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !998, file: !14, line: 3402, baseType: !902, size: 32, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !14, line: 3403, baseType: !919, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !916, file: !14, line: 3507, baseType: !919, size: 64, align: 64, offset: 768)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !916, file: !14, line: 3516, baseType: !902, size: 32, align: 32, offset: 832)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !916, file: !14, line: 3517, baseType: !1005, size: 64, align: 64, offset: 896)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !916, file: !14, line: 3527, baseType: !1007, size: 64, align: 64, offset: 960)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!902, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1020, !1021, !1022, !1023, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1305, !1309, !1310, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1497, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1012, file: !14, line: 1561, baseType: !953, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1012, file: !14, line: 1562, baseType: !902, size: 32, align: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1012, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1012, file: !14, line: 1565, baseType: !1018, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1012, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1012, file: !14, line: 1581, baseType: !903, size: 32, align: 32, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1012, file: !14, line: 1583, baseType: !963, size: 64, align: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1012, file: !14, line: 1591, baseType: !1024, size: 64, align: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1026, line: 129, size: 1664, align: 64, elements: !1027)
!1026 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1027 = !{!1028, !1029, !1030, !1031, !1131, !1152, !1153, !1182, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1025, file: !1026, line: 136, baseType: !902, size: 32, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1025, file: !1026, line: 151, baseType: !902, size: 32, align: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1025, file: !1026, line: 157, baseType: !902, size: 32, align: 32, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1025, file: !1026, line: 159, baseType: !1032, size: 64, align: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1035)
!1035 = !{!1036, !1041, !1043, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1083, !1085, !1086, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1119, !1120, !1121, !1122, !1123, !1124, !1127, !1128, !1129, !1130}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1034, file: !722, line: 282, baseType: !1037, size: 512, align: 64)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 512, align: 64, elements: !1039)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!1039 = !{!1040}
!1040 = !DISubrange(count: 8)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1034, file: !722, line: 299, baseType: !1042, size: 256, align: 32, offset: 512)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 256, align: 32, elements: !1039)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1034, file: !722, line: 315, baseType: !1044, size: 64, align: 64, offset: 768)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1034, file: !722, line: 326, baseType: !902, size: 32, align: 32, offset: 832)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1034, file: !722, line: 326, baseType: !902, size: 32, align: 32, offset: 864)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1034, file: !722, line: 334, baseType: !902, size: 32, align: 32, offset: 896)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1034, file: !722, line: 341, baseType: !902, size: 32, align: 32, offset: 928)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1034, file: !722, line: 346, baseType: !902, size: 32, align: 32, offset: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1034, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1034, file: !722, line: 356, baseType: !929, size: 64, align: 32, offset: 1024)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1034, file: !722, line: 361, baseType: !1053, size: 64, align: 64, offset: 1088)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !911, line: 40, baseType: !1054)
!1054 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1034, file: !722, line: 369, baseType: !1053, size: 64, align: 64, offset: 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1034, file: !722, line: 377, baseType: !1053, size: 64, align: 64, offset: 1216)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1034, file: !722, line: 382, baseType: !902, size: 32, align: 32, offset: 1280)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1034, file: !722, line: 386, baseType: !902, size: 32, align: 32, offset: 1312)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1034, file: !722, line: 391, baseType: !902, size: 32, align: 32, offset: 1344)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1034, file: !722, line: 396, baseType: !963, size: 64, align: 64, offset: 1408)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1034, file: !722, line: 403, baseType: !1062, size: 512, align: 64, offset: 1472)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !947, size: 512, align: 64, elements: !1039)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1034, file: !722, line: 410, baseType: !902, size: 32, align: 32, offset: 1984)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1034, file: !722, line: 415, baseType: !902, size: 32, align: 32, offset: 2016)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1034, file: !722, line: 420, baseType: !902, size: 32, align: 32, offset: 2048)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1034, file: !722, line: 425, baseType: !902, size: 32, align: 32, offset: 2080)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1034, file: !722, line: 435, baseType: !1053, size: 64, align: 64, offset: 2112)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1034, file: !722, line: 440, baseType: !902, size: 32, align: 32, offset: 2176)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1034, file: !722, line: 445, baseType: !947, size: 64, align: 64, offset: 2240)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1034, file: !722, line: 459, baseType: !1071, size: 512, align: 64, offset: 2304)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 512, align: 64, elements: !1039)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1074, line: 94, baseType: !1075)
!1074 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1074, line: 81, size: 192, align: 64, elements: !1076)
!1076 = !{!1077, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1075, file: !1074, line: 82, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1074, line: 73, baseType: !1080)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1074, line: 73, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !1074, line: 89, baseType: !1038, size: 64, align: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1075, file: !1074, line: 93, baseType: !902, size: 32, align: 32, offset: 128)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1034, file: !722, line: 473, baseType: !1084, size: 64, align: 64, offset: 2816)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1034, file: !722, line: 477, baseType: !902, size: 32, align: 32, offset: 2880)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1034, file: !722, line: 479, baseType: !1087, size: 64, align: 64, offset: 2944)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1100}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1090, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1090, file: !722, line: 203, baseType: !1038, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1090, file: !722, line: 204, baseType: !902, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1090, file: !722, line: 205, baseType: !1096, size: 64, align: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1098, line: 86, baseType: !1099)
!1098 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1099 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1098, line: 86, flags: DIFlagFwdDecl)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1090, file: !722, line: 206, baseType: !1072, size: 64, align: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1034, file: !722, line: 480, baseType: !902, size: 32, align: 32, offset: 3008)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1034, file: !722, line: 505, baseType: !902, size: 32, align: 32, offset: 3040)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1034, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1034, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1034, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1034, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1034, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1034, file: !722, line: 532, baseType: !1053, size: 64, align: 64, offset: 3264)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1034, file: !722, line: 539, baseType: !1053, size: 64, align: 64, offset: 3328)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1034, file: !722, line: 547, baseType: !1053, size: 64, align: 64, offset: 3392)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1034, file: !722, line: 554, baseType: !1096, size: 64, align: 64, offset: 3456)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1034, file: !722, line: 563, baseType: !902, size: 32, align: 32, offset: 3520)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1034, file: !722, line: 572, baseType: !902, size: 32, align: 32, offset: 3552)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1034, file: !722, line: 581, baseType: !902, size: 32, align: 32, offset: 3584)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1034, file: !722, line: 588, baseType: !1116, size: 64, align: 64, offset: 3648)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !911, line: 36, baseType: !1118)
!1118 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1034, file: !722, line: 593, baseType: !902, size: 32, align: 32, offset: 3712)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1034, file: !722, line: 596, baseType: !902, size: 32, align: 32, offset: 3744)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1034, file: !722, line: 599, baseType: !1072, size: 64, align: 64, offset: 3776)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1034, file: !722, line: 605, baseType: !1072, size: 64, align: 64, offset: 3840)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1034, file: !722, line: 616, baseType: !1072, size: 64, align: 64, offset: 3904)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1034, file: !722, line: 626, baseType: !1125, size: 64, align: 64, offset: 3968)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1126, line: 216, baseType: !948)
!1126 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1034, file: !722, line: 627, baseType: !1125, size: 64, align: 64, offset: 4032)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1034, file: !722, line: 628, baseType: !1125, size: 64, align: 64, offset: 4096)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1034, file: !722, line: 629, baseType: !1125, size: 64, align: 64, offset: 4160)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1034, file: !722, line: 645, baseType: !1072, size: 64, align: 64, offset: 4224)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1025, file: !1026, line: 161, baseType: !1132, size: 64, align: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1026, line: 117, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1026, line: 100, size: 832, align: 64, elements: !1135)
!1135 = !{!1136, !1143, !1144, !1145, !1146, !1147, !1149, !1150, !1151}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1134, file: !1026, line: 105, baseType: !1137, size: 256, align: 64)
!1137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 256, align: 64, elements: !1141)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1074, line: 238, baseType: !1140)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1074, line: 238, flags: DIFlagFwdDecl)
!1141 = !{!1142}
!1142 = !DISubrange(count: 4)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1134, file: !1026, line: 110, baseType: !902, size: 32, align: 32, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1134, file: !1026, line: 111, baseType: !902, size: 32, align: 32, offset: 288)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1134, file: !1026, line: 111, baseType: !902, size: 32, align: 32, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1134, file: !1026, line: 112, baseType: !1042, size: 256, align: 32, offset: 352)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1134, file: !1026, line: 113, baseType: !1148, size: 128, align: 32, offset: 608)
!1148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, align: 32, elements: !1141)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1134, file: !1026, line: 114, baseType: !902, size: 32, align: 32, offset: 736)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1134, file: !1026, line: 115, baseType: !902, size: 32, align: 32, offset: 768)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1134, file: !1026, line: 116, baseType: !902, size: 32, align: 32, offset: 800)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1025, file: !1026, line: 163, baseType: !963, size: 64, align: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1025, file: !1026, line: 165, baseType: !1154, size: 128, align: 64, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1026, line: 122, baseType: !1155)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1026, line: 119, size: 128, align: 64, elements: !1156)
!1156 = !{!1157, !1181}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1155, file: !1026, line: 120, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1177, !1178, !1179, !1180}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1160, file: !14, line: 1451, baseType: !1072, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1160, file: !14, line: 1461, baseType: !1053, size: 64, align: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1160, file: !14, line: 1467, baseType: !1053, size: 64, align: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !14, line: 1468, baseType: !1038, size: 64, align: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1160, file: !14, line: 1469, baseType: !902, size: 32, align: 32, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1160, file: !14, line: 1470, baseType: !902, size: 32, align: 32, offset: 288)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1160, file: !14, line: 1474, baseType: !902, size: 32, align: 32, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1160, file: !14, line: 1479, baseType: !1170, size: 64, align: 64, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1172, file: !14, line: 1412, baseType: !1038, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1172, file: !14, line: 1413, baseType: !902, size: 32, align: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1172, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1160, file: !14, line: 1480, baseType: !902, size: 32, align: 32, offset: 448)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1160, file: !14, line: 1486, baseType: !1053, size: 64, align: 64, offset: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1160, file: !14, line: 1488, baseType: !1053, size: 64, align: 64, offset: 576)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1160, file: !14, line: 1497, baseType: !1053, size: 64, align: 64, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1155, file: !1026, line: 121, baseType: !1032, size: 64, align: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1025, file: !1026, line: 166, baseType: !1183, size: 128, align: 64, offset: 448)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1026, line: 127, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1026, line: 124, size: 128, align: 64, elements: !1185)
!1185 = !{!1186, !1259}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1184, file: !1026, line: 125, baseType: !1187, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64, align: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1191)
!1191 = !{!1192, !1193, !1217, !1221, !1222, !1256, !1257, !1258}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1190, file: !14, line: 5751, baseType: !953, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1190, file: !14, line: 5756, baseType: !1194, size: 64, align: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1196)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1197)
!1197 = !{!1198, !1199, !1202, !1203, !1204, !1208, !1212, !1216}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1196, file: !14, line: 5797, baseType: !919, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1196, file: !14, line: 5804, baseType: !1200, size: 64, align: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1196, file: !14, line: 5815, baseType: !953, size: 64, align: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1196, file: !14, line: 5825, baseType: !902, size: 32, align: 32, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1196, file: !14, line: 5826, baseType: !1205, size: 64, align: 64, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!902, !1188}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1196, file: !14, line: 5827, baseType: !1209, size: 64, align: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!902, !1188, !1158}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1196, file: !14, line: 5828, baseType: !1213, size: 64, align: 64, offset: 384)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !1188}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1196, file: !14, line: 5829, baseType: !1213, size: 64, align: 64, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1190, file: !14, line: 5762, baseType: !1218, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1220)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1190, file: !14, line: 5768, baseType: !963, size: 64, align: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1190, file: !14, line: 5775, baseType: !1223, size: 64, align: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1225, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1225, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1225, file: !14, line: 3948, baseType: !910, size: 32, align: 32, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1225, file: !14, line: 3958, baseType: !1038, size: 64, align: 64, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1225, file: !14, line: 3962, baseType: !902, size: 32, align: 32, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1225, file: !14, line: 3968, baseType: !902, size: 32, align: 32, offset: 224)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1225, file: !14, line: 3973, baseType: !1053, size: 64, align: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1225, file: !14, line: 3986, baseType: !902, size: 32, align: 32, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1225, file: !14, line: 3999, baseType: !902, size: 32, align: 32, offset: 352)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1225, file: !14, line: 4004, baseType: !902, size: 32, align: 32, offset: 384)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1225, file: !14, line: 4005, baseType: !902, size: 32, align: 32, offset: 416)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1225, file: !14, line: 4010, baseType: !902, size: 32, align: 32, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1225, file: !14, line: 4011, baseType: !902, size: 32, align: 32, offset: 480)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1225, file: !14, line: 4020, baseType: !929, size: 64, align: 32, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1225, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1225, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1225, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1225, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1225, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1225, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1225, file: !14, line: 4039, baseType: !902, size: 32, align: 32, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1225, file: !14, line: 4046, baseType: !947, size: 64, align: 64, offset: 832)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1225, file: !14, line: 4050, baseType: !902, size: 32, align: 32, offset: 896)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1225, file: !14, line: 4054, baseType: !902, size: 32, align: 32, offset: 928)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1225, file: !14, line: 4061, baseType: !902, size: 32, align: 32, offset: 960)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1225, file: !14, line: 4065, baseType: !902, size: 32, align: 32, offset: 992)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1225, file: !14, line: 4073, baseType: !902, size: 32, align: 32, offset: 1024)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1225, file: !14, line: 4080, baseType: !902, size: 32, align: 32, offset: 1056)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1225, file: !14, line: 4084, baseType: !902, size: 32, align: 32, offset: 1088)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1190, file: !14, line: 5781, baseType: !1223, size: 64, align: 64, offset: 320)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1190, file: !14, line: 5787, baseType: !929, size: 64, align: 32, offset: 384)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1190, file: !14, line: 5793, baseType: !929, size: 64, align: 32, offset: 448)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1184, file: !1026, line: 126, baseType: !902, size: 32, align: 32, offset: 64)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1025, file: !1026, line: 172, baseType: !1158, size: 64, align: 64, offset: 576)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1025, file: !1026, line: 177, baseType: !1038, size: 64, align: 64, offset: 640)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1025, file: !1026, line: 178, baseType: !903, size: 32, align: 32, offset: 704)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1025, file: !1026, line: 180, baseType: !963, size: 64, align: 64, offset: 768)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1025, file: !1026, line: 185, baseType: !902, size: 32, align: 32, offset: 832)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1025, file: !1026, line: 190, baseType: !963, size: 64, align: 64, offset: 896)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1025, file: !1026, line: 195, baseType: !902, size: 32, align: 32, offset: 960)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1025, file: !1026, line: 200, baseType: !1158, size: 64, align: 64, offset: 1024)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1025, file: !1026, line: 201, baseType: !902, size: 32, align: 32, offset: 1088)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1025, file: !1026, line: 202, baseType: !1032, size: 64, align: 64, offset: 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1025, file: !1026, line: 203, baseType: !902, size: 32, align: 32, offset: 1216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1025, file: !1026, line: 205, baseType: !902, size: 32, align: 32, offset: 1248)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1025, file: !1026, line: 206, baseType: !902, size: 32, align: 32, offset: 1280)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1025, file: !1026, line: 209, baseType: !1125, size: 64, align: 64, offset: 1344)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1025, file: !1026, line: 212, baseType: !1125, size: 64, align: 64, offset: 1408)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1025, file: !1026, line: 213, baseType: !1032, size: 64, align: 64, offset: 1472)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1025, file: !1026, line: 215, baseType: !902, size: 32, align: 32, offset: 1536)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1025, file: !1026, line: 217, baseType: !902, size: 32, align: 32, offset: 1568)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1025, file: !1026, line: 220, baseType: !902, size: 32, align: 32, offset: 1600)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1012, file: !14, line: 1598, baseType: !963, size: 64, align: 64, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1012, file: !14, line: 1606, baseType: !1053, size: 64, align: 64, offset: 448)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1012, file: !14, line: 1614, baseType: !902, size: 32, align: 32, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1012, file: !14, line: 1622, baseType: !902, size: 32, align: 32, offset: 544)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1012, file: !14, line: 1628, baseType: !902, size: 32, align: 32, offset: 576)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1012, file: !14, line: 1636, baseType: !902, size: 32, align: 32, offset: 608)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1012, file: !14, line: 1643, baseType: !902, size: 32, align: 32, offset: 640)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1012, file: !14, line: 1657, baseType: !1038, size: 64, align: 64, offset: 704)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1012, file: !14, line: 1658, baseType: !902, size: 32, align: 32, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1012, file: !14, line: 1679, baseType: !929, size: 64, align: 32, offset: 800)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1012, file: !14, line: 1688, baseType: !902, size: 32, align: 32, offset: 864)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1012, file: !14, line: 1712, baseType: !902, size: 32, align: 32, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1012, file: !14, line: 1729, baseType: !902, size: 32, align: 32, offset: 928)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1012, file: !14, line: 1729, baseType: !902, size: 32, align: 32, offset: 960)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1012, file: !14, line: 1744, baseType: !902, size: 32, align: 32, offset: 992)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1012, file: !14, line: 1744, baseType: !902, size: 32, align: 32, offset: 1024)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1012, file: !14, line: 1751, baseType: !902, size: 32, align: 32, offset: 1056)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1012, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1012, file: !14, line: 1791, baseType: !1298, size: 64, align: 64, offset: 1152)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !1301, !1302, !1304, !902, !902, !902}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1012, file: !14, line: 1808, baseType: !1306, size: 64, align: 64, offset: 1216)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{!473, !1301, !936}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1012, file: !14, line: 1816, baseType: !902, size: 32, align: 32, offset: 1280)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1012, file: !14, line: 1825, baseType: !1311, size: 32, align: 32, offset: 1312)
!1311 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1012, file: !14, line: 1830, baseType: !902, size: 32, align: 32, offset: 1344)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1012, file: !14, line: 1838, baseType: !1311, size: 32, align: 32, offset: 1376)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1012, file: !14, line: 1846, baseType: !902, size: 32, align: 32, offset: 1408)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1012, file: !14, line: 1851, baseType: !902, size: 32, align: 32, offset: 1440)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1012, file: !14, line: 1861, baseType: !1311, size: 32, align: 32, offset: 1472)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1012, file: !14, line: 1868, baseType: !1311, size: 32, align: 32, offset: 1504)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1012, file: !14, line: 1875, baseType: !1311, size: 32, align: 32, offset: 1536)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1012, file: !14, line: 1882, baseType: !1311, size: 32, align: 32, offset: 1568)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1012, file: !14, line: 1889, baseType: !1311, size: 32, align: 32, offset: 1600)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1012, file: !14, line: 1896, baseType: !1311, size: 32, align: 32, offset: 1632)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1012, file: !14, line: 1903, baseType: !1311, size: 32, align: 32, offset: 1664)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1012, file: !14, line: 1910, baseType: !902, size: 32, align: 32, offset: 1696)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1012, file: !14, line: 1915, baseType: !902, size: 32, align: 32, offset: 1728)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1012, file: !14, line: 1926, baseType: !1304, size: 64, align: 64, offset: 1792)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1012, file: !14, line: 1935, baseType: !929, size: 64, align: 32, offset: 1856)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1012, file: !14, line: 1942, baseType: !902, size: 32, align: 32, offset: 1920)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1012, file: !14, line: 1948, baseType: !902, size: 32, align: 32, offset: 1952)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1012, file: !14, line: 1954, baseType: !902, size: 32, align: 32, offset: 1984)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1012, file: !14, line: 1960, baseType: !902, size: 32, align: 32, offset: 2016)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1012, file: !14, line: 1984, baseType: !902, size: 32, align: 32, offset: 2048)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1012, file: !14, line: 1991, baseType: !902, size: 32, align: 32, offset: 2080)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1012, file: !14, line: 1996, baseType: !902, size: 32, align: 32, offset: 2112)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1012, file: !14, line: 2004, baseType: !902, size: 32, align: 32, offset: 2144)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1012, file: !14, line: 2011, baseType: !902, size: 32, align: 32, offset: 2176)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1012, file: !14, line: 2018, baseType: !902, size: 32, align: 32, offset: 2208)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1012, file: !14, line: 2027, baseType: !902, size: 32, align: 32, offset: 2240)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1012, file: !14, line: 2034, baseType: !902, size: 32, align: 32, offset: 2272)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1012, file: !14, line: 2044, baseType: !902, size: 32, align: 32, offset: 2304)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1012, file: !14, line: 2054, baseType: !1341, size: 64, align: 64, offset: 2368)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !911, line: 49, baseType: !1343)
!1343 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1012, file: !14, line: 2061, baseType: !1341, size: 64, align: 64, offset: 2432)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1012, file: !14, line: 2066, baseType: !902, size: 32, align: 32, offset: 2496)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1012, file: !14, line: 2070, baseType: !902, size: 32, align: 32, offset: 2528)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1012, file: !14, line: 2078, baseType: !902, size: 32, align: 32, offset: 2560)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1012, file: !14, line: 2085, baseType: !902, size: 32, align: 32, offset: 2592)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1012, file: !14, line: 2092, baseType: !902, size: 32, align: 32, offset: 2624)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1012, file: !14, line: 2099, baseType: !902, size: 32, align: 32, offset: 2656)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1012, file: !14, line: 2106, baseType: !902, size: 32, align: 32, offset: 2688)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1012, file: !14, line: 2113, baseType: !902, size: 32, align: 32, offset: 2720)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1012, file: !14, line: 2120, baseType: !902, size: 32, align: 32, offset: 2752)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1012, file: !14, line: 2125, baseType: !902, size: 32, align: 32, offset: 2784)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1012, file: !14, line: 2133, baseType: !902, size: 32, align: 32, offset: 2816)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1012, file: !14, line: 2140, baseType: !902, size: 32, align: 32, offset: 2848)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1012, file: !14, line: 2145, baseType: !902, size: 32, align: 32, offset: 2880)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1012, file: !14, line: 2153, baseType: !902, size: 32, align: 32, offset: 2912)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1012, file: !14, line: 2158, baseType: !902, size: 32, align: 32, offset: 2944)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1012, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1012, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1012, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1012, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1012, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1012, file: !14, line: 2203, baseType: !902, size: 32, align: 32, offset: 3136)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1012, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1012, file: !14, line: 2212, baseType: !902, size: 32, align: 32, offset: 3200)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1012, file: !14, line: 2213, baseType: !902, size: 32, align: 32, offset: 3232)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1012, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1012, file: !14, line: 2232, baseType: !902, size: 32, align: 32, offset: 3296)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1012, file: !14, line: 2243, baseType: !902, size: 32, align: 32, offset: 3328)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1012, file: !14, line: 2249, baseType: !902, size: 32, align: 32, offset: 3360)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1012, file: !14, line: 2256, baseType: !902, size: 32, align: 32, offset: 3392)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1012, file: !14, line: 2263, baseType: !947, size: 64, align: 64, offset: 3456)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1012, file: !14, line: 2270, baseType: !947, size: 64, align: 64, offset: 3520)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1012, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1012, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1012, file: !14, line: 2367, baseType: !1379, size: 64, align: 64, offset: 3648)
!1379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1380, size: 64, align: 64)
!1380 = !DISubroutineType(types: !1381)
!1381 = !{!902, !1301, !1032, !902}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1012, file: !14, line: 2383, baseType: !902, size: 32, align: 32, offset: 3712)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1012, file: !14, line: 2386, baseType: !1311, size: 32, align: 32, offset: 3744)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1012, file: !14, line: 2387, baseType: !1311, size: 32, align: 32, offset: 3776)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1012, file: !14, line: 2394, baseType: !902, size: 32, align: 32, offset: 3808)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1012, file: !14, line: 2401, baseType: !902, size: 32, align: 32, offset: 3840)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1012, file: !14, line: 2408, baseType: !902, size: 32, align: 32, offset: 3872)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1012, file: !14, line: 2415, baseType: !902, size: 32, align: 32, offset: 3904)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1012, file: !14, line: 2422, baseType: !902, size: 32, align: 32, offset: 3936)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1012, file: !14, line: 2423, baseType: !1391, size: 64, align: 64, offset: 3968)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1394)
!1394 = !{!1395, !1396, !1397, !1398}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1393, file: !14, line: 827, baseType: !902, size: 32, align: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1393, file: !14, line: 828, baseType: !902, size: 32, align: 32, offset: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1393, file: !14, line: 829, baseType: !902, size: 32, align: 32, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1393, file: !14, line: 830, baseType: !1311, size: 32, align: 32, offset: 96)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1012, file: !14, line: 2430, baseType: !1053, size: 64, align: 64, offset: 4032)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1012, file: !14, line: 2437, baseType: !1053, size: 64, align: 64, offset: 4096)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1012, file: !14, line: 2444, baseType: !1311, size: 32, align: 32, offset: 4160)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1012, file: !14, line: 2451, baseType: !1311, size: 32, align: 32, offset: 4192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1012, file: !14, line: 2458, baseType: !902, size: 32, align: 32, offset: 4224)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1012, file: !14, line: 2469, baseType: !902, size: 32, align: 32, offset: 4256)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1012, file: !14, line: 2475, baseType: !902, size: 32, align: 32, offset: 4288)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1012, file: !14, line: 2481, baseType: !902, size: 32, align: 32, offset: 4320)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1012, file: !14, line: 2485, baseType: !902, size: 32, align: 32, offset: 4352)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1012, file: !14, line: 2489, baseType: !902, size: 32, align: 32, offset: 4384)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1012, file: !14, line: 2493, baseType: !902, size: 32, align: 32, offset: 4416)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1012, file: !14, line: 2501, baseType: !902, size: 32, align: 32, offset: 4448)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1012, file: !14, line: 2506, baseType: !902, size: 32, align: 32, offset: 4480)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1012, file: !14, line: 2510, baseType: !902, size: 32, align: 32, offset: 4512)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1012, file: !14, line: 2514, baseType: !1053, size: 64, align: 64, offset: 4544)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1012, file: !14, line: 2528, baseType: !1415, size: 64, align: 64, offset: 4608)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{null, !1301, !963, !902, !902}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1012, file: !14, line: 2534, baseType: !902, size: 32, align: 32, offset: 4672)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1012, file: !14, line: 2545, baseType: !902, size: 32, align: 32, offset: 4704)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1012, file: !14, line: 2547, baseType: !902, size: 32, align: 32, offset: 4736)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1012, file: !14, line: 2549, baseType: !902, size: 32, align: 32, offset: 4768)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1012, file: !14, line: 2551, baseType: !902, size: 32, align: 32, offset: 4800)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1012, file: !14, line: 2553, baseType: !902, size: 32, align: 32, offset: 4832)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1012, file: !14, line: 2555, baseType: !902, size: 32, align: 32, offset: 4864)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1012, file: !14, line: 2557, baseType: !902, size: 32, align: 32, offset: 4896)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1012, file: !14, line: 2559, baseType: !902, size: 32, align: 32, offset: 4928)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1012, file: !14, line: 2563, baseType: !902, size: 32, align: 32, offset: 4960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1012, file: !14, line: 2571, baseType: !1429, size: 64, align: 64, offset: 4992)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1012, file: !14, line: 2579, baseType: !1429, size: 64, align: 64, offset: 5056)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1012, file: !14, line: 2586, baseType: !902, size: 32, align: 32, offset: 5120)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1012, file: !14, line: 2615, baseType: !902, size: 32, align: 32, offset: 5152)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1012, file: !14, line: 2627, baseType: !902, size: 32, align: 32, offset: 5184)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1012, file: !14, line: 2637, baseType: !902, size: 32, align: 32, offset: 5216)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1012, file: !14, line: 2681, baseType: !902, size: 32, align: 32, offset: 5248)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1012, file: !14, line: 2709, baseType: !1053, size: 64, align: 64, offset: 5312)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1012, file: !14, line: 2716, baseType: !1438, size: 64, align: 64, offset: 5376)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1451, !1457, !1461, !1462, !1463, !1464, !1470, !1471, !1472, !1473, !1474}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1440, file: !14, line: 3642, baseType: !919, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1440, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1440, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1440, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1440, file: !14, line: 3669, baseType: !902, size: 32, align: 32, offset: 160)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1440, file: !14, line: 3682, baseType: !1448, size: 64, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!902, !1010, !1032}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1440, file: !14, line: 3698, baseType: !1452, size: 64, align: 64, offset: 256)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{!902, !1010, !1455, !910}
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1440, file: !14, line: 3712, baseType: !1458, size: 64, align: 64, offset: 320)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DISubroutineType(types: !1460)
!1460 = !{!902, !1010, !902, !1455, !910}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1440, file: !14, line: 3726, baseType: !1452, size: 64, align: 64, offset: 384)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1440, file: !14, line: 3737, baseType: !1007, size: 64, align: 64, offset: 448)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1440, file: !14, line: 3746, baseType: !902, size: 32, align: 32, offset: 512)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1440, file: !14, line: 3757, baseType: !1465, size: 64, align: 64, offset: 576)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{null, !1468}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1440, file: !14, line: 3766, baseType: !1007, size: 64, align: 64, offset: 640)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1440, file: !14, line: 3774, baseType: !1007, size: 64, align: 64, offset: 704)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1440, file: !14, line: 3780, baseType: !902, size: 32, align: 32, offset: 768)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1440, file: !14, line: 3785, baseType: !902, size: 32, align: 32, offset: 800)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1440, file: !14, line: 3795, baseType: !1475, size: 64, align: 64, offset: 832)
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!902, !1010, !1072}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1012, file: !14, line: 2728, baseType: !963, size: 64, align: 64, offset: 5440)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1012, file: !14, line: 2735, baseType: !1062, size: 512, align: 64, offset: 5504)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1012, file: !14, line: 2742, baseType: !902, size: 32, align: 32, offset: 6016)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1012, file: !14, line: 2755, baseType: !902, size: 32, align: 32, offset: 6048)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1012, file: !14, line: 2776, baseType: !902, size: 32, align: 32, offset: 6080)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1012, file: !14, line: 2783, baseType: !902, size: 32, align: 32, offset: 6112)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1012, file: !14, line: 2791, baseType: !902, size: 32, align: 32, offset: 6144)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1012, file: !14, line: 2802, baseType: !1032, size: 64, align: 64, offset: 6208)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1012, file: !14, line: 2811, baseType: !902, size: 32, align: 32, offset: 6272)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1012, file: !14, line: 2821, baseType: !902, size: 32, align: 32, offset: 6304)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1012, file: !14, line: 2830, baseType: !902, size: 32, align: 32, offset: 6336)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1012, file: !14, line: 2840, baseType: !902, size: 32, align: 32, offset: 6368)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1012, file: !14, line: 2851, baseType: !1491, size: 64, align: 64, offset: 6400)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!902, !1301, !1494, !963, !1304, !902, !902}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!902, !1301, !963}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1012, file: !14, line: 2871, baseType: !1498, size: 64, align: 64, offset: 6464)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!902, !1301, !1501, !963, !1304, !902}
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{!902, !1301, !963, !902, !902}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1012, file: !14, line: 2878, baseType: !902, size: 32, align: 32, offset: 6528)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1012, file: !14, line: 2885, baseType: !902, size: 32, align: 32, offset: 6560)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1012, file: !14, line: 3005, baseType: !902, size: 32, align: 32, offset: 6592)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1012, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1012, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1012, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1012, file: !14, line: 3037, baseType: !1038, size: 64, align: 64, offset: 6720)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1012, file: !14, line: 3038, baseType: !902, size: 32, align: 32, offset: 6784)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1012, file: !14, line: 3050, baseType: !947, size: 64, align: 64, offset: 6848)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1012, file: !14, line: 3065, baseType: !902, size: 32, align: 32, offset: 6912)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1012, file: !14, line: 3083, baseType: !902, size: 32, align: 32, offset: 6944)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1012, file: !14, line: 3092, baseType: !929, size: 64, align: 32, offset: 6976)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1012, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1012, file: !14, line: 3106, baseType: !929, size: 64, align: 32, offset: 7072)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1012, file: !14, line: 3113, baseType: !1519, size: 64, align: 64, offset: 7168)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1521)
!1521 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1522)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1523)
!1523 = !{!1524, !1525, !1526, !1527, !1528, !1529, !1532}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1522, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1522, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1522, file: !14, line: 720, baseType: !919, size: 64, align: 64, offset: 64)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1522, file: !14, line: 724, baseType: !919, size: 64, align: 64, offset: 128)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1522, file: !14, line: 728, baseType: !902, size: 32, align: 32, offset: 192)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1522, file: !14, line: 734, baseType: !1530, size: 64, align: 64, offset: 256)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1522, file: !14, line: 739, baseType: !1533, size: 64, align: 64, offset: 320)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1012, file: !14, line: 3129, baseType: !1053, size: 64, align: 64, offset: 7232)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1012, file: !14, line: 3130, baseType: !1053, size: 64, align: 64, offset: 7296)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1012, file: !14, line: 3131, baseType: !1053, size: 64, align: 64, offset: 7360)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1012, file: !14, line: 3132, baseType: !1053, size: 64, align: 64, offset: 7424)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1012, file: !14, line: 3139, baseType: !1429, size: 64, align: 64, offset: 7488)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1012, file: !14, line: 3147, baseType: !902, size: 32, align: 32, offset: 7552)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1012, file: !14, line: 3165, baseType: !902, size: 32, align: 32, offset: 7584)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1012, file: !14, line: 3172, baseType: !902, size: 32, align: 32, offset: 7616)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1012, file: !14, line: 3180, baseType: !902, size: 32, align: 32, offset: 7648)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1012, file: !14, line: 3191, baseType: !1341, size: 64, align: 64, offset: 7680)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1012, file: !14, line: 3199, baseType: !1038, size: 64, align: 64, offset: 7744)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1012, file: !14, line: 3207, baseType: !1429, size: 64, align: 64, offset: 7808)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1012, file: !14, line: 3214, baseType: !903, size: 32, align: 32, offset: 7872)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1012, file: !14, line: 3224, baseType: !1170, size: 64, align: 64, offset: 7936)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1012, file: !14, line: 3225, baseType: !902, size: 32, align: 32, offset: 8000)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1012, file: !14, line: 3249, baseType: !1072, size: 64, align: 64, offset: 8064)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1012, file: !14, line: 3256, baseType: !902, size: 32, align: 32, offset: 8128)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1012, file: !14, line: 3271, baseType: !902, size: 32, align: 32, offset: 8160)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1012, file: !14, line: 3279, baseType: !1053, size: 64, align: 64, offset: 8192)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1012, file: !14, line: 3301, baseType: !1072, size: 64, align: 64, offset: 8256)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1012, file: !14, line: 3310, baseType: !902, size: 32, align: 32, offset: 8320)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1012, file: !14, line: 3337, baseType: !902, size: 32, align: 32, offset: 8352)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1012, file: !14, line: 3351, baseType: !902, size: 32, align: 32, offset: 8384)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1012, file: !14, line: 3359, baseType: !902, size: 32, align: 32, offset: 8416)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !916, file: !14, line: 3535, baseType: !1560, size: 64, align: 64, offset: 1024)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!902, !1010, !1563}
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !916, file: !14, line: 3541, baseType: !1566, size: 64, align: 64, offset: 1088)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64, align: 64)
!1567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1568)
!1568 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1569)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1026, line: 223, size: 128, align: 64, elements: !1570)
!1570 = !{!1571, !1572}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1569, file: !1026, line: 224, baseType: !1455, size: 64, align: 64)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1569, file: !1026, line: 225, baseType: !1455, size: 64, align: 64, offset: 64)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !916, file: !14, line: 3549, baseType: !1574, size: 64, align: 64, offset: 1152)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{null, !1005}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !916, file: !14, line: 3551, baseType: !1007, size: 64, align: 64, offset: 1216)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !916, file: !14, line: 3552, baseType: !1579, size: 64, align: 64, offset: 1280)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{!902, !1010, !1038, !902, !1582}
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1584)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1585)
!1585 = !{!1586, !1587, !1588, !1589, !1590, !1614}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1584, file: !14, line: 3921, baseType: !1342, size: 16, align: 16)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1584, file: !14, line: 3922, baseType: !910, size: 32, align: 32, offset: 32)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1584, file: !14, line: 3923, baseType: !910, size: 32, align: 32, offset: 64)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1584, file: !14, line: 3924, baseType: !903, size: 32, align: 32, offset: 96)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1584, file: !14, line: 3925, baseType: !1591, size: 64, align: 64, offset: 128)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1594)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1595)
!1595 = !{!1596, !1597, !1598, !1599, !1600, !1601, !1607, !1609, !1610, !1611, !1612, !1613}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1594, file: !14, line: 3886, baseType: !902, size: 32, align: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1594, file: !14, line: 3887, baseType: !902, size: 32, align: 32, offset: 32)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1594, file: !14, line: 3888, baseType: !902, size: 32, align: 32, offset: 64)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1594, file: !14, line: 3889, baseType: !902, size: 32, align: 32, offset: 96)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1594, file: !14, line: 3890, baseType: !902, size: 32, align: 32, offset: 128)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1594, file: !14, line: 3897, baseType: !1602, size: 768, align: 64, offset: 192)
!1602 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1603)
!1603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1604)
!1604 = !{!1605, !1606}
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1603, file: !14, line: 3855, baseType: !1037, size: 512, align: 64)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1603, file: !14, line: 3857, baseType: !1042, size: 256, align: 32, offset: 512)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1594, file: !14, line: 3903, baseType: !1608, size: 256, align: 64, offset: 960)
!1608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 256, align: 64, elements: !1141)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1594, file: !14, line: 3904, baseType: !1148, size: 128, align: 32, offset: 1216)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1594, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1594, file: !14, line: 3908, baseType: !1429, size: 64, align: 64, offset: 1408)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1594, file: !14, line: 3915, baseType: !1429, size: 64, align: 64, offset: 1472)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1594, file: !14, line: 3917, baseType: !902, size: 32, align: 32, offset: 1536)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1584, file: !14, line: 3926, baseType: !1053, size: 64, align: 64, offset: 192)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !916, file: !14, line: 3564, baseType: !1616, size: 64, align: 64, offset: 1344)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{!902, !1010, !1158, !1302, !1304}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !916, file: !14, line: 3566, baseType: !1620, size: 64, align: 64, offset: 1408)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!902, !1010, !963, !1304, !1158}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !916, file: !14, line: 3567, baseType: !1007, size: 64, align: 64, offset: 1472)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !916, file: !14, line: 3576, baseType: !1625, size: 64, align: 64, offset: 1536)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64, align: 64)
!1626 = !DISubroutineType(types: !1627)
!1627 = !{!902, !1010, !1302}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !916, file: !14, line: 3577, baseType: !1629, size: 64, align: 64, offset: 1600)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!902, !1010, !1158}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !916, file: !14, line: 3584, baseType: !1448, size: 64, align: 64, offset: 1664)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !916, file: !14, line: 3589, baseType: !1634, size: 64, align: 64, offset: 1728)
!1634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1635, size: 64, align: 64)
!1635 = !DISubroutineType(types: !1636)
!1636 = !{null, !1010}
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !916, file: !14, line: 3594, baseType: !902, size: 32, align: 32, offset: 1792)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !916, file: !14, line: 3600, baseType: !919, size: 64, align: 64, offset: 1856)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !916, file: !14, line: 3609, baseType: !1640, size: 64, align: 64, offset: 1920)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1643)
!1643 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1644 = distinct !DIGlobalVariable(name: "ivi4_common_pic_sizes", scope: !0, file: !1645, line: 37, type: !1646, isLocal: true, isDefinition: true, variable: [14 x i16]* @ivi4_common_pic_sizes)
!1645 = !DIFile(filename: "libavcodec/indeo4data.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1647, size: 224, align: 16, elements: !1648)
!1647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1342)
!1648 = !{!1649}
!1649 = !DISubrange(count: 14)
!1650 = distinct !DIGlobalVariable(name: "transforms", scope: !0, file: !914, line: 46, type: !1651, isLocal: true, isDefinition: true, variable: [18 x %struct.anon]* @transforms)
!1651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1652, size: 3456, align: 64, elements: !1673)
!1652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1653)
!1653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !914, line: 42, size: 192, align: 64, elements: !1654)
!1654 = !{!1655, !1667, !1672}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "inv_trans", scope: !1653, file: !914, line: 43, baseType: !1656, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1657, size: 64, align: 64)
