; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ffv1.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ffv1.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!871 = !{!872, !873, !874, !875, !876, !877, !878, !879}
!872 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!873 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!874 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !{!910, !911, !912}
!910 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!911 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!913 = !{i32 2, !"Dwarf Version", i32 4}
!914 = !{i32 2, !"Debug Info Version", i32 3}
!915 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!916 = distinct !DISubprogram(name: "ff_ffv1_common_init", scope: !917, file: !917, line: 42, type: !918, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1680)
!917 = !DIFile(filename: "libavcodec/ffv1.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !DISubroutineType(types: !919)
!919 = !{!910, !920}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !923)
!923 = !{!924, !1009, !1010, !1011, !1278, !1279, !1280, !1281, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1434, !1438, !1439, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1618, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !922, file: !57, line: 1561, baseType: !925, size: 64, align: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !929)
!929 = !{!930, !934, !938, !968, !969, !970, !971, !975, !981, !983, !987}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !928, file: !26, line: 72, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !928, file: !26, line: 78, baseType: !935, size: 64, align: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!931, !912}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !928, file: !26, line: 85, baseType: !939, size: 64, align: 64, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !964, !965, !966, !967}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !941, file: !4, line: 247, baseType: !931, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !941, file: !4, line: 253, baseType: !931, size: 64, align: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !941, file: !4, line: 259, baseType: !910, size: 32, align: 32, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !941, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !941, file: !4, line: 271, baseType: !948, size: 64, align: 64, offset: 192)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !941, file: !4, line: 265, size: 64, align: 64, elements: !949)
!949 = !{!950, !954, !956, !957}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !948, file: !4, line: 266, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !952, line: 197, baseType: !953)
!952 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!953 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !948, file: !4, line: 267, baseType: !955, size: 64, align: 64)
!955 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !948, file: !4, line: 268, baseType: !931, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !948, file: !4, line: 270, baseType: !958, size: 64, align: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !959, line: 61, baseType: !960)
!959 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !959, line: 58, size: 64, align: 32, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !960, file: !959, line: 59, baseType: !910, size: 32, align: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !960, file: !959, line: 60, baseType: !910, size: 32, align: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !941, file: !4, line: 272, baseType: !955, size: 64, align: 64, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !941, file: !4, line: 273, baseType: !955, size: 64, align: 64, offset: 320)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !941, file: !4, line: 275, baseType: !910, size: 32, align: 32, offset: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !941, file: !4, line: 300, baseType: !931, size: 64, align: 64, offset: 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !928, file: !26, line: 93, baseType: !910, size: 32, align: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !928, file: !26, line: 99, baseType: !910, size: 32, align: 32, offset: 224)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !928, file: !26, line: 108, baseType: !910, size: 32, align: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !928, file: !26, line: 113, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!912, !912, !912}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !928, file: !26, line: 123, baseType: !976, size: 64, align: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!979, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !928, file: !26, line: 130, baseType: !982, size: 32, align: 32, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !928, file: !26, line: 136, baseType: !984, size: 64, align: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!982, !912}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !928, file: !26, line: 142, baseType: !988, size: 64, align: 64, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!910, !991, !912, !931, !910}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !994)
!994 = !{!995, !1007, !1008}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !993, file: !4, line: 360, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1000)
!1000 = !{!1001, !1002, !1003, !1004, !1005, !1006}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !999, file: !4, line: 307, baseType: !931, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !999, file: !4, line: 313, baseType: !955, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !999, file: !4, line: 313, baseType: !955, size: 64, align: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !999, file: !4, line: 318, baseType: !955, size: 64, align: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !999, file: !4, line: 318, baseType: !955, size: 64, align: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !999, file: !4, line: 323, baseType: !910, size: 32, align: 32, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !993, file: !4, line: 364, baseType: !910, size: 32, align: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !993, file: !4, line: 368, baseType: !910, size: 32, align: 32, offset: 96)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !922, file: !57, line: 1562, baseType: !910, size: 32, align: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !922, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !922, file: !57, line: 1565, baseType: !1012, size: 64, align: 64, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1024, !1027, !1030, !1033, !1039, !1042, !1043, !1051, !1052, !1053, !1055, !1057, !1063, !1074, !1078, !1079, !1128, !1249, !1253, !1254, !1258, !1262, !1267, !1271, !1272, !1273}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !57, line: 3475, baseType: !931, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1014, file: !57, line: 3480, baseType: !931, size: 64, align: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1014, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1014, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1014, file: !57, line: 3487, baseType: !910, size: 32, align: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1014, file: !57, line: 3488, baseType: !1022, size: 64, align: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1014, file: !57, line: 3489, baseType: !1025, size: 64, align: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1014, file: !57, line: 3490, baseType: !1028, size: 64, align: 64, offset: 384)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1014, file: !57, line: 3491, baseType: !1031, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1014, file: !57, line: 3492, baseType: !1034, size: 64, align: 64, offset: 512)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1037, line: 55, baseType: !1038)
!1037 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1038 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1014, file: !57, line: 3493, baseType: !1040, size: 8, align: 8, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1037, line: 48, baseType: !1041)
!1041 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1014, file: !57, line: 3494, baseType: !925, size: 64, align: 64, offset: 640)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1014, file: !57, line: 3495, baseType: !1044, size: 64, align: 64, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1047, file: !57, line: 3402, baseType: !910, size: 32, align: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1047, file: !57, line: 3403, baseType: !931, size: 64, align: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1014, file: !57, line: 3507, baseType: !931, size: 64, align: 64, offset: 768)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1014, file: !57, line: 3516, baseType: !910, size: 32, align: 32, offset: 832)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !57, line: 3517, baseType: !1054, size: 64, align: 64, offset: 896)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1014, file: !57, line: 3527, baseType: !1056, size: 64, align: 64, offset: 960)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1014, file: !57, line: 3535, baseType: !1058, size: 64, align: 64, offset: 1024)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!910, !920, !1061}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1014, file: !57, line: 3541, baseType: !1064, size: 64, align: 64, offset: 1088)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1068, line: 223, size: 128, align: 64, elements: !1069)
!1068 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1069 = !{!1070, !1073}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1067, file: !1068, line: 224, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1067, file: !1068, line: 225, baseType: !1071, size: 64, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1014, file: !57, line: 3549, baseType: !1075, size: 64, align: 64, offset: 1152)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{null, !1054}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1014, file: !57, line: 3551, baseType: !1056, size: 64, align: 64, offset: 1216)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1014, file: !57, line: 3552, baseType: !1080, size: 64, align: 64, offset: 1280)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!910, !920, !1083, !910, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1087)
!1087 = !{!1088, !1091, !1093, !1094, !1095, !1127}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1086, file: !57, line: 3921, baseType: !1089, size: 16, align: 16)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1037, line: 49, baseType: !1090)
!1090 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1086, file: !57, line: 3922, baseType: !1092, size: 32, align: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1037, line: 51, baseType: !911)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1086, file: !57, line: 3923, baseType: !1092, size: 32, align: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1086, file: !57, line: 3924, baseType: !911, size: 32, align: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1086, file: !57, line: 3925, baseType: !1096, size: 64, align: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1104, !1105, !1106, !1116, !1120, !1122, !1123, !1125, !1126}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1099, file: !57, line: 3886, baseType: !910, size: 32, align: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1099, file: !57, line: 3887, baseType: !910, size: 32, align: 32, offset: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1099, file: !57, line: 3888, baseType: !910, size: 32, align: 32, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1099, file: !57, line: 3889, baseType: !910, size: 32, align: 32, offset: 96)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1099, file: !57, line: 3890, baseType: !910, size: 32, align: 32, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1099, file: !57, line: 3897, baseType: !1107, size: 768, align: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1109)
!1109 = !{!1110, !1114}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !57, line: 3855, baseType: !1111, size: 512, align: 64)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 512, align: 64, elements: !1112)
!1112 = !{!1113}
!1113 = !DISubrange(count: 8)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1108, file: !57, line: 3857, baseType: !1115, size: 256, align: 32, offset: 512)
!1115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 256, align: 32, elements: !1112)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !57, line: 3903, baseType: !1117, size: 256, align: 64, offset: 960)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 256, align: 64, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 4)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1099, file: !57, line: 3904, baseType: !1121, size: 128, align: 32, offset: 1216)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 128, align: 32, elements: !1118)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1099, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1099, file: !57, line: 3908, baseType: !1124, size: 64, align: 64, offset: 1408)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1099, file: !57, line: 3915, baseType: !1124, size: 64, align: 64, offset: 1472)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !57, line: 3917, baseType: !910, size: 32, align: 32, offset: 1536)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1086, file: !57, line: 3926, baseType: !951, size: 64, align: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1014, file: !57, line: 3564, baseType: !1129, size: 64, align: 64, offset: 1344)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!910, !920, !1132, !1166, !1248}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1134)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1135)
!1135 = !{!1136, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1162, !1163, !1164, !1165}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1134, file: !57, line: 1451, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1139, line: 94, baseType: !1140)
!1139 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1139, line: 81, size: 192, align: 64, elements: !1141)
!1141 = !{!1142, !1146, !1147}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1140, file: !1139, line: 82, baseType: !1143, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1139, line: 73, baseType: !1145)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1139, line: 73, flags: DIFlagFwdDecl)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1140, file: !1139, line: 89, baseType: !1083, size: 64, align: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !1139, line: 93, baseType: !910, size: 32, align: 32, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1134, file: !57, line: 1461, baseType: !951, size: 64, align: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1134, file: !57, line: 1467, baseType: !951, size: 64, align: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1134, file: !57, line: 1468, baseType: !1083, size: 64, align: 64, offset: 192)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !57, line: 1469, baseType: !910, size: 32, align: 32, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1134, file: !57, line: 1470, baseType: !910, size: 32, align: 32, offset: 288)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1134, file: !57, line: 1474, baseType: !910, size: 32, align: 32, offset: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1134, file: !57, line: 1479, baseType: !1155, size: 64, align: 64, offset: 384)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1157)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1158)
!1158 = !{!1159, !1160, !1161}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1157, file: !57, line: 1412, baseType: !1083, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1157, file: !57, line: 1413, baseType: !910, size: 32, align: 32, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1157, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1134, file: !57, line: 1480, baseType: !910, size: 32, align: 32, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1134, file: !57, line: 1486, baseType: !951, size: 64, align: 64, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1134, file: !57, line: 1488, baseType: !951, size: 64, align: 64, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1134, file: !57, line: 1497, baseType: !951, size: 64, align: 64, offset: 640)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1168)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1200, !1202, !1203, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1236, !1237, !1238, !1239, !1240, !1241, !1244, !1245, !1246, !1247}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1169, file: !780, line: 282, baseType: !1111, size: 512, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1169, file: !780, line: 299, baseType: !1115, size: 256, align: 32, offset: 512)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1169, file: !780, line: 315, baseType: !1174, size: 64, align: 64, offset: 768)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1169, file: !780, line: 326, baseType: !910, size: 32, align: 32, offset: 832)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1169, file: !780, line: 326, baseType: !910, size: 32, align: 32, offset: 864)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1169, file: !780, line: 334, baseType: !910, size: 32, align: 32, offset: 896)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1169, file: !780, line: 341, baseType: !910, size: 32, align: 32, offset: 928)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1169, file: !780, line: 346, baseType: !910, size: 32, align: 32, offset: 960)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1169, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1169, file: !780, line: 356, baseType: !958, size: 64, align: 32, offset: 1024)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1169, file: !780, line: 361, baseType: !951, size: 64, align: 64, offset: 1088)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1169, file: !780, line: 369, baseType: !951, size: 64, align: 64, offset: 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1169, file: !780, line: 377, baseType: !951, size: 64, align: 64, offset: 1216)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1169, file: !780, line: 382, baseType: !910, size: 32, align: 32, offset: 1280)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1169, file: !780, line: 386, baseType: !910, size: 32, align: 32, offset: 1312)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1169, file: !780, line: 391, baseType: !910, size: 32, align: 32, offset: 1344)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1169, file: !780, line: 396, baseType: !912, size: 64, align: 64, offset: 1408)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1169, file: !780, line: 403, baseType: !1190, size: 512, align: 64, offset: 1472)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 512, align: 64, elements: !1112)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1169, file: !780, line: 410, baseType: !910, size: 32, align: 32, offset: 1984)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1169, file: !780, line: 415, baseType: !910, size: 32, align: 32, offset: 2016)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1169, file: !780, line: 420, baseType: !910, size: 32, align: 32, offset: 2048)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1169, file: !780, line: 425, baseType: !910, size: 32, align: 32, offset: 2080)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1169, file: !780, line: 435, baseType: !951, size: 64, align: 64, offset: 2112)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1169, file: !780, line: 440, baseType: !910, size: 32, align: 32, offset: 2176)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1169, file: !780, line: 445, baseType: !1036, size: 64, align: 64, offset: 2240)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1169, file: !780, line: 459, baseType: !1199, size: 512, align: 64, offset: 2304)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1137, size: 512, align: 64, elements: !1112)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1169, file: !780, line: 473, baseType: !1201, size: 64, align: 64, offset: 2816)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1169, file: !780, line: 477, baseType: !910, size: 32, align: 32, offset: 2880)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1169, file: !780, line: 479, baseType: !1204, size: 64, align: 64, offset: 2944)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1208)
!1208 = !{!1209, !1210, !1211, !1212, !1217}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1207, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1207, file: !780, line: 203, baseType: !1083, size: 64, align: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1207, file: !780, line: 204, baseType: !910, size: 32, align: 32, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1207, file: !780, line: 205, baseType: !1213, size: 64, align: 64, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1215, line: 86, baseType: !1216)
!1215 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1216 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1215, line: 86, flags: DIFlagFwdDecl)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1207, file: !780, line: 206, baseType: !1137, size: 64, align: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1169, file: !780, line: 480, baseType: !910, size: 32, align: 32, offset: 3008)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1169, file: !780, line: 505, baseType: !910, size: 32, align: 32, offset: 3040)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1169, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1169, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1169, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1169, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1169, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1169, file: !780, line: 532, baseType: !951, size: 64, align: 64, offset: 3264)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1169, file: !780, line: 539, baseType: !951, size: 64, align: 64, offset: 3328)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1169, file: !780, line: 547, baseType: !951, size: 64, align: 64, offset: 3392)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1169, file: !780, line: 554, baseType: !1213, size: 64, align: 64, offset: 3456)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1169, file: !780, line: 563, baseType: !910, size: 32, align: 32, offset: 3520)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1169, file: !780, line: 572, baseType: !910, size: 32, align: 32, offset: 3552)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1169, file: !780, line: 581, baseType: !910, size: 32, align: 32, offset: 3584)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1169, file: !780, line: 588, baseType: !1233, size: 64, align: 64, offset: 3648)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !952, line: 194, baseType: !1235)
!1235 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1169, file: !780, line: 593, baseType: !910, size: 32, align: 32, offset: 3712)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1169, file: !780, line: 596, baseType: !910, size: 32, align: 32, offset: 3744)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1169, file: !780, line: 599, baseType: !1137, size: 64, align: 64, offset: 3776)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1169, file: !780, line: 605, baseType: !1137, size: 64, align: 64, offset: 3840)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1169, file: !780, line: 616, baseType: !1137, size: 64, align: 64, offset: 3904)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1169, file: !780, line: 626, baseType: !1242, size: 64, align: 64, offset: 3968)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1243, line: 216, baseType: !1038)
!1243 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1169, file: !780, line: 627, baseType: !1242, size: 64, align: 64, offset: 4032)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1169, file: !780, line: 628, baseType: !1242, size: 64, align: 64, offset: 4096)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1169, file: !780, line: 629, baseType: !1242, size: 64, align: 64, offset: 4160)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1169, file: !780, line: 645, baseType: !1137, size: 64, align: 64, offset: 4224)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1014, file: !57, line: 3566, baseType: !1250, size: 64, align: 64, offset: 1408)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!910, !920, !912, !1248, !1132}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1014, file: !57, line: 3567, baseType: !1056, size: 64, align: 64, offset: 1472)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1014, file: !57, line: 3576, baseType: !1255, size: 64, align: 64, offset: 1536)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64, align: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!910, !920, !1166}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1014, file: !57, line: 3577, baseType: !1259, size: 64, align: 64, offset: 1600)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!910, !920, !1132}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1014, file: !57, line: 3584, baseType: !1263, size: 64, align: 64, offset: 1664)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{!910, !920, !1266}
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1014, file: !57, line: 3589, baseType: !1268, size: 64, align: 64, offset: 1728)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{null, !920}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1014, file: !57, line: 3594, baseType: !910, size: 32, align: 32, offset: 1792)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1014, file: !57, line: 3600, baseType: !931, size: 64, align: 64, offset: 1856)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1014, file: !57, line: 3609, baseType: !1274, size: 64, align: 64, offset: 1920)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1277)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !922, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !922, file: !57, line: 1581, baseType: !911, size: 32, align: 32, offset: 224)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !922, file: !57, line: 1583, baseType: !912, size: 64, align: 64, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !922, file: !57, line: 1591, baseType: !1282, size: 64, align: 64, offset: 320)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1068, line: 129, size: 1664, align: 64, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1289, !1307, !1308, !1314, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1283, file: !1068, line: 136, baseType: !910, size: 32, align: 32)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1283, file: !1068, line: 151, baseType: !910, size: 32, align: 32, offset: 32)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1283, file: !1068, line: 157, baseType: !910, size: 32, align: 32, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1283, file: !1068, line: 159, baseType: !1266, size: 64, align: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1283, file: !1068, line: 161, baseType: !1290, size: 64, align: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1068, line: 117, baseType: !1292)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1068, line: 100, size: 832, align: 64, elements: !1293)
!1293 = !{!1294, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1292, file: !1068, line: 105, baseType: !1295, size: 256, align: 64)
!1295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1296, size: 256, align: 64, elements: !1118)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1139, line: 238, baseType: !1298)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1139, line: 238, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1292, file: !1068, line: 110, baseType: !910, size: 32, align: 32, offset: 256)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1292, file: !1068, line: 111, baseType: !910, size: 32, align: 32, offset: 288)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1292, file: !1068, line: 111, baseType: !910, size: 32, align: 32, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1292, file: !1068, line: 112, baseType: !1115, size: 256, align: 32, offset: 352)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1292, file: !1068, line: 113, baseType: !1121, size: 128, align: 32, offset: 608)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1292, file: !1068, line: 114, baseType: !910, size: 32, align: 32, offset: 736)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1292, file: !1068, line: 115, baseType: !910, size: 32, align: 32, offset: 768)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1292, file: !1068, line: 116, baseType: !910, size: 32, align: 32, offset: 800)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1283, file: !1068, line: 163, baseType: !912, size: 64, align: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1283, file: !1068, line: 165, baseType: !1309, size: 128, align: 64, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1068, line: 122, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1068, line: 119, size: 128, align: 64, elements: !1311)
!1311 = !{!1312, !1313}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1310, file: !1068, line: 120, baseType: !1132, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1310, file: !1068, line: 121, baseType: !1266, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1283, file: !1068, line: 166, baseType: !1315, size: 128, align: 64, offset: 448)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1068, line: 127, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1068, line: 124, size: 128, align: 64, elements: !1317)
!1317 = !{!1318, !1391}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1316, file: !1068, line: 125, baseType: !1319, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1323)
!1323 = !{!1324, !1325, !1349, !1353, !1354, !1388, !1389, !1390}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1322, file: !57, line: 5751, baseType: !925, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1322, file: !57, line: 5756, baseType: !1326, size: 64, align: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1329)
!1329 = !{!1330, !1331, !1334, !1335, !1336, !1340, !1344, !1348}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1328, file: !57, line: 5797, baseType: !931, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1328, file: !57, line: 5804, baseType: !1332, size: 64, align: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1328, file: !57, line: 5815, baseType: !925, size: 64, align: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1328, file: !57, line: 5825, baseType: !910, size: 32, align: 32, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1328, file: !57, line: 5826, baseType: !1337, size: 64, align: 64, offset: 256)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!910, !1320}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1328, file: !57, line: 5827, baseType: !1341, size: 64, align: 64, offset: 320)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DISubroutineType(types: !1343)
!1343 = !{!910, !1320, !1132}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1328, file: !57, line: 5828, baseType: !1345, size: 64, align: 64, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{null, !1320}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1328, file: !57, line: 5829, baseType: !1345, size: 64, align: 64, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1322, file: !57, line: 5762, baseType: !1350, size: 64, align: 64, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1352)
!1352 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1322, file: !57, line: 5768, baseType: !912, size: 64, align: 64, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1322, file: !57, line: 5775, baseType: !1355, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1357, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1357, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1357, file: !57, line: 3948, baseType: !1092, size: 32, align: 32, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1357, file: !57, line: 3958, baseType: !1083, size: 64, align: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1357, file: !57, line: 3962, baseType: !910, size: 32, align: 32, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1357, file: !57, line: 3968, baseType: !910, size: 32, align: 32, offset: 224)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1357, file: !57, line: 3973, baseType: !951, size: 64, align: 64, offset: 256)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1357, file: !57, line: 3986, baseType: !910, size: 32, align: 32, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1357, file: !57, line: 3999, baseType: !910, size: 32, align: 32, offset: 352)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1357, file: !57, line: 4004, baseType: !910, size: 32, align: 32, offset: 384)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1357, file: !57, line: 4005, baseType: !910, size: 32, align: 32, offset: 416)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1357, file: !57, line: 4010, baseType: !910, size: 32, align: 32, offset: 448)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1357, file: !57, line: 4011, baseType: !910, size: 32, align: 32, offset: 480)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1357, file: !57, line: 4020, baseType: !958, size: 64, align: 32, offset: 512)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1357, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1357, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1357, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1357, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1357, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1357, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1357, file: !57, line: 4039, baseType: !910, size: 32, align: 32, offset: 768)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1357, file: !57, line: 4046, baseType: !1036, size: 64, align: 64, offset: 832)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1357, file: !57, line: 4050, baseType: !910, size: 32, align: 32, offset: 896)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1357, file: !57, line: 4054, baseType: !910, size: 32, align: 32, offset: 928)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1357, file: !57, line: 4061, baseType: !910, size: 32, align: 32, offset: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1357, file: !57, line: 4065, baseType: !910, size: 32, align: 32, offset: 992)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1357, file: !57, line: 4073, baseType: !910, size: 32, align: 32, offset: 1024)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1357, file: !57, line: 4080, baseType: !910, size: 32, align: 32, offset: 1056)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1357, file: !57, line: 4084, baseType: !910, size: 32, align: 32, offset: 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1322, file: !57, line: 5781, baseType: !1355, size: 64, align: 64, offset: 320)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1322, file: !57, line: 5787, baseType: !958, size: 64, align: 32, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1322, file: !57, line: 5793, baseType: !958, size: 64, align: 32, offset: 448)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1316, file: !1068, line: 126, baseType: !910, size: 32, align: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1283, file: !1068, line: 172, baseType: !1132, size: 64, align: 64, offset: 576)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1283, file: !1068, line: 177, baseType: !1083, size: 64, align: 64, offset: 640)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1283, file: !1068, line: 178, baseType: !911, size: 32, align: 32, offset: 704)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1283, file: !1068, line: 180, baseType: !912, size: 64, align: 64, offset: 768)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1283, file: !1068, line: 185, baseType: !910, size: 32, align: 32, offset: 832)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1283, file: !1068, line: 190, baseType: !912, size: 64, align: 64, offset: 896)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1283, file: !1068, line: 195, baseType: !910, size: 32, align: 32, offset: 960)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1283, file: !1068, line: 200, baseType: !1132, size: 64, align: 64, offset: 1024)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1283, file: !1068, line: 201, baseType: !910, size: 32, align: 32, offset: 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1283, file: !1068, line: 202, baseType: !1266, size: 64, align: 64, offset: 1152)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1283, file: !1068, line: 203, baseType: !910, size: 32, align: 32, offset: 1216)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1283, file: !1068, line: 205, baseType: !910, size: 32, align: 32, offset: 1248)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1283, file: !1068, line: 206, baseType: !910, size: 32, align: 32, offset: 1280)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1283, file: !1068, line: 209, baseType: !1242, size: 64, align: 64, offset: 1344)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1283, file: !1068, line: 212, baseType: !1242, size: 64, align: 64, offset: 1408)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1283, file: !1068, line: 213, baseType: !1266, size: 64, align: 64, offset: 1472)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1283, file: !1068, line: 215, baseType: !910, size: 32, align: 32, offset: 1536)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1283, file: !1068, line: 217, baseType: !910, size: 32, align: 32, offset: 1568)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1283, file: !1068, line: 220, baseType: !910, size: 32, align: 32, offset: 1600)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !922, file: !57, line: 1598, baseType: !912, size: 64, align: 64, offset: 384)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !922, file: !57, line: 1606, baseType: !951, size: 64, align: 64, offset: 448)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !922, file: !57, line: 1614, baseType: !910, size: 32, align: 32, offset: 512)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !922, file: !57, line: 1622, baseType: !910, size: 32, align: 32, offset: 544)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !922, file: !57, line: 1628, baseType: !910, size: 32, align: 32, offset: 576)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !922, file: !57, line: 1636, baseType: !910, size: 32, align: 32, offset: 608)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !922, file: !57, line: 1643, baseType: !910, size: 32, align: 32, offset: 640)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !922, file: !57, line: 1657, baseType: !1083, size: 64, align: 64, offset: 704)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !922, file: !57, line: 1658, baseType: !910, size: 32, align: 32, offset: 768)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !922, file: !57, line: 1679, baseType: !958, size: 64, align: 32, offset: 800)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !922, file: !57, line: 1688, baseType: !910, size: 32, align: 32, offset: 864)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !922, file: !57, line: 1712, baseType: !910, size: 32, align: 32, offset: 896)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !922, file: !57, line: 1729, baseType: !910, size: 32, align: 32, offset: 928)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !922, file: !57, line: 1729, baseType: !910, size: 32, align: 32, offset: 960)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !922, file: !57, line: 1744, baseType: !910, size: 32, align: 32, offset: 992)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !922, file: !57, line: 1744, baseType: !910, size: 32, align: 32, offset: 1024)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !922, file: !57, line: 1751, baseType: !910, size: 32, align: 32, offset: 1056)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !922, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !922, file: !57, line: 1791, baseType: !1430, size: 64, align: 64, offset: 1152)
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64, align: 64)
!1431 = !DISubroutineType(types: !1432)
!1432 = !{null, !1433, !1166, !1248, !910, !910, !910}
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !922, file: !57, line: 1808, baseType: !1435, size: 64, align: 64, offset: 1216)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64, align: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!516, !1433, !1025}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !922, file: !57, line: 1816, baseType: !910, size: 32, align: 32, offset: 1280)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !922, file: !57, line: 1825, baseType: !1440, size: 32, align: 32, offset: 1312)
!1440 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !922, file: !57, line: 1830, baseType: !910, size: 32, align: 32, offset: 1344)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !922, file: !57, line: 1838, baseType: !1440, size: 32, align: 32, offset: 1376)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !922, file: !57, line: 1846, baseType: !910, size: 32, align: 32, offset: 1408)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !922, file: !57, line: 1851, baseType: !910, size: 32, align: 32, offset: 1440)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !922, file: !57, line: 1861, baseType: !1440, size: 32, align: 32, offset: 1472)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !922, file: !57, line: 1868, baseType: !1440, size: 32, align: 32, offset: 1504)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !922, file: !57, line: 1875, baseType: !1440, size: 32, align: 32, offset: 1536)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !922, file: !57, line: 1882, baseType: !1440, size: 32, align: 32, offset: 1568)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !922, file: !57, line: 1889, baseType: !1440, size: 32, align: 32, offset: 1600)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !922, file: !57, line: 1896, baseType: !1440, size: 32, align: 32, offset: 1632)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !922, file: !57, line: 1903, baseType: !1440, size: 32, align: 32, offset: 1664)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !922, file: !57, line: 1910, baseType: !910, size: 32, align: 32, offset: 1696)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !922, file: !57, line: 1915, baseType: !910, size: 32, align: 32, offset: 1728)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !922, file: !57, line: 1926, baseType: !1248, size: 64, align: 64, offset: 1792)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !922, file: !57, line: 1935, baseType: !958, size: 64, align: 32, offset: 1856)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !922, file: !57, line: 1942, baseType: !910, size: 32, align: 32, offset: 1920)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !922, file: !57, line: 1948, baseType: !910, size: 32, align: 32, offset: 1952)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !922, file: !57, line: 1954, baseType: !910, size: 32, align: 32, offset: 1984)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !922, file: !57, line: 1960, baseType: !910, size: 32, align: 32, offset: 2016)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !922, file: !57, line: 1984, baseType: !910, size: 32, align: 32, offset: 2048)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !922, file: !57, line: 1991, baseType: !910, size: 32, align: 32, offset: 2080)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !922, file: !57, line: 1996, baseType: !910, size: 32, align: 32, offset: 2112)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !922, file: !57, line: 2004, baseType: !910, size: 32, align: 32, offset: 2144)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !922, file: !57, line: 2011, baseType: !910, size: 32, align: 32, offset: 2176)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !922, file: !57, line: 2018, baseType: !910, size: 32, align: 32, offset: 2208)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !922, file: !57, line: 2027, baseType: !910, size: 32, align: 32, offset: 2240)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !922, file: !57, line: 2034, baseType: !910, size: 32, align: 32, offset: 2272)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !922, file: !57, line: 2044, baseType: !910, size: 32, align: 32, offset: 2304)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !922, file: !57, line: 2054, baseType: !1470, size: 64, align: 64, offset: 2368)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !922, file: !57, line: 2061, baseType: !1470, size: 64, align: 64, offset: 2432)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !922, file: !57, line: 2066, baseType: !910, size: 32, align: 32, offset: 2496)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !922, file: !57, line: 2070, baseType: !910, size: 32, align: 32, offset: 2528)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !922, file: !57, line: 2078, baseType: !910, size: 32, align: 32, offset: 2560)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !922, file: !57, line: 2085, baseType: !910, size: 32, align: 32, offset: 2592)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !922, file: !57, line: 2092, baseType: !910, size: 32, align: 32, offset: 2624)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !922, file: !57, line: 2099, baseType: !910, size: 32, align: 32, offset: 2656)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !922, file: !57, line: 2106, baseType: !910, size: 32, align: 32, offset: 2688)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !922, file: !57, line: 2113, baseType: !910, size: 32, align: 32, offset: 2720)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !922, file: !57, line: 2120, baseType: !910, size: 32, align: 32, offset: 2752)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !922, file: !57, line: 2125, baseType: !910, size: 32, align: 32, offset: 2784)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !922, file: !57, line: 2133, baseType: !910, size: 32, align: 32, offset: 2816)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !922, file: !57, line: 2140, baseType: !910, size: 32, align: 32, offset: 2848)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !922, file: !57, line: 2145, baseType: !910, size: 32, align: 32, offset: 2880)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !922, file: !57, line: 2153, baseType: !910, size: 32, align: 32, offset: 2912)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !922, file: !57, line: 2158, baseType: !910, size: 32, align: 32, offset: 2944)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !922, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !922, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !922, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !922, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !922, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !922, file: !57, line: 2203, baseType: !910, size: 32, align: 32, offset: 3136)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !922, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !922, file: !57, line: 2212, baseType: !910, size: 32, align: 32, offset: 3200)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !922, file: !57, line: 2213, baseType: !910, size: 32, align: 32, offset: 3232)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !922, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !922, file: !57, line: 2232, baseType: !910, size: 32, align: 32, offset: 3296)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !922, file: !57, line: 2243, baseType: !910, size: 32, align: 32, offset: 3328)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !922, file: !57, line: 2249, baseType: !910, size: 32, align: 32, offset: 3360)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !922, file: !57, line: 2256, baseType: !910, size: 32, align: 32, offset: 3392)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !922, file: !57, line: 2263, baseType: !1036, size: 64, align: 64, offset: 3456)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !922, file: !57, line: 2270, baseType: !1036, size: 64, align: 64, offset: 3520)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !922, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !922, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !922, file: !57, line: 2367, baseType: !1506, size: 64, align: 64, offset: 3648)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DISubroutineType(types: !1508)
!1508 = !{!910, !1433, !1266, !910}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !922, file: !57, line: 2383, baseType: !910, size: 32, align: 32, offset: 3712)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !922, file: !57, line: 2386, baseType: !1440, size: 32, align: 32, offset: 3744)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !922, file: !57, line: 2387, baseType: !1440, size: 32, align: 32, offset: 3776)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !922, file: !57, line: 2394, baseType: !910, size: 32, align: 32, offset: 3808)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !922, file: !57, line: 2401, baseType: !910, size: 32, align: 32, offset: 3840)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !922, file: !57, line: 2408, baseType: !910, size: 32, align: 32, offset: 3872)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !922, file: !57, line: 2415, baseType: !910, size: 32, align: 32, offset: 3904)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !922, file: !57, line: 2422, baseType: !910, size: 32, align: 32, offset: 3936)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !922, file: !57, line: 2423, baseType: !1518, size: 64, align: 64, offset: 3968)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1521)
!1521 = !{!1522, !1523, !1524, !1525}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1520, file: !57, line: 827, baseType: !910, size: 32, align: 32)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1520, file: !57, line: 828, baseType: !910, size: 32, align: 32, offset: 32)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1520, file: !57, line: 829, baseType: !910, size: 32, align: 32, offset: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1520, file: !57, line: 830, baseType: !1440, size: 32, align: 32, offset: 96)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !922, file: !57, line: 2430, baseType: !951, size: 64, align: 64, offset: 4032)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !922, file: !57, line: 2437, baseType: !951, size: 64, align: 64, offset: 4096)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !922, file: !57, line: 2444, baseType: !1440, size: 32, align: 32, offset: 4160)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !922, file: !57, line: 2451, baseType: !1440, size: 32, align: 32, offset: 4192)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !922, file: !57, line: 2458, baseType: !910, size: 32, align: 32, offset: 4224)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !922, file: !57, line: 2469, baseType: !910, size: 32, align: 32, offset: 4256)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !922, file: !57, line: 2475, baseType: !910, size: 32, align: 32, offset: 4288)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !922, file: !57, line: 2481, baseType: !910, size: 32, align: 32, offset: 4320)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !922, file: !57, line: 2485, baseType: !910, size: 32, align: 32, offset: 4352)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !922, file: !57, line: 2489, baseType: !910, size: 32, align: 32, offset: 4384)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !922, file: !57, line: 2493, baseType: !910, size: 32, align: 32, offset: 4416)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !922, file: !57, line: 2501, baseType: !910, size: 32, align: 32, offset: 4448)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !922, file: !57, line: 2506, baseType: !910, size: 32, align: 32, offset: 4480)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !922, file: !57, line: 2510, baseType: !910, size: 32, align: 32, offset: 4512)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !922, file: !57, line: 2514, baseType: !951, size: 64, align: 64, offset: 4544)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !922, file: !57, line: 2528, baseType: !1542, size: 64, align: 64, offset: 4608)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{null, !1433, !912, !910, !910}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !922, file: !57, line: 2534, baseType: !910, size: 32, align: 32, offset: 4672)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !922, file: !57, line: 2545, baseType: !910, size: 32, align: 32, offset: 4704)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !922, file: !57, line: 2547, baseType: !910, size: 32, align: 32, offset: 4736)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !922, file: !57, line: 2549, baseType: !910, size: 32, align: 32, offset: 4768)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !922, file: !57, line: 2551, baseType: !910, size: 32, align: 32, offset: 4800)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !922, file: !57, line: 2553, baseType: !910, size: 32, align: 32, offset: 4832)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !922, file: !57, line: 2555, baseType: !910, size: 32, align: 32, offset: 4864)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !922, file: !57, line: 2557, baseType: !910, size: 32, align: 32, offset: 4896)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !922, file: !57, line: 2559, baseType: !910, size: 32, align: 32, offset: 4928)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !922, file: !57, line: 2563, baseType: !910, size: 32, align: 32, offset: 4960)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !922, file: !57, line: 2571, baseType: !1124, size: 64, align: 64, offset: 4992)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !922, file: !57, line: 2579, baseType: !1124, size: 64, align: 64, offset: 5056)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !922, file: !57, line: 2586, baseType: !910, size: 32, align: 32, offset: 5120)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !922, file: !57, line: 2615, baseType: !910, size: 32, align: 32, offset: 5152)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !922, file: !57, line: 2627, baseType: !910, size: 32, align: 32, offset: 5184)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !922, file: !57, line: 2637, baseType: !910, size: 32, align: 32, offset: 5216)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !922, file: !57, line: 2681, baseType: !910, size: 32, align: 32, offset: 5248)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !922, file: !57, line: 2709, baseType: !951, size: 64, align: 64, offset: 5312)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !922, file: !57, line: 2716, baseType: !1564, size: 64, align: 64, offset: 5376)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1566)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571, !1572, !1573, !1574, !1578, !1582, !1583, !1584, !1585, !1591, !1592, !1593, !1594, !1595}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1566, file: !57, line: 3642, baseType: !931, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1566, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1566, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1566, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1566, file: !57, line: 3669, baseType: !910, size: 32, align: 32, offset: 160)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1566, file: !57, line: 3682, baseType: !1263, size: 64, align: 64, offset: 192)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1566, file: !57, line: 3698, baseType: !1575, size: 64, align: 64, offset: 256)
!1575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1576, size: 64, align: 64)
!1576 = !DISubroutineType(types: !1577)
!1577 = !{!910, !920, !1071, !1092}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1566, file: !57, line: 3712, baseType: !1579, size: 64, align: 64, offset: 320)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{!910, !920, !910, !1071, !1092}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1566, file: !57, line: 3726, baseType: !1575, size: 64, align: 64, offset: 384)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1566, file: !57, line: 3737, baseType: !1056, size: 64, align: 64, offset: 448)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1566, file: !57, line: 3746, baseType: !910, size: 32, align: 32, offset: 512)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1566, file: !57, line: 3757, baseType: !1586, size: 64, align: 64, offset: 576)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DISubroutineType(types: !1588)
!1588 = !{null, !1589}
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !57, line: 3617, flags: DIFlagFwdDecl)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1566, file: !57, line: 3766, baseType: !1056, size: 64, align: 64, offset: 640)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1566, file: !57, line: 3774, baseType: !1056, size: 64, align: 64, offset: 704)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1566, file: !57, line: 3780, baseType: !910, size: 32, align: 32, offset: 768)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1566, file: !57, line: 3785, baseType: !910, size: 32, align: 32, offset: 800)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1566, file: !57, line: 3795, baseType: !1596, size: 64, align: 64, offset: 832)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!910, !920, !1137}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !922, file: !57, line: 2728, baseType: !912, size: 64, align: 64, offset: 5440)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !922, file: !57, line: 2735, baseType: !1190, size: 512, align: 64, offset: 5504)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !922, file: !57, line: 2742, baseType: !910, size: 32, align: 32, offset: 6016)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !922, file: !57, line: 2755, baseType: !910, size: 32, align: 32, offset: 6048)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !922, file: !57, line: 2776, baseType: !910, size: 32, align: 32, offset: 6080)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !922, file: !57, line: 2783, baseType: !910, size: 32, align: 32, offset: 6112)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !922, file: !57, line: 2791, baseType: !910, size: 32, align: 32, offset: 6144)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !922, file: !57, line: 2802, baseType: !1266, size: 64, align: 64, offset: 6208)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !922, file: !57, line: 2811, baseType: !910, size: 32, align: 32, offset: 6272)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !922, file: !57, line: 2821, baseType: !910, size: 32, align: 32, offset: 6304)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !922, file: !57, line: 2830, baseType: !910, size: 32, align: 32, offset: 6336)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !922, file: !57, line: 2840, baseType: !910, size: 32, align: 32, offset: 6368)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !922, file: !57, line: 2851, baseType: !1612, size: 64, align: 64, offset: 6400)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!910, !1433, !1615, !912, !1248, !910, !910}
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{!910, !1433, !912}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !922, file: !57, line: 2871, baseType: !1619, size: 64, align: 64, offset: 6464)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64, align: 64)
!1620 = !DISubroutineType(types: !1621)
!1621 = !{!910, !1433, !1622, !912, !1248, !910}
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DISubroutineType(types: !1624)
!1624 = !{!910, !1433, !912, !910, !910}
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !922, file: !57, line: 2878, baseType: !910, size: 32, align: 32, offset: 6528)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !922, file: !57, line: 2885, baseType: !910, size: 32, align: 32, offset: 6560)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !922, file: !57, line: 3005, baseType: !910, size: 32, align: 32, offset: 6592)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !922, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !922, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !922, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !922, file: !57, line: 3037, baseType: !1083, size: 64, align: 64, offset: 6720)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !922, file: !57, line: 3038, baseType: !910, size: 32, align: 32, offset: 6784)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !922, file: !57, line: 3050, baseType: !1036, size: 64, align: 64, offset: 6848)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !922, file: !57, line: 3065, baseType: !910, size: 32, align: 32, offset: 6912)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !922, file: !57, line: 3083, baseType: !910, size: 32, align: 32, offset: 6944)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !922, file: !57, line: 3092, baseType: !958, size: 64, align: 32, offset: 6976)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !922, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !922, file: !57, line: 3106, baseType: !958, size: 64, align: 32, offset: 7072)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !922, file: !57, line: 3113, baseType: !1640, size: 64, align: 64, offset: 7168)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1642)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1643)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1644)
!1644 = !{!1645, !1646, !1647, !1648, !1649, !1650, !1653}
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1643, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1643, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1643, file: !57, line: 720, baseType: !931, size: 64, align: 64, offset: 64)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1643, file: !57, line: 724, baseType: !931, size: 64, align: 64, offset: 128)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1643, file: !57, line: 728, baseType: !910, size: 32, align: 32, offset: 192)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1643, file: !57, line: 734, baseType: !1651, size: 64, align: 64, offset: 256)
!1651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1652, size: 64, align: 64)
!1652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1643, file: !57, line: 739, baseType: !1654, size: 64, align: 64, offset: 320)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !922, file: !57, line: 3129, baseType: !951, size: 64, align: 64, offset: 7232)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !922, file: !57, line: 3130, baseType: !951, size: 64, align: 64, offset: 7296)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !922, file: !57, line: 3131, baseType: !951, size: 64, align: 64, offset: 7360)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !922, file: !57, line: 3132, baseType: !951, size: 64, align: 64, offset: 7424)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !922, file: !57, line: 3139, baseType: !1124, size: 64, align: 64, offset: 7488)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !922, file: !57, line: 3147, baseType: !910, size: 32, align: 32, offset: 7552)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !922, file: !57, line: 3165, baseType: !910, size: 32, align: 32, offset: 7584)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !922, file: !57, line: 3172, baseType: !910, size: 32, align: 32, offset: 7616)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !922, file: !57, line: 3180, baseType: !910, size: 32, align: 32, offset: 7648)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !922, file: !57, line: 3191, baseType: !1470, size: 64, align: 64, offset: 7680)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !922, file: !57, line: 3199, baseType: !1083, size: 64, align: 64, offset: 7744)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !922, file: !57, line: 3207, baseType: !1124, size: 64, align: 64, offset: 7808)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !922, file: !57, line: 3214, baseType: !911, size: 32, align: 32, offset: 7872)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !922, file: !57, line: 3224, baseType: !1155, size: 64, align: 64, offset: 7936)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !922, file: !57, line: 3225, baseType: !910, size: 32, align: 32, offset: 8000)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !922, file: !57, line: 3249, baseType: !1137, size: 64, align: 64, offset: 8064)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !922, file: !57, line: 3256, baseType: !910, size: 32, align: 32, offset: 8128)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !922, file: !57, line: 3271, baseType: !910, size: 32, align: 32, offset: 8160)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !922, file: !57, line: 3279, baseType: !951, size: 64, align: 64, offset: 8192)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !922, file: !57, line: 3301, baseType: !1137, size: 64, align: 64, offset: 8256)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !922, file: !57, line: 3310, baseType: !910, size: 32, align: 32, offset: 8320)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !922, file: !57, line: 3337, baseType: !910, size: 32, align: 32, offset: 8352)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !922, file: !57, line: 3351, baseType: !910, size: 32, align: 32, offset: 8384)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !922, file: !57, line: 3359, baseType: !910, size: 32, align: 32, offset: 8416)
!1680 = !{}
!1681 = !DILocalVariable(name: "avctx", arg: 1, scope: !916, file: !917, line: 42, type: !920)
!1682 = !DIExpression()
!1683 = !DILocation(line: 42, column: 63, scope: !916)
!1684 = !DILocalVariable(name: "s", scope: !916, file: !917, line: 44, type: !1685)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
