; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--af_headphone.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--af_headphone.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterPad = type { i8*, i32, %struct.AVFrame* (%struct.AVFilterLink*, i32, i32)*, %struct.AVFrame* (%struct.AVFilterLink*, i32)*, i32 (%struct.AVFilterLink*, %struct.AVFrame*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32 (%struct.AVFilterLink*)*, i32, i32 }
%struct.AVFrame = type { [8 x i8*], [8 x i32], i8**, i32, i32, i32, i32, i32, i32, %struct.AVRational, i64, i64, i64, i32, i32, i32, i8*, [8 x i64], i32, i32, i32, i32, i64, i32, i64, [8 x %struct.AVBufferRef*], %struct.AVBufferRef**, i32, %struct.AVFrameSideData**, i32, i32, i32, i32, i32, i32, i32, i64, i64, i64, %struct.AVDictionary*, i32, i32, i32, i8*, i32, i32, %struct.AVBufferRef*, %struct.AVBufferRef*, %struct.AVBufferRef*, i64, i64, i64, i64, %struct.AVBufferRef* }
%struct.AVRational = type { i32, i32 }
%struct.AVFrameSideData = type { i32, i8*, i32, %struct.AVDictionary*, %struct.AVBufferRef* }
%struct.AVDictionary = type opaque
%struct.AVBufferRef = type { %struct.AVBuffer*, i8*, i32 }
%struct.AVBuffer = type opaque

!114 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !48, line: 538, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!118 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!119 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!120 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!121 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!122 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!123 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!124 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !126, line: 221, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!128 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!129 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!130 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!131 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!132 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!133 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!134 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!135 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!136 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!137 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!138 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!139 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!140 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!141 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!142 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!143 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!144 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!145 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!146 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !148, line: 29, size: 32, align: 32, elements: !149)
!148 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!150 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!151 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!152 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!153 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!154 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!155 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!156 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!157 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!158 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!159 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!160 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!161 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!162 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!163 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!164 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!165 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!166 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!167 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!168 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !170, file: !169, line: 503, size: 32, align: 32, elements: !575)
!169 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !169, line: 439, size: 493504, align: 64, elements: !171)
!171 = !{!172, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !536, !537, !538, !539, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !170, file: !169, line: 440, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !169, line: 67, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !169, line: 338, size: 1344, align: 64, elements: !176)
!176 = !{!177, !264, !436, !437, !439, !441, !443, !444, !445, !446, !447, !487, !488, !494, !503, !504, !505, !507, !508, !509, !510, !511}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !175, file: !169, line: 339, baseType: !178, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !148, line: 143, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !148, line: 67, size: 640, align: 64, elements: !182)
!182 = !{!183, !187, !192, !223, !224, !225, !226, !230, !236, !238, !242}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !181, file: !148, line: 72, baseType: !184, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !181, file: !148, line: 78, baseType: !188, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DISubroutineType(types: !190)
!190 = !{!184, !191}
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !181, file: !148, line: 85, baseType: !193, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !126, line: 246, size: 512, align: 64, elements: !196)
!196 = !{!197, !198, !199, !201, !202, !219, !220, !221, !222}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !126, line: 247, baseType: !184, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !195, file: !126, line: 253, baseType: !184, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !195, file: !126, line: 259, baseType: !200, size: 32, align: 32, offset: 128)
!200 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !195, file: !126, line: 260, baseType: !125, size: 32, align: 32, offset: 160)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !195, file: !126, line: 271, baseType: !203, size: 64, align: 64, offset: 192)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !195, file: !126, line: 265, size: 64, align: 64, elements: !204)
!204 = !{!205, !209, !211, !212}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !203, file: !126, line: 266, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !207, line: 40, baseType: !208)
!207 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!208 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !203, file: !126, line: 267, baseType: !210, size: 64, align: 64)
!210 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !203, file: !126, line: 268, baseType: !184, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !203, file: !126, line: 270, baseType: !213, size: 64, align: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !214, line: 61, baseType: !215)
!214 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !214, line: 58, size: 64, align: 32, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !215, file: !214, line: 59, baseType: !200, size: 32, align: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !215, file: !214, line: 60, baseType: !200, size: 32, align: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !195, file: !126, line: 272, baseType: !210, size: 64, align: 64, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !195, file: !126, line: 273, baseType: !210, size: 64, align: 64, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !195, file: !126, line: 275, baseType: !200, size: 32, align: 32, offset: 384)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !195, file: !126, line: 300, baseType: !184, size: 64, align: 64, offset: 448)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !148, line: 93, baseType: !200, size: 32, align: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !181, file: !148, line: 99, baseType: !200, size: 32, align: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !181, file: !148, line: 108, baseType: !200, size: 32, align: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !181, file: !148, line: 113, baseType: !227, size: 64, align: 64, offset: 320)
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64, align: 64)
!228 = !DISubroutineType(types: !229)
!229 = !{!191, !191, !191}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !181, file: !148, line: 123, baseType: !231, size: 64, align: 64, offset: 384)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64, align: 64)
!232 = !DISubroutineType(types: !233)
!233 = !{!234, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !181, file: !148, line: 130, baseType: !237, size: 32, align: 32, offset: 448)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !148, line: 48, baseType: !147)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !181, file: !148, line: 136, baseType: !239, size: 64, align: 64, offset: 512)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64, align: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!237, !191}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !181, file: !148, line: 142, baseType: !243, size: 64, align: 64, offset: 576)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64, align: 64)
!244 = !DISubroutineType(types: !245)
!245 = !{!200, !246, !191, !184, !200}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64, align: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64, align: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !126, line: 329, size: 128, align: 64, elements: !249)
!249 = !{!250, !262, !263}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !248, file: !126, line: 360, baseType: !251, size: 64, align: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !126, line: 324, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !126, line: 306, size: 384, align: 64, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !254, file: !126, line: 307, baseType: !184, size: 64, align: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !254, file: !126, line: 313, baseType: !210, size: 64, align: 64, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 192)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !254, file: !126, line: 318, baseType: !210, size: 64, align: 64, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !254, file: !126, line: 323, baseType: !200, size: 32, align: 32, offset: 320)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !248, file: !126, line: 364, baseType: !200, size: 32, align: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !248, file: !126, line: 368, baseType: !200, size: 32, align: 32, offset: 96)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !175, file: !169, line: 341, baseType: !265, size: 64, align: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !169, line: 328, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !169, line: 144, size: 1024, align: 64, elements: !269)
!269 = !{!270, !271, !272, !404, !405, !406, !407, !411, !412, !417, !421, !422, !423, !424, !426, !431, !435}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !268, file: !169, line: 148, baseType: !184, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !268, file: !169, line: 155, baseType: !184, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !268, file: !169, line: 164, baseType: !273, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64, align: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !169, line: 69, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !277, line: 54, size: 576, align: 64, elements: !278)
!277 = !DIFile(filename: "libavfilter/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!278 = !{!279, !280, !281, !388, !392, !396, !400, !401, !402, !403}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !276, file: !277, line: 60, baseType: !184, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !276, file: !277, line: 65, baseType: !3, size: 32, align: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "get_video_buffer", scope: !276, file: !277, line: 73, baseType: !282, size: 64, align: 64, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64, align: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!285, !386, !200, !200}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64, align: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !24, line: 646, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !24, line: 268, size: 4288, align: 64, elements: !288)
!288 = !{!289, !296, !298, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !318, !319, !320, !321, !322, !323, !324, !325, !338, !340, !341, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !374, !375, !376, !377, !378, !379, !382, !383, !384, !385}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !287, file: !24, line: 282, baseType: !290, size: 512, align: 64)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 512, align: 64, elements: !294)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64, align: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !207, line: 48, baseType: !293)
!293 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!294 = !{!295}
!295 = !DISubrange(count: 8)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !287, file: !24, line: 299, baseType: !297, size: 256, align: 32, offset: 512)
!297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 256, align: 32, elements: !294)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !287, file: !24, line: 315, baseType: !299, size: 64, align: 64, offset: 768)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64, align: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 832)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !287, file: !24, line: 326, baseType: !200, size: 32, align: 32, offset: 864)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !287, file: !24, line: 334, baseType: !200, size: 32, align: 32, offset: 896)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !287, file: !24, line: 341, baseType: !200, size: 32, align: 32, offset: 928)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !287, file: !24, line: 346, baseType: !200, size: 32, align: 32, offset: 960)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !287, file: !24, line: 351, baseType: !13, size: 32, align: 32, offset: 992)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !287, file: !24, line: 356, baseType: !213, size: 64, align: 32, offset: 1024)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !287, file: !24, line: 361, baseType: !206, size: 64, align: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !287, file: !24, line: 369, baseType: !206, size: 64, align: 64, offset: 1152)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !287, file: !24, line: 377, baseType: !206, size: 64, align: 64, offset: 1216)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !287, file: !24, line: 382, baseType: !200, size: 32, align: 32, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !287, file: !24, line: 386, baseType: !200, size: 32, align: 32, offset: 1312)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !287, file: !24, line: 391, baseType: !200, size: 32, align: 32, offset: 1344)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !287, file: !24, line: 396, baseType: !191, size: 64, align: 64, offset: 1408)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !287, file: !24, line: 403, baseType: !315, size: 512, align: 64, offset: 1472)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, size: 512, align: 64, elements: !294)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !207, line: 55, baseType: !317)
!317 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !287, file: !24, line: 410, baseType: !200, size: 32, align: 32, offset: 1984)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !287, file: !24, line: 415, baseType: !200, size: 32, align: 32, offset: 2016)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !287, file: !24, line: 420, baseType: !200, size: 32, align: 32, offset: 2048)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !287, file: !24, line: 425, baseType: !200, size: 32, align: 32, offset: 2080)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !287, file: !24, line: 435, baseType: !206, size: 64, align: 64, offset: 2112)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !287, file: !24, line: 440, baseType: !200, size: 32, align: 32, offset: 2176)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !287, file: !24, line: 445, baseType: !316, size: 64, align: 64, offset: 2240)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !287, file: !24, line: 459, baseType: !326, size: 512, align: 64, offset: 2304)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, align: 64, elements: !294)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !329, line: 94, baseType: !330)
!329 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !329, line: 81, size: 192, align: 64, elements: !331)
!331 = !{!332, !336, !337}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !330, file: !329, line: 82, baseType: !333, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64, align: 64)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !329, line: 73, baseType: !335)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !329, line: 73, flags: DIFlagFwdDecl)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !330, file: !329, line: 89, baseType: !291, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !330, file: !329, line: 93, baseType: !200, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !287, file: !24, line: 473, baseType: !339, size: 64, align: 64, offset: 2816)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !287, file: !24, line: 477, baseType: !200, size: 32, align: 32, offset: 2880)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !287, file: !24, line: 479, baseType: !342, size: 64, align: 64, offset: 2944)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !24, line: 207, baseType: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !24, line: 201, size: 320, align: 64, elements: !346)
!346 = !{!347, !348, !349, !350, !355}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !345, file: !24, line: 202, baseType: !23, size: 32, align: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !24, line: 203, baseType: !291, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !345, file: !24, line: 204, baseType: !200, size: 32, align: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !345, file: !24, line: 205, baseType: !351, size: 64, align: 64, offset: 192)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !353, line: 86, baseType: !354)
!353 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !353, line: 86, flags: DIFlagFwdDecl)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !345, file: !24, line: 206, baseType: !327, size: 64, align: 64, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !287, file: !24, line: 480, baseType: !200, size: 32, align: 32, offset: 3008)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !24, line: 505, baseType: !200, size: 32, align: 32, offset: 3040)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !287, file: !24, line: 512, baseType: !47, size: 32, align: 32, offset: 3072)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !287, file: !24, line: 514, baseType: !54, size: 32, align: 32, offset: 3104)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !287, file: !24, line: 516, baseType: !72, size: 32, align: 32, offset: 3136)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !287, file: !24, line: 523, baseType: !96, size: 32, align: 32, offset: 3168)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !287, file: !24, line: 525, baseType: !115, size: 32, align: 32, offset: 3200)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !287, file: !24, line: 532, baseType: !206, size: 64, align: 64, offset: 3264)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !287, file: !24, line: 539, baseType: !206, size: 64, align: 64, offset: 3328)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !287, file: !24, line: 547, baseType: !206, size: 64, align: 64, offset: 3392)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !287, file: !24, line: 554, baseType: !351, size: 64, align: 64, offset: 3456)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !287, file: !24, line: 563, baseType: !200, size: 32, align: 32, offset: 3520)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !287, file: !24, line: 572, baseType: !200, size: 32, align: 32, offset: 3552)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !287, file: !24, line: 581, baseType: !200, size: 32, align: 32, offset: 3584)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !287, file: !24, line: 588, baseType: !371, size: 64, align: 64, offset: 3648)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !207, line: 36, baseType: !373)
!373 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !287, file: !24, line: 593, baseType: !200, size: 32, align: 32, offset: 3712)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !287, file: !24, line: 596, baseType: !200, size: 32, align: 32, offset: 3744)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !287, file: !24, line: 599, baseType: !327, size: 64, align: 64, offset: 3776)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !287, file: !24, line: 605, baseType: !327, size: 64, align: 64, offset: 3840)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !287, file: !24, line: 616, baseType: !327, size: 64, align: 64, offset: 3904)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !287, file: !24, line: 626, baseType: !380, size: 64, align: 64, offset: 3968)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !381, line: 216, baseType: !317)
!381 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !287, file: !24, line: 627, baseType: !380, size: 64, align: 64, offset: 4032)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !287, file: !24, line: 628, baseType: !380, size: 64, align: 64, offset: 4096)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !287, file: !24, line: 629, baseType: !380, size: 64, align: 64, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !287, file: !24, line: 645, baseType: !327, size: 64, align: 64, offset: 4224)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64, align: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !169, line: 68, baseType: !170)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "get_audio_buffer", scope: !276, file: !277, line: 81, baseType: !389, size: 64, align: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64, align: 64)
!390 = !DISubroutineType(types: !391)
!391 = !{!285, !386, !200}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "filter_frame", scope: !276, file: !277, line: 93, baseType: !393, size: 64, align: 64, offset: 256)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!200, !386, !285}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_frame", scope: !276, file: !277, line: 104, baseType: !397, size: 64, align: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!200, !386}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "request_frame", scope: !276, file: !277, line: 113, baseType: !397, size: 64, align: 64, offset: 384)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "config_props", scope: !276, file: !277, line: 129, baseType: !397, size: 64, align: 64, offset: 448)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "needs_fifo", scope: !276, file: !277, line: 137, baseType: !200, size: 32, align: 32, offset: 512)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "needs_writable", scope: !276, file: !277, line: 145, baseType: !200, size: 32, align: 32, offset: 544)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !268, file: !169, line: 172, baseType: !273, size: 64, align: 64, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !268, file: !169, line: 182, baseType: !178, size: 64, align: 64, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !268, file: !169, line: 187, baseType: !200, size: 32, align: 32, offset: 320)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !268, file: !169, line: 210, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = !DISubroutineType(types: !410)
!410 = !{!200, !173}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !268, file: !169, line: 233, baseType: !408, size: 64, align: 64, offset: 448)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !268, file: !169, line: 246, baseType: !413, size: 64, align: 64, offset: 512)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DISubroutineType(types: !415)
!415 = !{!200, !173, !416}
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !268, file: !169, line: 258, baseType: !418, size: 64, align: 64, offset: 576)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64, align: 64)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !173}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !268, file: !169, line: 282, baseType: !408, size: 64, align: 64, offset: 640)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !268, file: !169, line: 284, baseType: !200, size: 32, align: 32, offset: 704)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !268, file: !169, line: 286, baseType: !200, size: 32, align: 32, offset: 736)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !268, file: !169, line: 292, baseType: !425, size: 64, align: 64, offset: 768)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !268, file: !169, line: 306, baseType: !427, size: 64, align: 64, offset: 832)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = !DISubroutineType(types: !429)
!429 = !{!200, !173, !184, !184, !430, !200, !200}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !268, file: !169, line: 313, baseType: !432, size: 64, align: 64, offset: 896)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64, align: 64)
!433 = !DISubroutineType(types: !434)
!434 = !{!200, !173, !191}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !268, file: !169, line: 327, baseType: !408, size: 64, align: 64, offset: 960)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !169, line: 343, baseType: !430, size: 64, align: 64, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !175, file: !169, line: 345, baseType: !438, size: 64, align: 64, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !175, file: !169, line: 346, baseType: !440, size: 64, align: 64, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !175, file: !169, line: 347, baseType: !442, size: 32, align: 32, offset: 320)
!442 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !175, file: !169, line: 349, baseType: !438, size: 64, align: 64, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !175, file: !169, line: 350, baseType: !440, size: 64, align: 64, offset: 448)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !175, file: !169, line: 351, baseType: !442, size: 32, align: 32, offset: 512)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !175, file: !169, line: 353, baseType: !191, size: 64, align: 64, offset: 576)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !175, file: !169, line: 355, baseType: !448, size: 64, align: 64, offset: 640)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64, align: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !169, line: 840, size: 768, align: 64, elements: !450)
!450 = !{!451, !452, !454, !455, !456, !457, !458, !459, !481, !482, !483, !484, !485, !486}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !449, file: !169, line: 841, baseType: !178, size: 64, align: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !449, file: !169, line: 842, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !449, file: !169, line: 843, baseType: !442, size: 32, align: 32, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !449, file: !169, line: 845, baseType: !430, size: 64, align: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !449, file: !169, line: 847, baseType: !430, size: 64, align: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !449, file: !169, line: 862, baseType: !200, size: 32, align: 32, offset: 320)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !449, file: !169, line: 869, baseType: !200, size: 32, align: 32, offset: 352)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !449, file: !169, line: 874, baseType: !460, size: 64, align: 64, offset: 384)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64, align: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !169, line: 809, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !277, line: 148, size: 192, align: 64, elements: !463)
!463 = !{!464, !465, !475}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !462, file: !277, line: 149, baseType: !191, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "thread_execute", scope: !462, file: !277, line: 150, baseType: !466, size: 64, align: 64, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !169, line: 837, baseType: !468)
!468 = !DISubroutineType(types: !469)
!469 = !{!200, !173, !470, !191, !474, !200}
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !169, line: 823, baseType: !472)
!472 = !DISubroutineType(types: !473)
!473 = !{!200, !173, !191, !200, !200}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64, align: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_queues", scope: !462, file: !277, line: 151, baseType: !476, size: 8, align: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFFrameQueueGlobal", file: !477, line: 48, baseType: !478)
!477 = !DIFile(filename: "libavfilter/framequeue.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFFrameQueueGlobal", file: !477, line: 46, size: 8, align: 8, elements: !479)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !478, file: !477, line: 47, baseType: !186, size: 8, align: 8)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !449, file: !169, line: 881, baseType: !191, size: 64, align: 64, offset: 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !449, file: !169, line: 895, baseType: !466, size: 64, align: 64, offset: 512)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !449, file: !169, line: 897, baseType: !430, size: 64, align: 64, offset: 576)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !449, file: !169, line: 906, baseType: !440, size: 64, align: 64, offset: 640)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !449, file: !169, line: 907, baseType: !200, size: 32, align: 32, offset: 704)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !449, file: !169, line: 909, baseType: !442, size: 32, align: 32, offset: 736)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !175, file: !169, line: 373, baseType: !200, size: 32, align: 32, offset: 704)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !175, file: !169, line: 378, baseType: !489, size: 64, align: 64, offset: 768)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 64, align: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !169, line: 335, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !277, line: 154, size: 64, align: 64, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !491, file: !277, line: 155, baseType: !466, size: 64, align: 64)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !175, file: !169, line: 380, baseType: !495, size: 64, align: 64, offset: 832)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64, align: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !277, line: 38, size: 320, align: 64, elements: !497)
!497 = !{!498, !499, !500, !501, !502}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !496, file: !277, line: 39, baseType: !210, size: 64, align: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "command", scope: !496, file: !277, line: 40, baseType: !430, size: 64, align: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !496, file: !277, line: 41, baseType: !430, size: 64, align: 64, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !496, file: !277, line: 42, baseType: !200, size: 32, align: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !277, line: 43, baseType: !495, size: 64, align: 64, offset: 256)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !175, file: !169, line: 382, baseType: !430, size: 64, align: 64, offset: 896)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !175, file: !169, line: 383, baseType: !191, size: 64, align: 64, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !175, file: !169, line: 384, baseType: !506, size: 64, align: 64, offset: 1024)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !175, file: !169, line: 385, baseType: !200, size: 32, align: 32, offset: 1088)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !175, file: !169, line: 394, baseType: !327, size: 64, align: 64, offset: 1152)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !175, file: !169, line: 401, baseType: !200, size: 32, align: 32, offset: 1216)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !175, file: !169, line: 408, baseType: !442, size: 32, align: 32, offset: 1248)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !175, file: !169, line: 424, baseType: !200, size: 32, align: 32, offset: 1280)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !170, file: !169, line: 441, baseType: !438, size: 64, align: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !170, file: !169, line: 443, baseType: !173, size: 64, align: 64, offset: 128)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !170, file: !169, line: 444, baseType: !438, size: 64, align: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !170, file: !169, line: 446, baseType: !3, size: 32, align: 32, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !170, file: !169, line: 449, baseType: !200, size: 32, align: 32, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !170, file: !169, line: 450, baseType: !200, size: 32, align: 32, offset: 320)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !170, file: !169, line: 451, baseType: !213, size: 64, align: 32, offset: 352)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !170, file: !169, line: 453, baseType: !316, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !170, file: !169, line: 454, baseType: !200, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !170, file: !169, line: 456, baseType: !200, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !170, file: !169, line: 465, baseType: !213, size: 64, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !170, file: !169, line: 481, baseType: !524, size: 64, align: 64, offset: 640)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64, align: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !169, line: 70, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !527, line: 64, size: 256, align: 64, elements: !528)
!527 = !DIFile(filename: "libavfilter/formats.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nb_formats", scope: !526, file: !527, line: 65, baseType: !442, size: 32, align: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "formats", scope: !526, file: !527, line: 66, baseType: !474, size: 64, align: 64, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !526, file: !527, line: 68, baseType: !442, size: 32, align: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !526, file: !527, line: 69, baseType: !533, size: 64, align: 64, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64, align: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !170, file: !169, line: 482, baseType: !524, size: 64, align: 64, offset: 704)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !170, file: !169, line: 488, baseType: !524, size: 64, align: 64, offset: 768)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !170, file: !169, line: 489, baseType: !524, size: 64, align: 64, offset: 832)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !170, file: !169, line: 490, baseType: !540, size: 64, align: 64, offset: 896)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64, align: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !527, line: 85, size: 256, align: 64, elements: !542)
!542 = !{!543, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !541, file: !527, line: 86, baseType: !544, size: 64, align: 64)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "nb_channel_layouts", scope: !541, file: !527, line: 87, baseType: !200, size: 32, align: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "all_layouts", scope: !541, file: !527, line: 88, baseType: !186, size: 8, align: 8, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "all_counts", scope: !541, file: !527, line: 89, baseType: !186, size: 8, align: 8, offset: 104)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !541, file: !527, line: 91, baseType: !442, size: 32, align: 32, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !541, file: !527, line: 92, baseType: !550, size: 64, align: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64, align: 64)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !170, file: !169, line: 491, baseType: !540, size: 64, align: 64, offset: 960)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !170, file: !169, line: 500, baseType: !200, size: 32, align: 32, offset: 1024)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !170, file: !169, line: 507, baseType: !168, size: 32, align: 32, offset: 1056)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !170, file: !169, line: 512, baseType: !448, size: 64, align: 64, offset: 1088)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !170, file: !169, line: 518, baseType: !206, size: 64, align: 64, offset: 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !170, file: !169, line: 524, baseType: !206, size: 64, align: 64, offset: 1216)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !170, file: !169, line: 529, baseType: !200, size: 32, align: 32, offset: 1280)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !170, file: !169, line: 542, baseType: !213, size: 64, align: 32, offset: 1312)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !170, file: !169, line: 547, baseType: !285, size: 64, align: 64, offset: 1408)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !170, file: !169, line: 553, baseType: !200, size: 32, align: 32, offset: 1472)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !170, file: !169, line: 562, baseType: !200, size: 32, align: 32, offset: 1504)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !170, file: !169, line: 568, baseType: !200, size: 32, align: 32, offset: 1536)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !170, file: !169, line: 573, baseType: !200, size: 32, align: 32, offset: 1568)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !170, file: !169, line: 578, baseType: !442, size: 32, align: 32, offset: 1600)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1664)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !170, file: !169, line: 583, baseType: !206, size: 64, align: 64, offset: 1728)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !170, file: !169, line: 588, baseType: !191, size: 64, align: 64, offset: 1792)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !170, file: !169, line: 595, baseType: !200, size: 32, align: 32, offset: 1856)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !170, file: !169, line: 601, baseType: !327, size: 64, align: 64, offset: 1920)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !170, file: !169, line: 610, baseType: !572, size: 491520, align: 8, offset: 1984)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 491520, align: 8, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 61440)
!575 = !{!576, !577, !578}
!576 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!577 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!578 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSampleFormat", file: !580, line: 58, size: 32, align: 32, elements: !581)
!580 = !DIFile(filename: "./libavutil/samplefmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595}
!582 = !DIEnumerator(name: "AV_SAMPLE_FMT_NONE", value: -1)
!583 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8", value: 0)
!584 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16", value: 1)
!585 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32", value: 2)
!586 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLT", value: 3)
!587 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBL", value: 4)
!588 = !DIEnumerator(name: "AV_SAMPLE_FMT_U8P", value: 5)
!589 = !DIEnumerator(name: "AV_SAMPLE_FMT_S16P", value: 6)
!590 = !DIEnumerator(name: "AV_SAMPLE_FMT_S32P", value: 7)
!591 = !DIEnumerator(name: "AV_SAMPLE_FMT_FLTP", value: 8)
!592 = !DIEnumerator(name: "AV_SAMPLE_FMT_DBLP", value: 9)
!593 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64", value: 10)
!594 = !DIEnumerator(name: "AV_SAMPLE_FMT_S64P", value: 11)
!595 = !DIEnumerator(name: "AV_SAMPLE_FMT_NB", value: 12)
!596 = !{!200, !442, !597, !599, !601}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64, align: 64)
!598 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64, align: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !207, line: 51, baseType: !442)
!602 = !{!603, !605, !609, !610}
!603 = distinct !DIGlobalVariable(name: "ff_af_headphone", scope: !0, file: !604, line: 872, type: !267, isLocal: false, isDefinition: true, variable: %struct.AVFilter* @ff_af_headphone)
!604 = !DIFile(filename: "libavfilter/af_headphone.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!605 = distinct !DIGlobalVariable(name: "outputs", scope: !0, file: !604, line: 863, type: !606, isLocal: true, isDefinition: true, variable: [2 x %struct.AVFilterPad]* @outputs)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1152, align: 64, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 2)
!609 = distinct !DIGlobalVariable(name: "headphone_class", scope: !0, file: !604, line: 861, type: !179, isLocal: true, isDefinition: true, variable: %struct.AVClass* @headphone_class)
!610 = distinct !DIGlobalVariable(name: "headphone_options", scope: !0, file: !604, line: 847, type: !611, isLocal: true, isDefinition: true, variable: <{ { i8*, i8*, i32, i32, { i8* }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, { i8*, i8*, i32, i32, { double }, double, double, i32, i8* }, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption, %struct.AVOption }>* @headphone_options)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 5632, align: 64, elements: !614)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !126, line: 301, baseType: !195)
!614 = !{!615}
!615 = !DISubrange(count: 11)
!616 = !{i32 2, !"Dwarf Version", i32 4}
!617 = !{i32 2, !"Debug Info Version", i32 3}
!618 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!619 = distinct !DISubprogram(name: "init", scope: !604, file: !604, line: 747, type: !409, isLocal: true, isDefinition: true, scopeLine: 748, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !620)
!620 = !{}
!621 = !DILocalVariable(name: "ctx", arg: 1, scope: !619, file: !604, line: 747, type: !173)
!622 = !DIExpression()
!623 = !DILocation(line: 747, column: 56, scope: !619)
!624 = !DILocalVariable(name: "s", scope: !619, file: !604, line: 749, type: !625)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "HeadphoneContext", file: !604, line: 89, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HeadphoneContext", file: !604, line: 41, size: 4032, align: 64, elements: !628)
!628 = !{!629, !630, !631, !632, !633, !634, !635, !636, !637, !641, !642, !643, !644, !645, !646, !648, !650, !651, !652, !653, !654, !656, !657, !658, !668, !669, !674, !675, !676, !717}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !627, file: !604, line: 42, baseType: !178, size: 64, align: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !627, file: !604, line: 44, baseType: !430, size: 64, align: 64, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !627, file: !604, line: 45, baseType: !200, size: 32, align: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_channel", scope: !627, file: !604, line: 47, baseType: !200, size: 32, align: 32, offset: 160)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "have_hrirs", scope: !627, file: !604, line: 49, baseType: !200, size: 32, align: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "eof_hrirs", scope: !627, file: !604, line: 50, baseType: !200, size: 32, align: 32, offset: 224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ir_len", scope: !627, file: !604, line: 52, baseType: !200, size: 32, align: 32, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "air_len", scope: !627, file: !604, line: 53, baseType: !200, size: 32, align: 32, offset: 288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "mapping", scope: !627, file: !604, line: 55, baseType: !638, size: 2048, align: 32, offset: 320)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 2048, align: 32, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !627, file: !604, line: 57, baseType: !200, size: 32, align: 32, offset: 2368)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "nb_irs", scope: !627, file: !604, line: 59, baseType: !200, size: 32, align: 32, offset: 2400)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gain", scope: !627, file: !604, line: 61, baseType: !598, size: 32, align: 32, offset: 2432)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lfe_gain", scope: !627, file: !604, line: 62, baseType: !598, size: 32, align: 32, offset: 2464)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "gain_lfe", scope: !627, file: !604, line: 62, baseType: !598, size: 32, align: 32, offset: 2496)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ringbuffer", scope: !627, file: !604, line: 64, baseType: !647, size: 128, align: 64, offset: 2560)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !597, size: 128, align: 64, elements: !607)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !627, file: !604, line: 65, baseType: !649, size: 64, align: 32, offset: 2688)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 64, align: 32, elements: !607)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_length", scope: !627, file: !604, line: 67, baseType: !200, size: 32, align: 32, offset: 2752)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "n_fft", scope: !627, file: !604, line: 68, baseType: !200, size: 32, align: 32, offset: 2784)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !627, file: !604, line: 69, baseType: !200, size: 32, align: 32, offset: 2816)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "hrir_fmt", scope: !627, file: !604, line: 70, baseType: !200, size: 32, align: 32, offset: 2848)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !627, file: !604, line: 72, baseType: !655, size: 128, align: 64, offset: 2880)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 128, align: 64, elements: !607)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "data_ir", scope: !627, file: !604, line: 73, baseType: !647, size: 128, align: 64, offset: 3008)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "temp_src", scope: !627, file: !604, line: 74, baseType: !647, size: 128, align: 64, offset: 3136)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "temp_fft", scope: !627, file: !604, line: 75, baseType: !659, size: 128, align: 64, offset: 3264)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 128, align: 64, elements: !607)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !662, line: 39, baseType: !663)
!662 = !DIFile(filename: "./libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !662, line: 37, size: 64, align: 32, elements: !664)
!664 = !{!665, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !663, file: !662, line: 38, baseType: !666, size: 32, align: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !662, line: 35, baseType: !598)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !663, file: !662, line: 38, baseType: !666, size: 32, align: 32, offset: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "temp_afft", scope: !627, file: !604, line: 76, baseType: !659, size: 128, align: 64, offset: 3392)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fft", scope: !627, file: !604, line: 78, baseType: !670, size: 128, align: 64, offset: 3520)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 128, align: 64, elements: !607)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !662, line: 41, baseType: !673)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !662, line: 41, flags: DIFlagFwdDecl)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ifft", scope: !627, file: !604, line: 78, baseType: !670, size: 128, align: 64, offset: 3648)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "data_hrtf", scope: !627, file: !604, line: 79, baseType: !659, size: 128, align: 64, offset: 3776)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fdsp", scope: !627, file: !604, line: 81, baseType: !677, size: 64, align: 64, offset: 3904)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFloatDSPContext", file: !679, line: 192, baseType: !680)
!679 = !DIFile(filename: "./libavutil/float_dsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFloatDSPContext", file: !679, line: 24, size: 704, align: 64, elements: !681)
!681 = !{!682, !686, !690, !696, !697, !698, !702, !703, !704, !709, !713}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul", scope: !680, file: !679, line: 38, baseType: !683, size: 64, align: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64, align: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !597, !599, !599, !200}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmac_scalar", scope: !680, file: !679, line: 54, baseType: !687, size: 64, align: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64, align: 64)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !597, !599, !598, !200}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmac_scalar", scope: !680, file: !679, line: 70, baseType: !691, size: 64, align: 64, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64, align: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !506, !694, !210, !200}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64, align: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_scalar", scope: !680, file: !679, line: 85, baseType: !687, size: 64, align: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul_scalar", scope: !680, file: !679, line: 100, baseType: !691, size: 64, align: 64, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_window", scope: !680, file: !679, line: 119, baseType: !699, size: 64, align: 64, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64, align: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{null, !597, !599, !599, !599, !200}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_add", scope: !680, file: !679, line: 137, baseType: !699, size: 64, align: 64, offset: 384)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "vector_fmul_reverse", scope: !680, file: !679, line: 154, baseType: !683, size: 64, align: 64, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "butterflies_float", scope: !680, file: !679, line: 164, baseType: !705, size: 64, align: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !708, !708, !200}
!708 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !597)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "scalarproduct_float", scope: !680, file: !679, line: 175, baseType: !710, size: 64, align: 64, offset: 576)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!598, !599, !599, !200}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vector_dmul", scope: !680, file: !679, line: 190, baseType: !714, size: 64, align: 64, offset: 640)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64, align: 64)
!715 = !DISubroutineType(types: !716)
!716 = !{null, !506, !694, !694, !200}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !627, file: !604, line: 88, baseType: !718, size: 64, align: 64, offset: 3968)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "headphone_inputs", file: !604, line: 82, size: 192, align: 64, elements: !720)
!720 = !{!721, !722, !723, !724, !725}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "frame", scope: !719, file: !604, line: 83, baseType: !285, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ir_len", scope: !719, file: !604, line: 84, baseType: !200, size: 32, align: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "delay_l", scope: !719, file: !604, line: 85, baseType: !200, size: 32, align: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "delay_r", scope: !719, file: !604, line: 86, baseType: !200, size: 32, align: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "eof", scope: !719, file: !604, line: 87, baseType: !200, size: 32, align: 32, offset: 160)
!726 = !DILocation(line: 749, column: 23, scope: !619)
!727 = !DILocation(line: 749, column: 27, scope: !619)
!728 = !DILocation(line: 749, column: 32, scope: !619)
!729 = !DILocalVariable(name: "i", scope: !619, file: !604, line: 750, type: !200)
!730 = !DILocation(line: 750, column: 9, scope: !619)
!731 = !DILocalVariable(name: "ret", scope: !619, file: !604, line: 750, type: !200)
!732 = !DILocation(line: 750, column: 12, scope: !619)
!733 = !DILocalVariable(name: "pad", scope: !619, file: !604, line: 752, type: !275)
!734 = !DILocation(line: 752, column: 17, scope: !619)
!735 = !DILocation(line: 757, column: 32, scope: !736)
!736 = distinct !DILexicalBlock(scope: !619, file: !604, line: 757, column: 9)
!737 = !DILocation(line: 757, column: 16, scope: !736)
!738 = !DILocation(line: 757, column: 14, scope: !736)
!739 = !DILocation(line: 757, column: 47, scope: !736)
!740 = !DILocation(line: 757, column: 9, scope: !619)
!741 = !DILocation(line: 758, column: 16, scope: !736)
!742 = !DILocation(line: 758, column: 9, scope: !736)
!743 = !DILocation(line: 760, column: 10, scope: !744)
!744 = distinct !DILexicalBlock(scope: !619, file: !604, line: 760, column: 9)
!745 = !DILocation(line: 760, column: 13, scope: !744)
!746 = !DILocation(line: 760, column: 9, scope: !619)
!747 = !DILocation(line: 761, column: 16, scope: !748)
!748 = distinct !DILexicalBlock(scope: !744, file: !604, line: 760, column: 18)
!749 = !DILocation(line: 761, column: 9, scope: !748)
!750 = !DILocation(line: 762, column: 9, scope: !748)
!751 = !DILocation(line: 765, column: 15, scope: !619)
!752 = !DILocation(line: 765, column: 5, scope: !619)
!753 = !DILocation(line: 767, column: 23, scope: !619)
!754 = !DILocation(line: 767, column: 26, scope: !619)
!755 = !DILocation(line: 767, column: 13, scope: !619)
!756 = !DILocation(line: 767, column: 5, scope: !619)
!757 = !DILocation(line: 767, column: 8, scope: !619)
!758 = !DILocation(line: 767, column: 11, scope: !619)
!759 = !DILocation(line: 768, column: 10, scope: !760)
!760 = distinct !DILexicalBlock(scope: !619, file: !604, line: 768, column: 9)
!761 = !DILocation(line: 768, column: 13, scope: !760)
!762 = !DILocation(line: 768, column: 9, scope: !619)
!763 = !DILocation(line: 769, column: 9, scope: !760)
!764 = !DILocation(line: 771, column: 12, scope: !765)
!765 = distinct !DILexicalBlock(scope: !619, file: !604, line: 771, column: 5)
!766 = !DILocation(line: 771, column: 10, scope: !765)
!767 = !DILocation(line: 771, column: 17, scope: !768)
!768 = !DILexicalBlockFile(scope: !769, file: !604, discriminator: 1)
!769 = distinct !DILexicalBlock(scope: !765, file: !604, line: 771, column: 5)
!770 = !DILocation(line: 771, column: 21, scope: !768)
!771 = !DILocation(line: 771, column: 24, scope: !768)
!772 = !DILocation(line: 771, column: 19, scope: !768)
!773 = !DILocation(line: 771, column: 5, scope: !768)
!774 = !DILocalVariable(name: "name", scope: !775, file: !604, line: 772, type: !430)
!775 = distinct !DILexicalBlock(scope: !769, file: !604, line: 771, column: 40)
!776 = !DILocation(line: 772, column: 15, scope: !775)
!777 = !DILocation(line: 772, column: 44, scope: !775)
!778 = !DILocation(line: 772, column: 46, scope: !775)
!779 = !DILocation(line: 772, column: 22, scope: !775)
!780 = !DILocalVariable(name: "pad", scope: !775, file: !604, line: 773, type: !275)
!781 = !DILocation(line: 773, column: 21, scope: !775)
!782 = !DILocation(line: 773, column: 27, scope: !775)
!783 = !DILocation(line: 774, column: 21, scope: !775)
!784 = !DILocation(line: 777, column: 14, scope: !785)
!785 = distinct !DILexicalBlock(scope: !775, file: !604, line: 777, column: 13)
!786 = !DILocation(line: 777, column: 13, scope: !775)
!787 = !DILocation(line: 778, column: 13, scope: !785)
!788 = !DILocation(line: 779, column: 36, scope: !789)
!789 = distinct !DILexicalBlock(scope: !775, file: !604, line: 779, column: 13)
!790 = !DILocation(line: 779, column: 41, scope: !789)
!791 = !DILocation(line: 779, column: 20, scope: !789)
!792 = !DILocation(line: 779, column: 18, scope: !789)
!793 = !DILocation(line: 779, column: 51, scope: !789)
!794 = !DILocation(line: 779, column: 13, scope: !775)
!795 = !DILocation(line: 780, column: 27, scope: !796)
!796 = distinct !DILexicalBlock(scope: !789, file: !604, line: 779, column: 56)
!797 = !DILocation(line: 780, column: 22, scope: !796)
!798 = !DILocation(line: 780, column: 13, scope: !796)
!799 = !DILocation(line: 781, column: 20, scope: !796)
!800 = !DILocation(line: 781, column: 13, scope: !796)
!801 = !DILocation(line: 783, column: 5, scope: !775)
!802 = !DILocation(line: 771, column: 36, scope: !803)
!803 = !DILexicalBlockFile(scope: !769, file: !604, discriminator: 2)
!804 = !DILocation(line: 771, column: 5, scope: !803)
!805 = distinct !{!805, !806}
!806 = !DILocation(line: 771, column: 5, scope: !619)
!807 = !DILocation(line: 785, column: 15, scope: !619)
!808 = !DILocation(line: 785, column: 5, scope: !619)
!809 = !DILocation(line: 785, column: 8, scope: !619)
!810 = !DILocation(line: 785, column: 13, scope: !619)
!811 = !DILocation(line: 786, column: 10, scope: !812)
!812 = distinct !DILexicalBlock(scope: !619, file: !604, line: 786, column: 9)
!813 = !DILocation(line: 786, column: 13, scope: !812)
!814 = !DILocation(line: 786, column: 9, scope: !619)
!815 = !DILocation(line: 787, column: 9, scope: !812)
!816 = !DILocation(line: 789, column: 5, scope: !619)
!817 = !DILocation(line: 790, column: 1, scope: !619)
!818 = distinct !DISubprogram(name: "uninit", scope: !604, file: !604, line: 812, type: !419, isLocal: true, isDefinition: true, scopeLine: 813, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !620)
!819 = !DILocalVariable(name: "ctx", arg: 1, scope: !818, file: !604, line: 812, type: !173)
!820 = !DILocation(line: 812, column: 59, scope: !818)
!821 = !DILocalVariable(name: "s", scope: !818, file: !604, line: 814, type: !625)
!822 = !DILocation(line: 814, column: 23, scope: !818)
!823 = !DILocation(line: 814, column: 27, scope: !818)
!824 = !DILocation(line: 814, column: 32, scope: !818)
!825 = !DILocalVariable(name: "i", scope: !818, file: !604, line: 815, type: !200)
!826 = !DILocation(line: 815, column: 9, scope: !818)
!827 = !DILocation(line: 817, column: 16, scope: !818)
!828 = !DILocation(line: 817, column: 19, scope: !818)
!829 = !DILocation(line: 817, column: 5, scope: !818)
!830 = !DILocation(line: 818, column: 16, scope: !818)
!831 = !DILocation(line: 818, column: 19, scope: !818)
!832 = !DILocation(line: 818, column: 5, scope: !818)
!833 = !DILocation(line: 819, column: 16, scope: !818)
!834 = !DILocation(line: 819, column: 19, scope: !818)
!835 = !DILocation(line: 819, column: 5, scope: !818)
!836 = !DILocation(line: 820, column: 16, scope: !818)
!837 = !DILocation(line: 820, column: 19, scope: !818)
!838 = !DILocation(line: 820, column: 5, scope: !818)
!839 = !DILocation(line: 821, column: 15, scope: !818)
!840 = !DILocation(line: 821, column: 18, scope: !818)
!841 = !DILocation(line: 821, column: 14, scope: !818)
!842 = !DILocation(line: 821, column: 5, scope: !818)
!843 = !DILocation(line: 822, column: 15, scope: !818)
!844 = !DILocation(line: 822, column: 18, scope: !818)
!845 = !DILocation(line: 822, column: 14, scope: !818)
!846 = !DILocation(line: 822, column: 5, scope: !818)
!847 = !DILocation(line: 823, column: 15, scope: !818)
!848 = !DILocation(line: 823, column: 18, scope: !818)
!849 = !DILocation(line: 823, column: 14, scope: !818)
!850 = !DILocation(line: 823, column: 5, scope: !818)
!851 = !DILocation(line: 824, column: 15, scope: !818)
!852 = !DILocation(line: 824, column: 18, scope: !818)
!853 = !DILocation(line: 824, column: 14, scope: !818)
!854 = !DILocation(line: 824, column: 5, scope: !818)
!855 = !DILocation(line: 825, column: 15, scope: !818)
!856 = !DILocation(line: 825, column: 18, scope: !818)
!857 = !DILocation(line: 825, column: 14, scope: !818)
!858 = !DILocation(line: 825, column: 5, scope: !818)
!859 = !DILocation(line: 826, column: 15, scope: !818)
!860 = !DILocation(line: 826, column: 18, scope: !818)
!861 = !DILocation(line: 826, column: 14, scope: !818)
!862 = !DILocation(line: 826, column: 5, scope: !818)
!863 = !DILocation(line: 827, column: 15, scope: !818)
!864 = !DILocation(line: 827, column: 18, scope: !818)
!865 = !DILocation(line: 827, column: 14, scope: !818)
!866 = !DILocation(line: 827, column: 5, scope: !818)
!867 = !DILocation(line: 828, column: 15, scope: !818)
!868 = !DILocation(line: 828, column: 18, scope: !818)
!869 = !DILocation(line: 828, column: 14, scope: !818)
!870 = !DILocation(line: 828, column: 5, scope: !818)
!871 = !DILocation(line: 829, column: 15, scope: !818)
!872 = !DILocation(line: 829, column: 18, scope: !818)
!873 = !DILocation(line: 829, column: 14, scope: !818)
!874 = !DILocation(line: 829, column: 5, scope: !818)
!875 = !DILocation(line: 830, column: 15, scope: !818)
!876 = !DILocation(line: 830, column: 18, scope: !818)
!877 = !DILocation(line: 830, column: 14, scope: !818)
!878 = !DILocation(line: 830, column: 5, scope: !818)
!879 = !DILocation(line: 831, column: 15, scope: !818)
!880 = !DILocation(line: 831, column: 18, scope: !818)
!881 = !DILocation(line: 831, column: 14, scope: !818)
!882 = !DILocation(line: 831, column: 5, scope: !818)
!883 = !DILocation(line: 832, column: 15, scope: !818)
!884 = !DILocation(line: 832, column: 18, scope: !818)
!885 = !DILocation(line: 832, column: 14, scope: !818)
!886 = !DILocation(line: 832, column: 5, scope: !818)
!887 = !DILocation(line: 833, column: 15, scope: !818)
!888 = !DILocation(line: 833, column: 18, scope: !818)
!889 = !DILocation(line: 833, column: 14, scope: !818)
!890 = !DILocation(line: 833, column: 5, scope: !818)
!891 = !DILocation(line: 834, column: 15, scope: !818)
!892 = !DILocation(line: 834, column: 18, scope: !818)
!893 = !DILocation(line: 834, column: 14, scope: !818)
!894 = !DILocation(line: 834, column: 5, scope: !818)
!895 = !DILocation(line: 835, column: 15, scope: !818)
!896 = !DILocation(line: 835, column: 18, scope: !818)
!897 = !DILocation(line: 835, column: 14, scope: !818)
!898 = !DILocation(line: 835, column: 5, scope: !818)
!899 = !DILocation(line: 837, column: 12, scope: !900)
!900 = distinct !DILexicalBlock(scope: !818, file: !604, line: 837, column: 5)
!901 = !DILocation(line: 837, column: 10, scope: !900)
!902 = !DILocation(line: 837, column: 17, scope: !903)
!903 = !DILexicalBlockFile(scope: !904, file: !604, discriminator: 1)
!904 = distinct !DILexicalBlock(scope: !900, file: !604, line: 837, column: 5)
!905 = !DILocation(line: 837, column: 21, scope: !903)
!906 = !DILocation(line: 837, column: 24, scope: !903)
!907 = !DILocation(line: 837, column: 19, scope: !903)
!908 = !DILocation(line: 837, column: 5, scope: !903)
!909 = !DILocation(line: 838, column: 13, scope: !910)
!910 = distinct !DILexicalBlock(scope: !911, file: !604, line: 838, column: 13)
!911 = distinct !DILexicalBlock(scope: !904, file: !604, line: 837, column: 40)
!912 = !DILocation(line: 838, column: 18, scope: !910)
!913 = !DILocation(line: 838, column: 29, scope: !910)
!914 = !DILocation(line: 838, column: 32, scope: !915)
!915 = !DILexicalBlockFile(scope: !910, file: !604, discriminator: 1)
!916 = !DILocation(line: 838, column: 13, scope: !915)
!917 = !DILocation(line: 839, column: 39, scope: !910)
!918 = !DILocation(line: 839, column: 23, scope: !910)
!919 = !DILocation(line: 839, column: 28, scope: !910)
!920 = !DILocation(line: 839, column: 42, scope: !910)
!921 = !DILocation(line: 839, column: 22, scope: !910)
!922 = !DILocation(line: 839, column: 13, scope: !910)
!923 = !DILocation(line: 840, column: 5, scope: !911)
!924 = !DILocation(line: 837, column: 36, scope: !925)
!925 = !DILexicalBlockFile(scope: !904, file: !604, discriminator: 2)
!926 = !DILocation(line: 837, column: 5, scope: !925)
!927 = distinct !{!927, !928}
!928 = !DILocation(line: 837, column: 5, scope: !818)
!929 = !DILocation(line: 841, column: 15, scope: !818)
!930 = !DILocation(line: 841, column: 18, scope: !818)
!931 = !DILocation(line: 841, column: 14, scope: !818)
!932 = !DILocation(line: 841, column: 5, scope: !818)
!933 = !DILocation(line: 842, column: 1, scope: !818)
!934 = distinct !DISubprogram(name: "query_formats", scope: !604, file: !604, line: 681, type: !409, isLocal: true, isDefinition: true, scopeLine: 682, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !620)
!935 = !DILocalVariable(name: "ctx", arg: 1, scope: !934, file: !604, line: 681, type: !173)
!936 = !DILocation(line: 681, column: 43, scope: !934)
!937 = !DILocalVariable(name: "s", scope: !934, file: !604, line: 683, type: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64, align: 64)
!939 = !DILocation(line: 683, column: 30, scope: !934)
!940 = !DILocation(line: 683, column: 34, scope: !934)
!941 = !DILocation(line: 683, column: 39, scope: !934)
!942 = !DILocalVariable(name: "formats", scope: !934, file: !604, line: 684, type: !524)
!943 = !DILocation(line: 684, column: 22, scope: !934)
!944 = !DILocalVariable(name: "layouts", scope: !934, file: !604, line: 685, type: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterChannelLayouts", file: !527, line: 93, baseType: !541)
!947 = !DILocation(line: 685, column: 29, scope: !934)
!948 = !DILocalVariable(name: "stereo_layout", scope: !934, file: !604, line: 686, type: !945)
!949 = !DILocation(line: 686, column: 29, scope: !934)
!950 = !DILocalVariable(name: "hrir_layouts", scope: !934, file: !604, line: 687, type: !945)
!951 = !DILocation(line: 687, column: 29, scope: !934)
!952 = !DILocalVariable(name: "ret", scope: !934, file: !604, line: 688, type: !200)
!953 = !DILocation(line: 688, column: 9, scope: !934)
!954 = !DILocalVariable(name: "i", scope: !934, file: !604, line: 688, type: !200)
!955 = !DILocation(line: 688, column: 14, scope: !934)
!956 = !DILocation(line: 690, column: 11, scope: !934)
!957 = !DILocation(line: 690, column: 9, scope: !934)
!958 = !DILocation(line: 691, column: 9, scope: !959)
!959 = distinct !DILexicalBlock(scope: !934, file: !604, line: 691, column: 9)
!960 = !DILocation(line: 691, column: 9, scope: !934)
!961 = !DILocation(line: 692, column: 16, scope: !959)
!962 = !DILocation(line: 692, column: 9, scope: !959)
!963 = !DILocation(line: 693, column: 33, scope: !934)
!964 = !DILocation(line: 693, column: 38, scope: !934)
!965 = !DILocation(line: 693, column: 11, scope: !934)
!966 = !DILocation(line: 693, column: 9, scope: !934)
!967 = !DILocation(line: 694, column: 9, scope: !968)
!968 = distinct !DILexicalBlock(scope: !934, file: !604, line: 694, column: 9)
!969 = !DILocation(line: 694, column: 9, scope: !934)
!970 = !DILocation(line: 695, column: 16, scope: !968)
!971 = !DILocation(line: 695, column: 9, scope: !968)
!972 = !DILocation(line: 697, column: 15, scope: !934)
!973 = !DILocation(line: 697, column: 13, scope: !934)
!974 = !DILocation(line: 698, column: 10, scope: !975)
!975 = distinct !DILexicalBlock(scope: !934, file: !604, line: 698, column: 9)
!976 = !DILocation(line: 698, column: 9, scope: !934)
!977 = !DILocation(line: 699, column: 9, scope: !975)
!978 = !DILocation(line: 701, column: 34, scope: !934)
!979 = !DILocation(line: 701, column: 44, scope: !934)
!980 = !DILocation(line: 701, column: 49, scope: !934)
!981 = !DILocation(line: 701, column: 60, scope: !934)
!982 = !DILocation(line: 701, column: 11, scope: !934)
!983 = !DILocation(line: 701, column: 9, scope: !934)
!984 = !DILocation(line: 702, column: 9, scope: !985)
!985 = distinct !DILexicalBlock(scope: !934, file: !604, line: 702, column: 9)
!986 = !DILocation(line: 702, column: 9, scope: !934)
!987 = !DILocation(line: 703, column: 16, scope: !985)
!988 = !DILocation(line: 703, column: 9, scope: !985)
!989 = !DILocation(line: 705, column: 11, scope: !934)
!990 = !DILocation(line: 705, column: 9, scope: !934)
!991 = !DILocation(line: 706, column: 9, scope: !992)
!992 = distinct !DILexicalBlock(scope: !934, file: !604, line: 706, column: 9)
!993 = !DILocation(line: 706, column: 9, scope: !934)
!994 = !DILocation(line: 707, column: 16, scope: !992)
!995 = !DILocation(line: 707, column: 9, scope: !992)
!996 = !DILocation(line: 709, column: 9, scope: !997)
!997 = distinct !DILexicalBlock(scope: !934, file: !604, line: 709, column: 9)
!998 = !DILocation(line: 709, column: 12, scope: !997)
!999 = !DILocation(line: 709, column: 21, scope: !997)
!1000 = !DILocation(line: 709, column: 9, scope: !934)
!1001 = !DILocation(line: 710, column: 24, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !997, file: !604, line: 709, column: 27)
!1003 = !DILocation(line: 710, column: 22, scope: !1002)
!1004 = !DILocation(line: 711, column: 14, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1002, file: !604, line: 711, column: 13)
!1006 = !DILocation(line: 711, column: 13, scope: !1002)
!1007 = !DILocation(line: 712, column: 17, scope: !1005)
!1008 = !DILocation(line: 712, column: 13, scope: !1005)
!1009 = !DILocation(line: 713, column: 38, scope: !1002)
!1010 = !DILocation(line: 713, column: 53, scope: !1002)
!1011 = !DILocation(line: 713, column: 58, scope: !1002)
!1012 = !DILocation(line: 713, column: 69, scope: !1002)
!1013 = !DILocation(line: 713, column: 15, scope: !1002)
!1014 = !DILocation(line: 713, column: 13, scope: !1002)
!1015 = !DILocation(line: 714, column: 13, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !1002, file: !604, line: 714, column: 13)
!1017 = !DILocation(line: 714, column: 13, scope: !1002)
!1018 = !DILocation(line: 715, column: 20, scope: !1016)
!1019 = !DILocation(line: 715, column: 13, scope: !1016)
!1020 = !DILocation(line: 716, column: 5, scope: !1002)
!1021 = !DILocation(line: 717, column: 16, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !604, line: 717, column: 9)
!1023 = distinct !DILexicalBlock(scope: !997, file: !604, line: 716, column: 12)
!1024 = !DILocation(line: 717, column: 14, scope: !1022)
!1025 = !DILocation(line: 717, column: 21, scope: !1026)
!1026 = !DILexicalBlockFile(scope: !1027, file: !604, discriminator: 1)
!1027 = distinct !DILexicalBlock(scope: !1022, file: !604, line: 717, column: 9)
!1028 = !DILocation(line: 717, column: 25, scope: !1026)
!1029 = !DILocation(line: 717, column: 28, scope: !1026)
!1030 = !DILocation(line: 717, column: 23, scope: !1026)
!1031 = !DILocation(line: 717, column: 9, scope: !1026)
!1032 = !DILocation(line: 718, column: 42, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1027, file: !604, line: 717, column: 44)
!1034 = !DILocation(line: 718, column: 70, scope: !1033)
!1035 = !DILocation(line: 718, column: 58, scope: !1033)
!1036 = !DILocation(line: 718, column: 63, scope: !1033)
!1037 = !DILocation(line: 718, column: 74, scope: !1033)
!1038 = !DILocation(line: 718, column: 19, scope: !1033)
!1039 = !DILocation(line: 718, column: 17, scope: !1033)
!1040 = !DILocation(line: 719, column: 17, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1033, file: !604, line: 719, column: 17)
!1042 = !DILocation(line: 719, column: 17, scope: !1033)
!1043 = !DILocation(line: 720, column: 24, scope: !1041)
!1044 = !DILocation(line: 720, column: 17, scope: !1041)
!1045 = !DILocation(line: 721, column: 9, scope: !1033)
!1046 = !DILocation(line: 717, column: 40, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !1027, file: !604, discriminator: 2)
!1048 = !DILocation(line: 717, column: 9, scope: !1047)
!1049 = distinct !{!1049, !1050}
!1050 = !DILocation(line: 717, column: 9, scope: !1023)
!1051 = !DILocation(line: 724, column: 34, scope: !934)
!1052 = !DILocation(line: 724, column: 50, scope: !934)
!1053 = !DILocation(line: 724, column: 55, scope: !934)
!1054 = !DILocation(line: 724, column: 67, scope: !934)
!1055 = !DILocation(line: 724, column: 11, scope: !934)
!1056 = !DILocation(line: 724, column: 9, scope: !934)
!1057 = !DILocation(line: 725, column: 9, scope: !1058)
!1058 = distinct !DILexicalBlock(scope: !934, file: !604, line: 725, column: 9)
!1059 = !DILocation(line: 725, column: 9, scope: !934)
!1060 = !DILocation(line: 726, column: 16, scope: !1058)
!1061 = !DILocation(line: 726, column: 9, scope: !1058)
!1062 = !DILocation(line: 728, column: 15, scope: !934)
!1063 = !DILocation(line: 728, column: 13, scope: !934)
!1064 = !DILocation(line: 729, column: 10, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !934, file: !604, line: 729, column: 9)
!1066 = !DILocation(line: 729, column: 9, scope: !934)
!1067 = !DILocation(line: 730, column: 9, scope: !1065)
!1068 = !DILocation(line: 731, column: 38, scope: !934)
!1069 = !DILocation(line: 731, column: 43, scope: !934)
!1070 = !DILocation(line: 731, column: 12, scope: !934)
!1071 = !DILocation(line: 731, column: 5, scope: !934)
!1072 = !DILocation(line: 732, column: 1, scope: !934)
!1073 = distinct !DISubprogram(name: "activate", scope: !604, file: !604, line: 617, type: !409, isLocal: true, isDefinition: true, scopeLine: 618, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !620)
!1074 = !DILocalVariable(name: "ctx", arg: 1, scope: !1073, file: !604, line: 617, type: !173)
!1075 = !DILocation(line: 617, column: 38, scope: !1073)
!1076 = !DILocalVariable(name: "s", scope: !1073, file: !604, line: 619, type: !625)
!1077 = !DILocation(line: 619, column: 23, scope: !1073)
!1078 = !DILocation(line: 619, column: 27, scope: !1073)
!1079 = !DILocation(line: 619, column: 32, scope: !1073)
!1080 = !DILocalVariable(name: "inlink", scope: !1073, file: !604, line: 620, type: !386)
!1081 = !DILocation(line: 620, column: 19, scope: !1073)
!1082 = !DILocation(line: 620, column: 28, scope: !1073)
!1083 = !DILocation(line: 620, column: 33, scope: !1073)
!1084 = !DILocalVariable(name: "outlink", scope: !1073, file: !604, line: 621, type: !386)
!1085 = !DILocation(line: 621, column: 19, scope: !1073)
!1086 = !DILocation(line: 621, column: 29, scope: !1073)
!1087 = !DILocation(line: 621, column: 34, scope: !1073)
!1088 = !DILocalVariable(name: "in", scope: !1073, file: !604, line: 622, type: !285)
!1089 = !DILocation(line: 622, column: 14, scope: !1073)
!1090 = !DILocalVariable(name: "i", scope: !1073, file: !604, line: 623, type: !200)
!1091 = !DILocation(line: 623, column: 9, scope: !1073)
!1092 = !DILocalVariable(name: "ret", scope: !1073, file: !604, line: 623, type: !200)
!1093 = !DILocation(line: 623, column: 12, scope: !1073)
!1094 = !DILocation(line: 625, column: 5, scope: !1073)
!1095 = distinct !{!1095, !1094}
!1096 = !DILocalVariable(name: "ret", scope: !1097, file: !604, line: 625, type: !200)
!1097 = distinct !DILexicalBlock(scope: !1073, file: !604, line: 625, column: 8)
!1098 = !DILocation(line: 625, column: 14, scope: !1097)
!1099 = !DILocation(line: 625, column: 42, scope: !1100)
!1100 = !DILexicalBlockFile(scope: !1097, file: !604, discriminator: 1)
!1101 = !DILocation(line: 625, column: 47, scope: !1100)
!1102 = !DILocation(line: 625, column: 20, scope: !1100)
!1103 = !DILocation(line: 625, column: 14, scope: !1100)
!1104 = !DILocation(line: 625, column: 64, scope: !1100)
!1105 = !DILocalVariable(name: "i", scope: !1106, file: !604, line: 625, type: !442)
!1106 = distinct !DILexicalBlock(scope: !1107, file: !604, line: 625, column: 69)
!1107 = distinct !DILexicalBlock(scope: !1097, file: !604, line: 625, column: 64)
!1108 = !DILocation(line: 625, column: 80, scope: !1106)
!1109 = !DILocation(line: 625, column: 90, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !1111, file: !604, discriminator: 2)
!1111 = distinct !DILexicalBlock(scope: !1106, file: !604, line: 625, column: 83)
!1112 = !DILocation(line: 625, column: 88, scope: !1110)
!1113 = !DILocation(line: 625, column: 95, scope: !1114)
!1114 = !DILexicalBlockFile(scope: !1115, file: !604, discriminator: 3)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !604, line: 625, column: 83)
!1116 = !DILocation(line: 625, column: 99, scope: !1114)
!1117 = !DILocation(line: 625, column: 104, scope: !1114)
!1118 = !DILocation(line: 625, column: 97, scope: !1114)
!1119 = !DILocation(line: 625, column: 83, scope: !1114)
!1120 = !DILocation(line: 625, column: 153, scope: !1121)
!1121 = !DILexicalBlockFile(scope: !1115, file: !604, discriminator: 4)
!1122 = !DILocation(line: 625, column: 141, scope: !1121)
!1123 = !DILocation(line: 625, column: 146, scope: !1121)
!1124 = !DILocation(line: 625, column: 157, scope: !1121)
!1125 = !DILocation(line: 625, column: 120, scope: !1121)
!1126 = !DILocation(line: 625, column: 116, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1115, file: !604, discriminator: 5)
!1128 = !DILocation(line: 625, column: 83, scope: !1127)
!1129 = distinct !{!1129, !1130}
!1130 = !DILocation(line: 625, column: 83, scope: !1106)
!1131 = !DILocation(line: 625, column: 163, scope: !1132)
!1132 = !DILexicalBlockFile(scope: !1106, file: !604, discriminator: 6)
!1133 = !DILocation(line: 625, column: 175, scope: !1134)
!1134 = !DILexicalBlockFile(scope: !1097, file: !604, discriminator: 7)
!1135 = !DILocation(line: 626, column: 10, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1073, file: !604, line: 626, column: 9)
!1137 = !DILocation(line: 626, column: 13, scope: !1136)
!1138 = !DILocation(line: 626, column: 9, scope: !1073)
!1139 = !DILocation(line: 627, column: 16, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1141, file: !604, line: 627, column: 9)
!1141 = distinct !DILexicalBlock(scope: !1136, file: !604, line: 626, column: 24)
!1142 = !DILocation(line: 627, column: 14, scope: !1140)
!1143 = !DILocation(line: 627, column: 21, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !1145, file: !604, discriminator: 1)
!1145 = distinct !DILexicalBlock(scope: !1140, file: !604, line: 627, column: 9)
!1146 = !DILocation(line: 627, column: 25, scope: !1144)
!1147 = !DILocation(line: 627, column: 28, scope: !1144)
!1148 = !DILocation(line: 627, column: 23, scope: !1144)
!1149 = !DILocation(line: 627, column: 9, scope: !1144)
!1150 = !DILocation(line: 628, column: 23, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1152, file: !604, line: 628, column: 17)
!1152 = distinct !DILexicalBlock(scope: !1145, file: !604, line: 627, column: 44)
!1153 = !DILocation(line: 628, column: 17, scope: !1151)
!1154 = !DILocation(line: 628, column: 20, scope: !1151)
!1155 = !DILocation(line: 628, column: 26, scope: !1151)
!1156 = !DILocation(line: 628, column: 17, scope: !1152)
!1157 = !DILocation(line: 629, column: 17, scope: !1151)
!1158 = !DILocation(line: 631, column: 45, scope: !1159)
!1159 = distinct !DILexicalBlock(scope: !1152, file: !604, line: 631, column: 17)
!1160 = !DILocation(line: 631, column: 33, scope: !1159)
!1161 = !DILocation(line: 631, column: 38, scope: !1159)
!1162 = !DILocation(line: 631, column: 49, scope: !1159)
!1163 = !DILocation(line: 631, column: 24, scope: !1159)
!1164 = !DILocation(line: 631, column: 22, scope: !1159)
!1165 = !DILocation(line: 631, column: 53, scope: !1159)
!1166 = !DILocation(line: 631, column: 17, scope: !1152)
!1167 = !DILocation(line: 632, column: 24, scope: !1159)
!1168 = !DILocation(line: 632, column: 17, scope: !1159)
!1169 = !DILocation(line: 634, column: 24, scope: !1170)
!1170 = distinct !DILexicalBlock(scope: !1152, file: !604, line: 634, column: 17)
!1171 = !DILocation(line: 634, column: 18, scope: !1170)
!1172 = !DILocation(line: 634, column: 21, scope: !1170)
!1173 = !DILocation(line: 634, column: 27, scope: !1170)
!1174 = !DILocation(line: 634, column: 17, scope: !1152)
!1175 = !DILocation(line: 635, column: 55, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1177, file: !604, line: 635, column: 21)
!1177 = distinct !DILexicalBlock(scope: !1170, file: !604, line: 634, column: 32)
!1178 = !DILocation(line: 635, column: 43, scope: !1176)
!1179 = !DILocation(line: 635, column: 48, scope: !1176)
!1180 = !DILocation(line: 635, column: 21, scope: !1176)
!1181 = !DILocation(line: 635, column: 59, scope: !1176)
!1182 = !DILocation(line: 635, column: 21, scope: !1177)
!1183 = !DILocation(line: 636, column: 27, scope: !1176)
!1184 = !DILocation(line: 636, column: 21, scope: !1176)
!1185 = !DILocation(line: 636, column: 24, scope: !1176)
!1186 = !DILocation(line: 636, column: 30, scope: !1176)
!1187 = !DILocation(line: 636, column: 34, scope: !1176)
!1188 = !DILocation(line: 637, column: 13, scope: !1177)
!1189 = !DILocation(line: 638, column: 9, scope: !1152)
!1190 = !DILocation(line: 627, column: 40, scope: !1191)
!1191 = !DILexicalBlockFile(scope: !1145, file: !604, discriminator: 2)
!1192 = !DILocation(line: 627, column: 9, scope: !1191)
!1193 = distinct !{!1193, !1194}
!1194 = !DILocation(line: 627, column: 9, scope: !1141)
!1195 = !DILocation(line: 640, column: 16, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1141, file: !604, line: 640, column: 9)
!1197 = !DILocation(line: 640, column: 14, scope: !1196)
!1198 = !DILocation(line: 640, column: 21, scope: !1199)
!1199 = !DILexicalBlockFile(scope: !1200, file: !604, discriminator: 1)
!1200 = distinct !DILexicalBlock(scope: !1196, file: !604, line: 640, column: 9)
!1201 = !DILocation(line: 640, column: 25, scope: !1199)
!1202 = !DILocation(line: 640, column: 28, scope: !1199)
!1203 = !DILocation(line: 640, column: 23, scope: !1199)
!1204 = !DILocation(line: 640, column: 9, scope: !1199)
!1205 = !DILocation(line: 641, column: 24, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1207, file: !604, line: 641, column: 17)
!1207 = distinct !DILexicalBlock(scope: !1200, file: !604, line: 640, column: 44)
!1208 = !DILocation(line: 641, column: 18, scope: !1206)
!1209 = !DILocation(line: 641, column: 21, scope: !1206)
!1210 = !DILocation(line: 641, column: 27, scope: !1206)
!1211 = !DILocation(line: 641, column: 17, scope: !1207)
!1212 = !DILocation(line: 642, column: 17, scope: !1206)
!1213 = !DILocation(line: 643, column: 9, scope: !1207)
!1214 = !DILocation(line: 640, column: 40, scope: !1215)
!1215 = !DILexicalBlockFile(scope: !1200, file: !604, discriminator: 2)
!1216 = !DILocation(line: 640, column: 9, scope: !1215)
!1217 = distinct !{!1217, !1218}
!1218 = !DILocation(line: 640, column: 9, scope: !1141)
!1219 = !DILocation(line: 645, column: 13, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1141, file: !604, line: 645, column: 13)
!1221 = !DILocation(line: 645, column: 18, scope: !1220)
!1222 = !DILocation(line: 645, column: 21, scope: !1220)
!1223 = !DILocation(line: 645, column: 15, scope: !1220)
!1224 = !DILocation(line: 645, column: 13, scope: !1141)
!1225 = !DILocation(line: 646, column: 41, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !604, line: 646, column: 17)
!1227 = distinct !DILexicalBlock(scope: !1220, file: !604, line: 645, column: 32)
!1228 = !DILocation(line: 646, column: 46, scope: !1226)
!1229 = !DILocation(line: 646, column: 17, scope: !1226)
!1230 = !DILocation(line: 646, column: 17, scope: !1227)
!1231 = !DILocation(line: 647, column: 24, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !604, line: 647, column: 17)
!1233 = distinct !DILexicalBlock(scope: !1226, file: !604, line: 646, column: 59)
!1234 = !DILocation(line: 647, column: 22, scope: !1232)
!1235 = !DILocation(line: 647, column: 29, scope: !1236)
!1236 = !DILexicalBlockFile(scope: !1237, file: !604, discriminator: 1)
!1237 = distinct !DILexicalBlock(scope: !1232, file: !604, line: 647, column: 17)
!1238 = !DILocation(line: 647, column: 33, scope: !1236)
!1239 = !DILocation(line: 647, column: 36, scope: !1236)
!1240 = !DILocation(line: 647, column: 31, scope: !1236)
!1241 = !DILocation(line: 647, column: 17, scope: !1236)
!1242 = !DILocation(line: 648, column: 32, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1244, file: !604, line: 648, column: 25)
!1244 = distinct !DILexicalBlock(scope: !1237, file: !604, line: 647, column: 52)
