; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpegvideo.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpegvideo.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"


!938 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !941, line: 195, baseType: !942)
!941 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!942 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !933, line: 49, baseType: !945)
!945 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!946 = !{!947}
!947 = distinct !DIGlobalVariable(name: "h263_chroma_roundtab", scope: !948, file: !949, line: 104, type: !953, isLocal: true, isDefinition: true, variable: [16 x i8]* @ff_h263_round_chroma.h263_chroma_roundtab)
!948 = distinct !DISubprogram(name: "ff_h263_round_chroma", scope: !949, file: !949, line: 101, type: !950, isLocal: true, isDefinition: true, scopeLine: 102, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !952)
!949 = !DIFile(filename: "libavcodec/motion_est.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!950 = !DISubroutineType(types: !951)
!951 = !{!938, !938}
!952 = !{}
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, align: 8, elements: !957)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !933, line: 48, baseType: !956)
!956 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!957 = !{!958}
!958 = !DISubrange(count: 16)
!959 = !{i32 2, !"Dwarf Version", i32 4}
!960 = !{i32 2, !"Debug Info Version", i32 3}
!961 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!962 = distinct !DISubprogram(name: "ff_mpv_idct_init", scope: !963, file: !963, line: 330, type: !964, isLocal: false, isDefinition: true, scopeLine: 331, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !952)
!963 = !DIFile(filename: "libavcodec/mpegvideo.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!964 = !DISubroutineType(types: !965)
!965 = !{null, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !968, line: 582, baseType: !969)
!968 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !968, line: 81, size: 86208, align: 64, elements: !970)
!970 = !{!971, !1053, !1054, !1055, !1056, !1060, !1061, !1072, !1073, !1074, !1075, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1778, !1779, !1832, !1834, !1835, !1836, !1837, !1838, !1849, !1850, !1851, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1867, !1868, !1870, !1871, !1872, !1873, !1874, !1875, !1878, !1880, !1881, !1882, !1883, !1884, !1885, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1912, !1913, !1914, !1915, !1931, !1938, !1950, !1966, !1988, !2028, !2041, !2068, !2083, !2097, !2110, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2131, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2144, !2146, !2147, !2148, !2149, !2150, !2151, !2154, !2156, !2158, !2159, !2162, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2228, !2229, !2231, !2232, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2254, !2255, !2256, !2259, !2260, !2261, !2262, !2264, !2266, !2267, !2268, !2269, !2270, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2352, !2353, !2354, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2461, !2462, !2463, !2464, !2465, !2466, !2467, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2524, !2525, !2526, !2527, !2531, !2532, !2536, !2540, !2544, !2545, !2549, !2553, !2554, !2555, !2556, !2557, !2558, !2559, !2560, !2564, !2565, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2583, !2584, !2585, !2635, !2636, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !969, file: !968, line: 82, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !975)
!975 = !{!976, !979, !983, !1012, !1013, !1014, !1015, !1019, !1025, !1027, !1031}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !974, file: !26, line: 72, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !974, file: !26, line: 78, baseType: !980, size: 64, align: 64, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DISubroutineType(types: !982)
!982 = !{!977, !935}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !974, file: !26, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !1008, !1009, !1010, !1011}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !4, line: 247, baseType: !977, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !986, file: !4, line: 253, baseType: !977, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !986, file: !4, line: 259, baseType: !938, size: 32, align: 32, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !986, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !986, file: !4, line: 271, baseType: !993, size: 64, align: 64, offset: 192)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !4, line: 265, size: 64, align: 64, elements: !994)
!994 = !{!995, !998, !1000, !1001}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !993, file: !4, line: 266, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !941, line: 197, baseType: !997)
!997 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !993, file: !4, line: 267, baseType: !999, size: 64, align: 64)
!999 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !993, file: !4, line: 268, baseType: !977, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !993, file: !4, line: 270, baseType: !1002, size: 64, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1003, line: 61, baseType: !1004)
!1003 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1003, line: 58, size: 64, align: 32, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1004, file: !1003, line: 59, baseType: !938, size: 32, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1004, file: !1003, line: 60, baseType: !938, size: 32, align: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !986, file: !4, line: 272, baseType: !999, size: 64, align: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !986, file: !4, line: 273, baseType: !999, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !4, line: 275, baseType: !938, size: 32, align: 32, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !986, file: !4, line: 300, baseType: !977, size: 64, align: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !974, file: !26, line: 93, baseType: !938, size: 32, align: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !974, file: !26, line: 99, baseType: !938, size: 32, align: 32, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !974, file: !26, line: 108, baseType: !938, size: 32, align: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !974, file: !26, line: 113, baseType: !1016, size: 64, align: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!935, !935, !935}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !974, file: !26, line: 123, baseType: !1020, size: 64, align: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!1023, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !974, file: !26, line: 130, baseType: !1026, size: 32, align: 32, offset: 448)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !974, file: !26, line: 136, baseType: !1028, size: 64, align: 64, offset: 512)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!1026, !935}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !974, file: !26, line: 142, baseType: !1032, size: 64, align: 64, offset: 576)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!938, !1035, !935, !977, !938}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1038)
!1038 = !{!1039, !1051, !1052}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1037, file: !4, line: 360, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049, !1050}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1043, file: !4, line: 307, baseType: !977, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1043, file: !4, line: 313, baseType: !999, size: 64, align: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1043, file: !4, line: 313, baseType: !999, size: 64, align: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1043, file: !4, line: 318, baseType: !999, size: 64, align: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1043, file: !4, line: 318, baseType: !999, size: 64, align: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1043, file: !4, line: 323, baseType: !938, size: 32, align: 32, offset: 320)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1037, file: !4, line: 364, baseType: !938, size: 32, align: 32, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1037, file: !4, line: 368, baseType: !938, size: 32, align: 32, offset: 96)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !969, file: !968, line: 84, baseType: !938, size: 32, align: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !969, file: !968, line: 84, baseType: !938, size: 32, align: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !969, file: !968, line: 85, baseType: !938, size: 32, align: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !969, file: !968, line: 86, baseType: !1057, size: 384, align: 32, offset: 160)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 384, align: 32, elements: !1058)
!1058 = !{!1059}
!1059 = !DISubrange(count: 12)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !969, file: !968, line: 87, baseType: !938, size: 32, align: 32, offset: 544)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !969, file: !968, line: 90, baseType: !1062, size: 1088, align: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1064)
!1064 = !{!1065, !1067, !1071}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1063, file: !917, line: 32, baseType: !1066, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1063, file: !917, line: 33, baseType: !1068, size: 512, align: 8, offset: 64)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 512, align: 8, elements: !1069)
!1069 = !{!1070}
!1070 = !DISubrange(count: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1063, file: !917, line: 34, baseType: !1068, size: 512, align: 8, offset: 576)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !969, file: !968, line: 91, baseType: !1062, size: 1088, align: 64, offset: 1664)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !969, file: !968, line: 92, baseType: !1062, size: 1088, align: 64, offset: 2752)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !969, file: !968, line: 93, baseType: !1062, size: 1088, align: 64, offset: 3840)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !969, file: !968, line: 98, baseType: !1076, size: 64, align: 64, offset: 4928)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1078)
!1078 = !{!1079, !1082, !1083, !1084, !1346, !1347, !1348, !1349, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1501, !1505, !1506, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1683, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1077, file: !57, line: 1561, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1077, file: !57, line: 1562, baseType: !938, size: 32, align: 32, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1077, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1077, file: !57, line: 1565, baseType: !1085, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1097, !1100, !1103, !1106, !1111, !1112, !1113, !1121, !1122, !1123, !1125, !1131, !1137, !1146, !1150, !1151, !1196, !1317, !1321, !1322, !1326, !1330, !1335, !1339, !1340, !1341}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !57, line: 3475, baseType: !977, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1087, file: !57, line: 3480, baseType: !977, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1087, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1087, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1087, file: !57, line: 3487, baseType: !938, size: 32, align: 32, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1087, file: !57, line: 3488, baseType: !1095, size: 64, align: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1087, file: !57, line: 3489, baseType: !1098, size: 64, align: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1087, file: !57, line: 3490, baseType: !1101, size: 64, align: 64, offset: 384)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1087, file: !57, line: 3491, baseType: !1104, size: 64, align: 64, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1087, file: !57, line: 3492, baseType: !1107, size: 64, align: 64, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !933, line: 55, baseType: !1110)
!1110 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1087, file: !57, line: 3493, baseType: !955, size: 8, align: 8, offset: 576)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1087, file: !57, line: 3494, baseType: !1080, size: 64, align: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1087, file: !57, line: 3495, baseType: !1114, size: 64, align: 64, offset: 704)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1117, file: !57, line: 3402, baseType: !938, size: 32, align: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1117, file: !57, line: 3403, baseType: !977, size: 64, align: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1087, file: !57, line: 3507, baseType: !977, size: 64, align: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1087, file: !57, line: 3516, baseType: !938, size: 32, align: 32, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1087, file: !57, line: 3517, baseType: !1124, size: 64, align: 64, offset: 896)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1087, file: !57, line: 3527, baseType: !1126, size: 64, align: 64, offset: 960)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!938, !1129}
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1077)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1087, file: !57, line: 3535, baseType: !1132, size: 64, align: 64, offset: 1024)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DISubroutineType(types: !1134)
!1134 = !{!938, !1129, !1135}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1087, file: !57, line: 3541, baseType: !1138, size: 64, align: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1142, line: 223, size: 128, align: 64, elements: !1143)
!1142 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1143 = !{!1144, !1145}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1141, file: !1142, line: 224, baseType: !1066, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1141, file: !1142, line: 225, baseType: !1066, size: 64, align: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1087, file: !57, line: 3549, baseType: !1147, size: 64, align: 64, offset: 1152)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !1124}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1087, file: !57, line: 3551, baseType: !1126, size: 64, align: 64, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1087, file: !57, line: 3552, baseType: !1152, size: 64, align: 64, offset: 1280)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64, align: 64)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!938, !1129, !1155, !938, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1164, !1195}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1158, file: !57, line: 3921, baseType: !944, size: 16, align: 16)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1158, file: !57, line: 3922, baseType: !932, size: 32, align: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1158, file: !57, line: 3923, baseType: !932, size: 32, align: 32, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1158, file: !57, line: 3924, baseType: !934, size: 32, align: 32, offset: 96)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1158, file: !57, line: 3925, baseType: !1165, size: 64, align: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174, !1175, !1185, !1189, !1191, !1192, !1193, !1194}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1168, file: !57, line: 3886, baseType: !938, size: 32, align: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1168, file: !57, line: 3887, baseType: !938, size: 32, align: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1168, file: !57, line: 3888, baseType: !938, size: 32, align: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1168, file: !57, line: 3889, baseType: !938, size: 32, align: 32, offset: 96)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1168, file: !57, line: 3890, baseType: !938, size: 32, align: 32, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1168, file: !57, line: 3897, baseType: !1176, size: 768, align: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1178)
!1178 = !{!1179, !1183}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1177, file: !57, line: 3855, baseType: !1180, size: 512, align: 64)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 512, align: 64, elements: !1181)
!1181 = !{!1182}
!1182 = !DISubrange(count: 8)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1177, file: !57, line: 3857, baseType: !1184, size: 256, align: 32, offset: 512)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 256, align: 32, elements: !1181)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1168, file: !57, line: 3903, baseType: !1186, size: 256, align: 64, offset: 960)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1155, size: 256, align: 64, elements: !1187)
!1187 = !{!1188}
!1188 = !DISubrange(count: 4)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1168, file: !57, line: 3904, baseType: !1190, size: 128, align: 32, offset: 1216)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 128, align: 32, elements: !1187)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1168, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1168, file: !57, line: 3908, baseType: !936, size: 64, align: 64, offset: 1408)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1168, file: !57, line: 3915, baseType: !936, size: 64, align: 64, offset: 1472)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1168, file: !57, line: 3917, baseType: !938, size: 32, align: 32, offset: 1536)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1158, file: !57, line: 3926, baseType: !996, size: 64, align: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1087, file: !57, line: 3564, baseType: !1197, size: 64, align: 64, offset: 1344)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64, align: 64)
!1198 = !DISubroutineType(types: !1199)
!1199 = !{!938, !1129, !1200, !1234, !1316}
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1203)
!1203 = !{!1204, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1230, !1231, !1232, !1233}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1202, file: !57, line: 1451, baseType: !1205, size: 64, align: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1207, line: 94, baseType: !1208)
!1207 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1207, line: 81, size: 192, align: 64, elements: !1209)
!1209 = !{!1210, !1214, !1215}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1208, file: !1207, line: 82, baseType: !1211, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1207, line: 73, baseType: !1213)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1207, line: 73, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !1207, line: 89, baseType: !1155, size: 64, align: 64, offset: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !1207, line: 93, baseType: !938, size: 32, align: 32, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1202, file: !57, line: 1461, baseType: !996, size: 64, align: 64, offset: 64)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1202, file: !57, line: 1467, baseType: !996, size: 64, align: 64, offset: 128)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !57, line: 1468, baseType: !1155, size: 64, align: 64, offset: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !57, line: 1469, baseType: !938, size: 32, align: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1202, file: !57, line: 1470, baseType: !938, size: 32, align: 32, offset: 288)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1202, file: !57, line: 1474, baseType: !938, size: 32, align: 32, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1202, file: !57, line: 1479, baseType: !1223, size: 64, align: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !57, line: 1412, baseType: !1155, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !57, line: 1413, baseType: !938, size: 32, align: 32, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1225, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1202, file: !57, line: 1480, baseType: !938, size: 32, align: 32, offset: 448)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1202, file: !57, line: 1486, baseType: !996, size: 64, align: 64, offset: 512)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1202, file: !57, line: 1488, baseType: !996, size: 64, align: 64, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1202, file: !57, line: 1497, baseType: !996, size: 64, align: 64, offset: 640)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1268, !1270, !1271, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1304, !1305, !1306, !1307, !1308, !1309, !1312, !1313, !1314, !1315}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1237, file: !780, line: 282, baseType: !1180, size: 512, align: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1237, file: !780, line: 299, baseType: !1184, size: 256, align: 32, offset: 512)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1237, file: !780, line: 315, baseType: !1242, size: 64, align: 64, offset: 768)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64, align: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1237, file: !780, line: 326, baseType: !938, size: 32, align: 32, offset: 832)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1237, file: !780, line: 326, baseType: !938, size: 32, align: 32, offset: 864)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1237, file: !780, line: 334, baseType: !938, size: 32, align: 32, offset: 896)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1237, file: !780, line: 341, baseType: !938, size: 32, align: 32, offset: 928)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1237, file: !780, line: 346, baseType: !938, size: 32, align: 32, offset: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1237, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1237, file: !780, line: 356, baseType: !1002, size: 64, align: 32, offset: 1024)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1237, file: !780, line: 361, baseType: !996, size: 64, align: 64, offset: 1088)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1237, file: !780, line: 369, baseType: !996, size: 64, align: 64, offset: 1152)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1237, file: !780, line: 377, baseType: !996, size: 64, align: 64, offset: 1216)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1237, file: !780, line: 382, baseType: !938, size: 32, align: 32, offset: 1280)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1237, file: !780, line: 386, baseType: !938, size: 32, align: 32, offset: 1312)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1237, file: !780, line: 391, baseType: !938, size: 32, align: 32, offset: 1344)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1237, file: !780, line: 396, baseType: !935, size: 64, align: 64, offset: 1408)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1237, file: !780, line: 403, baseType: !1258, size: 512, align: 64, offset: 1472)
!1258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 512, align: 64, elements: !1181)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1237, file: !780, line: 410, baseType: !938, size: 32, align: 32, offset: 1984)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1237, file: !780, line: 415, baseType: !938, size: 32, align: 32, offset: 2016)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1237, file: !780, line: 420, baseType: !938, size: 32, align: 32, offset: 2048)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1237, file: !780, line: 425, baseType: !938, size: 32, align: 32, offset: 2080)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1237, file: !780, line: 435, baseType: !996, size: 64, align: 64, offset: 2112)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1237, file: !780, line: 440, baseType: !938, size: 32, align: 32, offset: 2176)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1237, file: !780, line: 445, baseType: !1109, size: 64, align: 64, offset: 2240)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1237, file: !780, line: 459, baseType: !1267, size: 512, align: 64, offset: 2304)
!1267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1205, size: 512, align: 64, elements: !1181)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1237, file: !780, line: 473, baseType: !1269, size: 64, align: 64, offset: 2816)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1237, file: !780, line: 477, baseType: !938, size: 32, align: 32, offset: 2880)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1237, file: !780, line: 479, baseType: !1272, size: 64, align: 64, offset: 2944)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1276)
!1276 = !{!1277, !1278, !1279, !1280, !1285}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1275, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1275, file: !780, line: 203, baseType: !1155, size: 64, align: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1275, file: !780, line: 204, baseType: !938, size: 32, align: 32, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1275, file: !780, line: 205, baseType: !1281, size: 64, align: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1283, line: 86, baseType: !1284)
!1283 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1283, line: 86, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1275, file: !780, line: 206, baseType: !1205, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1237, file: !780, line: 480, baseType: !938, size: 32, align: 32, offset: 3008)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1237, file: !780, line: 505, baseType: !938, size: 32, align: 32, offset: 3040)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1237, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1237, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1237, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1237, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1237, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1237, file: !780, line: 532, baseType: !996, size: 64, align: 64, offset: 3264)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1237, file: !780, line: 539, baseType: !996, size: 64, align: 64, offset: 3328)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1237, file: !780, line: 547, baseType: !996, size: 64, align: 64, offset: 3392)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1237, file: !780, line: 554, baseType: !1281, size: 64, align: 64, offset: 3456)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1237, file: !780, line: 563, baseType: !938, size: 32, align: 32, offset: 3520)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1237, file: !780, line: 572, baseType: !938, size: 32, align: 32, offset: 3552)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1237, file: !780, line: 581, baseType: !938, size: 32, align: 32, offset: 3584)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1237, file: !780, line: 588, baseType: !1301, size: 64, align: 64, offset: 3648)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !941, line: 194, baseType: !1303)
!1303 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1237, file: !780, line: 593, baseType: !938, size: 32, align: 32, offset: 3712)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1237, file: !780, line: 596, baseType: !938, size: 32, align: 32, offset: 3744)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1237, file: !780, line: 599, baseType: !1205, size: 64, align: 64, offset: 3776)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1237, file: !780, line: 605, baseType: !1205, size: 64, align: 64, offset: 3840)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1237, file: !780, line: 616, baseType: !1205, size: 64, align: 64, offset: 3904)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1237, file: !780, line: 626, baseType: !1310, size: 64, align: 64, offset: 3968)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1311, line: 216, baseType: !1110)
!1311 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1237, file: !780, line: 627, baseType: !1310, size: 64, align: 64, offset: 4032)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1237, file: !780, line: 628, baseType: !1310, size: 64, align: 64, offset: 4096)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1237, file: !780, line: 629, baseType: !1310, size: 64, align: 64, offset: 4160)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1237, file: !780, line: 645, baseType: !1205, size: 64, align: 64, offset: 4224)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1087, file: !57, line: 3566, baseType: !1318, size: 64, align: 64, offset: 1408)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!938, !1129, !935, !1316, !1200}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1087, file: !57, line: 3567, baseType: !1126, size: 64, align: 64, offset: 1472)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1087, file: !57, line: 3576, baseType: !1323, size: 64, align: 64, offset: 1536)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{!938, !1129, !1234}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1087, file: !57, line: 3577, baseType: !1327, size: 64, align: 64, offset: 1600)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!938, !1129, !1200}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1087, file: !57, line: 3584, baseType: !1331, size: 64, align: 64, offset: 1664)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64, align: 64)
!1332 = !DISubroutineType(types: !1333)
!1333 = !{!938, !1129, !1334}
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1087, file: !57, line: 3589, baseType: !1336, size: 64, align: 64, offset: 1728)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{null, !1129}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1087, file: !57, line: 3594, baseType: !938, size: 32, align: 32, offset: 1792)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1087, file: !57, line: 3600, baseType: !977, size: 64, align: 64, offset: 1856)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1087, file: !57, line: 3609, baseType: !1342, size: 64, align: 64, offset: 1920)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1345)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1077, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1077, file: !57, line: 1581, baseType: !934, size: 32, align: 32, offset: 224)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1077, file: !57, line: 1583, baseType: !935, size: 64, align: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1077, file: !57, line: 1591, baseType: !1350, size: 64, align: 64, offset: 320)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1142, line: 129, size: 1664, align: 64, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357, !1375, !1376, !1382, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1351, file: !1142, line: 136, baseType: !938, size: 32, align: 32)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1351, file: !1142, line: 151, baseType: !938, size: 32, align: 32, offset: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1351, file: !1142, line: 157, baseType: !938, size: 32, align: 32, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1351, file: !1142, line: 159, baseType: !1334, size: 64, align: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1351, file: !1142, line: 161, baseType: !1358, size: 64, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1142, line: 117, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1142, line: 100, size: 832, align: 64, elements: !1361)
!1361 = !{!1362, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1360, file: !1142, line: 105, baseType: !1363, size: 256, align: 64)
!1363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1364, size: 256, align: 64, elements: !1187)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1207, line: 238, baseType: !1366)
!1366 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1207, line: 238, flags: DIFlagFwdDecl)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1360, file: !1142, line: 110, baseType: !938, size: 32, align: 32, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1360, file: !1142, line: 111, baseType: !938, size: 32, align: 32, offset: 288)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1360, file: !1142, line: 111, baseType: !938, size: 32, align: 32, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1360, file: !1142, line: 112, baseType: !1184, size: 256, align: 32, offset: 352)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1360, file: !1142, line: 113, baseType: !1190, size: 128, align: 32, offset: 608)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1360, file: !1142, line: 114, baseType: !938, size: 32, align: 32, offset: 736)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1360, file: !1142, line: 115, baseType: !938, size: 32, align: 32, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1360, file: !1142, line: 116, baseType: !938, size: 32, align: 32, offset: 800)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1351, file: !1142, line: 163, baseType: !935, size: 64, align: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1351, file: !1142, line: 165, baseType: !1377, size: 128, align: 64, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1142, line: 122, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1142, line: 119, size: 128, align: 64, elements: !1379)
!1379 = !{!1380, !1381}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1378, file: !1142, line: 120, baseType: !1200, size: 64, align: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1378, file: !1142, line: 121, baseType: !1334, size: 64, align: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1351, file: !1142, line: 166, baseType: !1383, size: 128, align: 64, offset: 448)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1142, line: 127, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1142, line: 124, size: 128, align: 64, elements: !1385)
!1385 = !{!1386, !1459}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1384, file: !1142, line: 125, baseType: !1387, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64, align: 64)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1391)
!1391 = !{!1392, !1393, !1417, !1421, !1422, !1456, !1457, !1458}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1390, file: !57, line: 5751, baseType: !1080, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1390, file: !57, line: 5756, baseType: !1394, size: 64, align: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1397)
!1397 = !{!1398, !1399, !1402, !1403, !1404, !1408, !1412, !1416}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1396, file: !57, line: 5797, baseType: !977, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1396, file: !57, line: 5804, baseType: !1400, size: 64, align: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1396, file: !57, line: 5815, baseType: !1080, size: 64, align: 64, offset: 128)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1396, file: !57, line: 5825, baseType: !938, size: 32, align: 32, offset: 192)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1396, file: !57, line: 5826, baseType: !1405, size: 64, align: 64, offset: 256)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64, align: 64)
!1406 = !DISubroutineType(types: !1407)
!1407 = !{!938, !1388}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1396, file: !57, line: 5827, baseType: !1409, size: 64, align: 64, offset: 320)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!938, !1388, !1200}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1396, file: !57, line: 5828, baseType: !1413, size: 64, align: 64, offset: 384)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{null, !1388}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1396, file: !57, line: 5829, baseType: !1413, size: 64, align: 64, offset: 448)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1390, file: !57, line: 5762, baseType: !1418, size: 64, align: 64, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1420)
!1420 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1390, file: !57, line: 5768, baseType: !935, size: 64, align: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1390, file: !57, line: 5775, baseType: !1423, size: 64, align: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1425)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1425, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1425, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1425, file: !57, line: 3948, baseType: !932, size: 32, align: 32, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1425, file: !57, line: 3958, baseType: !1155, size: 64, align: 64, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1425, file: !57, line: 3962, baseType: !938, size: 32, align: 32, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1425, file: !57, line: 3968, baseType: !938, size: 32, align: 32, offset: 224)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1425, file: !57, line: 3973, baseType: !996, size: 64, align: 64, offset: 256)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1425, file: !57, line: 3986, baseType: !938, size: 32, align: 32, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1425, file: !57, line: 3999, baseType: !938, size: 32, align: 32, offset: 352)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1425, file: !57, line: 4004, baseType: !938, size: 32, align: 32, offset: 384)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1425, file: !57, line: 4005, baseType: !938, size: 32, align: 32, offset: 416)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1425, file: !57, line: 4010, baseType: !938, size: 32, align: 32, offset: 448)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1425, file: !57, line: 4011, baseType: !938, size: 32, align: 32, offset: 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1425, file: !57, line: 4020, baseType: !1002, size: 64, align: 32, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1425, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1425, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1425, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1425, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1425, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1425, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1425, file: !57, line: 4039, baseType: !938, size: 32, align: 32, offset: 768)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1425, file: !57, line: 4046, baseType: !1109, size: 64, align: 64, offset: 832)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1425, file: !57, line: 4050, baseType: !938, size: 32, align: 32, offset: 896)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1425, file: !57, line: 4054, baseType: !938, size: 32, align: 32, offset: 928)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1425, file: !57, line: 4061, baseType: !938, size: 32, align: 32, offset: 960)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1425, file: !57, line: 4065, baseType: !938, size: 32, align: 32, offset: 992)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1425, file: !57, line: 4073, baseType: !938, size: 32, align: 32, offset: 1024)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1425, file: !57, line: 4080, baseType: !938, size: 32, align: 32, offset: 1056)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1425, file: !57, line: 4084, baseType: !938, size: 32, align: 32, offset: 1088)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1390, file: !57, line: 5781, baseType: !1423, size: 64, align: 64, offset: 320)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1390, file: !57, line: 5787, baseType: !1002, size: 64, align: 32, offset: 384)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1390, file: !57, line: 5793, baseType: !1002, size: 64, align: 32, offset: 448)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1384, file: !1142, line: 126, baseType: !938, size: 32, align: 32, offset: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1351, file: !1142, line: 172, baseType: !1200, size: 64, align: 64, offset: 576)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1351, file: !1142, line: 177, baseType: !1155, size: 64, align: 64, offset: 640)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1351, file: !1142, line: 178, baseType: !934, size: 32, align: 32, offset: 704)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1351, file: !1142, line: 180, baseType: !935, size: 64, align: 64, offset: 768)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1351, file: !1142, line: 185, baseType: !938, size: 32, align: 32, offset: 832)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1351, file: !1142, line: 190, baseType: !935, size: 64, align: 64, offset: 896)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1351, file: !1142, line: 195, baseType: !938, size: 32, align: 32, offset: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1351, file: !1142, line: 200, baseType: !1200, size: 64, align: 64, offset: 1024)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1351, file: !1142, line: 201, baseType: !938, size: 32, align: 32, offset: 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1351, file: !1142, line: 202, baseType: !1334, size: 64, align: 64, offset: 1152)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1351, file: !1142, line: 203, baseType: !938, size: 32, align: 32, offset: 1216)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1351, file: !1142, line: 205, baseType: !938, size: 32, align: 32, offset: 1248)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1351, file: !1142, line: 206, baseType: !938, size: 32, align: 32, offset: 1280)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1351, file: !1142, line: 209, baseType: !1310, size: 64, align: 64, offset: 1344)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1351, file: !1142, line: 212, baseType: !1310, size: 64, align: 64, offset: 1408)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1351, file: !1142, line: 213, baseType: !1334, size: 64, align: 64, offset: 1472)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1351, file: !1142, line: 215, baseType: !938, size: 32, align: 32, offset: 1536)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1351, file: !1142, line: 217, baseType: !938, size: 32, align: 32, offset: 1568)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1351, file: !1142, line: 220, baseType: !938, size: 32, align: 32, offset: 1600)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1077, file: !57, line: 1598, baseType: !935, size: 64, align: 64, offset: 384)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1077, file: !57, line: 1606, baseType: !996, size: 64, align: 64, offset: 448)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1077, file: !57, line: 1614, baseType: !938, size: 32, align: 32, offset: 512)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1077, file: !57, line: 1622, baseType: !938, size: 32, align: 32, offset: 544)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1077, file: !57, line: 1628, baseType: !938, size: 32, align: 32, offset: 576)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1077, file: !57, line: 1636, baseType: !938, size: 32, align: 32, offset: 608)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1077, file: !57, line: 1643, baseType: !938, size: 32, align: 32, offset: 640)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1077, file: !57, line: 1657, baseType: !1155, size: 64, align: 64, offset: 704)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1077, file: !57, line: 1658, baseType: !938, size: 32, align: 32, offset: 768)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1077, file: !57, line: 1679, baseType: !1002, size: 64, align: 32, offset: 800)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1077, file: !57, line: 1688, baseType: !938, size: 32, align: 32, offset: 864)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1077, file: !57, line: 1712, baseType: !938, size: 32, align: 32, offset: 896)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1077, file: !57, line: 1729, baseType: !938, size: 32, align: 32, offset: 928)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1077, file: !57, line: 1729, baseType: !938, size: 32, align: 32, offset: 960)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1077, file: !57, line: 1744, baseType: !938, size: 32, align: 32, offset: 992)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1077, file: !57, line: 1744, baseType: !938, size: 32, align: 32, offset: 1024)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1077, file: !57, line: 1751, baseType: !938, size: 32, align: 32, offset: 1056)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1077, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1077, file: !57, line: 1791, baseType: !1498, size: 64, align: 64, offset: 1152)
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{null, !1076, !1234, !1316, !938, !938, !938}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1077, file: !57, line: 1808, baseType: !1502, size: 64, align: 64, offset: 1216)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64, align: 64)
!1503 = !DISubroutineType(types: !1504)
!1504 = !{!516, !1076, !1098}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1077, file: !57, line: 1816, baseType: !938, size: 32, align: 32, offset: 1280)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1077, file: !57, line: 1825, baseType: !1507, size: 32, align: 32, offset: 1312)
!1507 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1077, file: !57, line: 1830, baseType: !938, size: 32, align: 32, offset: 1344)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1077, file: !57, line: 1838, baseType: !1507, size: 32, align: 32, offset: 1376)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1077, file: !57, line: 1846, baseType: !938, size: 32, align: 32, offset: 1408)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1077, file: !57, line: 1851, baseType: !938, size: 32, align: 32, offset: 1440)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1077, file: !57, line: 1861, baseType: !1507, size: 32, align: 32, offset: 1472)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1077, file: !57, line: 1868, baseType: !1507, size: 32, align: 32, offset: 1504)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1077, file: !57, line: 1875, baseType: !1507, size: 32, align: 32, offset: 1536)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1077, file: !57, line: 1882, baseType: !1507, size: 32, align: 32, offset: 1568)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1077, file: !57, line: 1889, baseType: !1507, size: 32, align: 32, offset: 1600)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1077, file: !57, line: 1896, baseType: !1507, size: 32, align: 32, offset: 1632)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1077, file: !57, line: 1903, baseType: !1507, size: 32, align: 32, offset: 1664)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1077, file: !57, line: 1910, baseType: !938, size: 32, align: 32, offset: 1696)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1077, file: !57, line: 1915, baseType: !938, size: 32, align: 32, offset: 1728)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1077, file: !57, line: 1926, baseType: !1316, size: 64, align: 64, offset: 1792)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1077, file: !57, line: 1935, baseType: !1002, size: 64, align: 32, offset: 1856)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1077, file: !57, line: 1942, baseType: !938, size: 32, align: 32, offset: 1920)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1077, file: !57, line: 1948, baseType: !938, size: 32, align: 32, offset: 1952)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1077, file: !57, line: 1954, baseType: !938, size: 32, align: 32, offset: 1984)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1077, file: !57, line: 1960, baseType: !938, size: 32, align: 32, offset: 2016)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1077, file: !57, line: 1984, baseType: !938, size: 32, align: 32, offset: 2048)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1077, file: !57, line: 1991, baseType: !938, size: 32, align: 32, offset: 2080)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1077, file: !57, line: 1996, baseType: !938, size: 32, align: 32, offset: 2112)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1077, file: !57, line: 2004, baseType: !938, size: 32, align: 32, offset: 2144)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1077, file: !57, line: 2011, baseType: !938, size: 32, align: 32, offset: 2176)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1077, file: !57, line: 2018, baseType: !938, size: 32, align: 32, offset: 2208)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1077, file: !57, line: 2027, baseType: !938, size: 32, align: 32, offset: 2240)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1077, file: !57, line: 2034, baseType: !938, size: 32, align: 32, offset: 2272)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1077, file: !57, line: 2044, baseType: !938, size: 32, align: 32, offset: 2304)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1077, file: !57, line: 2054, baseType: !943, size: 64, align: 64, offset: 2368)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1077, file: !57, line: 2061, baseType: !943, size: 64, align: 64, offset: 2432)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1077, file: !57, line: 2066, baseType: !938, size: 32, align: 32, offset: 2496)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1077, file: !57, line: 2070, baseType: !938, size: 32, align: 32, offset: 2528)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1077, file: !57, line: 2078, baseType: !938, size: 32, align: 32, offset: 2560)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1077, file: !57, line: 2085, baseType: !938, size: 32, align: 32, offset: 2592)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1077, file: !57, line: 2092, baseType: !938, size: 32, align: 32, offset: 2624)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1077, file: !57, line: 2099, baseType: !938, size: 32, align: 32, offset: 2656)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1077, file: !57, line: 2106, baseType: !938, size: 32, align: 32, offset: 2688)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1077, file: !57, line: 2113, baseType: !938, size: 32, align: 32, offset: 2720)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1077, file: !57, line: 2120, baseType: !938, size: 32, align: 32, offset: 2752)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1077, file: !57, line: 2125, baseType: !938, size: 32, align: 32, offset: 2784)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1077, file: !57, line: 2133, baseType: !938, size: 32, align: 32, offset: 2816)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1077, file: !57, line: 2140, baseType: !938, size: 32, align: 32, offset: 2848)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1077, file: !57, line: 2145, baseType: !938, size: 32, align: 32, offset: 2880)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1077, file: !57, line: 2153, baseType: !938, size: 32, align: 32, offset: 2912)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1077, file: !57, line: 2158, baseType: !938, size: 32, align: 32, offset: 2944)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1077, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1077, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1077, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1077, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1077, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1077, file: !57, line: 2203, baseType: !938, size: 32, align: 32, offset: 3136)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1077, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1077, file: !57, line: 2212, baseType: !938, size: 32, align: 32, offset: 3200)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1077, file: !57, line: 2213, baseType: !938, size: 32, align: 32, offset: 3232)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1077, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1077, file: !57, line: 2232, baseType: !938, size: 32, align: 32, offset: 3296)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1077, file: !57, line: 2243, baseType: !938, size: 32, align: 32, offset: 3328)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1077, file: !57, line: 2249, baseType: !938, size: 32, align: 32, offset: 3360)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1077, file: !57, line: 2256, baseType: !938, size: 32, align: 32, offset: 3392)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1077, file: !57, line: 2263, baseType: !1109, size: 64, align: 64, offset: 3456)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1077, file: !57, line: 2270, baseType: !1109, size: 64, align: 64, offset: 3520)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1077, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1077, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1077, file: !57, line: 2367, baseType: !1572, size: 64, align: 64, offset: 3648)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DISubroutineType(types: !1574)
!1574 = !{!938, !1076, !1334, !938}
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1077, file: !57, line: 2383, baseType: !938, size: 32, align: 32, offset: 3712)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1077, file: !57, line: 2386, baseType: !1507, size: 32, align: 32, offset: 3744)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1077, file: !57, line: 2387, baseType: !1507, size: 32, align: 32, offset: 3776)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1077, file: !57, line: 2394, baseType: !938, size: 32, align: 32, offset: 3808)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1077, file: !57, line: 2401, baseType: !938, size: 32, align: 32, offset: 3840)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1077, file: !57, line: 2408, baseType: !938, size: 32, align: 32, offset: 3872)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1077, file: !57, line: 2415, baseType: !938, size: 32, align: 32, offset: 3904)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1077, file: !57, line: 2422, baseType: !938, size: 32, align: 32, offset: 3936)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1077, file: !57, line: 2423, baseType: !1584, size: 64, align: 64, offset: 3968)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64, align: 64)
!1585 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1586)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1587)
!1587 = !{!1588, !1589, !1590, !1591}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1586, file: !57, line: 827, baseType: !938, size: 32, align: 32)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1586, file: !57, line: 828, baseType: !938, size: 32, align: 32, offset: 32)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1586, file: !57, line: 829, baseType: !938, size: 32, align: 32, offset: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1586, file: !57, line: 830, baseType: !1507, size: 32, align: 32, offset: 96)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1077, file: !57, line: 2430, baseType: !996, size: 64, align: 64, offset: 4032)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1077, file: !57, line: 2437, baseType: !996, size: 64, align: 64, offset: 4096)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1077, file: !57, line: 2444, baseType: !1507, size: 32, align: 32, offset: 4160)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1077, file: !57, line: 2451, baseType: !1507, size: 32, align: 32, offset: 4192)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1077, file: !57, line: 2458, baseType: !938, size: 32, align: 32, offset: 4224)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1077, file: !57, line: 2469, baseType: !938, size: 32, align: 32, offset: 4256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1077, file: !57, line: 2475, baseType: !938, size: 32, align: 32, offset: 4288)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1077, file: !57, line: 2481, baseType: !938, size: 32, align: 32, offset: 4320)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1077, file: !57, line: 2485, baseType: !938, size: 32, align: 32, offset: 4352)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1077, file: !57, line: 2489, baseType: !938, size: 32, align: 32, offset: 4384)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1077, file: !57, line: 2493, baseType: !938, size: 32, align: 32, offset: 4416)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1077, file: !57, line: 2501, baseType: !938, size: 32, align: 32, offset: 4448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1077, file: !57, line: 2506, baseType: !938, size: 32, align: 32, offset: 4480)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1077, file: !57, line: 2510, baseType: !938, size: 32, align: 32, offset: 4512)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1077, file: !57, line: 2514, baseType: !996, size: 64, align: 64, offset: 4544)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1077, file: !57, line: 2528, baseType: !1608, size: 64, align: 64, offset: 4608)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DISubroutineType(types: !1610)
!1610 = !{null, !1076, !935, !938, !938}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1077, file: !57, line: 2534, baseType: !938, size: 32, align: 32, offset: 4672)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1077, file: !57, line: 2545, baseType: !938, size: 32, align: 32, offset: 4704)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1077, file: !57, line: 2547, baseType: !938, size: 32, align: 32, offset: 4736)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1077, file: !57, line: 2549, baseType: !938, size: 32, align: 32, offset: 4768)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1077, file: !57, line: 2551, baseType: !938, size: 32, align: 32, offset: 4800)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1077, file: !57, line: 2553, baseType: !938, size: 32, align: 32, offset: 4832)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1077, file: !57, line: 2555, baseType: !938, size: 32, align: 32, offset: 4864)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1077, file: !57, line: 2557, baseType: !938, size: 32, align: 32, offset: 4896)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1077, file: !57, line: 2559, baseType: !938, size: 32, align: 32, offset: 4928)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1077, file: !57, line: 2563, baseType: !938, size: 32, align: 32, offset: 4960)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1077, file: !57, line: 2571, baseType: !936, size: 64, align: 64, offset: 4992)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1077, file: !57, line: 2579, baseType: !936, size: 64, align: 64, offset: 5056)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1077, file: !57, line: 2586, baseType: !938, size: 32, align: 32, offset: 5120)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1077, file: !57, line: 2615, baseType: !938, size: 32, align: 32, offset: 5152)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1077, file: !57, line: 2627, baseType: !938, size: 32, align: 32, offset: 5184)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1077, file: !57, line: 2637, baseType: !938, size: 32, align: 32, offset: 5216)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1077, file: !57, line: 2681, baseType: !938, size: 32, align: 32, offset: 5248)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1077, file: !57, line: 2709, baseType: !996, size: 64, align: 64, offset: 5312)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1077, file: !57, line: 2716, baseType: !1630, size: 64, align: 64, offset: 5376)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1632)
!1632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1633)
!1633 = !{!1634, !1635, !1636, !1637, !1638, !1639, !1640, !1644, !1648, !1649, !1650, !1651, !1656, !1657, !1658, !1659, !1660}
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1632, file: !57, line: 3642, baseType: !977, size: 64, align: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1632, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1632, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1632, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1632, file: !57, line: 3669, baseType: !938, size: 32, align: 32, offset: 160)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1632, file: !57, line: 3682, baseType: !1331, size: 64, align: 64, offset: 192)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1632, file: !57, line: 3698, baseType: !1641, size: 64, align: 64, offset: 256)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{!938, !1129, !1066, !932}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1632, file: !57, line: 3712, baseType: !1645, size: 64, align: 64, offset: 320)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{!938, !1129, !938, !1066, !932}
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1632, file: !57, line: 3726, baseType: !1641, size: 64, align: 64, offset: 384)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1632, file: !57, line: 3737, baseType: !1126, size: 64, align: 64, offset: 448)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1632, file: !57, line: 3746, baseType: !938, size: 32, align: 32, offset: 512)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1632, file: !57, line: 3757, baseType: !1652, size: 64, align: 64, offset: 576)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{null, !1655}
!1655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1632, file: !57, line: 3766, baseType: !1126, size: 64, align: 64, offset: 640)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1632, file: !57, line: 3774, baseType: !1126, size: 64, align: 64, offset: 704)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1632, file: !57, line: 3780, baseType: !938, size: 32, align: 32, offset: 768)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1632, file: !57, line: 3785, baseType: !938, size: 32, align: 32, offset: 800)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1632, file: !57, line: 3795, baseType: !1661, size: 64, align: 64, offset: 832)
!1661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1662, size: 64, align: 64)
!1662 = !DISubroutineType(types: !1663)
!1663 = !{!938, !1129, !1205}
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1077, file: !57, line: 2728, baseType: !935, size: 64, align: 64, offset: 5440)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1077, file: !57, line: 2735, baseType: !1258, size: 512, align: 64, offset: 5504)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1077, file: !57, line: 2742, baseType: !938, size: 32, align: 32, offset: 6016)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1077, file: !57, line: 2755, baseType: !938, size: 32, align: 32, offset: 6048)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1077, file: !57, line: 2776, baseType: !938, size: 32, align: 32, offset: 6080)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1077, file: !57, line: 2783, baseType: !938, size: 32, align: 32, offset: 6112)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1077, file: !57, line: 2791, baseType: !938, size: 32, align: 32, offset: 6144)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1077, file: !57, line: 2802, baseType: !1334, size: 64, align: 64, offset: 6208)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1077, file: !57, line: 2811, baseType: !938, size: 32, align: 32, offset: 6272)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1077, file: !57, line: 2821, baseType: !938, size: 32, align: 32, offset: 6304)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1077, file: !57, line: 2830, baseType: !938, size: 32, align: 32, offset: 6336)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1077, file: !57, line: 2840, baseType: !938, size: 32, align: 32, offset: 6368)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1077, file: !57, line: 2851, baseType: !1677, size: 64, align: 64, offset: 6400)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64, align: 64)
!1678 = !DISubroutineType(types: !1679)
!1679 = !{!938, !1076, !1680, !935, !1316, !938, !938}
!1680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1681, size: 64, align: 64)
!1681 = !DISubroutineType(types: !1682)
!1682 = !{!938, !1076, !935}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1077, file: !57, line: 2871, baseType: !1684, size: 64, align: 64, offset: 6464)
!1684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1685, size: 64, align: 64)
!1685 = !DISubroutineType(types: !1686)
!1686 = !{!938, !1076, !1687, !935, !1316, !938}
!1687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1688, size: 64, align: 64)
!1688 = !DISubroutineType(types: !1689)
!1689 = !{!938, !1076, !935, !938, !938}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1077, file: !57, line: 2878, baseType: !938, size: 32, align: 32, offset: 6528)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1077, file: !57, line: 2885, baseType: !938, size: 32, align: 32, offset: 6560)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1077, file: !57, line: 3005, baseType: !938, size: 32, align: 32, offset: 6592)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1077, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1077, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1077, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1077, file: !57, line: 3037, baseType: !1155, size: 64, align: 64, offset: 6720)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1077, file: !57, line: 3038, baseType: !938, size: 32, align: 32, offset: 6784)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1077, file: !57, line: 3050, baseType: !1109, size: 64, align: 64, offset: 6848)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1077, file: !57, line: 3065, baseType: !938, size: 32, align: 32, offset: 6912)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1077, file: !57, line: 3083, baseType: !938, size: 32, align: 32, offset: 6944)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1077, file: !57, line: 3092, baseType: !1002, size: 64, align: 32, offset: 6976)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1077, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1077, file: !57, line: 3106, baseType: !1002, size: 64, align: 32, offset: 7072)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1077, file: !57, line: 3113, baseType: !1705, size: 64, align: 64, offset: 7168)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64, align: 64)
!1706 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1707)
!1707 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1708)
!1708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1709)
!1709 = !{!1710, !1711, !1712, !1713, !1714, !1715, !1718}
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1708, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1708, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1708, file: !57, line: 720, baseType: !977, size: 64, align: 64, offset: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1708, file: !57, line: 724, baseType: !977, size: 64, align: 64, offset: 128)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1708, file: !57, line: 728, baseType: !938, size: 32, align: 32, offset: 192)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1708, file: !57, line: 734, baseType: !1716, size: 64, align: 64, offset: 256)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1717, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1708, file: !57, line: 739, baseType: !1719, size: 64, align: 64, offset: 320)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64, align: 64)
!1720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1117)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1077, file: !57, line: 3129, baseType: !996, size: 64, align: 64, offset: 7232)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1077, file: !57, line: 3130, baseType: !996, size: 64, align: 64, offset: 7296)
