; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--movtextdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--movtextdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!853 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!854 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!855 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!856 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!857 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!858 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!859 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!860 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!861 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!862 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!863 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!864 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!865 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!866 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!867 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!868 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!869 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!870 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!871 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!872 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!873 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!874 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!875 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!876 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!877 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!878 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!879 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!880 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !893, !901, !902, !903, !909, !914, !890}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64, align: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !891, line: 48, baseType: !892)
!891 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!892 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !896, line: 222, size: 16, align: 8, elements: !897)
!896 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!897 = !{!898}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !895, file: !896, line: 222, baseType: !899, size: 16, align: 16)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !891, line: 49, baseType: !900)
!900 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!901 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!902 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !896, line: 221, size: 32, align: 8, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !905, file: !896, line: 221, baseType: !908, size: 32, align: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !891, line: 51, baseType: !902)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !896, line: 220, size: 64, align: 8, elements: !912)
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !911, file: !896, line: 220, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !891, line: 55, baseType: !915)
!915 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!916 = !{!917, !1509, !1511}
!917 = distinct !DIGlobalVariable(name: "ff_movtext_decoder", scope: !0, file: !918, line: 570, type: !919, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_movtext_decoder)
!918 = !DIFile(filename: "libavcodec/movtextdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !921)
!921 = !{!922, !926, !927, !928, !929, !930, !939, !942, !945, !948, !951, !952, !994, !1002, !1003, !1004, !1006, !1408, !1414, !1419, !1423, !1424, !1464, !1484, !1488, !1489, !1493, !1497, !1498, !1502, !1503, !1504}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !14, line: 3475, baseType: !923, size: 64, align: 64)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !920, file: !14, line: 3480, baseType: !923, size: 64, align: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !920, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !920, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !920, file: !14, line: 3487, baseType: !901, size: 32, align: 32, offset: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !920, file: !14, line: 3488, baseType: !931, size: 64, align: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !934, line: 61, baseType: !935)
!934 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !934, line: 58, size: 64, align: 32, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !935, file: !934, line: 59, baseType: !901, size: 32, align: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !935, file: !934, line: 60, baseType: !901, size: 32, align: 32, offset: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !920, file: !14, line: 3489, baseType: !940, size: 64, align: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !920, file: !14, line: 3490, baseType: !943, size: 64, align: 64, offset: 384)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !920, file: !14, line: 3491, baseType: !946, size: 64, align: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !920, file: !14, line: 3492, baseType: !949, size: 64, align: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !920, file: !14, line: 3493, baseType: !890, size: 8, align: 8, offset: 576)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !920, file: !14, line: 3494, baseType: !953, size: 64, align: 64, offset: 640)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !957)
!957 = !{!958, !959, !964, !968, !969, !970, !971, !975, !981, !983, !987}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !956, file: !691, line: 72, baseType: !923, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !956, file: !691, line: 78, baseType: !960, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!923, !963}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !956, file: !691, line: 85, baseType: !965, size: 64, align: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !956, file: !691, line: 93, baseType: !901, size: 32, align: 32, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !956, file: !691, line: 99, baseType: !901, size: 32, align: 32, offset: 224)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !956, file: !691, line: 108, baseType: !901, size: 32, align: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !956, file: !691, line: 113, baseType: !972, size: 64, align: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DISubroutineType(types: !974)
!974 = !{!963, !963, !963}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !956, file: !691, line: 123, baseType: !976, size: 64, align: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DISubroutineType(types: !978)
!978 = !{!979, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !956, file: !691, line: 130, baseType: !982, size: 32, align: 32, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !956, file: !691, line: 136, baseType: !984, size: 64, align: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!982, !963}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !956, file: !691, line: 142, baseType: !988, size: 64, align: 64, offset: 576)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!901, !991, !963, !923, !901}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64, align: 64)
!993 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !920, file: !14, line: 3495, baseType: !995, size: 64, align: 64, offset: 704)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !998, file: !14, line: 3402, baseType: !901, size: 32, align: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !998, file: !14, line: 3403, baseType: !923, size: 64, align: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !920, file: !14, line: 3507, baseType: !923, size: 64, align: 64, offset: 768)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !920, file: !14, line: 3516, baseType: !901, size: 32, align: 32, offset: 832)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !920, file: !14, line: 3517, baseType: !1005, size: 64, align: 64, offset: 896)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !920, file: !14, line: 3527, baseType: !1007, size: 64, align: 64, offset: 960)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64, align: 64)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!901, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1020, !1021, !1022, !1023, !1026, !1027, !1030, !1031, !1032, !1033, !1034, !1035, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1150, !1154, !1155, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1339, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1012, file: !14, line: 1561, baseType: !953, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1012, file: !14, line: 1562, baseType: !901, size: 32, align: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1012, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1012, file: !14, line: 1565, baseType: !1018, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1012, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1012, file: !14, line: 1581, baseType: !902, size: 32, align: 32, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1012, file: !14, line: 1583, baseType: !963, size: 64, align: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1012, file: !14, line: 1591, baseType: !1024, size: 64, align: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1012, file: !14, line: 1598, baseType: !963, size: 64, align: 64, offset: 384)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1012, file: !14, line: 1606, baseType: !1028, size: 64, align: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !891, line: 40, baseType: !1029)
!1029 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1012, file: !14, line: 1614, baseType: !901, size: 32, align: 32, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1012, file: !14, line: 1622, baseType: !901, size: 32, align: 32, offset: 544)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1012, file: !14, line: 1628, baseType: !901, size: 32, align: 32, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1012, file: !14, line: 1636, baseType: !901, size: 32, align: 32, offset: 608)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1012, file: !14, line: 1643, baseType: !901, size: 32, align: 32, offset: 640)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1012, file: !14, line: 1657, baseType: !1036, size: 64, align: 64, offset: 704)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1012, file: !14, line: 1658, baseType: !901, size: 32, align: 32, offset: 768)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1012, file: !14, line: 1679, baseType: !933, size: 64, align: 32, offset: 800)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1012, file: !14, line: 1688, baseType: !901, size: 32, align: 32, offset: 864)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1012, file: !14, line: 1712, baseType: !901, size: 32, align: 32, offset: 896)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1012, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 928)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1012, file: !14, line: 1729, baseType: !901, size: 32, align: 32, offset: 960)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1012, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 992)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1012, file: !14, line: 1744, baseType: !901, size: 32, align: 32, offset: 1024)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1012, file: !14, line: 1751, baseType: !901, size: 32, align: 32, offset: 1056)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1012, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1012, file: !14, line: 1791, baseType: !1048, size: 64, align: 64, offset: 1152)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{null, !1051, !1052, !1149, !901, !901, !901}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1056)
!1056 = !{!1057, !1061, !1063, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1101, !1103, !1104, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1137, !1138, !1139, !1140, !1141, !1142, !1145, !1146, !1147, !1148}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !722, line: 282, baseType: !1058, size: 512, align: 64)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 512, align: 64, elements: !1059)
!1059 = !{!1060}
!1060 = !DISubrange(count: 8)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1055, file: !722, line: 299, baseType: !1062, size: 256, align: 32, offset: 512)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 256, align: 32, elements: !1059)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1055, file: !722, line: 315, baseType: !1064, size: 64, align: 64, offset: 768)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1055, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1055, file: !722, line: 326, baseType: !901, size: 32, align: 32, offset: 864)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1055, file: !722, line: 334, baseType: !901, size: 32, align: 32, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1055, file: !722, line: 341, baseType: !901, size: 32, align: 32, offset: 928)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1055, file: !722, line: 346, baseType: !901, size: 32, align: 32, offset: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1055, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1055, file: !722, line: 356, baseType: !933, size: 64, align: 32, offset: 1024)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1055, file: !722, line: 361, baseType: !1028, size: 64, align: 64, offset: 1088)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1055, file: !722, line: 369, baseType: !1028, size: 64, align: 64, offset: 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1055, file: !722, line: 377, baseType: !1028, size: 64, align: 64, offset: 1216)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1055, file: !722, line: 382, baseType: !901, size: 32, align: 32, offset: 1280)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1055, file: !722, line: 386, baseType: !901, size: 32, align: 32, offset: 1312)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1055, file: !722, line: 391, baseType: !901, size: 32, align: 32, offset: 1344)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1055, file: !722, line: 396, baseType: !963, size: 64, align: 64, offset: 1408)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1055, file: !722, line: 403, baseType: !1080, size: 512, align: 64, offset: 1472)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 512, align: 64, elements: !1059)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1055, file: !722, line: 410, baseType: !901, size: 32, align: 32, offset: 1984)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1055, file: !722, line: 415, baseType: !901, size: 32, align: 32, offset: 2016)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1055, file: !722, line: 420, baseType: !901, size: 32, align: 32, offset: 2048)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1055, file: !722, line: 425, baseType: !901, size: 32, align: 32, offset: 2080)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1055, file: !722, line: 435, baseType: !1028, size: 64, align: 64, offset: 2112)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1055, file: !722, line: 440, baseType: !901, size: 32, align: 32, offset: 2176)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1055, file: !722, line: 445, baseType: !914, size: 64, align: 64, offset: 2240)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1055, file: !722, line: 459, baseType: !1089, size: 512, align: 64, offset: 2304)
!1089 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 512, align: 64, elements: !1059)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1092, line: 94, baseType: !1093)
!1092 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1092, line: 81, size: 192, align: 64, elements: !1094)
!1094 = !{!1095, !1099, !1100}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1093, file: !1092, line: 82, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1092, line: 73, baseType: !1098)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1092, line: 73, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1093, file: !1092, line: 89, baseType: !1036, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1093, file: !1092, line: 93, baseType: !901, size: 32, align: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1055, file: !722, line: 473, baseType: !1102, size: 64, align: 64, offset: 2816)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1055, file: !722, line: 477, baseType: !901, size: 32, align: 32, offset: 2880)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1055, file: !722, line: 479, baseType: !1105, size: 64, align: 64, offset: 2944)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1118}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1108, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1108, file: !722, line: 203, baseType: !1036, size: 64, align: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1108, file: !722, line: 204, baseType: !901, size: 32, align: 32, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1108, file: !722, line: 205, baseType: !1114, size: 64, align: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1116, line: 86, baseType: !1117)
!1116 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1117 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1116, line: 86, flags: DIFlagFwdDecl)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1108, file: !722, line: 206, baseType: !1090, size: 64, align: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1055, file: !722, line: 480, baseType: !901, size: 32, align: 32, offset: 3008)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1055, file: !722, line: 505, baseType: !901, size: 32, align: 32, offset: 3040)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1055, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1055, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1055, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1055, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1055, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1055, file: !722, line: 532, baseType: !1028, size: 64, align: 64, offset: 3264)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1055, file: !722, line: 539, baseType: !1028, size: 64, align: 64, offset: 3328)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1055, file: !722, line: 547, baseType: !1028, size: 64, align: 64, offset: 3392)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1055, file: !722, line: 554, baseType: !1114, size: 64, align: 64, offset: 3456)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1055, file: !722, line: 563, baseType: !901, size: 32, align: 32, offset: 3520)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1055, file: !722, line: 572, baseType: !901, size: 32, align: 32, offset: 3552)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1055, file: !722, line: 581, baseType: !901, size: 32, align: 32, offset: 3584)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1055, file: !722, line: 588, baseType: !1134, size: 64, align: 64, offset: 3648)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !891, line: 36, baseType: !1136)
!1136 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1055, file: !722, line: 593, baseType: !901, size: 32, align: 32, offset: 3712)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1055, file: !722, line: 596, baseType: !901, size: 32, align: 32, offset: 3744)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1055, file: !722, line: 599, baseType: !1090, size: 64, align: 64, offset: 3776)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1055, file: !722, line: 605, baseType: !1090, size: 64, align: 64, offset: 3840)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1055, file: !722, line: 616, baseType: !1090, size: 64, align: 64, offset: 3904)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1055, file: !722, line: 626, baseType: !1143, size: 64, align: 64, offset: 3968)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1144, line: 216, baseType: !915)
!1144 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1055, file: !722, line: 627, baseType: !1143, size: 64, align: 64, offset: 4032)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1055, file: !722, line: 628, baseType: !1143, size: 64, align: 64, offset: 4096)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1055, file: !722, line: 629, baseType: !1143, size: 64, align: 64, offset: 4160)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1055, file: !722, line: 645, baseType: !1090, size: 64, align: 64, offset: 4224)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1012, file: !14, line: 1808, baseType: !1151, size: 64, align: 64, offset: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DISubroutineType(types: !1153)
!1153 = !{!473, !1051, !940}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1012, file: !14, line: 1816, baseType: !901, size: 32, align: 32, offset: 1280)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1012, file: !14, line: 1825, baseType: !1156, size: 32, align: 32, offset: 1312)
!1156 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1012, file: !14, line: 1830, baseType: !901, size: 32, align: 32, offset: 1344)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1012, file: !14, line: 1838, baseType: !1156, size: 32, align: 32, offset: 1376)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1012, file: !14, line: 1846, baseType: !901, size: 32, align: 32, offset: 1408)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1012, file: !14, line: 1851, baseType: !901, size: 32, align: 32, offset: 1440)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1012, file: !14, line: 1861, baseType: !1156, size: 32, align: 32, offset: 1472)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1012, file: !14, line: 1868, baseType: !1156, size: 32, align: 32, offset: 1504)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1012, file: !14, line: 1875, baseType: !1156, size: 32, align: 32, offset: 1536)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1012, file: !14, line: 1882, baseType: !1156, size: 32, align: 32, offset: 1568)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1012, file: !14, line: 1889, baseType: !1156, size: 32, align: 32, offset: 1600)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1012, file: !14, line: 1896, baseType: !1156, size: 32, align: 32, offset: 1632)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1012, file: !14, line: 1903, baseType: !1156, size: 32, align: 32, offset: 1664)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1012, file: !14, line: 1910, baseType: !901, size: 32, align: 32, offset: 1696)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1012, file: !14, line: 1915, baseType: !901, size: 32, align: 32, offset: 1728)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1012, file: !14, line: 1926, baseType: !1149, size: 64, align: 64, offset: 1792)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1012, file: !14, line: 1935, baseType: !933, size: 64, align: 32, offset: 1856)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1012, file: !14, line: 1942, baseType: !901, size: 32, align: 32, offset: 1920)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1012, file: !14, line: 1948, baseType: !901, size: 32, align: 32, offset: 1952)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1012, file: !14, line: 1954, baseType: !901, size: 32, align: 32, offset: 1984)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1012, file: !14, line: 1960, baseType: !901, size: 32, align: 32, offset: 2016)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1012, file: !14, line: 1984, baseType: !901, size: 32, align: 32, offset: 2048)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1012, file: !14, line: 1991, baseType: !901, size: 32, align: 32, offset: 2080)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1012, file: !14, line: 1996, baseType: !901, size: 32, align: 32, offset: 2112)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1012, file: !14, line: 2004, baseType: !901, size: 32, align: 32, offset: 2144)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1012, file: !14, line: 2011, baseType: !901, size: 32, align: 32, offset: 2176)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1012, file: !14, line: 2018, baseType: !901, size: 32, align: 32, offset: 2208)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1012, file: !14, line: 2027, baseType: !901, size: 32, align: 32, offset: 2240)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1012, file: !14, line: 2034, baseType: !901, size: 32, align: 32, offset: 2272)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1012, file: !14, line: 2044, baseType: !901, size: 32, align: 32, offset: 2304)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1012, file: !14, line: 2054, baseType: !1186, size: 64, align: 64, offset: 2368)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1012, file: !14, line: 2061, baseType: !1186, size: 64, align: 64, offset: 2432)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1012, file: !14, line: 2066, baseType: !901, size: 32, align: 32, offset: 2496)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1012, file: !14, line: 2070, baseType: !901, size: 32, align: 32, offset: 2528)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1012, file: !14, line: 2078, baseType: !901, size: 32, align: 32, offset: 2560)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1012, file: !14, line: 2085, baseType: !901, size: 32, align: 32, offset: 2592)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1012, file: !14, line: 2092, baseType: !901, size: 32, align: 32, offset: 2624)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1012, file: !14, line: 2099, baseType: !901, size: 32, align: 32, offset: 2656)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1012, file: !14, line: 2106, baseType: !901, size: 32, align: 32, offset: 2688)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1012, file: !14, line: 2113, baseType: !901, size: 32, align: 32, offset: 2720)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1012, file: !14, line: 2120, baseType: !901, size: 32, align: 32, offset: 2752)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1012, file: !14, line: 2125, baseType: !901, size: 32, align: 32, offset: 2784)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1012, file: !14, line: 2133, baseType: !901, size: 32, align: 32, offset: 2816)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1012, file: !14, line: 2140, baseType: !901, size: 32, align: 32, offset: 2848)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1012, file: !14, line: 2145, baseType: !901, size: 32, align: 32, offset: 2880)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1012, file: !14, line: 2153, baseType: !901, size: 32, align: 32, offset: 2912)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1012, file: !14, line: 2158, baseType: !901, size: 32, align: 32, offset: 2944)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1012, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1012, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1012, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1012, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1012, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1012, file: !14, line: 2203, baseType: !901, size: 32, align: 32, offset: 3136)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1012, file: !14, line: 2209, baseType: !822, size: 32, align: 32, offset: 3168)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1012, file: !14, line: 2212, baseType: !901, size: 32, align: 32, offset: 3200)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1012, file: !14, line: 2213, baseType: !901, size: 32, align: 32, offset: 3232)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1012, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1012, file: !14, line: 2232, baseType: !901, size: 32, align: 32, offset: 3296)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1012, file: !14, line: 2243, baseType: !901, size: 32, align: 32, offset: 3328)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1012, file: !14, line: 2249, baseType: !901, size: 32, align: 32, offset: 3360)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1012, file: !14, line: 2256, baseType: !901, size: 32, align: 32, offset: 3392)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1012, file: !14, line: 2263, baseType: !914, size: 64, align: 64, offset: 3456)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1012, file: !14, line: 2270, baseType: !914, size: 64, align: 64, offset: 3520)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1012, file: !14, line: 2277, baseType: !830, size: 32, align: 32, offset: 3584)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1012, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1012, file: !14, line: 2367, baseType: !1222, size: 64, align: 64, offset: 3648)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{!901, !1051, !1225, !901}
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1012, file: !14, line: 2383, baseType: !901, size: 32, align: 32, offset: 3712)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1012, file: !14, line: 2386, baseType: !1156, size: 32, align: 32, offset: 3744)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1012, file: !14, line: 2387, baseType: !1156, size: 32, align: 32, offset: 3776)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1012, file: !14, line: 2394, baseType: !901, size: 32, align: 32, offset: 3808)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1012, file: !14, line: 2401, baseType: !901, size: 32, align: 32, offset: 3840)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1012, file: !14, line: 2408, baseType: !901, size: 32, align: 32, offset: 3872)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1012, file: !14, line: 2415, baseType: !901, size: 32, align: 32, offset: 3904)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1012, file: !14, line: 2422, baseType: !901, size: 32, align: 32, offset: 3936)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1012, file: !14, line: 2423, baseType: !1235, size: 64, align: 64, offset: 3968)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1237, file: !14, line: 827, baseType: !901, size: 32, align: 32)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1237, file: !14, line: 828, baseType: !901, size: 32, align: 32, offset: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1237, file: !14, line: 829, baseType: !901, size: 32, align: 32, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1237, file: !14, line: 830, baseType: !1156, size: 32, align: 32, offset: 96)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1012, file: !14, line: 2430, baseType: !1028, size: 64, align: 64, offset: 4032)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1012, file: !14, line: 2437, baseType: !1028, size: 64, align: 64, offset: 4096)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1012, file: !14, line: 2444, baseType: !1156, size: 32, align: 32, offset: 4160)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1012, file: !14, line: 2451, baseType: !1156, size: 32, align: 32, offset: 4192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1012, file: !14, line: 2458, baseType: !901, size: 32, align: 32, offset: 4224)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1012, file: !14, line: 2469, baseType: !901, size: 32, align: 32, offset: 4256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1012, file: !14, line: 2475, baseType: !901, size: 32, align: 32, offset: 4288)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1012, file: !14, line: 2481, baseType: !901, size: 32, align: 32, offset: 4320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1012, file: !14, line: 2485, baseType: !901, size: 32, align: 32, offset: 4352)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1012, file: !14, line: 2489, baseType: !901, size: 32, align: 32, offset: 4384)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1012, file: !14, line: 2493, baseType: !901, size: 32, align: 32, offset: 4416)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1012, file: !14, line: 2501, baseType: !901, size: 32, align: 32, offset: 4448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1012, file: !14, line: 2506, baseType: !901, size: 32, align: 32, offset: 4480)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1012, file: !14, line: 2510, baseType: !901, size: 32, align: 32, offset: 4512)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1012, file: !14, line: 2514, baseType: !1028, size: 64, align: 64, offset: 4544)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1012, file: !14, line: 2528, baseType: !1259, size: 64, align: 64, offset: 4608)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !1051, !963, !901, !901}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1012, file: !14, line: 2534, baseType: !901, size: 32, align: 32, offset: 4672)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1012, file: !14, line: 2545, baseType: !901, size: 32, align: 32, offset: 4704)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1012, file: !14, line: 2547, baseType: !901, size: 32, align: 32, offset: 4736)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1012, file: !14, line: 2549, baseType: !901, size: 32, align: 32, offset: 4768)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1012, file: !14, line: 2551, baseType: !901, size: 32, align: 32, offset: 4800)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1012, file: !14, line: 2553, baseType: !901, size: 32, align: 32, offset: 4832)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1012, file: !14, line: 2555, baseType: !901, size: 32, align: 32, offset: 4864)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1012, file: !14, line: 2557, baseType: !901, size: 32, align: 32, offset: 4896)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1012, file: !14, line: 2559, baseType: !901, size: 32, align: 32, offset: 4928)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1012, file: !14, line: 2563, baseType: !901, size: 32, align: 32, offset: 4960)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1012, file: !14, line: 2571, baseType: !1273, size: 64, align: 64, offset: 4992)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1012, file: !14, line: 2579, baseType: !1273, size: 64, align: 64, offset: 5056)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1012, file: !14, line: 2586, baseType: !901, size: 32, align: 32, offset: 5120)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1012, file: !14, line: 2615, baseType: !901, size: 32, align: 32, offset: 5152)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1012, file: !14, line: 2627, baseType: !901, size: 32, align: 32, offset: 5184)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1012, file: !14, line: 2637, baseType: !901, size: 32, align: 32, offset: 5216)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1012, file: !14, line: 2681, baseType: !901, size: 32, align: 32, offset: 5248)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1012, file: !14, line: 2709, baseType: !1028, size: 64, align: 64, offset: 5312)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1012, file: !14, line: 2716, baseType: !1282, size: 64, align: 64, offset: 5376)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1295, !1299, !1303, !1304, !1305, !1306, !1312, !1313, !1314, !1315, !1316}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1284, file: !14, line: 3642, baseType: !923, size: 64, align: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1284, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1284, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1284, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1284, file: !14, line: 3669, baseType: !901, size: 32, align: 32, offset: 160)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1284, file: !14, line: 3682, baseType: !1292, size: 64, align: 64, offset: 192)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!901, !1010, !1225}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1284, file: !14, line: 3698, baseType: !1296, size: 64, align: 64, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!901, !1010, !888, !908}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1284, file: !14, line: 3712, baseType: !1300, size: 64, align: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!901, !1010, !901, !888, !908}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1284, file: !14, line: 3726, baseType: !1296, size: 64, align: 64, offset: 384)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1284, file: !14, line: 3737, baseType: !1007, size: 64, align: 64, offset: 448)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1284, file: !14, line: 3746, baseType: !901, size: 32, align: 32, offset: 512)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1284, file: !14, line: 3757, baseType: !1307, size: 64, align: 64, offset: 576)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{null, !1310}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1284, file: !14, line: 3766, baseType: !1007, size: 64, align: 64, offset: 640)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1284, file: !14, line: 3774, baseType: !1007, size: 64, align: 64, offset: 704)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1284, file: !14, line: 3780, baseType: !901, size: 32, align: 32, offset: 768)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1284, file: !14, line: 3785, baseType: !901, size: 32, align: 32, offset: 800)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1284, file: !14, line: 3795, baseType: !1317, size: 64, align: 64, offset: 832)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64, align: 64)
!1318 = !DISubroutineType(types: !1319)
!1319 = !{!901, !1010, !1090}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1012, file: !14, line: 2728, baseType: !963, size: 64, align: 64, offset: 5440)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1012, file: !14, line: 2735, baseType: !1080, size: 512, align: 64, offset: 5504)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1012, file: !14, line: 2742, baseType: !901, size: 32, align: 32, offset: 6016)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1012, file: !14, line: 2755, baseType: !901, size: 32, align: 32, offset: 6048)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1012, file: !14, line: 2776, baseType: !901, size: 32, align: 32, offset: 6080)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1012, file: !14, line: 2783, baseType: !901, size: 32, align: 32, offset: 6112)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1012, file: !14, line: 2791, baseType: !901, size: 32, align: 32, offset: 6144)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1012, file: !14, line: 2802, baseType: !1225, size: 64, align: 64, offset: 6208)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1012, file: !14, line: 2811, baseType: !901, size: 32, align: 32, offset: 6272)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1012, file: !14, line: 2821, baseType: !901, size: 32, align: 32, offset: 6304)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1012, file: !14, line: 2830, baseType: !901, size: 32, align: 32, offset: 6336)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1012, file: !14, line: 2840, baseType: !901, size: 32, align: 32, offset: 6368)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1012, file: !14, line: 2851, baseType: !1333, size: 64, align: 64, offset: 6400)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!901, !1051, !1336, !963, !1149, !901, !901}
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!901, !1051, !963}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1012, file: !14, line: 2871, baseType: !1340, size: 64, align: 64, offset: 6464)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DISubroutineType(types: !1342)
!1342 = !{!901, !1051, !1343, !963, !1149, !901}
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!901, !1051, !963, !901, !901}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1012, file: !14, line: 2878, baseType: !901, size: 32, align: 32, offset: 6528)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1012, file: !14, line: 2885, baseType: !901, size: 32, align: 32, offset: 6560)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1012, file: !14, line: 3005, baseType: !901, size: 32, align: 32, offset: 6592)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1012, file: !14, line: 3013, baseType: !842, size: 32, align: 32, offset: 6624)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1012, file: !14, line: 3020, baseType: !842, size: 32, align: 32, offset: 6656)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1012, file: !14, line: 3027, baseType: !842, size: 32, align: 32, offset: 6688)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1012, file: !14, line: 3037, baseType: !1036, size: 64, align: 64, offset: 6720)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1012, file: !14, line: 3038, baseType: !901, size: 32, align: 32, offset: 6784)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1012, file: !14, line: 3050, baseType: !914, size: 64, align: 64, offset: 6848)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1012, file: !14, line: 3065, baseType: !901, size: 32, align: 32, offset: 6912)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1012, file: !14, line: 3083, baseType: !901, size: 32, align: 32, offset: 6944)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1012, file: !14, line: 3092, baseType: !933, size: 64, align: 32, offset: 6976)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1012, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1012, file: !14, line: 3106, baseType: !933, size: 64, align: 32, offset: 7072)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1012, file: !14, line: 3113, baseType: !1361, size: 64, align: 64, offset: 7168)
!1361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1362, size: 64, align: 64)
!1362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1363)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369, !1370, !1371, !1374}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1364, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1364, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1364, file: !14, line: 720, baseType: !923, size: 64, align: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1364, file: !14, line: 724, baseType: !923, size: 64, align: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1364, file: !14, line: 728, baseType: !901, size: 32, align: 32, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1364, file: !14, line: 734, baseType: !1372, size: 64, align: 64, offset: 256)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1364, file: !14, line: 739, baseType: !1375, size: 64, align: 64, offset: 320)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1012, file: !14, line: 3129, baseType: !1028, size: 64, align: 64, offset: 7232)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1012, file: !14, line: 3130, baseType: !1028, size: 64, align: 64, offset: 7296)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1012, file: !14, line: 3131, baseType: !1028, size: 64, align: 64, offset: 7360)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1012, file: !14, line: 3132, baseType: !1028, size: 64, align: 64, offset: 7424)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1012, file: !14, line: 3139, baseType: !1273, size: 64, align: 64, offset: 7488)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1012, file: !14, line: 3147, baseType: !901, size: 32, align: 32, offset: 7552)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1012, file: !14, line: 3165, baseType: !901, size: 32, align: 32, offset: 7584)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1012, file: !14, line: 3172, baseType: !901, size: 32, align: 32, offset: 7616)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1012, file: !14, line: 3180, baseType: !901, size: 32, align: 32, offset: 7648)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1012, file: !14, line: 3191, baseType: !1186, size: 64, align: 64, offset: 7680)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1012, file: !14, line: 3199, baseType: !1036, size: 64, align: 64, offset: 7744)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1012, file: !14, line: 3207, baseType: !1273, size: 64, align: 64, offset: 7808)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1012, file: !14, line: 3214, baseType: !902, size: 32, align: 32, offset: 7872)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1012, file: !14, line: 3224, baseType: !1391, size: 64, align: 64, offset: 7936)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1394)
!1394 = !{!1395, !1396, !1397}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1393, file: !14, line: 1412, baseType: !1036, size: 64, align: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1393, file: !14, line: 1413, baseType: !901, size: 32, align: 32, offset: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1393, file: !14, line: 1414, baseType: !851, size: 32, align: 32, offset: 96)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1012, file: !14, line: 3225, baseType: !901, size: 32, align: 32, offset: 8000)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1012, file: !14, line: 3249, baseType: !1090, size: 64, align: 64, offset: 8064)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1012, file: !14, line: 3256, baseType: !901, size: 32, align: 32, offset: 8128)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1012, file: !14, line: 3271, baseType: !901, size: 32, align: 32, offset: 8160)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1012, file: !14, line: 3279, baseType: !1028, size: 64, align: 64, offset: 8192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1012, file: !14, line: 3301, baseType: !1090, size: 64, align: 64, offset: 8256)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1012, file: !14, line: 3310, baseType: !901, size: 32, align: 32, offset: 8320)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1012, file: !14, line: 3337, baseType: !901, size: 32, align: 32, offset: 8352)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1012, file: !14, line: 3351, baseType: !901, size: 32, align: 32, offset: 8384)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1012, file: !14, line: 3359, baseType: !901, size: 32, align: 32, offset: 8416)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !920, file: !14, line: 3535, baseType: !1409, size: 64, align: 64, offset: 1024)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{!901, !1010, !1412}
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !920, file: !14, line: 3541, baseType: !1415, size: 64, align: 64, offset: 1088)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1417)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1418)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !920, file: !14, line: 3549, baseType: !1420, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DISubroutineType(types: !1422)
!1422 = !{null, !1005}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !920, file: !14, line: 3551, baseType: !1007, size: 64, align: 64, offset: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !920, file: !14, line: 3552, baseType: !1425, size: 64, align: 64, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64, align: 64)
!1426 = !DISubroutineType(types: !1427)
!1427 = !{!901, !1010, !1036, !901, !1428}
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1430)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1435, !1436, !1463}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1430, file: !14, line: 3921, baseType: !899, size: 16, align: 16)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1430, file: !14, line: 3922, baseType: !908, size: 32, align: 32, offset: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1430, file: !14, line: 3923, baseType: !908, size: 32, align: 32, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1430, file: !14, line: 3924, baseType: !902, size: 32, align: 32, offset: 96)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1430, file: !14, line: 3925, baseType: !1437, size: 64, align: 64, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1453, !1457, !1459, !1460, !1461, !1462}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1440, file: !14, line: 3886, baseType: !901, size: 32, align: 32)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1440, file: !14, line: 3887, baseType: !901, size: 32, align: 32, offset: 32)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1440, file: !14, line: 3888, baseType: !901, size: 32, align: 32, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1440, file: !14, line: 3889, baseType: !901, size: 32, align: 32, offset: 96)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1440, file: !14, line: 3890, baseType: !901, size: 32, align: 32, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1440, file: !14, line: 3897, baseType: !1448, size: 768, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1450)
!1450 = !{!1451, !1452}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1449, file: !14, line: 3855, baseType: !1058, size: 512, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1449, file: !14, line: 3857, baseType: !1062, size: 256, align: 32, offset: 512)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1440, file: !14, line: 3903, baseType: !1454, size: 256, align: 64, offset: 960)
!1454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 256, align: 64, elements: !1455)
!1455 = !{!1456}
!1456 = !DISubrange(count: 4)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1440, file: !14, line: 3904, baseType: !1458, size: 128, align: 32, offset: 1216)
!1458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 128, align: 32, elements: !1455)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1440, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1440, file: !14, line: 3908, baseType: !1273, size: 64, align: 64, offset: 1408)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1440, file: !14, line: 3915, baseType: !1273, size: 64, align: 64, offset: 1472)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1440, file: !14, line: 3917, baseType: !901, size: 32, align: 32, offset: 1536)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1430, file: !14, line: 3926, baseType: !1028, size: 64, align: 64, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !920, file: !14, line: 3564, baseType: !1465, size: 64, align: 64, offset: 1344)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!901, !1010, !1468, !1052, !1149}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1470, file: !14, line: 1451, baseType: !1090, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1470, file: !14, line: 1461, baseType: !1028, size: 64, align: 64, offset: 64)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1470, file: !14, line: 1467, baseType: !1028, size: 64, align: 64, offset: 128)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1470, file: !14, line: 1468, baseType: !1036, size: 64, align: 64, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1470, file: !14, line: 1469, baseType: !901, size: 32, align: 32, offset: 256)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1470, file: !14, line: 1470, baseType: !901, size: 32, align: 32, offset: 288)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1470, file: !14, line: 1474, baseType: !901, size: 32, align: 32, offset: 320)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1470, file: !14, line: 1479, baseType: !1391, size: 64, align: 64, offset: 384)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1470, file: !14, line: 1480, baseType: !901, size: 32, align: 32, offset: 448)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1470, file: !14, line: 1486, baseType: !1028, size: 64, align: 64, offset: 512)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1470, file: !14, line: 1488, baseType: !1028, size: 64, align: 64, offset: 576)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1470, file: !14, line: 1497, baseType: !1028, size: 64, align: 64, offset: 640)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !920, file: !14, line: 3566, baseType: !1485, size: 64, align: 64, offset: 1408)
!1485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1486, size: 64, align: 64)
!1486 = !DISubroutineType(types: !1487)
!1487 = !{!901, !1010, !963, !1149, !1468}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !920, file: !14, line: 3567, baseType: !1007, size: 64, align: 64, offset: 1472)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !920, file: !14, line: 3576, baseType: !1490, size: 64, align: 64, offset: 1536)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DISubroutineType(types: !1492)
!1492 = !{!901, !1010, !1052}
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !920, file: !14, line: 3577, baseType: !1494, size: 64, align: 64, offset: 1600)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DISubroutineType(types: !1496)
!1496 = !{!901, !1010, !1468}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !920, file: !14, line: 3584, baseType: !1292, size: 64, align: 64, offset: 1664)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !920, file: !14, line: 3589, baseType: !1499, size: 64, align: 64, offset: 1728)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64, align: 64)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{null, !1010}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !920, file: !14, line: 3594, baseType: !901, size: 32, align: 32, offset: 1792)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !920, file: !14, line: 3600, baseType: !923, size: 64, align: 64, offset: 1856)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !920, file: !14, line: 3609, baseType: !1505, size: 64, align: 64, offset: 1920)
!1505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1506, size: 64, align: 64)
!1506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64, align: 64)
!1507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1508)
!1508 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1509 = distinct !DIGlobalVariable(name: "box_count", scope: !0, file: !918, line: 335, type: !1510, isLocal: true, isDefinition: true, variable: i64 4)
!1510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1511 = distinct !DIGlobalVariable(name: "box_types", scope: !0, file: !918, line: 328, type: !1512, isLocal: true, isDefinition: true, variable: [4 x %struct.Box]* @box_types)
!1512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1513, size: 768, align: 64, elements: !1455)
!1513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1514)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "Box", file: !918, line: 109, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 105, size: 192, align: 64, elements: !1516)
!1516 = !{!1517, !1518, !1519}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1515, file: !918, line: 106, baseType: !908, size: 32, align: 32)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "base_size", scope: !1515, file: !918, line: 107, baseType: !1143, size: 64, align: 64, offset: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1515, file: !918, line: 108, baseType: !1520, size: 64, align: 64, offset: 128)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!901, !888, !1523, !1468}
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovTextContext", file: !918, line: 103, baseType: !1525)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 88, size: 960, align: 64, elements: !1526)
!1526 = !{!1527, !1538, !1539, !1545, !1551, !1559, !1560, !1565, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !1525, file: !918, line: 89, baseType: !1528, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_typedef, name: "StyleBox", file: !918, line: 73, baseType: !1531)
!1531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 67, size: 64, align: 16, elements: !1532)
!1532 = !{!1533, !1534, !1535, !1536, !1537}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "style_start", scope: !1531, file: !918, line: 68, baseType: !899, size: 16, align: 16)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "style_end", scope: !1531, file: !918, line: 69, baseType: !899, size: 16, align: 16, offset: 16)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "style_flag", scope: !1531, file: !918, line: 70, baseType: !890, size: 8, align: 8, offset: 32)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize", scope: !1531, file: !918, line: 71, baseType: !890, size: 8, align: 8, offset: 40)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "style_fontID", scope: !1531, file: !918, line: 72, baseType: !899, size: 16, align: 16, offset: 48)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "s_temp", scope: !1525, file: !918, line: 90, baseType: !1529, size: 64, align: 64, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1525, file: !918, line: 91, baseType: !1540, size: 32, align: 16, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "HighlightBox", file: !918, line: 78, baseType: !1541)
!1541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 75, size: 32, align: 16, elements: !1542)
!1542 = !{!1543, !1544}
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "hlit_start", scope: !1541, file: !918, line: 76, baseType: !899, size: 16, align: 16)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "hlit_end", scope: !1541, file: !918, line: 77, baseType: !899, size: 16, align: 16, offset: 16)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !1525, file: !918, line: 92, baseType: !1546, size: 32, align: 8, offset: 160)
!1546 = !DIDerivedType(tag: DW_TAG_typedef, name: "HilightcolorBox", file: !918, line: 82, baseType: !1547)
!1547 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 80, size: 32, align: 8, elements: !1548)
!1548 = !{!1549}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "hlit_color", scope: !1547, file: !918, line: 81, baseType: !1550, size: 32, align: 8)
!1550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 32, align: 8, elements: !1455)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "ftab", scope: !1525, file: !918, line: 93, baseType: !1552, size: 64, align: 64, offset: 192)
!1552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1553, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DIDerivedType(tag: DW_TAG_typedef, name: "FontRecord", file: !918, line: 65, baseType: !1555)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 62, size: 128, align: 64, elements: !1556)
!1556 = !{!1557, !1558}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "fontID", scope: !1555, file: !918, line: 63, baseType: !899, size: 16, align: 16)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1555, file: !918, line: 64, baseType: !1273, size: 64, align: 64, offset: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "ftab_temp", scope: !1525, file: !918, line: 94, baseType: !1553, size: 64, align: 64, offset: 256)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1525, file: !918, line: 95, baseType: !1561, size: 8, align: 8, offset: 320)
!1561 = !DIDerivedType(tag: DW_TAG_typedef, name: "TextWrapBox", file: !918, line: 86, baseType: !1562)
!1562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 84, size: 8, align: 8, elements: !1563)
!1563 = !{!1564}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "wrap_flag", scope: !1562, file: !918, line: 85, baseType: !890, size: 8, align: 8)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !1525, file: !918, line: 96, baseType: !1566, size: 320, align: 64, offset: 384)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "MovTextDefault", file: !918, line: 60, baseType: !1567)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !918, line: 51, size: 320, align: 64, elements: !1568)
!1568 = !{!1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "font", scope: !1567, file: !918, line: 52, baseType: !1273, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "fontsize", scope: !1567, file: !918, line: 53, baseType: !901, size: 32, align: 32, offset: 64)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !1567, file: !918, line: 54, baseType: !901, size: 32, align: 32, offset: 96)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "back_color", scope: !1567, file: !918, line: 55, baseType: !901, size: 32, align: 32, offset: 128)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "bold", scope: !1567, file: !918, line: 56, baseType: !901, size: 32, align: 32, offset: 160)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "italic", scope: !1567, file: !918, line: 57, baseType: !901, size: 32, align: 32, offset: 192)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "underline", scope: !1567, file: !918, line: 58, baseType: !901, size: 32, align: 32, offset: 224)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1567, file: !918, line: 59, baseType: !901, size: 32, align: 32, offset: 256)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "box_flags", scope: !1525, file: !918, line: 97, baseType: !890, size: 8, align: 8, offset: 704)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "style_entries", scope: !1525, file: !918, line: 98, baseType: !899, size: 16, align: 16, offset: 720)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "ftab_entries", scope: !1525, file: !918, line: 98, baseType: !899, size: 16, align: 16, offset: 736)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "tracksize", scope: !1525, file: !918, line: 99, baseType: !914, size: 64, align: 64, offset: 768)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "size_var", scope: !1525, file: !918, line: 100, baseType: !901, size: 32, align: 32, offset: 832)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "count_s", scope: !1525, file: !918, line: 101, baseType: !901, size: 32, align: 32, offset: 864)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "count_f", scope: !1525, file: !918, line: 101, baseType: !901, size: 32, align: 32, offset: 896)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !1525, file: !918, line: 102, baseType: !901, size: 32, align: 32, offset: 928)
!1585 = !{i32 2, !"Dwarf Version", i32 4}
!1586 = !{i32 2, !"Debug Info Version", i32 3}
!1587 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1588 = distinct !DISubprogram(name: "mov_text_init", scope: !918, file: !918, line: 440, type: !1008, isLocal: true, isDefinition: true, scopeLine: 440, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1589)
!1589 = !{}
!1590 = !DILocalVariable(name: "avctx", arg: 1, scope: !1588, file: !918, line: 440, type: !1010)
!1591 = !DIExpression()
!1592 = !DILocation(line: 440, column: 42, scope: !1588)
!1593 = !DILocalVariable(name: "ret", scope: !1588, file: !918, line: 447, type: !901)
!1594 = !DILocation(line: 447, column: 9, scope: !1588)
!1595 = !DILocalVariable(name: "m", scope: !1588, file: !918, line: 448, type: !1523)
!1596 = !DILocation(line: 448, column: 21, scope: !1588)
!1597 = !DILocation(line: 448, column: 25, scope: !1588)
!1598 = !DILocation(line: 448, column: 32, scope: !1588)
!1599 = !DILocation(line: 449, column: 25, scope: !1588)
!1600 = !DILocation(line: 449, column: 32, scope: !1588)
!1601 = !DILocation(line: 449, column: 11, scope: !1588)
!1602 = !DILocation(line: 449, column: 9, scope: !1588)
!1603 = !DILocation(line: 450, column: 9, scope: !1604)
!1604 = distinct !DILexicalBlock(scope: !1588, file: !918, line: 450, column: 9)
!1605 = !DILocation(line: 450, column: 13, scope: !1604)
!1606 = !DILocation(line: 450, column: 9, scope: !1588)
!1607 = !DILocation(line: 451, column: 39, scope: !1608)
!1608 = distinct !DILexicalBlock(scope: !1604, file: !918, line: 450, column: 19)
!1609 = !DILocation(line: 451, column: 46, scope: !1608)
!1610 = !DILocation(line: 451, column: 49, scope: !1608)
!1611 = !DILocation(line: 451, column: 51, scope: !1608)
!1612 = !DILocation(line: 451, column: 57, scope: !1608)
!1613 = !DILocation(line: 451, column: 60, scope: !1608)
!1614 = !DILocation(line: 451, column: 62, scope: !1608)
!1615 = !DILocation(line: 451, column: 72, scope: !1608)
!1616 = !DILocation(line: 451, column: 75, scope: !1608)
!1617 = !DILocation(line: 451, column: 77, scope: !1608)
!1618 = !DILocation(line: 452, column: 33, scope: !1608)
!1619 = !DILocation(line: 452, column: 36, scope: !1608)
!1620 = !DILocation(line: 452, column: 38, scope: !1608)
!1621 = !DILocation(line: 452, column: 50, scope: !1608)
!1622 = !DILocation(line: 452, column: 53, scope: !1608)
!1623 = !DILocation(line: 452, column: 55, scope: !1608)
!1624 = !DILocation(line: 452, column: 61, scope: !1608)
!1625 = !DILocation(line: 452, column: 64, scope: !1608)
!1626 = !DILocation(line: 452, column: 66, scope: !1608)
!1627 = !DILocation(line: 453, column: 33, scope: !1608)
!1628 = !DILocation(line: 453, column: 36, scope: !1608)
!1629 = !DILocation(line: 453, column: 38, scope: !1608)
!1630 = !DILocation(line: 454, column: 33, scope: !1608)
!1631 = !DILocation(line: 454, column: 36, scope: !1608)
!1632 = !DILocation(line: 454, column: 38, scope: !1608)
!1633 = !DILocation(line: 451, column: 16, scope: !1608)
!1634 = !DILocation(line: 451, column: 9, scope: !1608)
!1635 = !DILocation(line: 456, column: 47, scope: !1604)
!1636 = !DILocation(line: 456, column: 16, scope: !1604)
!1637 = !DILocation(line: 456, column: 9, scope: !1604)
!1638 = !DILocation(line: 457, column: 1, scope: !1588)
!1639 = distinct !DISubprogram(name: "mov_text_decode_frame", scope: !918, file: !918, line: 459, type: !1486, isLocal: true, isDefinition: true, scopeLine: 461, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1589)
!1640 = !DILocalVariable(name: "x", arg: 1, scope: !1641, file: !1642, line: 66, type: !908)
!1641 = distinct !DISubprogram(name: "av_bswap32", scope: !1642, file: !1642, line: 66, type: !1643, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1589)
!1642 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1643 = !DISubroutineType(types: !1644)
!1644 = !{!908, !908}
!1645 = !DILocation(line: 66, column: 98, scope: !1641, inlinedAt: !1646)
!1646 = distinct !DILocation(line: 510, column: 25, scope: !1647)
!1647 = distinct !DILexicalBlock(scope: !1648, file: !918, line: 505, column: 49)
!1648 = distinct !DILexicalBlock(scope: !1649, file: !918, line: 504, column: 41)
!1649 = distinct !DILexicalBlock(scope: !1639, file: !918, line: 504, column: 9)
!1650 = !DILocation(line: 66, column: 98, scope: !1641, inlinedAt: !1651)
!1651 = distinct !DILocation(line: 508, column: 25, scope: !1647)
!1652 = !DILocalVariable(name: "x", arg: 1, scope: !1653, file: !1642, line: 58, type: !899)
!1653 = distinct !DISubprogram(name: "av_bswap16", scope: !1642, file: !1642, line: 58, type: !1654, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1589)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{!899, !899}
!1656 = !DILocation(line: 58, column: 98, scope: !1653, inlinedAt: !1657)
!1657 = distinct !DILocation(line: 491, column: 19, scope: !1639)
!1658 = !DILocation(line: 58, column: 98, scope: !1653, inlinedAt: !1659)
!1659 = distinct !DILocation(line: 484, column: 16, scope: !1660)
!1660 = distinct !DILexicalBlock(scope: !1639, file: !918, line: 483, column: 9)
!1661 = !DILocalVariable(name: "avctx", arg: 1, scope: !1639, file: !918, line: 459, type: !1010)
!1662 = !DILocation(line: 459, column: 50, scope: !1639)
!1663 = !DILocalVariable(name: "data", arg: 2, scope: !1639, file: !918, line: 460, type: !963)
!1664 = !DILocation(line: 460, column: 35, scope: !1639)
!1665 = !DILocalVariable(name: "got_sub_ptr", arg: 3, scope: !1639, file: !918, line: 460, type: !1149)
!1666 = !DILocation(line: 460, column: 46, scope: !1639)
!1667 = !DILocalVariable(name: "avpkt", arg: 4, scope: !1639, file: !918, line: 460, type: !1468)
!1668 = !DILocation(line: 460, column: 69, scope: !1639)
!1669 = !DILocalVariable(name: "sub", scope: !1639, file: !918, line: 462, type: !1670)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitle", file: !14, line: 3927, baseType: !1430)
!1672 = !DILocation(line: 462, column: 17, scope: !1639)
!1673 = !DILocation(line: 462, column: 23, scope: !1639)
!1674 = !DILocalVariable(name: "m", scope: !1639, file: !918, line: 463, type: !1523)
!1675 = !DILocation(line: 463, column: 21, scope: !1639)
!1676 = !DILocation(line: 463, column: 25, scope: !1639)
!1677 = !DILocation(line: 463, column: 32, scope: !1639)
!1678 = !DILocalVariable(name: "ret", scope: !1639, file: !918, line: 464, type: !901)
!1679 = !DILocation(line: 464, column: 9, scope: !1639)
!1680 = !DILocalVariable(name: "buf", scope: !1639, file: !918, line: 465, type: !1681)
!1681 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !1682, line: 82, baseType: !1683)
!1682 = !DIFile(filename: "./libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !1682, line: 82, size: 8192, align: 64, elements: !1684)
!1684 = !{!1685, !1686, !1687, !1688, !1689, !1693}
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1683, file: !1682, line: 82, baseType: !1273, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1683, file: !1682, line: 82, baseType: !902, size: 32, align: 32, offset: 64)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1683, file: !1682, line: 82, baseType: !902, size: 32, align: 32, offset: 96)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !1683, file: !1682, line: 82, baseType: !902, size: 32, align: 32, offset: 128)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !1683, file: !1682, line: 82, baseType: !1690, size: 8, align: 8, offset: 160)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 8, align: 8, elements: !1691)
!1691 = !{!1692}
!1692 = !DISubrange(count: 1)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !1683, file: !1682, line: 82, baseType: !1694, size: 8000, align: 8, offset: 168)
!1694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 8000, align: 8, elements: !1695)
!1695 = !{!1696}
!1696 = !DISubrange(count: 1000)
!1697 = !DILocation(line: 465, column: 14, scope: !1639)
!1698 = !DILocalVariable(name: "ptr", scope: !1639, file: !918, line: 466, type: !1273)
!1699 = !DILocation(line: 466, column: 11, scope: !1639)
!1700 = !DILocation(line: 466, column: 17, scope: !1639)
!1701 = !DILocation(line: 466, column: 24, scope: !1639)
!1702 = !DILocalVariable(name: "end", scope: !1639, file: !918, line: 467, type: !1273)
!1703 = !DILocation(line: 467, column: 11, scope: !1639)
!1704 = !DILocalVariable(name: "text_length", scope: !1639, file: !918, line: 468, type: !901)
!1705 = !DILocation(line: 468, column: 9, scope: !1639)
!1706 = !DILocalVariable(name: "tsmb_type", scope: !1639, file: !918, line: 468, type: !901)
!1707 = !DILocation(line: 468, column: 22, scope: !1639)
!1708 = !DILocalVariable(name: "ret_tsmb", scope: !1639, file: !918, line: 468, type: !901)
!1709 = !DILocation(line: 468, column: 33, scope: !1639)
!1710 = !DILocalVariable(name: "tsmb_size", scope: !1639, file: !918, line: 469, type: !914)
!1711 = !DILocation(line: 469, column: 14, scope: !1639)
!1712 = !DILocalVariable(name: "tsmb", scope: !1639, file: !918, line: 470, type: !888)
!1713 = !DILocation(line: 470, column: 20, scope: !1639)
!1714 = !DILocalVariable(name: "i", scope: !1639, file: !918, line: 471, type: !1143)
!1715 = !DILocation(line: 471, column: 12, scope: !1639)
!1716 = !DILocation(line: 473, column: 10, scope: !1717)
!1717 = distinct !DILexicalBlock(scope: !1639, file: !918, line: 473, column: 9)
!1718 = !DILocation(line: 473, column: 14, scope: !1717)
!1719 = !DILocation(line: 473, column: 17, scope: !1720)
!1720 = !DILexicalBlockFile(scope: !1717, file: !918, discriminator: 1)
!1721 = !DILocation(line: 473, column: 24, scope: !1720)
!1722 = !DILocation(line: 473, column: 29, scope: !1720)
!1723 = !DILocation(line: 473, column: 9, scope: !1720)
!1724 = !DILocation(line: 474, column: 9, scope: !1717)
!1725 = !DILocation(line: 483, column: 9, scope: !1660)
!1726 = !DILocation(line: 483, column: 16, scope: !1660)
