; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--speedhq.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--speedhq.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!887 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!888 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!889 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!894 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !895, line: 123, size: 32, align: 32, elements: !896)
!895 = !DIFile(filename: "libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!896 = !{!897, !898, !899, !900}
!897 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!898 = !DIEnumerator(name: "FMT_H261", value: 1)
!899 = !DIEnumerator(name: "FMT_H263", value: 2)
!900 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !902, line: 37, size: 32, align: 32, elements: !903)
!902 = !DIFile(filename: "libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!903 = !{!904, !905, !906, !907, !908, !909}
!904 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!905 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!906 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!907 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!908 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!909 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918}
!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !927, file: !926, line: 54, size: 32, align: 32, elements: !2600)
!926 = !DIFile(filename: "libavcodec/speedhq.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SHQContext", file: !926, line: 48, size: 4480, align: 64, elements: !928)
!928 = !{!929, !2589, !2590, !2591, !2592, !2593, !2594}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !927, file: !926, line: 49, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !933)
!933 = !{!934, !1021, !1022, !1023, !1292, !1293, !1294, !1295, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1448, !1452, !1453, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520, !2527, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543, !2544, !2545, !2546, !2547, !2548, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585, !2586, !2587, !2588}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !932, file: !14, line: 1561, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !939)
!939 = !{!940, !944, !949, !980, !981, !982, !983, !987, !993, !995, !999}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !938, file: !713, line: 72, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64, align: 64)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !938, file: !713, line: 78, baseType: !945, size: 64, align: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DISubroutineType(types: !947)
!947 = !{!941, !948}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !938, file: !713, line: 85, baseType: !950, size: 64, align: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !953)
!953 = !{!954, !955, !956, !958, !959, !976, !977, !978, !979}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !691, line: 247, baseType: !941, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !952, file: !691, line: 253, baseType: !941, size: 64, align: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !952, file: !691, line: 259, baseType: !957, size: 32, align: 32, offset: 128)
!957 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !952, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !952, file: !691, line: 271, baseType: !960, size: 64, align: 64, offset: 192)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !952, file: !691, line: 265, size: 64, align: 64, elements: !961)
!961 = !{!962, !966, !968, !969}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !960, file: !691, line: 266, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !964, line: 40, baseType: !965)
!964 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!965 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !960, file: !691, line: 267, baseType: !967, size: 64, align: 64)
!967 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !960, file: !691, line: 268, baseType: !941, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !960, file: !691, line: 270, baseType: !970, size: 64, align: 32)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !971, line: 61, baseType: !972)
!971 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !971, line: 58, size: 64, align: 32, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !972, file: !971, line: 59, baseType: !957, size: 32, align: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !972, file: !971, line: 60, baseType: !957, size: 32, align: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !952, file: !691, line: 272, baseType: !967, size: 64, align: 64, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !952, file: !691, line: 273, baseType: !967, size: 64, align: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !691, line: 275, baseType: !957, size: 32, align: 32, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !952, file: !691, line: 300, baseType: !941, size: 64, align: 64, offset: 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !938, file: !713, line: 93, baseType: !957, size: 32, align: 32, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !938, file: !713, line: 99, baseType: !957, size: 32, align: 32, offset: 224)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !938, file: !713, line: 108, baseType: !957, size: 32, align: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !938, file: !713, line: 113, baseType: !984, size: 64, align: 64, offset: 320)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!948, !948, !948}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !938, file: !713, line: 123, baseType: !988, size: 64, align: 64, offset: 384)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!991, !991}
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !938, file: !713, line: 130, baseType: !994, size: 32, align: 32, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !938, file: !713, line: 136, baseType: !996, size: 64, align: 64, offset: 512)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!994, !948}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !938, file: !713, line: 142, baseType: !1000, size: 64, align: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64, align: 64)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!957, !1003, !948, !941, !957}
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1006)
!1006 = !{!1007, !1019, !1020}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1005, file: !691, line: 360, baseType: !1008, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1017, !1018}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1011, file: !691, line: 307, baseType: !941, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1011, file: !691, line: 313, baseType: !967, size: 64, align: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1011, file: !691, line: 313, baseType: !967, size: 64, align: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1011, file: !691, line: 318, baseType: !967, size: 64, align: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1011, file: !691, line: 318, baseType: !967, size: 64, align: 64, offset: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1011, file: !691, line: 323, baseType: !957, size: 32, align: 32, offset: 320)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1005, file: !691, line: 364, baseType: !957, size: 32, align: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1005, file: !691, line: 368, baseType: !957, size: 32, align: 32, offset: 96)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !932, file: !14, line: 1562, baseType: !957, size: 32, align: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !932, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !932, file: !14, line: 1565, baseType: !1024, size: 64, align: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1036, !1039, !1042, !1045, !1050, !1053, !1054, !1062, !1063, !1064, !1066, !1070, !1076, !1087, !1091, !1092, !1142, !1263, !1267, !1268, !1272, !1276, !1281, !1285, !1286, !1287}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !14, line: 3475, baseType: !941, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1026, file: !14, line: 3480, baseType: !941, size: 64, align: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1026, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1026, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1026, file: !14, line: 3487, baseType: !957, size: 32, align: 32, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1026, file: !14, line: 3488, baseType: !1034, size: 64, align: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1026, file: !14, line: 3489, baseType: !1037, size: 64, align: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1026, file: !14, line: 3490, baseType: !1040, size: 64, align: 64, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1026, file: !14, line: 3491, baseType: !1043, size: 64, align: 64, offset: 448)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1026, file: !14, line: 3492, baseType: !1046, size: 64, align: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !964, line: 55, baseType: !1049)
!1049 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1026, file: !14, line: 3493, baseType: !1051, size: 8, align: 8, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !964, line: 48, baseType: !1052)
!1052 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1026, file: !14, line: 3494, baseType: !935, size: 64, align: 64, offset: 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1026, file: !14, line: 3495, baseType: !1055, size: 64, align: 64, offset: 704)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1058, file: !14, line: 3402, baseType: !957, size: 32, align: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1058, file: !14, line: 3403, baseType: !941, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1026, file: !14, line: 3507, baseType: !941, size: 64, align: 64, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1026, file: !14, line: 3516, baseType: !957, size: 32, align: 32, offset: 832)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1026, file: !14, line: 3517, baseType: !1065, size: 64, align: 64, offset: 896)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1026, file: !14, line: 3527, baseType: !1067, size: 64, align: 64, offset: 960)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!957, !930}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1026, file: !14, line: 3535, baseType: !1071, size: 64, align: 64, offset: 1024)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{!957, !930, !1074}
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1026, file: !14, line: 3541, baseType: !1077, size: 64, align: 64, offset: 1088)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1081, line: 223, size: 128, align: 64, elements: !1082)
!1081 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1082 = !{!1083, !1086}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1080, file: !1081, line: 224, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1080, file: !1081, line: 225, baseType: !1084, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1026, file: !14, line: 3549, baseType: !1088, size: 64, align: 64, offset: 1152)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !1065}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1026, file: !14, line: 3551, baseType: !1067, size: 64, align: 64, offset: 1216)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1026, file: !14, line: 3552, baseType: !1093, size: 64, align: 64, offset: 1280)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!957, !930, !1096, !957, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1100)
!1100 = !{!1101, !1104, !1107, !1108, !1109, !1141}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1099, file: !14, line: 3921, baseType: !1102, size: 16, align: 16)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !964, line: 49, baseType: !1103)
!1103 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1099, file: !14, line: 3922, baseType: !1105, size: 32, align: 32, offset: 32)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !964, line: 51, baseType: !1106)
!1106 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1099, file: !14, line: 3923, baseType: !1105, size: 32, align: 32, offset: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1099, file: !14, line: 3924, baseType: !1106, size: 32, align: 32, offset: 96)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1099, file: !14, line: 3925, baseType: !1110, size: 64, align: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64, align: 64)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1114)
!1114 = !{!1115, !1116, !1117, !1118, !1119, !1120, !1130, !1134, !1136, !1137, !1139, !1140}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1113, file: !14, line: 3886, baseType: !957, size: 32, align: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1113, file: !14, line: 3887, baseType: !957, size: 32, align: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1113, file: !14, line: 3888, baseType: !957, size: 32, align: 32, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1113, file: !14, line: 3889, baseType: !957, size: 32, align: 32, offset: 96)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1113, file: !14, line: 3890, baseType: !957, size: 32, align: 32, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1113, file: !14, line: 3897, baseType: !1121, size: 768, align: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1123)
!1123 = !{!1124, !1128}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1122, file: !14, line: 3855, baseType: !1125, size: 512, align: 64)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 512, align: 64, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 8)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1122, file: !14, line: 3857, baseType: !1129, size: 256, align: 32, offset: 512)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 256, align: 32, elements: !1126)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1113, file: !14, line: 3903, baseType: !1131, size: 256, align: 64, offset: 960)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1096, size: 256, align: 64, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 4)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1113, file: !14, line: 3904, baseType: !1135, size: 128, align: 32, offset: 1216)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 128, align: 32, elements: !1132)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1113, file: !14, line: 3906, baseType: !919, size: 32, align: 32, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1113, file: !14, line: 3908, baseType: !1138, size: 64, align: 64, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1113, file: !14, line: 3915, baseType: !1138, size: 64, align: 64, offset: 1472)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1113, file: !14, line: 3917, baseType: !957, size: 32, align: 32, offset: 1536)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1099, file: !14, line: 3926, baseType: !963, size: 64, align: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1026, file: !14, line: 3564, baseType: !1143, size: 64, align: 64, offset: 1344)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64, align: 64)
!1144 = !DISubroutineType(types: !1145)
!1145 = !{!957, !930, !1146, !1180, !1262}
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1149)
!1149 = !{!1150, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1176, !1177, !1178, !1179}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1148, file: !14, line: 1451, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1153, line: 94, baseType: !1154)
!1153 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1153, line: 81, size: 192, align: 64, elements: !1155)
!1155 = !{!1156, !1160, !1161}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1154, file: !1153, line: 82, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1153, line: 73, baseType: !1159)
!1159 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1153, line: 73, flags: DIFlagFwdDecl)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !1153, line: 89, baseType: !1096, size: 64, align: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1154, file: !1153, line: 93, baseType: !957, size: 32, align: 32, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1148, file: !14, line: 1461, baseType: !963, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1148, file: !14, line: 1467, baseType: !963, size: 64, align: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1148, file: !14, line: 1468, baseType: !1096, size: 64, align: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !14, line: 1469, baseType: !957, size: 32, align: 32, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1148, file: !14, line: 1470, baseType: !957, size: 32, align: 32, offset: 288)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !14, line: 1474, baseType: !957, size: 32, align: 32, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1148, file: !14, line: 1479, baseType: !1169, size: 64, align: 64, offset: 384)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1172)
!1172 = !{!1173, !1174, !1175}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1171, file: !14, line: 1412, baseType: !1096, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1171, file: !14, line: 1413, baseType: !957, size: 32, align: 32, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1171, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1148, file: !14, line: 1480, baseType: !957, size: 32, align: 32, offset: 448)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1148, file: !14, line: 1486, baseType: !963, size: 64, align: 64, offset: 512)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1148, file: !14, line: 1488, baseType: !963, size: 64, align: 64, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1148, file: !14, line: 1497, baseType: !963, size: 64, align: 64, offset: 640)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1214, !1216, !1217, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1250, !1251, !1252, !1253, !1254, !1255, !1258, !1259, !1260, !1261}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !744, line: 282, baseType: !1125, size: 512, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1183, file: !744, line: 299, baseType: !1129, size: 256, align: 32, offset: 512)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1183, file: !744, line: 315, baseType: !1188, size: 64, align: 64, offset: 768)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1183, file: !744, line: 326, baseType: !957, size: 32, align: 32, offset: 832)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1183, file: !744, line: 326, baseType: !957, size: 32, align: 32, offset: 864)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1183, file: !744, line: 334, baseType: !957, size: 32, align: 32, offset: 896)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1183, file: !744, line: 341, baseType: !957, size: 32, align: 32, offset: 928)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1183, file: !744, line: 346, baseType: !957, size: 32, align: 32, offset: 960)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1183, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1183, file: !744, line: 356, baseType: !970, size: 64, align: 32, offset: 1024)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1183, file: !744, line: 361, baseType: !963, size: 64, align: 64, offset: 1088)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1183, file: !744, line: 369, baseType: !963, size: 64, align: 64, offset: 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1183, file: !744, line: 377, baseType: !963, size: 64, align: 64, offset: 1216)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1183, file: !744, line: 382, baseType: !957, size: 32, align: 32, offset: 1280)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1183, file: !744, line: 386, baseType: !957, size: 32, align: 32, offset: 1312)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1183, file: !744, line: 391, baseType: !957, size: 32, align: 32, offset: 1344)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1183, file: !744, line: 396, baseType: !948, size: 64, align: 64, offset: 1408)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1183, file: !744, line: 403, baseType: !1204, size: 512, align: 64, offset: 1472)
!1204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 512, align: 64, elements: !1126)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1183, file: !744, line: 410, baseType: !957, size: 32, align: 32, offset: 1984)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1183, file: !744, line: 415, baseType: !957, size: 32, align: 32, offset: 2016)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1183, file: !744, line: 420, baseType: !957, size: 32, align: 32, offset: 2048)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1183, file: !744, line: 425, baseType: !957, size: 32, align: 32, offset: 2080)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1183, file: !744, line: 435, baseType: !963, size: 64, align: 64, offset: 2112)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1183, file: !744, line: 440, baseType: !957, size: 32, align: 32, offset: 2176)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1183, file: !744, line: 445, baseType: !1048, size: 64, align: 64, offset: 2240)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1183, file: !744, line: 459, baseType: !1213, size: 512, align: 64, offset: 2304)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 512, align: 64, elements: !1126)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1183, file: !744, line: 473, baseType: !1215, size: 64, align: 64, offset: 2816)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1183, file: !744, line: 477, baseType: !957, size: 32, align: 32, offset: 2880)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1183, file: !744, line: 479, baseType: !1218, size: 64, align: 64, offset: 2944)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1226, !1231}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1221, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !744, line: 203, baseType: !1096, size: 64, align: 64, offset: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !744, line: 204, baseType: !957, size: 32, align: 32, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1221, file: !744, line: 205, baseType: !1227, size: 64, align: 64, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1229, line: 86, baseType: !1230)
!1229 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1229, line: 86, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1221, file: !744, line: 206, baseType: !1151, size: 64, align: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1183, file: !744, line: 480, baseType: !957, size: 32, align: 32, offset: 3008)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1183, file: !744, line: 505, baseType: !957, size: 32, align: 32, offset: 3040)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1183, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1183, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1183, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1183, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1183, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1183, file: !744, line: 532, baseType: !963, size: 64, align: 64, offset: 3264)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1183, file: !744, line: 539, baseType: !963, size: 64, align: 64, offset: 3328)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1183, file: !744, line: 547, baseType: !963, size: 64, align: 64, offset: 3392)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1183, file: !744, line: 554, baseType: !1227, size: 64, align: 64, offset: 3456)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1183, file: !744, line: 563, baseType: !957, size: 32, align: 32, offset: 3520)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1183, file: !744, line: 572, baseType: !957, size: 32, align: 32, offset: 3552)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1183, file: !744, line: 581, baseType: !957, size: 32, align: 32, offset: 3584)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1183, file: !744, line: 588, baseType: !1247, size: 64, align: 64, offset: 3648)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !964, line: 36, baseType: !1249)
!1249 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1183, file: !744, line: 593, baseType: !957, size: 32, align: 32, offset: 3712)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1183, file: !744, line: 596, baseType: !957, size: 32, align: 32, offset: 3744)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1183, file: !744, line: 599, baseType: !1151, size: 64, align: 64, offset: 3776)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1183, file: !744, line: 605, baseType: !1151, size: 64, align: 64, offset: 3840)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1183, file: !744, line: 616, baseType: !1151, size: 64, align: 64, offset: 3904)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1183, file: !744, line: 626, baseType: !1256, size: 64, align: 64, offset: 3968)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1257, line: 216, baseType: !1049)
!1257 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1183, file: !744, line: 627, baseType: !1256, size: 64, align: 64, offset: 4032)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1183, file: !744, line: 628, baseType: !1256, size: 64, align: 64, offset: 4096)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1183, file: !744, line: 629, baseType: !1256, size: 64, align: 64, offset: 4160)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1183, file: !744, line: 645, baseType: !1151, size: 64, align: 64, offset: 4224)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1026, file: !14, line: 3566, baseType: !1264, size: 64, align: 64, offset: 1408)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!957, !930, !948, !1262, !1146}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1026, file: !14, line: 3567, baseType: !1067, size: 64, align: 64, offset: 1472)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1026, file: !14, line: 3576, baseType: !1269, size: 64, align: 64, offset: 1536)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{!957, !930, !1180}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1026, file: !14, line: 3577, baseType: !1273, size: 64, align: 64, offset: 1600)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64, align: 64)
!1274 = !DISubroutineType(types: !1275)
!1275 = !{!957, !930, !1146}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1026, file: !14, line: 3584, baseType: !1277, size: 64, align: 64, offset: 1664)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DISubroutineType(types: !1279)
!1279 = !{!957, !930, !1280}
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1026, file: !14, line: 3589, baseType: !1282, size: 64, align: 64, offset: 1728)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{null, !930}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1026, file: !14, line: 3594, baseType: !957, size: 32, align: 32, offset: 1792)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1026, file: !14, line: 3600, baseType: !941, size: 64, align: 64, offset: 1856)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1026, file: !14, line: 3609, baseType: !1288, size: 64, align: 64, offset: 1920)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64, align: 64)
!1290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1291)
!1291 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !932, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !932, file: !14, line: 1581, baseType: !1106, size: 32, align: 32, offset: 224)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !932, file: !14, line: 1583, baseType: !948, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !932, file: !14, line: 1591, baseType: !1296, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1081, line: 129, size: 1664, align: 64, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1302, !1303, !1321, !1322, !1328, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1297, file: !1081, line: 136, baseType: !957, size: 32, align: 32)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1297, file: !1081, line: 151, baseType: !957, size: 32, align: 32, offset: 32)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1297, file: !1081, line: 157, baseType: !957, size: 32, align: 32, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1297, file: !1081, line: 159, baseType: !1280, size: 64, align: 64, offset: 128)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1297, file: !1081, line: 161, baseType: !1304, size: 64, align: 64, offset: 192)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1081, line: 117, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1081, line: 100, size: 832, align: 64, elements: !1307)
!1307 = !{!1308, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1306, file: !1081, line: 105, baseType: !1309, size: 256, align: 64)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1310, size: 256, align: 64, elements: !1132)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1153, line: 238, baseType: !1312)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1153, line: 238, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1306, file: !1081, line: 110, baseType: !957, size: 32, align: 32, offset: 256)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1306, file: !1081, line: 111, baseType: !957, size: 32, align: 32, offset: 288)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1306, file: !1081, line: 111, baseType: !957, size: 32, align: 32, offset: 320)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1306, file: !1081, line: 112, baseType: !1129, size: 256, align: 32, offset: 352)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1306, file: !1081, line: 113, baseType: !1135, size: 128, align: 32, offset: 608)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1306, file: !1081, line: 114, baseType: !957, size: 32, align: 32, offset: 736)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1306, file: !1081, line: 115, baseType: !957, size: 32, align: 32, offset: 768)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1306, file: !1081, line: 116, baseType: !957, size: 32, align: 32, offset: 800)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1297, file: !1081, line: 163, baseType: !948, size: 64, align: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1297, file: !1081, line: 165, baseType: !1323, size: 128, align: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1081, line: 122, baseType: !1324)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1081, line: 119, size: 128, align: 64, elements: !1325)
!1325 = !{!1326, !1327}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1324, file: !1081, line: 120, baseType: !1146, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1324, file: !1081, line: 121, baseType: !1280, size: 64, align: 64, offset: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1297, file: !1081, line: 166, baseType: !1329, size: 128, align: 64, offset: 448)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1081, line: 127, baseType: !1330)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1081, line: 124, size: 128, align: 64, elements: !1331)
!1331 = !{!1332, !1405}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1330, file: !1081, line: 125, baseType: !1333, size: 64, align: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1337)
!1337 = !{!1338, !1339, !1363, !1367, !1368, !1402, !1403, !1404}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1336, file: !14, line: 5751, baseType: !935, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1336, file: !14, line: 5756, baseType: !1340, size: 64, align: 64, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1342)
!1342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1343)
!1343 = !{!1344, !1345, !1348, !1349, !1350, !1354, !1358, !1362}
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1342, file: !14, line: 5797, baseType: !941, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1342, file: !14, line: 5804, baseType: !1346, size: 64, align: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1342, file: !14, line: 5815, baseType: !935, size: 64, align: 64, offset: 128)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1342, file: !14, line: 5825, baseType: !957, size: 32, align: 32, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1342, file: !14, line: 5826, baseType: !1351, size: 64, align: 64, offset: 256)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!957, !1334}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1342, file: !14, line: 5827, baseType: !1355, size: 64, align: 64, offset: 320)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!957, !1334, !1146}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1342, file: !14, line: 5828, baseType: !1359, size: 64, align: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{null, !1334}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1342, file: !14, line: 5829, baseType: !1359, size: 64, align: 64, offset: 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1336, file: !14, line: 5762, baseType: !1364, size: 64, align: 64, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1366)
!1366 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1336, file: !14, line: 5768, baseType: !948, size: 64, align: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1336, file: !14, line: 5775, baseType: !1369, size: 64, align: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64, align: 64)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1371)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1372)
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1371, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1371, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1371, file: !14, line: 3948, baseType: !1105, size: 32, align: 32, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1371, file: !14, line: 3958, baseType: !1096, size: 64, align: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1371, file: !14, line: 3962, baseType: !957, size: 32, align: 32, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1371, file: !14, line: 3968, baseType: !957, size: 32, align: 32, offset: 224)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1371, file: !14, line: 3973, baseType: !963, size: 64, align: 64, offset: 256)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1371, file: !14, line: 3986, baseType: !957, size: 32, align: 32, offset: 320)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1371, file: !14, line: 3999, baseType: !957, size: 32, align: 32, offset: 352)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1371, file: !14, line: 4004, baseType: !957, size: 32, align: 32, offset: 384)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1371, file: !14, line: 4005, baseType: !957, size: 32, align: 32, offset: 416)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1371, file: !14, line: 4010, baseType: !957, size: 32, align: 32, offset: 448)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1371, file: !14, line: 4011, baseType: !957, size: 32, align: 32, offset: 480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1371, file: !14, line: 4020, baseType: !970, size: 64, align: 32, offset: 512)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1371, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1371, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1371, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1371, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1371, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1371, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1371, file: !14, line: 4039, baseType: !957, size: 32, align: 32, offset: 768)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1371, file: !14, line: 4046, baseType: !1048, size: 64, align: 64, offset: 832)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1371, file: !14, line: 4050, baseType: !957, size: 32, align: 32, offset: 896)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1371, file: !14, line: 4054, baseType: !957, size: 32, align: 32, offset: 928)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1371, file: !14, line: 4061, baseType: !957, size: 32, align: 32, offset: 960)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1371, file: !14, line: 4065, baseType: !957, size: 32, align: 32, offset: 992)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1371, file: !14, line: 4073, baseType: !957, size: 32, align: 32, offset: 1024)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1371, file: !14, line: 4080, baseType: !957, size: 32, align: 32, offset: 1056)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1371, file: !14, line: 4084, baseType: !957, size: 32, align: 32, offset: 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1336, file: !14, line: 5781, baseType: !1369, size: 64, align: 64, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1336, file: !14, line: 5787, baseType: !970, size: 64, align: 32, offset: 384)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1336, file: !14, line: 5793, baseType: !970, size: 64, align: 32, offset: 448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1330, file: !1081, line: 126, baseType: !957, size: 32, align: 32, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1297, file: !1081, line: 172, baseType: !1146, size: 64, align: 64, offset: 576)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1297, file: !1081, line: 177, baseType: !1096, size: 64, align: 64, offset: 640)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1297, file: !1081, line: 178, baseType: !1106, size: 32, align: 32, offset: 704)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1297, file: !1081, line: 180, baseType: !948, size: 64, align: 64, offset: 768)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1297, file: !1081, line: 185, baseType: !957, size: 32, align: 32, offset: 832)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1297, file: !1081, line: 190, baseType: !948, size: 64, align: 64, offset: 896)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1297, file: !1081, line: 195, baseType: !957, size: 32, align: 32, offset: 960)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1297, file: !1081, line: 200, baseType: !1146, size: 64, align: 64, offset: 1024)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1297, file: !1081, line: 201, baseType: !957, size: 32, align: 32, offset: 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1297, file: !1081, line: 202, baseType: !1280, size: 64, align: 64, offset: 1152)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1297, file: !1081, line: 203, baseType: !957, size: 32, align: 32, offset: 1216)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1297, file: !1081, line: 205, baseType: !957, size: 32, align: 32, offset: 1248)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1297, file: !1081, line: 206, baseType: !957, size: 32, align: 32, offset: 1280)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1297, file: !1081, line: 209, baseType: !1256, size: 64, align: 64, offset: 1344)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1297, file: !1081, line: 212, baseType: !1256, size: 64, align: 64, offset: 1408)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1297, file: !1081, line: 213, baseType: !1280, size: 64, align: 64, offset: 1472)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1297, file: !1081, line: 215, baseType: !957, size: 32, align: 32, offset: 1536)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1297, file: !1081, line: 217, baseType: !957, size: 32, align: 32, offset: 1568)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1297, file: !1081, line: 220, baseType: !957, size: 32, align: 32, offset: 1600)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !932, file: !14, line: 1598, baseType: !948, size: 64, align: 64, offset: 384)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !932, file: !14, line: 1606, baseType: !963, size: 64, align: 64, offset: 448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !932, file: !14, line: 1614, baseType: !957, size: 32, align: 32, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !932, file: !14, line: 1622, baseType: !957, size: 32, align: 32, offset: 544)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !932, file: !14, line: 1628, baseType: !957, size: 32, align: 32, offset: 576)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !932, file: !14, line: 1636, baseType: !957, size: 32, align: 32, offset: 608)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !932, file: !14, line: 1643, baseType: !957, size: 32, align: 32, offset: 640)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !932, file: !14, line: 1657, baseType: !1096, size: 64, align: 64, offset: 704)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !932, file: !14, line: 1658, baseType: !957, size: 32, align: 32, offset: 768)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !932, file: !14, line: 1679, baseType: !970, size: 64, align: 32, offset: 800)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !932, file: !14, line: 1688, baseType: !957, size: 32, align: 32, offset: 864)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !932, file: !14, line: 1712, baseType: !957, size: 32, align: 32, offset: 896)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !932, file: !14, line: 1729, baseType: !957, size: 32, align: 32, offset: 928)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !932, file: !14, line: 1729, baseType: !957, size: 32, align: 32, offset: 960)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !932, file: !14, line: 1744, baseType: !957, size: 32, align: 32, offset: 992)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !932, file: !14, line: 1744, baseType: !957, size: 32, align: 32, offset: 1024)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !932, file: !14, line: 1751, baseType: !957, size: 32, align: 32, offset: 1056)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !932, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !932, file: !14, line: 1791, baseType: !1444, size: 64, align: 64, offset: 1152)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{null, !1447, !1180, !1262, !957, !957, !957}
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !932, file: !14, line: 1808, baseType: !1449, size: 64, align: 64, offset: 1216)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!473, !1447, !1037}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !932, file: !14, line: 1816, baseType: !957, size: 32, align: 32, offset: 1280)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !932, file: !14, line: 1825, baseType: !1454, size: 32, align: 32, offset: 1312)
!1454 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !932, file: !14, line: 1830, baseType: !957, size: 32, align: 32, offset: 1344)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !932, file: !14, line: 1838, baseType: !1454, size: 32, align: 32, offset: 1376)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !932, file: !14, line: 1846, baseType: !957, size: 32, align: 32, offset: 1408)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !932, file: !14, line: 1851, baseType: !957, size: 32, align: 32, offset: 1440)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !932, file: !14, line: 1861, baseType: !1454, size: 32, align: 32, offset: 1472)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !932, file: !14, line: 1868, baseType: !1454, size: 32, align: 32, offset: 1504)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !932, file: !14, line: 1875, baseType: !1454, size: 32, align: 32, offset: 1536)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !932, file: !14, line: 1882, baseType: !1454, size: 32, align: 32, offset: 1568)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !932, file: !14, line: 1889, baseType: !1454, size: 32, align: 32, offset: 1600)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !932, file: !14, line: 1896, baseType: !1454, size: 32, align: 32, offset: 1632)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !932, file: !14, line: 1903, baseType: !1454, size: 32, align: 32, offset: 1664)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !932, file: !14, line: 1910, baseType: !957, size: 32, align: 32, offset: 1696)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !932, file: !14, line: 1915, baseType: !957, size: 32, align: 32, offset: 1728)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !932, file: !14, line: 1926, baseType: !1262, size: 64, align: 64, offset: 1792)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !932, file: !14, line: 1935, baseType: !970, size: 64, align: 32, offset: 1856)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !932, file: !14, line: 1942, baseType: !957, size: 32, align: 32, offset: 1920)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !932, file: !14, line: 1948, baseType: !957, size: 32, align: 32, offset: 1952)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !932, file: !14, line: 1954, baseType: !957, size: 32, align: 32, offset: 1984)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !932, file: !14, line: 1960, baseType: !957, size: 32, align: 32, offset: 2016)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !932, file: !14, line: 1984, baseType: !957, size: 32, align: 32, offset: 2048)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !932, file: !14, line: 1991, baseType: !957, size: 32, align: 32, offset: 2080)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !932, file: !14, line: 1996, baseType: !957, size: 32, align: 32, offset: 2112)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !932, file: !14, line: 2004, baseType: !957, size: 32, align: 32, offset: 2144)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !932, file: !14, line: 2011, baseType: !957, size: 32, align: 32, offset: 2176)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !932, file: !14, line: 2018, baseType: !957, size: 32, align: 32, offset: 2208)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !932, file: !14, line: 2027, baseType: !957, size: 32, align: 32, offset: 2240)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !932, file: !14, line: 2034, baseType: !957, size: 32, align: 32, offset: 2272)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !932, file: !14, line: 2044, baseType: !957, size: 32, align: 32, offset: 2304)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !932, file: !14, line: 2054, baseType: !1484, size: 64, align: 64, offset: 2368)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !932, file: !14, line: 2061, baseType: !1484, size: 64, align: 64, offset: 2432)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !932, file: !14, line: 2066, baseType: !957, size: 32, align: 32, offset: 2496)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !932, file: !14, line: 2070, baseType: !957, size: 32, align: 32, offset: 2528)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !932, file: !14, line: 2078, baseType: !957, size: 32, align: 32, offset: 2560)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !932, file: !14, line: 2085, baseType: !957, size: 32, align: 32, offset: 2592)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !932, file: !14, line: 2092, baseType: !957, size: 32, align: 32, offset: 2624)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !932, file: !14, line: 2099, baseType: !957, size: 32, align: 32, offset: 2656)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !932, file: !14, line: 2106, baseType: !957, size: 32, align: 32, offset: 2688)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !932, file: !14, line: 2113, baseType: !957, size: 32, align: 32, offset: 2720)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !932, file: !14, line: 2120, baseType: !957, size: 32, align: 32, offset: 2752)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !932, file: !14, line: 2125, baseType: !957, size: 32, align: 32, offset: 2784)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !932, file: !14, line: 2133, baseType: !957, size: 32, align: 32, offset: 2816)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !932, file: !14, line: 2140, baseType: !957, size: 32, align: 32, offset: 2848)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !932, file: !14, line: 2145, baseType: !957, size: 32, align: 32, offset: 2880)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !932, file: !14, line: 2153, baseType: !957, size: 32, align: 32, offset: 2912)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !932, file: !14, line: 2158, baseType: !957, size: 32, align: 32, offset: 2944)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !932, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !932, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !932, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !932, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !932, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !932, file: !14, line: 2203, baseType: !957, size: 32, align: 32, offset: 3136)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !932, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !932, file: !14, line: 2212, baseType: !957, size: 32, align: 32, offset: 3200)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !932, file: !14, line: 2213, baseType: !957, size: 32, align: 32, offset: 3232)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !932, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !932, file: !14, line: 2232, baseType: !957, size: 32, align: 32, offset: 3296)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !932, file: !14, line: 2243, baseType: !957, size: 32, align: 32, offset: 3328)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !932, file: !14, line: 2249, baseType: !957, size: 32, align: 32, offset: 3360)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !932, file: !14, line: 2256, baseType: !957, size: 32, align: 32, offset: 3392)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !932, file: !14, line: 2263, baseType: !1048, size: 64, align: 64, offset: 3456)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !932, file: !14, line: 2270, baseType: !1048, size: 64, align: 64, offset: 3520)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !932, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !932, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !932, file: !14, line: 2367, baseType: !1520, size: 64, align: 64, offset: 3648)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!957, !1447, !1280, !957}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !932, file: !14, line: 2383, baseType: !957, size: 32, align: 32, offset: 3712)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !932, file: !14, line: 2386, baseType: !1454, size: 32, align: 32, offset: 3744)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !932, file: !14, line: 2387, baseType: !1454, size: 32, align: 32, offset: 3776)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !932, file: !14, line: 2394, baseType: !957, size: 32, align: 32, offset: 3808)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !932, file: !14, line: 2401, baseType: !957, size: 32, align: 32, offset: 3840)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !932, file: !14, line: 2408, baseType: !957, size: 32, align: 32, offset: 3872)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !932, file: !14, line: 2415, baseType: !957, size: 32, align: 32, offset: 3904)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !932, file: !14, line: 2422, baseType: !957, size: 32, align: 32, offset: 3936)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !932, file: !14, line: 2423, baseType: !1532, size: 64, align: 64, offset: 3968)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1535)
!1535 = !{!1536, !1537, !1538, !1539}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1534, file: !14, line: 827, baseType: !957, size: 32, align: 32)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1534, file: !14, line: 828, baseType: !957, size: 32, align: 32, offset: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1534, file: !14, line: 829, baseType: !957, size: 32, align: 32, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1534, file: !14, line: 830, baseType: !1454, size: 32, align: 32, offset: 96)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !932, file: !14, line: 2430, baseType: !963, size: 64, align: 64, offset: 4032)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !932, file: !14, line: 2437, baseType: !963, size: 64, align: 64, offset: 4096)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !932, file: !14, line: 2444, baseType: !1454, size: 32, align: 32, offset: 4160)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !932, file: !14, line: 2451, baseType: !1454, size: 32, align: 32, offset: 4192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !932, file: !14, line: 2458, baseType: !957, size: 32, align: 32, offset: 4224)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !932, file: !14, line: 2469, baseType: !957, size: 32, align: 32, offset: 4256)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !932, file: !14, line: 2475, baseType: !957, size: 32, align: 32, offset: 4288)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !932, file: !14, line: 2481, baseType: !957, size: 32, align: 32, offset: 4320)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !932, file: !14, line: 2485, baseType: !957, size: 32, align: 32, offset: 4352)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !932, file: !14, line: 2489, baseType: !957, size: 32, align: 32, offset: 4384)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !932, file: !14, line: 2493, baseType: !957, size: 32, align: 32, offset: 4416)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !932, file: !14, line: 2501, baseType: !957, size: 32, align: 32, offset: 4448)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !932, file: !14, line: 2506, baseType: !957, size: 32, align: 32, offset: 4480)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !932, file: !14, line: 2510, baseType: !957, size: 32, align: 32, offset: 4512)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !932, file: !14, line: 2514, baseType: !963, size: 64, align: 64, offset: 4544)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !932, file: !14, line: 2528, baseType: !1556, size: 64, align: 64, offset: 4608)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{null, !1447, !948, !957, !957}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !932, file: !14, line: 2534, baseType: !957, size: 32, align: 32, offset: 4672)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !932, file: !14, line: 2545, baseType: !957, size: 32, align: 32, offset: 4704)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !932, file: !14, line: 2547, baseType: !957, size: 32, align: 32, offset: 4736)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !932, file: !14, line: 2549, baseType: !957, size: 32, align: 32, offset: 4768)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !932, file: !14, line: 2551, baseType: !957, size: 32, align: 32, offset: 4800)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !932, file: !14, line: 2553, baseType: !957, size: 32, align: 32, offset: 4832)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !932, file: !14, line: 2555, baseType: !957, size: 32, align: 32, offset: 4864)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !932, file: !14, line: 2557, baseType: !957, size: 32, align: 32, offset: 4896)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !932, file: !14, line: 2559, baseType: !957, size: 32, align: 32, offset: 4928)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !932, file: !14, line: 2563, baseType: !957, size: 32, align: 32, offset: 4960)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !932, file: !14, line: 2571, baseType: !1138, size: 64, align: 64, offset: 4992)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !932, file: !14, line: 2579, baseType: !1138, size: 64, align: 64, offset: 5056)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !932, file: !14, line: 2586, baseType: !957, size: 32, align: 32, offset: 5120)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !932, file: !14, line: 2615, baseType: !957, size: 32, align: 32, offset: 5152)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !932, file: !14, line: 2627, baseType: !957, size: 32, align: 32, offset: 5184)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !932, file: !14, line: 2637, baseType: !957, size: 32, align: 32, offset: 5216)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !932, file: !14, line: 2681, baseType: !957, size: 32, align: 32, offset: 5248)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !932, file: !14, line: 2709, baseType: !963, size: 64, align: 64, offset: 5312)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !932, file: !14, line: 2716, baseType: !1578, size: 64, align: 64, offset: 5376)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585, !1586, !1587, !1588, !1592, !1596, !1597, !1598, !1599, !2500, !2501, !2502, !2503, !2504}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1580, file: !14, line: 3642, baseType: !941, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1580, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1580, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1580, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1580, file: !14, line: 3669, baseType: !957, size: 32, align: 32, offset: 160)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1580, file: !14, line: 3682, baseType: !1277, size: 64, align: 64, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1580, file: !14, line: 3698, baseType: !1589, size: 64, align: 64, offset: 256)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{!957, !930, !1084, !1105}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1580, file: !14, line: 3712, baseType: !1593, size: 64, align: 64, offset: 320)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!957, !930, !957, !1084, !1105}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1580, file: !14, line: 3726, baseType: !1589, size: 64, align: 64, offset: 384)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1580, file: !14, line: 3737, baseType: !1067, size: 64, align: 64, offset: 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1580, file: !14, line: 3746, baseType: !957, size: 32, align: 32, offset: 512)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1580, file: !14, line: 3757, baseType: !1600, size: 64, align: 64, offset: 576)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1603}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1605, line: 81, size: 86208, align: 64, elements: !1606)
!1605 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1606 = !{!1607, !1609, !1610, !1611, !1612, !1616, !1617, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1664, !1665, !1720, !1722, !1723, !1724, !1725, !1726, !1737, !1738, !1739, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1755, !1757, !1759, !1760, !1761, !1762, !1763, !1764, !1769, !1771, !1772, !1773, !1774, !1775, !1776, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1803, !1804, !1805, !1806, !1822, !1829, !1841, !1857, !1879, !1919, !1932, !1959, !1974, !1988, !2001, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2022, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2035, !2037, !2038, !2039, !2040, !2041, !2042, !2045, !2047, !2049, !2050, !2053, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2120, !2121, !2123, !2124, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2146, !2147, !2148, !2151, !2152, !2153, !2154, !2156, !2158, !2159, !2160, !2161, !2162, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2244, !2245, !2246, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2375, !2376, !2377, !2378, !2382, !2383, !2387, !2391, !2395, !2396, !2401, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2416, !2417, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432, !2433, !2435, !2436, !2437, !2487, !2488, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1604, file: !1605, line: 82, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1604, file: !1605, line: 84, baseType: !957, size: 32, align: 32, offset: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1604, file: !1605, line: 84, baseType: !957, size: 32, align: 32, offset: 96)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1604, file: !1605, line: 85, baseType: !957, size: 32, align: 32, offset: 128)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1604, file: !1605, line: 86, baseType: !1613, size: 384, align: 32, offset: 160)
!1613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 384, align: 32, elements: !1614)
!1614 = !{!1615}
!1615 = !DISubrange(count: 12)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1604, file: !1605, line: 87, baseType: !957, size: 32, align: 32, offset: 544)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1604, file: !1605, line: 90, baseType: !1618, size: 1088, align: 64, offset: 576)
!1618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1619)
!1619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1620)
!1620 = !{!1621, !1622, !1626}
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1619, file: !902, line: 32, baseType: !1084, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1619, file: !902, line: 33, baseType: !1623, size: 512, align: 8, offset: 64)
!1623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 512, align: 8, elements: !1624)
!1624 = !{!1625}
!1625 = !DISubrange(count: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1619, file: !902, line: 34, baseType: !1623, size: 512, align: 8, offset: 576)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1604, file: !1605, line: 91, baseType: !1618, size: 1088, align: 64, offset: 1664)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1604, file: !1605, line: 92, baseType: !1618, size: 1088, align: 64, offset: 2752)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1604, file: !1605, line: 93, baseType: !1618, size: 1088, align: 64, offset: 3840)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1604, file: !1605, line: 98, baseType: !1447, size: 64, align: 64, offset: 4928)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1604, file: !1605, line: 100, baseType: !957, size: 32, align: 32, offset: 4992)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1604, file: !1605, line: 100, baseType: !957, size: 32, align: 32, offset: 5024)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1604, file: !1605, line: 101, baseType: !957, size: 32, align: 32, offset: 5056)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1604, file: !1605, line: 102, baseType: !957, size: 32, align: 32, offset: 5088)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1604, file: !1605, line: 103, baseType: !963, size: 64, align: 64, offset: 5120)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1604, file: !1605, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1604, file: !1605, line: 105, baseType: !957, size: 32, align: 32, offset: 5216)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1604, file: !1605, line: 106, baseType: !957, size: 32, align: 32, offset: 5248)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1604, file: !1605, line: 109, baseType: !957, size: 32, align: 32, offset: 5280)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1604, file: !1605, line: 110, baseType: !957, size: 32, align: 32, offset: 5312)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1604, file: !1605, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1604, file: !1605, line: 113, baseType: !957, size: 32, align: 32, offset: 5376)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1604, file: !1605, line: 114, baseType: !957, size: 32, align: 32, offset: 5408)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1604, file: !1605, line: 115, baseType: !957, size: 32, align: 32, offset: 5440)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1604, file: !1605, line: 116, baseType: !957, size: 32, align: 32, offset: 5472)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1604, file: !1605, line: 117, baseType: !957, size: 32, align: 32, offset: 5504)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1604, file: !1605, line: 118, baseType: !957, size: 32, align: 32, offset: 5536)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1604, file: !1605, line: 119, baseType: !957, size: 32, align: 32, offset: 5568)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1604, file: !1605, line: 120, baseType: !957, size: 32, align: 32, offset: 5600)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1604, file: !1605, line: 124, baseType: !957, size: 32, align: 32, offset: 5632)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1604, file: !1605, line: 125, baseType: !957, size: 32, align: 32, offset: 5664)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1604, file: !1605, line: 126, baseType: !957, size: 32, align: 32, offset: 5696)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1604, file: !1605, line: 127, baseType: !957, size: 32, align: 32, offset: 5728)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1604, file: !1605, line: 128, baseType: !957, size: 32, align: 32, offset: 5760)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1604, file: !1605, line: 129, baseType: !957, size: 32, align: 32, offset: 5792)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1604, file: !1605, line: 129, baseType: !957, size: 32, align: 32, offset: 5824)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1604, file: !1605, line: 130, baseType: !957, size: 32, align: 32, offset: 5856)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1604, file: !1605, line: 131, baseType: !957, size: 32, align: 32, offset: 5888)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1604, file: !1605, line: 132, baseType: !957, size: 32, align: 32, offset: 5920)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1604, file: !1605, line: 132, baseType: !957, size: 32, align: 32, offset: 5952)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1604, file: !1605, line: 133, baseType: !957, size: 32, align: 32, offset: 5984)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1604, file: !1605, line: 134, baseType: !1663, size: 64, align: 64, offset: 6016)
!1663 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1257, line: 149, baseType: !965)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1604, file: !1605, line: 135, baseType: !1663, size: 64, align: 64, offset: 6080)
