; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--dnxhdenc_init.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--x86--dnxhdenc_init.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DNXHDEncContext = type { %struct.AVClass*, %struct.BlockDSPContext, %struct.MpegEncContext, i32, i32, i32, i32, %struct.CIDEntry*, i8*, i32*, i32*, [32 x %struct.DNXHDEncContext*], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [4 x i8], [12 x [64 x i16]], [512 x i8], [2 x [512 x i8]], [64 x i32]*, [64 x i32]*, [2 x [64 x i16]]*, [2 x [64 x i16]]*, i32, [3 x i8*], i32*, i8*, i32*, i8*, i16*, i8*, i32, i32, i32, i16*, i8*, %struct.RCCMPEntry*, %struct.RCCMPEntry*, %struct.RCEntry*, void (i16*, i8*, i64)*, [16 x i8] }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.BlockDSPContext = type { void (i16*)*, void (i16*)*, [2 x void (i8*, i8, i64, i32)*] }

!870 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !517, line: 538, size: 32, align: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879}
!872 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!873 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!874 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!875 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!876 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!877 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!878 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!879 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!880 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !57, line: 1534, size: 32, align: 32, elements: !881)
!881 = !{!882, !883, !884, !885, !886, !887}
!882 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!883 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!884 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!885 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!886 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!887 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !57, line: 810, size: 32, align: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899}
!890 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!891 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!892 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!893 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!894 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!895 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!896 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!897 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!898 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!899 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!900 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !57, line: 798, size: 32, align: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!903 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!904 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!905 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!906 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!907 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!908 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OutputFormat", file: !910, line: 123, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "./libavcodec/mpegutils.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "FMT_MPEG1", value: 0)
!913 = !DIEnumerator(name: "FMT_H261", value: 1)
!914 = !DIEnumerator(name: "FMT_H263", value: 2)
!915 = !DIEnumerator(name: "FMT_MJPEG", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "idct_permutation_type", file: !917, line: 37, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "./libavcodec/idctdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919, !920, !921, !922, !923, !924}
!919 = !DIEnumerator(name: "FF_IDCT_PERM_NONE", value: 0)
!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{i32 2, !"Dwarf Version", i32 4}
!926 = !{i32 2, !"Debug Info Version", i32 3}
!927 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!928 = distinct !DISubprogram(name: "ff_dnxhdenc_init_x86", scope: !929, file: !929, line: 31, type: !930, isLocal: false, isDefinition: true, scopeLine: 32, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2692)
!929 = !DIFile(filename: "libavcodec/x86/dnxhdenc_init.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!930 = !DISubroutineType(types: !931)
!931 = !{null, !932}
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "DNXHDEncContext", file: !934, line: 110, baseType: !935)
!934 = !DIFile(filename: "./libavcodec/dnxhdenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DNXHDEncContext", file: !934, line: 44, size: 115456, align: 256, elements: !936)
!936 = !{!937, !1023, !1049, !2600, !2601, !2602, !2603, !2604, !2634, !2635, !2636, !2637, !2640, !2641, !2642, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651, !2652, !2656, !2659, !2660, !2661, !2662, !2663, !2664, !2665, !2666, !2667, !2668, !2669, !2670, !2671, !2672, !2673, !2674, !2675, !2676, !2683, !2684, !2691}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !935, file: !934, line: 45, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !941)
!941 = !{!942, !946, !951, !982, !983, !984, !985, !989, !995, !997, !1001}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !940, file: !26, line: 72, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !940, file: !26, line: 78, baseType: !947, size: 64, align: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!948 = !DISubroutineType(types: !949)
!949 = !{!943, !950}
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !940, file: !26, line: 85, baseType: !952, size: 64, align: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !955)
!955 = !{!956, !957, !958, !960, !961, !978, !979, !980, !981}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !4, line: 247, baseType: !943, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !954, file: !4, line: 253, baseType: !943, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !954, file: !4, line: 259, baseType: !959, size: 32, align: 32, offset: 128)
!959 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !954, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !954, file: !4, line: 271, baseType: !962, size: 64, align: 64, offset: 192)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !954, file: !4, line: 265, size: 64, align: 64, elements: !963)
!963 = !{!964, !968, !970, !971}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !962, file: !4, line: 266, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !966, line: 40, baseType: !967)
!966 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !962, file: !4, line: 267, baseType: !969, size: 64, align: 64)
!969 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !962, file: !4, line: 268, baseType: !943, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !962, file: !4, line: 270, baseType: !972, size: 64, align: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !973, line: 61, baseType: !974)
!973 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !973, line: 58, size: 64, align: 32, elements: !975)
!975 = !{!976, !977}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !974, file: !973, line: 59, baseType: !959, size: 32, align: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !974, file: !973, line: 60, baseType: !959, size: 32, align: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !954, file: !4, line: 272, baseType: !969, size: 64, align: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !954, file: !4, line: 273, baseType: !969, size: 64, align: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !954, file: !4, line: 275, baseType: !959, size: 32, align: 32, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !954, file: !4, line: 300, baseType: !943, size: 64, align: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !940, file: !26, line: 93, baseType: !959, size: 32, align: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !940, file: !26, line: 99, baseType: !959, size: 32, align: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !940, file: !26, line: 108, baseType: !959, size: 32, align: 32, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !940, file: !26, line: 113, baseType: !986, size: 64, align: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!950, !950, !950}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !940, file: !26, line: 123, baseType: !990, size: 64, align: 64, offset: 384)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!993, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !940, file: !26, line: 130, baseType: !996, size: 32, align: 32, offset: 448)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !940, file: !26, line: 136, baseType: !998, size: 64, align: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!996, !950}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !940, file: !26, line: 142, baseType: !1002, size: 64, align: 64, offset: 576)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!959, !1005, !950, !943, !959}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1008)
!1008 = !{!1009, !1021, !1022}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1007, file: !4, line: 360, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1013, file: !4, line: 307, baseType: !943, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1013, file: !4, line: 313, baseType: !969, size: 64, align: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1013, file: !4, line: 313, baseType: !969, size: 64, align: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1013, file: !4, line: 318, baseType: !969, size: 64, align: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1013, file: !4, line: 318, baseType: !969, size: 64, align: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1013, file: !4, line: 323, baseType: !959, size: 32, align: 32, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1007, file: !4, line: 364, baseType: !959, size: 32, align: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1007, file: !4, line: 368, baseType: !959, size: 32, align: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bdsp", scope: !935, file: !934, line: 46, baseType: !1024, size: 256, align: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockDSPContext", file: !1025, line: 40, baseType: !1026)
!1025 = !DIFile(filename: "./libavcodec/blockdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BlockDSPContext", file: !1025, line: 35, size: 256, align: 64, elements: !1027)
!1027 = !{!1028, !1035, !1036}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "clear_block", scope: !1026, file: !1025, line: 36, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !966, line: 37, baseType: !1034)
!1034 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "clear_blocks", scope: !1026, file: !1025, line: 37, baseType: !1029, size: 64, align: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "fill_block_tab", scope: !1026, file: !1025, line: 39, baseType: !1037, size: 128, align: 64, offset: 128)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 128, align: 64, elements: !1047)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "op_fill_func", file: !1025, line: 32, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !1042, !1043, !1045, !959}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !966, line: 48, baseType: !1044)
!1044 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1046, line: 149, baseType: !967)
!1046 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1047 = !{!1048}
!1048 = !DISubrange(count: 2)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "m", scope: !935, file: !934, line: 47, baseType: !1050, size: 86208, align: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !1051, line: 582, baseType: !1052)
!1051 = !DIFile(filename: "./libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1051, line: 81, size: 86208, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1062, !1063, !1075, !1076, !1077, !1078, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785, !1836, !1838, !1839, !1840, !1841, !1842, !1853, !1854, !1855, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1871, !1872, !1874, !1875, !1876, !1877, !1878, !1879, !1884, !1886, !1887, !1888, !1889, !1890, !1891, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1918, !1919, !1920, !1921, !1922, !1929, !1941, !1957, !1979, !2019, !2032, !2059, !2074, !2088, !2101, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118, !2119, !2122, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2135, !2137, !2138, !2139, !2140, !2141, !2142, !2145, !2147, !2149, !2150, !2153, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2220, !2221, !2223, !2224, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2246, !2247, !2248, !2251, !2252, !2253, !2254, !2256, !2258, !2259, !2260, !2261, !2262, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2344, !2345, !2346, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465, !2466, !2475, !2476, !2477, !2478, !2482, !2483, !2487, !2491, !2495, !2496, !2501, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2516, !2517, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2535, !2536, !2537, !2587, !2588, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1052, file: !1051, line: 82, baseType: !938, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1052, file: !1051, line: 84, baseType: !959, size: 32, align: 32, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1052, file: !1051, line: 84, baseType: !959, size: 32, align: 32, offset: 96)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1052, file: !1051, line: 85, baseType: !959, size: 32, align: 32, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1052, file: !1051, line: 86, baseType: !1059, size: 384, align: 32, offset: 160)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 384, align: 32, elements: !1060)
!1060 = !{!1061}
!1061 = !DISubrange(count: 12)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1052, file: !1051, line: 87, baseType: !959, size: 32, align: 32, offset: 544)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1052, file: !1051, line: 90, baseType: !1064, size: 1088, align: 64, offset: 576)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1066)
!1066 = !{!1067, !1070, !1074}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1065, file: !917, line: 32, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1065, file: !917, line: 33, baseType: !1071, size: 512, align: 8, offset: 64)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1043, size: 512, align: 8, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1065, file: !917, line: 34, baseType: !1071, size: 512, align: 8, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1052, file: !1051, line: 91, baseType: !1064, size: 1088, align: 64, offset: 1664)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1052, file: !1051, line: 92, baseType: !1064, size: 1088, align: 64, offset: 2752)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1052, file: !1051, line: 93, baseType: !1064, size: 1088, align: 64, offset: 3840)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1052, file: !1051, line: 98, baseType: !1079, size: 64, align: 64, offset: 4928)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1081)
!1081 = !{!1082, !1085, !1086, !1087, !1352, !1353, !1354, !1355, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1507, !1511, !1512, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1690, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1080, file: !57, line: 1561, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1080, file: !57, line: 1562, baseType: !959, size: 32, align: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1080, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1080, file: !57, line: 1565, baseType: !1088, size: 64, align: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1100, !1103, !1106, !1109, !1114, !1115, !1116, !1124, !1125, !1126, !1128, !1134, !1140, !1149, !1153, !1154, !1203, !1323, !1327, !1328, !1332, !1336, !1341, !1345, !1346, !1347}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1090, file: !57, line: 3475, baseType: !943, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1090, file: !57, line: 3480, baseType: !943, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1090, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1090, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1090, file: !57, line: 3487, baseType: !959, size: 32, align: 32, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1090, file: !57, line: 3488, baseType: !1098, size: 64, align: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1090, file: !57, line: 3489, baseType: !1101, size: 64, align: 64, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1090, file: !57, line: 3490, baseType: !1104, size: 64, align: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1090, file: !57, line: 3491, baseType: !1107, size: 64, align: 64, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1090, file: !57, line: 3492, baseType: !1110, size: 64, align: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1112)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !966, line: 55, baseType: !1113)
!1113 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1090, file: !57, line: 3493, baseType: !1043, size: 8, align: 8, offset: 576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1090, file: !57, line: 3494, baseType: !1083, size: 64, align: 64, offset: 640)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1090, file: !57, line: 3495, baseType: !1117, size: 64, align: 64, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1119)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1120, file: !57, line: 3402, baseType: !959, size: 32, align: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1120, file: !57, line: 3403, baseType: !943, size: 64, align: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1090, file: !57, line: 3507, baseType: !943, size: 64, align: 64, offset: 768)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1090, file: !57, line: 3516, baseType: !959, size: 32, align: 32, offset: 832)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1090, file: !57, line: 3517, baseType: !1127, size: 64, align: 64, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1090, file: !57, line: 3527, baseType: !1129, size: 64, align: 64, offset: 960)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!959, !1132}
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1080)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1090, file: !57, line: 3535, baseType: !1135, size: 64, align: 64, offset: 1024)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1136 = !DISubroutineType(types: !1137)
!1137 = !{!959, !1132, !1138}
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1133)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1090, file: !57, line: 3541, baseType: !1141, size: 64, align: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1143)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1145, line: 223, size: 128, align: 64, elements: !1146)
!1145 = !DIFile(filename: "./libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1144, file: !1145, line: 224, baseType: !1068, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1144, file: !1145, line: 225, baseType: !1068, size: 64, align: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1090, file: !57, line: 3549, baseType: !1150, size: 64, align: 64, offset: 1152)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !1127}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1090, file: !57, line: 3551, baseType: !1129, size: 64, align: 64, offset: 1216)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1090, file: !57, line: 3552, baseType: !1155, size: 64, align: 64, offset: 1280)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64, align: 64)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!959, !1132, !1042, !959, !1158}
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1161)
!1161 = !{!1162, !1165, !1168, !1169, !1170, !1202}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1160, file: !57, line: 3921, baseType: !1163, size: 16, align: 16)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !966, line: 49, baseType: !1164)
!1164 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1160, file: !57, line: 3922, baseType: !1166, size: 32, align: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !966, line: 51, baseType: !1167)
!1167 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1160, file: !57, line: 3923, baseType: !1166, size: 32, align: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1160, file: !57, line: 3924, baseType: !1167, size: 32, align: 32, offset: 96)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1160, file: !57, line: 3925, baseType: !1171, size: 64, align: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64, align: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1174)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1191, !1195, !1197, !1198, !1200, !1201}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1174, file: !57, line: 3886, baseType: !959, size: 32, align: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1174, file: !57, line: 3887, baseType: !959, size: 32, align: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1174, file: !57, line: 3888, baseType: !959, size: 32, align: 32, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1174, file: !57, line: 3889, baseType: !959, size: 32, align: 32, offset: 96)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1174, file: !57, line: 3890, baseType: !959, size: 32, align: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1174, file: !57, line: 3897, baseType: !1182, size: 768, align: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1183)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1184)
!1184 = !{!1185, !1189}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1183, file: !57, line: 3855, baseType: !1186, size: 512, align: 64)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 512, align: 64, elements: !1187)
!1187 = !{!1188}
!1188 = !DISubrange(count: 8)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1183, file: !57, line: 3857, baseType: !1190, size: 256, align: 32, offset: 512)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 256, align: 32, elements: !1187)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1174, file: !57, line: 3903, baseType: !1192, size: 256, align: 64, offset: 960)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 256, align: 64, elements: !1193)
!1193 = !{!1194}
!1194 = !DISubrange(count: 4)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1174, file: !57, line: 3904, baseType: !1196, size: 128, align: 32, offset: 1216)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 128, align: 32, elements: !1193)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1174, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1174, file: !57, line: 3908, baseType: !1199, size: 64, align: 64, offset: 1408)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1174, file: !57, line: 3915, baseType: !1199, size: 64, align: 64, offset: 1472)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1174, file: !57, line: 3917, baseType: !959, size: 32, align: 32, offset: 1536)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1160, file: !57, line: 3926, baseType: !965, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1090, file: !57, line: 3564, baseType: !1204, size: 64, align: 64, offset: 1344)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64, align: 64)
!1205 = !DISubroutineType(types: !1206)
!1206 = !{!959, !1132, !1207, !1241, !1322}
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1210)
!1210 = !{!1211, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1237, !1238, !1239, !1240}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1209, file: !57, line: 1451, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1214, line: 94, baseType: !1215)
!1214 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1214, line: 81, size: 192, align: 64, elements: !1216)
!1216 = !{!1217, !1221, !1222}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1215, file: !1214, line: 82, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1214, line: 73, baseType: !1220)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1214, line: 73, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1215, file: !1214, line: 89, baseType: !1042, size: 64, align: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1215, file: !1214, line: 93, baseType: !959, size: 32, align: 32, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1209, file: !57, line: 1461, baseType: !965, size: 64, align: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1209, file: !57, line: 1467, baseType: !965, size: 64, align: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1209, file: !57, line: 1468, baseType: !1042, size: 64, align: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1209, file: !57, line: 1469, baseType: !959, size: 32, align: 32, offset: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1209, file: !57, line: 1470, baseType: !959, size: 32, align: 32, offset: 288)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1209, file: !57, line: 1474, baseType: !959, size: 32, align: 32, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1209, file: !57, line: 1479, baseType: !1230, size: 64, align: 64, offset: 384)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1233)
!1233 = !{!1234, !1235, !1236}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1232, file: !57, line: 1412, baseType: !1042, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1232, file: !57, line: 1413, baseType: !959, size: 32, align: 32, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1232, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1209, file: !57, line: 1480, baseType: !959, size: 32, align: 32, offset: 448)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1209, file: !57, line: 1486, baseType: !965, size: 64, align: 64, offset: 512)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1209, file: !57, line: 1488, baseType: !965, size: 64, align: 64, offset: 576)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1209, file: !57, line: 1497, baseType: !965, size: 64, align: 64, offset: 640)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1244)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1245)
!1245 = !{!1246, !1247, !1248, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1275, !1277, !1278, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1311, !1312, !1313, !1314, !1315, !1316, !1318, !1319, !1320, !1321}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1244, file: !780, line: 282, baseType: !1186, size: 512, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1244, file: !780, line: 299, baseType: !1190, size: 256, align: 32, offset: 512)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1244, file: !780, line: 315, baseType: !1249, size: 64, align: 64, offset: 768)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1244, file: !780, line: 326, baseType: !959, size: 32, align: 32, offset: 832)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1244, file: !780, line: 326, baseType: !959, size: 32, align: 32, offset: 864)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1244, file: !780, line: 334, baseType: !959, size: 32, align: 32, offset: 896)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1244, file: !780, line: 341, baseType: !959, size: 32, align: 32, offset: 928)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1244, file: !780, line: 346, baseType: !959, size: 32, align: 32, offset: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1244, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1244, file: !780, line: 356, baseType: !972, size: 64, align: 32, offset: 1024)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1244, file: !780, line: 361, baseType: !965, size: 64, align: 64, offset: 1088)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1244, file: !780, line: 369, baseType: !965, size: 64, align: 64, offset: 1152)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1244, file: !780, line: 377, baseType: !965, size: 64, align: 64, offset: 1216)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1244, file: !780, line: 382, baseType: !959, size: 32, align: 32, offset: 1280)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1244, file: !780, line: 386, baseType: !959, size: 32, align: 32, offset: 1312)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1244, file: !780, line: 391, baseType: !959, size: 32, align: 32, offset: 1344)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1244, file: !780, line: 396, baseType: !950, size: 64, align: 64, offset: 1408)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1244, file: !780, line: 403, baseType: !1265, size: 512, align: 64, offset: 1472)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1112, size: 512, align: 64, elements: !1187)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1244, file: !780, line: 410, baseType: !959, size: 32, align: 32, offset: 1984)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1244, file: !780, line: 415, baseType: !959, size: 32, align: 32, offset: 2016)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1244, file: !780, line: 420, baseType: !959, size: 32, align: 32, offset: 2048)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1244, file: !780, line: 425, baseType: !959, size: 32, align: 32, offset: 2080)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1244, file: !780, line: 435, baseType: !965, size: 64, align: 64, offset: 2112)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1244, file: !780, line: 440, baseType: !959, size: 32, align: 32, offset: 2176)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1244, file: !780, line: 445, baseType: !1112, size: 64, align: 64, offset: 2240)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1244, file: !780, line: 459, baseType: !1274, size: 512, align: 64, offset: 2304)
!1274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1212, size: 512, align: 64, elements: !1187)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1244, file: !780, line: 473, baseType: !1276, size: 64, align: 64, offset: 2816)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1244, file: !780, line: 477, baseType: !959, size: 32, align: 32, offset: 2880)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1244, file: !780, line: 479, baseType: !1279, size: 64, align: 64, offset: 2944)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1292}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1282, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1282, file: !780, line: 203, baseType: !1042, size: 64, align: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1282, file: !780, line: 204, baseType: !959, size: 32, align: 32, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1282, file: !780, line: 205, baseType: !1288, size: 64, align: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1290, line: 86, baseType: !1291)
!1290 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1291 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1290, line: 86, flags: DIFlagFwdDecl)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1282, file: !780, line: 206, baseType: !1212, size: 64, align: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1244, file: !780, line: 480, baseType: !959, size: 32, align: 32, offset: 3008)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1244, file: !780, line: 505, baseType: !959, size: 32, align: 32, offset: 3040)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1244, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1244, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1244, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1244, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1244, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1244, file: !780, line: 532, baseType: !965, size: 64, align: 64, offset: 3264)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1244, file: !780, line: 539, baseType: !965, size: 64, align: 64, offset: 3328)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1244, file: !780, line: 547, baseType: !965, size: 64, align: 64, offset: 3392)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1244, file: !780, line: 554, baseType: !1288, size: 64, align: 64, offset: 3456)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1244, file: !780, line: 563, baseType: !959, size: 32, align: 32, offset: 3520)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1244, file: !780, line: 572, baseType: !959, size: 32, align: 32, offset: 3552)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1244, file: !780, line: 581, baseType: !959, size: 32, align: 32, offset: 3584)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1244, file: !780, line: 588, baseType: !1308, size: 64, align: 64, offset: 3648)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !966, line: 36, baseType: !1310)
!1310 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1244, file: !780, line: 593, baseType: !959, size: 32, align: 32, offset: 3712)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1244, file: !780, line: 596, baseType: !959, size: 32, align: 32, offset: 3744)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1244, file: !780, line: 599, baseType: !1212, size: 64, align: 64, offset: 3776)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1244, file: !780, line: 605, baseType: !1212, size: 64, align: 64, offset: 3840)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1244, file: !780, line: 616, baseType: !1212, size: 64, align: 64, offset: 3904)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1244, file: !780, line: 626, baseType: !1317, size: 64, align: 64, offset: 3968)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1046, line: 216, baseType: !1113)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1244, file: !780, line: 627, baseType: !1317, size: 64, align: 64, offset: 4032)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1244, file: !780, line: 628, baseType: !1317, size: 64, align: 64, offset: 4096)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1244, file: !780, line: 629, baseType: !1317, size: 64, align: 64, offset: 4160)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1244, file: !780, line: 645, baseType: !1212, size: 64, align: 64, offset: 4224)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1090, file: !57, line: 3566, baseType: !1324, size: 64, align: 64, offset: 1408)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64, align: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{!959, !1132, !950, !1322, !1207}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1090, file: !57, line: 3567, baseType: !1129, size: 64, align: 64, offset: 1472)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1090, file: !57, line: 3576, baseType: !1329, size: 64, align: 64, offset: 1536)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!959, !1132, !1241}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1090, file: !57, line: 3577, baseType: !1333, size: 64, align: 64, offset: 1600)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{!959, !1132, !1207}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1090, file: !57, line: 3584, baseType: !1337, size: 64, align: 64, offset: 1664)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!959, !1132, !1340}
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1090, file: !57, line: 3589, baseType: !1342, size: 64, align: 64, offset: 1728)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{null, !1132}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1090, file: !57, line: 3594, baseType: !959, size: 32, align: 32, offset: 1792)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1090, file: !57, line: 3600, baseType: !943, size: 64, align: 64, offset: 1856)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1090, file: !57, line: 3609, baseType: !1348, size: 64, align: 64, offset: 1920)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1351)
!1351 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1080, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1080, file: !57, line: 1581, baseType: !1167, size: 32, align: 32, offset: 224)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1080, file: !57, line: 1583, baseType: !950, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1080, file: !57, line: 1591, baseType: !1356, size: 64, align: 64, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1145, line: 129, size: 1664, align: 64, elements: !1358)
!1358 = !{!1359, !1360, !1361, !1362, !1363, !1381, !1382, !1388, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1357, file: !1145, line: 136, baseType: !959, size: 32, align: 32)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1357, file: !1145, line: 151, baseType: !959, size: 32, align: 32, offset: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1357, file: !1145, line: 157, baseType: !959, size: 32, align: 32, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1357, file: !1145, line: 159, baseType: !1340, size: 64, align: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1357, file: !1145, line: 161, baseType: !1364, size: 64, align: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1145, line: 117, baseType: !1366)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1145, line: 100, size: 832, align: 64, elements: !1367)
!1367 = !{!1368, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1366, file: !1145, line: 105, baseType: !1369, size: 256, align: 64)
!1369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1370, size: 256, align: 64, elements: !1193)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1214, line: 238, baseType: !1372)
!1372 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1214, line: 238, flags: DIFlagFwdDecl)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1366, file: !1145, line: 110, baseType: !959, size: 32, align: 32, offset: 256)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1366, file: !1145, line: 111, baseType: !959, size: 32, align: 32, offset: 288)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1366, file: !1145, line: 111, baseType: !959, size: 32, align: 32, offset: 320)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1366, file: !1145, line: 112, baseType: !1190, size: 256, align: 32, offset: 352)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1366, file: !1145, line: 113, baseType: !1196, size: 128, align: 32, offset: 608)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1366, file: !1145, line: 114, baseType: !959, size: 32, align: 32, offset: 736)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1366, file: !1145, line: 115, baseType: !959, size: 32, align: 32, offset: 768)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1366, file: !1145, line: 116, baseType: !959, size: 32, align: 32, offset: 800)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1357, file: !1145, line: 163, baseType: !950, size: 64, align: 64, offset: 256)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1357, file: !1145, line: 165, baseType: !1383, size: 128, align: 64, offset: 320)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1145, line: 122, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1145, line: 119, size: 128, align: 64, elements: !1385)
!1385 = !{!1386, !1387}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1384, file: !1145, line: 120, baseType: !1207, size: 64, align: 64)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1384, file: !1145, line: 121, baseType: !1340, size: 64, align: 64, offset: 64)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1357, file: !1145, line: 166, baseType: !1389, size: 128, align: 64, offset: 448)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1145, line: 127, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1145, line: 124, size: 128, align: 64, elements: !1391)
!1391 = !{!1392, !1465}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1390, file: !1145, line: 125, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1397)
!1397 = !{!1398, !1399, !1423, !1427, !1428, !1462, !1463, !1464}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1396, file: !57, line: 5751, baseType: !1083, size: 64, align: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1396, file: !57, line: 5756, baseType: !1400, size: 64, align: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1402)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1403)
!1403 = !{!1404, !1405, !1408, !1409, !1410, !1414, !1418, !1422}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1402, file: !57, line: 5797, baseType: !943, size: 64, align: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1402, file: !57, line: 5804, baseType: !1406, size: 64, align: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64, align: 64)
!1407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1402, file: !57, line: 5815, baseType: !1083, size: 64, align: 64, offset: 128)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1402, file: !57, line: 5825, baseType: !959, size: 32, align: 32, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1402, file: !57, line: 5826, baseType: !1411, size: 64, align: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DISubroutineType(types: !1413)
!1413 = !{!959, !1394}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1402, file: !57, line: 5827, baseType: !1415, size: 64, align: 64, offset: 320)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!959, !1394, !1207}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1402, file: !57, line: 5828, baseType: !1419, size: 64, align: 64, offset: 384)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{null, !1394}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1402, file: !57, line: 5829, baseType: !1419, size: 64, align: 64, offset: 448)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1396, file: !57, line: 5762, baseType: !1424, size: 64, align: 64, offset: 128)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1426)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1396, file: !57, line: 5768, baseType: !950, size: 64, align: 64, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1396, file: !57, line: 5775, baseType: !1429, size: 64, align: 64, offset: 256)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1431)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1431, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1431, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1431, file: !57, line: 3948, baseType: !1166, size: 32, align: 32, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1431, file: !57, line: 3958, baseType: !1042, size: 64, align: 64, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1431, file: !57, line: 3962, baseType: !959, size: 32, align: 32, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1431, file: !57, line: 3968, baseType: !959, size: 32, align: 32, offset: 224)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1431, file: !57, line: 3973, baseType: !965, size: 64, align: 64, offset: 256)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1431, file: !57, line: 3986, baseType: !959, size: 32, align: 32, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1431, file: !57, line: 3999, baseType: !959, size: 32, align: 32, offset: 352)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1431, file: !57, line: 4004, baseType: !959, size: 32, align: 32, offset: 384)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1431, file: !57, line: 4005, baseType: !959, size: 32, align: 32, offset: 416)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1431, file: !57, line: 4010, baseType: !959, size: 32, align: 32, offset: 448)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1431, file: !57, line: 4011, baseType: !959, size: 32, align: 32, offset: 480)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1431, file: !57, line: 4020, baseType: !972, size: 64, align: 32, offset: 512)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1431, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1431, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1431, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1431, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1431, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1431, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1431, file: !57, line: 4039, baseType: !959, size: 32, align: 32, offset: 768)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1431, file: !57, line: 4046, baseType: !1112, size: 64, align: 64, offset: 832)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1431, file: !57, line: 4050, baseType: !959, size: 32, align: 32, offset: 896)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1431, file: !57, line: 4054, baseType: !959, size: 32, align: 32, offset: 928)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1431, file: !57, line: 4061, baseType: !959, size: 32, align: 32, offset: 960)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1431, file: !57, line: 4065, baseType: !959, size: 32, align: 32, offset: 992)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1431, file: !57, line: 4073, baseType: !959, size: 32, align: 32, offset: 1024)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1431, file: !57, line: 4080, baseType: !959, size: 32, align: 32, offset: 1056)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1431, file: !57, line: 4084, baseType: !959, size: 32, align: 32, offset: 1088)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1396, file: !57, line: 5781, baseType: !1429, size: 64, align: 64, offset: 320)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1396, file: !57, line: 5787, baseType: !972, size: 64, align: 32, offset: 384)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1396, file: !57, line: 5793, baseType: !972, size: 64, align: 32, offset: 448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1390, file: !1145, line: 126, baseType: !959, size: 32, align: 32, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1357, file: !1145, line: 172, baseType: !1207, size: 64, align: 64, offset: 576)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1357, file: !1145, line: 177, baseType: !1042, size: 64, align: 64, offset: 640)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1357, file: !1145, line: 178, baseType: !1167, size: 32, align: 32, offset: 704)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1357, file: !1145, line: 180, baseType: !950, size: 64, align: 64, offset: 768)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1357, file: !1145, line: 185, baseType: !959, size: 32, align: 32, offset: 832)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1357, file: !1145, line: 190, baseType: !950, size: 64, align: 64, offset: 896)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1357, file: !1145, line: 195, baseType: !959, size: 32, align: 32, offset: 960)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1357, file: !1145, line: 200, baseType: !1207, size: 64, align: 64, offset: 1024)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1357, file: !1145, line: 201, baseType: !959, size: 32, align: 32, offset: 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1357, file: !1145, line: 202, baseType: !1340, size: 64, align: 64, offset: 1152)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1357, file: !1145, line: 203, baseType: !959, size: 32, align: 32, offset: 1216)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1357, file: !1145, line: 205, baseType: !959, size: 32, align: 32, offset: 1248)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1357, file: !1145, line: 206, baseType: !959, size: 32, align: 32, offset: 1280)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1357, file: !1145, line: 209, baseType: !1317, size: 64, align: 64, offset: 1344)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1357, file: !1145, line: 212, baseType: !1317, size: 64, align: 64, offset: 1408)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1357, file: !1145, line: 213, baseType: !1340, size: 64, align: 64, offset: 1472)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1357, file: !1145, line: 215, baseType: !959, size: 32, align: 32, offset: 1536)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1357, file: !1145, line: 217, baseType: !959, size: 32, align: 32, offset: 1568)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1357, file: !1145, line: 220, baseType: !959, size: 32, align: 32, offset: 1600)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1080, file: !57, line: 1598, baseType: !950, size: 64, align: 64, offset: 384)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1080, file: !57, line: 1606, baseType: !965, size: 64, align: 64, offset: 448)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1080, file: !57, line: 1614, baseType: !959, size: 32, align: 32, offset: 512)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1080, file: !57, line: 1622, baseType: !959, size: 32, align: 32, offset: 544)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1080, file: !57, line: 1628, baseType: !959, size: 32, align: 32, offset: 576)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1080, file: !57, line: 1636, baseType: !959, size: 32, align: 32, offset: 608)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1080, file: !57, line: 1643, baseType: !959, size: 32, align: 32, offset: 640)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1080, file: !57, line: 1657, baseType: !1042, size: 64, align: 64, offset: 704)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1080, file: !57, line: 1658, baseType: !959, size: 32, align: 32, offset: 768)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1080, file: !57, line: 1679, baseType: !972, size: 64, align: 32, offset: 800)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1080, file: !57, line: 1688, baseType: !959, size: 32, align: 32, offset: 864)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1080, file: !57, line: 1712, baseType: !959, size: 32, align: 32, offset: 896)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1080, file: !57, line: 1729, baseType: !959, size: 32, align: 32, offset: 928)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1080, file: !57, line: 1729, baseType: !959, size: 32, align: 32, offset: 960)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1080, file: !57, line: 1744, baseType: !959, size: 32, align: 32, offset: 992)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1080, file: !57, line: 1744, baseType: !959, size: 32, align: 32, offset: 1024)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1080, file: !57, line: 1751, baseType: !959, size: 32, align: 32, offset: 1056)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1080, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1080, file: !57, line: 1791, baseType: !1504, size: 64, align: 64, offset: 1152)
!1504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1505 = !DISubroutineType(types: !1506)
!1506 = !{null, !1079, !1241, !1322, !959, !959, !959}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1080, file: !57, line: 1808, baseType: !1508, size: 64, align: 64, offset: 1216)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DISubroutineType(types: !1510)
!1510 = !{!516, !1079, !1101}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1080, file: !57, line: 1816, baseType: !959, size: 32, align: 32, offset: 1280)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1080, file: !57, line: 1825, baseType: !1513, size: 32, align: 32, offset: 1312)
!1513 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1080, file: !57, line: 1830, baseType: !959, size: 32, align: 32, offset: 1344)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1080, file: !57, line: 1838, baseType: !1513, size: 32, align: 32, offset: 1376)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1080, file: !57, line: 1846, baseType: !959, size: 32, align: 32, offset: 1408)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1080, file: !57, line: 1851, baseType: !959, size: 32, align: 32, offset: 1440)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1080, file: !57, line: 1861, baseType: !1513, size: 32, align: 32, offset: 1472)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1080, file: !57, line: 1868, baseType: !1513, size: 32, align: 32, offset: 1504)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1080, file: !57, line: 1875, baseType: !1513, size: 32, align: 32, offset: 1536)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1080, file: !57, line: 1882, baseType: !1513, size: 32, align: 32, offset: 1568)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1080, file: !57, line: 1889, baseType: !1513, size: 32, align: 32, offset: 1600)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1080, file: !57, line: 1896, baseType: !1513, size: 32, align: 32, offset: 1632)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1080, file: !57, line: 1903, baseType: !1513, size: 32, align: 32, offset: 1664)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1080, file: !57, line: 1910, baseType: !959, size: 32, align: 32, offset: 1696)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1080, file: !57, line: 1915, baseType: !959, size: 32, align: 32, offset: 1728)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1080, file: !57, line: 1926, baseType: !1322, size: 64, align: 64, offset: 1792)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1080, file: !57, line: 1935, baseType: !972, size: 64, align: 32, offset: 1856)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1080, file: !57, line: 1942, baseType: !959, size: 32, align: 32, offset: 1920)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1080, file: !57, line: 1948, baseType: !959, size: 32, align: 32, offset: 1952)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1080, file: !57, line: 1954, baseType: !959, size: 32, align: 32, offset: 1984)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1080, file: !57, line: 1960, baseType: !959, size: 32, align: 32, offset: 2016)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1080, file: !57, line: 1984, baseType: !959, size: 32, align: 32, offset: 2048)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1080, file: !57, line: 1991, baseType: !959, size: 32, align: 32, offset: 2080)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1080, file: !57, line: 1996, baseType: !959, size: 32, align: 32, offset: 2112)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1080, file: !57, line: 2004, baseType: !959, size: 32, align: 32, offset: 2144)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1080, file: !57, line: 2011, baseType: !959, size: 32, align: 32, offset: 2176)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1080, file: !57, line: 2018, baseType: !959, size: 32, align: 32, offset: 2208)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1080, file: !57, line: 2027, baseType: !959, size: 32, align: 32, offset: 2240)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1080, file: !57, line: 2034, baseType: !959, size: 32, align: 32, offset: 2272)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1080, file: !57, line: 2044, baseType: !959, size: 32, align: 32, offset: 2304)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1080, file: !57, line: 2054, baseType: !1543, size: 64, align: 64, offset: 2368)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1080, file: !57, line: 2061, baseType: !1543, size: 64, align: 64, offset: 2432)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1080, file: !57, line: 2066, baseType: !959, size: 32, align: 32, offset: 2496)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1080, file: !57, line: 2070, baseType: !959, size: 32, align: 32, offset: 2528)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1080, file: !57, line: 2078, baseType: !959, size: 32, align: 32, offset: 2560)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1080, file: !57, line: 2085, baseType: !959, size: 32, align: 32, offset: 2592)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1080, file: !57, line: 2092, baseType: !959, size: 32, align: 32, offset: 2624)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1080, file: !57, line: 2099, baseType: !959, size: 32, align: 32, offset: 2656)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1080, file: !57, line: 2106, baseType: !959, size: 32, align: 32, offset: 2688)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1080, file: !57, line: 2113, baseType: !959, size: 32, align: 32, offset: 2720)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1080, file: !57, line: 2120, baseType: !959, size: 32, align: 32, offset: 2752)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1080, file: !57, line: 2125, baseType: !959, size: 32, align: 32, offset: 2784)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1080, file: !57, line: 2133, baseType: !959, size: 32, align: 32, offset: 2816)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1080, file: !57, line: 2140, baseType: !959, size: 32, align: 32, offset: 2848)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1080, file: !57, line: 2145, baseType: !959, size: 32, align: 32, offset: 2880)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1080, file: !57, line: 2153, baseType: !959, size: 32, align: 32, offset: 2912)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1080, file: !57, line: 2158, baseType: !959, size: 32, align: 32, offset: 2944)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1080, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1080, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1080, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1080, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1080, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1080, file: !57, line: 2203, baseType: !959, size: 32, align: 32, offset: 3136)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1080, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1080, file: !57, line: 2212, baseType: !959, size: 32, align: 32, offset: 3200)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1080, file: !57, line: 2213, baseType: !959, size: 32, align: 32, offset: 3232)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1080, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1080, file: !57, line: 2232, baseType: !959, size: 32, align: 32, offset: 3296)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1080, file: !57, line: 2243, baseType: !959, size: 32, align: 32, offset: 3328)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1080, file: !57, line: 2249, baseType: !959, size: 32, align: 32, offset: 3360)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1080, file: !57, line: 2256, baseType: !959, size: 32, align: 32, offset: 3392)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1080, file: !57, line: 2263, baseType: !1112, size: 64, align: 64, offset: 3456)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1080, file: !57, line: 2270, baseType: !1112, size: 64, align: 64, offset: 3520)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1080, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1080, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1080, file: !57, line: 2367, baseType: !1579, size: 64, align: 64, offset: 3648)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DISubroutineType(types: !1581)
!1581 = !{!959, !1079, !1340, !959}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1080, file: !57, line: 2383, baseType: !959, size: 32, align: 32, offset: 3712)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1080, file: !57, line: 2386, baseType: !1513, size: 32, align: 32, offset: 3744)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1080, file: !57, line: 2387, baseType: !1513, size: 32, align: 32, offset: 3776)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1080, file: !57, line: 2394, baseType: !959, size: 32, align: 32, offset: 3808)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1080, file: !57, line: 2401, baseType: !959, size: 32, align: 32, offset: 3840)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1080, file: !57, line: 2408, baseType: !959, size: 32, align: 32, offset: 3872)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1080, file: !57, line: 2415, baseType: !959, size: 32, align: 32, offset: 3904)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1080, file: !57, line: 2422, baseType: !959, size: 32, align: 32, offset: 3936)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1080, file: !57, line: 2423, baseType: !1591, size: 64, align: 64, offset: 3968)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1593)
!1593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1594)
!1594 = !{!1595, !1596, !1597, !1598}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1593, file: !57, line: 827, baseType: !959, size: 32, align: 32)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1593, file: !57, line: 828, baseType: !959, size: 32, align: 32, offset: 32)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1593, file: !57, line: 829, baseType: !959, size: 32, align: 32, offset: 64)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1593, file: !57, line: 830, baseType: !1513, size: 32, align: 32, offset: 96)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1080, file: !57, line: 2430, baseType: !965, size: 64, align: 64, offset: 4032)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1080, file: !57, line: 2437, baseType: !965, size: 64, align: 64, offset: 4096)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1080, file: !57, line: 2444, baseType: !1513, size: 32, align: 32, offset: 4160)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1080, file: !57, line: 2451, baseType: !1513, size: 32, align: 32, offset: 4192)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1080, file: !57, line: 2458, baseType: !959, size: 32, align: 32, offset: 4224)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1080, file: !57, line: 2469, baseType: !959, size: 32, align: 32, offset: 4256)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1080, file: !57, line: 2475, baseType: !959, size: 32, align: 32, offset: 4288)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1080, file: !57, line: 2481, baseType: !959, size: 32, align: 32, offset: 4320)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1080, file: !57, line: 2485, baseType: !959, size: 32, align: 32, offset: 4352)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1080, file: !57, line: 2489, baseType: !959, size: 32, align: 32, offset: 4384)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1080, file: !57, line: 2493, baseType: !959, size: 32, align: 32, offset: 4416)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1080, file: !57, line: 2501, baseType: !959, size: 32, align: 32, offset: 4448)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1080, file: !57, line: 2506, baseType: !959, size: 32, align: 32, offset: 4480)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1080, file: !57, line: 2510, baseType: !959, size: 32, align: 32, offset: 4512)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1080, file: !57, line: 2514, baseType: !965, size: 64, align: 64, offset: 4544)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1080, file: !57, line: 2528, baseType: !1615, size: 64, align: 64, offset: 4608)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{null, !1079, !950, !959, !959}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1080, file: !57, line: 2534, baseType: !959, size: 32, align: 32, offset: 4672)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1080, file: !57, line: 2545, baseType: !959, size: 32, align: 32, offset: 4704)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1080, file: !57, line: 2547, baseType: !959, size: 32, align: 32, offset: 4736)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1080, file: !57, line: 2549, baseType: !959, size: 32, align: 32, offset: 4768)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1080, file: !57, line: 2551, baseType: !959, size: 32, align: 32, offset: 4800)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1080, file: !57, line: 2553, baseType: !959, size: 32, align: 32, offset: 4832)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1080, file: !57, line: 2555, baseType: !959, size: 32, align: 32, offset: 4864)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1080, file: !57, line: 2557, baseType: !959, size: 32, align: 32, offset: 4896)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1080, file: !57, line: 2559, baseType: !959, size: 32, align: 32, offset: 4928)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1080, file: !57, line: 2563, baseType: !959, size: 32, align: 32, offset: 4960)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1080, file: !57, line: 2571, baseType: !1199, size: 64, align: 64, offset: 4992)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1080, file: !57, line: 2579, baseType: !1199, size: 64, align: 64, offset: 5056)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1080, file: !57, line: 2586, baseType: !959, size: 32, align: 32, offset: 5120)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1080, file: !57, line: 2615, baseType: !959, size: 32, align: 32, offset: 5152)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1080, file: !57, line: 2627, baseType: !959, size: 32, align: 32, offset: 5184)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1080, file: !57, line: 2637, baseType: !959, size: 32, align: 32, offset: 5216)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1080, file: !57, line: 2681, baseType: !959, size: 32, align: 32, offset: 5248)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1080, file: !57, line: 2709, baseType: !965, size: 64, align: 64, offset: 5312)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1080, file: !57, line: 2716, baseType: !1637, size: 64, align: 64, offset: 5376)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1639)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1640)
!1640 = !{!1641, !1642, !1643, !1644, !1645, !1646, !1647, !1651, !1655, !1656, !1657, !1658, !1663, !1664, !1665, !1666, !1667}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1639, file: !57, line: 3642, baseType: !943, size: 64, align: 64)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1639, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1639, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1639, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1639, file: !57, line: 3669, baseType: !959, size: 32, align: 32, offset: 160)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1639, file: !57, line: 3682, baseType: !1337, size: 64, align: 64, offset: 192)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1639, file: !57, line: 3698, baseType: !1648, size: 64, align: 64, offset: 256)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{!959, !1132, !1068, !1166}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1639, file: !57, line: 3712, baseType: !1652, size: 64, align: 64, offset: 320)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64, align: 64)
!1653 = !DISubroutineType(types: !1654)
!1654 = !{!959, !1132, !959, !1068, !1166}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1639, file: !57, line: 3726, baseType: !1648, size: 64, align: 64, offset: 384)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1639, file: !57, line: 3737, baseType: !1129, size: 64, align: 64, offset: 448)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1639, file: !57, line: 3746, baseType: !959, size: 32, align: 32, offset: 512)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1639, file: !57, line: 3757, baseType: !1659, size: 64, align: 64, offset: 576)
!1659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1660, size: 64, align: 64)
!1660 = !DISubroutineType(types: !1661)
!1661 = !{null, !1662}
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1639, file: !57, line: 3766, baseType: !1129, size: 64, align: 64, offset: 640)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1639, file: !57, line: 3774, baseType: !1129, size: 64, align: 64, offset: 704)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1639, file: !57, line: 3780, baseType: !959, size: 32, align: 32, offset: 768)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1639, file: !57, line: 3785, baseType: !959, size: 32, align: 32, offset: 800)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1639, file: !57, line: 3795, baseType: !1668, size: 64, align: 64, offset: 832)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DISubroutineType(types: !1670)
!1670 = !{!959, !1132, !1212}
