; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--idctdsp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--idctdsp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.ScanTable = type { i8*, [64 x i8], [64 x i8] }
%struct.IDCTDSPContext = type { void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*, i8*, i64)*, void (i16*)*, void (i8*, i64, i16*)*, void (i8*, i64, i16*)*, [64 x i8], i32, i32 }

!832 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!833 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!834 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!835 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!836 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!837 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !504, line: 493, size: 32, align: 32, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!840 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!841 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!842 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!843 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!844 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!845 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!846 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!847 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!848 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!849 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!851 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!853 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!854 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!855 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!856 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !504, line: 538, size: 32, align: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866}
!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !44, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !44, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !44, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !899, line: 48, baseType: !900)
!899 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!900 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!901 = !{i32 2, !"Dwarf Version", i32 4}
!902 = !{i32 2, !"Debug Info Version", i32 3}
!903 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!904 = distinct !DISubprogram(name: "ff_init_scantable", scope: !905, file: !905, line: 29, type: !906, isLocal: false, isDefinition: true, scopeLine: 31, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !921)
!905 = !DIFile(filename: "libavcodec/idctdsp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!906 = !DISubroutineType(types: !907)
!907 = !{null, !908, !909, !914}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !4, line: 35, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !4, line: 31, size: 1088, align: 64, elements: !912)
!912 = !{!913, !916, !920}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !911, file: !4, line: 32, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !911, file: !4, line: 33, baseType: !917, size: 512, align: 8, offset: 64)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 512, align: 8, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !911, file: !4, line: 34, baseType: !917, size: 512, align: 8, offset: 576)
!921 = !{}
!922 = !DILocalVariable(name: "permutation", arg: 1, scope: !904, file: !905, line: 29, type: !908)
!923 = !DIExpression()
!924 = !DILocation(line: 29, column: 55, scope: !904)
!925 = !DILocalVariable(name: "st", arg: 2, scope: !904, file: !905, line: 29, type: !909)
!926 = !DILocation(line: 29, column: 79, scope: !904)
!927 = !DILocalVariable(name: "src_scantable", arg: 3, scope: !904, file: !905, line: 30, type: !914)
!928 = !DILocation(line: 30, column: 47, scope: !904)
!929 = !DILocalVariable(name: "i", scope: !904, file: !905, line: 32, type: !930)
!930 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!931 = !DILocation(line: 32, column: 9, scope: !904)
!932 = !DILocalVariable(name: "end", scope: !904, file: !905, line: 32, type: !930)
!933 = !DILocation(line: 32, column: 12, scope: !904)
!934 = !DILocation(line: 34, column: 21, scope: !904)
!935 = !DILocation(line: 34, column: 5, scope: !904)
!936 = !DILocation(line: 34, column: 9, scope: !904)
!937 = !DILocation(line: 34, column: 19, scope: !904)
!938 = !DILocation(line: 36, column: 12, scope: !939)
!939 = distinct !DILexicalBlock(scope: !904, file: !905, line: 36, column: 5)
!940 = !DILocation(line: 36, column: 10, scope: !939)
!941 = !DILocation(line: 36, column: 17, scope: !942)
!942 = !DILexicalBlockFile(scope: !943, file: !905, discriminator: 1)
!943 = distinct !DILexicalBlock(scope: !939, file: !905, line: 36, column: 5)
!944 = !DILocation(line: 36, column: 19, scope: !942)
!945 = !DILocation(line: 36, column: 5, scope: !942)
!946 = !DILocalVariable(name: "j", scope: !947, file: !905, line: 37, type: !930)
!947 = distinct !DILexicalBlock(scope: !943, file: !905, line: 36, column: 30)
!948 = !DILocation(line: 37, column: 13, scope: !947)
!949 = !DILocation(line: 37, column: 31, scope: !947)
!950 = !DILocation(line: 37, column: 17, scope: !947)
!951 = !DILocation(line: 38, column: 41, scope: !947)
!952 = !DILocation(line: 38, column: 29, scope: !947)
!953 = !DILocation(line: 38, column: 24, scope: !947)
!954 = !DILocation(line: 38, column: 9, scope: !947)
!955 = !DILocation(line: 38, column: 13, scope: !947)
!956 = !DILocation(line: 38, column: 27, scope: !947)
!957 = !DILocation(line: 39, column: 5, scope: !947)
!958 = !DILocation(line: 36, column: 26, scope: !959)
!959 = !DILexicalBlockFile(scope: !943, file: !905, discriminator: 2)
!960 = !DILocation(line: 36, column: 5, scope: !959)
!961 = distinct !{!961, !962}
!962 = !DILocation(line: 36, column: 5, scope: !904)
!963 = !DILocation(line: 41, column: 9, scope: !904)
!964 = !DILocation(line: 42, column: 12, scope: !965)
!965 = distinct !DILexicalBlock(scope: !904, file: !905, line: 42, column: 5)
!966 = !DILocation(line: 42, column: 10, scope: !965)
!967 = !DILocation(line: 42, column: 17, scope: !968)
!968 = !DILexicalBlockFile(scope: !969, file: !905, discriminator: 1)
!969 = distinct !DILexicalBlock(scope: !965, file: !905, line: 42, column: 5)
!970 = !DILocation(line: 42, column: 19, scope: !968)
!971 = !DILocation(line: 42, column: 5, scope: !968)
!972 = !DILocalVariable(name: "j", scope: !973, file: !905, line: 43, type: !930)
!973 = distinct !DILexicalBlock(scope: !969, file: !905, line: 42, column: 30)
!974 = !DILocation(line: 43, column: 13, scope: !973)
!975 = !DILocation(line: 43, column: 32, scope: !973)
!976 = !DILocation(line: 43, column: 17, scope: !973)
!977 = !DILocation(line: 43, column: 21, scope: !973)
!978 = !DILocation(line: 44, column: 13, scope: !979)
!979 = distinct !DILexicalBlock(scope: !973, file: !905, line: 44, column: 13)
!980 = !DILocation(line: 44, column: 17, scope: !979)
!981 = !DILocation(line: 44, column: 15, scope: !979)
!982 = !DILocation(line: 44, column: 13, scope: !973)
!983 = !DILocation(line: 45, column: 19, scope: !979)
!984 = !DILocation(line: 45, column: 17, scope: !979)
!985 = !DILocation(line: 45, column: 13, scope: !979)
!986 = !DILocation(line: 46, column: 29, scope: !973)
!987 = !DILocation(line: 46, column: 24, scope: !973)
!988 = !DILocation(line: 46, column: 9, scope: !973)
!989 = !DILocation(line: 46, column: 13, scope: !973)
!990 = !DILocation(line: 46, column: 27, scope: !973)
!991 = !DILocation(line: 47, column: 5, scope: !973)
!992 = !DILocation(line: 42, column: 26, scope: !993)
!993 = !DILexicalBlockFile(scope: !969, file: !905, discriminator: 2)
!994 = !DILocation(line: 42, column: 5, scope: !993)
!995 = distinct !{!995, !996}
!996 = !DILocation(line: 42, column: 5, scope: !904)
!997 = !DILocation(line: 48, column: 1, scope: !904)
!998 = distinct !DISubprogram(name: "ff_init_scantable_permutation", scope: !905, file: !905, line: 50, type: !999, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !921)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !908, !3}
!1001 = !DILocalVariable(name: "idct_permutation", arg: 1, scope: !998, file: !905, line: 50, type: !908)
!1002 = !DILocation(line: 50, column: 67, scope: !998)
!1003 = !DILocalVariable(name: "perm_type", arg: 2, scope: !998, file: !905, line: 51, type: !3)
!1004 = !DILocation(line: 51, column: 71, scope: !998)
!1005 = !DILocalVariable(name: "i", scope: !998, file: !905, line: 53, type: !930)
!1006 = !DILocation(line: 53, column: 9, scope: !998)
!1007 = !DILocation(line: 56, column: 47, scope: !1008)
!1008 = distinct !DILexicalBlock(scope: !1009, file: !905, line: 56, column: 13)
!1009 = distinct !DILexicalBlock(scope: !998, file: !905, line: 55, column: 9)
!1010 = !DILocation(line: 57, column: 47, scope: !1008)
!1011 = !DILocation(line: 56, column: 13, scope: !1008)
!1012 = !DILocation(line: 56, column: 13, scope: !1009)
!1013 = !DILocation(line: 58, column: 13, scope: !1008)
!1014 = !DILocation(line: 60, column: 13, scope: !998)
!1015 = !DILocation(line: 60, column: 5, scope: !998)
!1016 = !DILocation(line: 62, column: 16, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !905, line: 62, column: 9)
!1018 = distinct !DILexicalBlock(scope: !998, file: !905, line: 60, column: 24)
!1019 = !DILocation(line: 62, column: 14, scope: !1017)
!1020 = !DILocation(line: 62, column: 21, scope: !1021)
!1021 = !DILexicalBlockFile(scope: !1022, file: !905, discriminator: 1)
!1022 = distinct !DILexicalBlock(scope: !1017, file: !905, line: 62, column: 9)
!1023 = !DILocation(line: 62, column: 23, scope: !1021)
!1024 = !DILocation(line: 62, column: 9, scope: !1021)
!1025 = !DILocation(line: 63, column: 35, scope: !1022)
!1026 = !DILocation(line: 63, column: 30, scope: !1022)
!1027 = !DILocation(line: 63, column: 13, scope: !1022)
!1028 = !DILocation(line: 63, column: 33, scope: !1022)
!1029 = !DILocation(line: 62, column: 30, scope: !1030)
!1030 = !DILexicalBlockFile(scope: !1022, file: !905, discriminator: 2)
!1031 = !DILocation(line: 62, column: 9, scope: !1030)
!1032 = distinct !{!1032, !1033}
!1033 = !DILocation(line: 62, column: 9, scope: !1018)
!1034 = !DILocation(line: 64, column: 9, scope: !1018)
!1035 = !DILocation(line: 66, column: 16, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1018, file: !905, line: 66, column: 9)
!1037 = !DILocation(line: 66, column: 14, scope: !1036)
!1038 = !DILocation(line: 66, column: 21, scope: !1039)
!1039 = !DILexicalBlockFile(scope: !1040, file: !905, discriminator: 1)
!1040 = distinct !DILexicalBlock(scope: !1036, file: !905, line: 66, column: 9)
!1041 = !DILocation(line: 66, column: 23, scope: !1039)
!1042 = !DILocation(line: 66, column: 9, scope: !1039)
!1043 = !DILocation(line: 67, column: 36, scope: !1040)
!1044 = !DILocation(line: 67, column: 38, scope: !1040)
!1045 = !DILocation(line: 67, column: 50, scope: !1040)
!1046 = !DILocation(line: 67, column: 52, scope: !1040)
!1047 = !DILocation(line: 67, column: 57, scope: !1040)
!1048 = !DILocation(line: 67, column: 46, scope: !1040)
!1049 = !DILocation(line: 67, column: 67, scope: !1040)
!1050 = !DILocation(line: 67, column: 69, scope: !1040)
!1051 = !DILocation(line: 67, column: 74, scope: !1040)
!1052 = !DILocation(line: 67, column: 63, scope: !1040)
!1053 = !DILocation(line: 67, column: 35, scope: !1040)
!1054 = !DILocation(line: 67, column: 30, scope: !1040)
!1055 = !DILocation(line: 67, column: 13, scope: !1040)
!1056 = !DILocation(line: 67, column: 33, scope: !1040)
!1057 = !DILocation(line: 66, column: 30, scope: !1058)
!1058 = !DILexicalBlockFile(scope: !1040, file: !905, discriminator: 2)
!1059 = !DILocation(line: 66, column: 9, scope: !1058)
!1060 = distinct !{!1060, !1061}
!1061 = !DILocation(line: 66, column: 9, scope: !1018)
!1062 = !DILocation(line: 68, column: 9, scope: !1018)
!1063 = !DILocation(line: 70, column: 16, scope: !1064)
!1064 = distinct !DILexicalBlock(scope: !1018, file: !905, line: 70, column: 9)
!1065 = !DILocation(line: 70, column: 14, scope: !1064)
!1066 = !DILocation(line: 70, column: 21, scope: !1067)
!1067 = !DILexicalBlockFile(scope: !1068, file: !905, discriminator: 1)
!1068 = distinct !DILexicalBlock(scope: !1064, file: !905, line: 70, column: 9)
!1069 = !DILocation(line: 70, column: 23, scope: !1067)
!1070 = !DILocation(line: 70, column: 9, scope: !1067)
!1071 = !DILocation(line: 71, column: 37, scope: !1068)
!1072 = !DILocation(line: 71, column: 39, scope: !1068)
!1073 = !DILocation(line: 71, column: 44, scope: !1068)
!1074 = !DILocation(line: 71, column: 53, scope: !1068)
!1075 = !DILocation(line: 71, column: 55, scope: !1068)
!1076 = !DILocation(line: 71, column: 50, scope: !1068)
!1077 = !DILocation(line: 71, column: 35, scope: !1068)
!1078 = !DILocation(line: 71, column: 30, scope: !1068)
!1079 = !DILocation(line: 71, column: 13, scope: !1068)
!1080 = !DILocation(line: 71, column: 33, scope: !1068)
!1081 = !DILocation(line: 70, column: 30, scope: !1082)
!1082 = !DILexicalBlockFile(scope: !1068, file: !905, discriminator: 2)
!1083 = !DILocation(line: 70, column: 9, scope: !1082)
!1084 = distinct !{!1084, !1085}
!1085 = !DILocation(line: 70, column: 9, scope: !1018)
!1086 = !DILocation(line: 72, column: 9, scope: !1018)
!1087 = !DILocation(line: 74, column: 16, scope: !1088)
!1088 = distinct !DILexicalBlock(scope: !1018, file: !905, line: 74, column: 9)
!1089 = !DILocation(line: 74, column: 14, scope: !1088)
!1090 = !DILocation(line: 74, column: 21, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1092, file: !905, discriminator: 1)
!1092 = distinct !DILexicalBlock(scope: !1088, file: !905, line: 74, column: 9)
!1093 = !DILocation(line: 74, column: 23, scope: !1091)
!1094 = !DILocation(line: 74, column: 9, scope: !1091)
!1095 = !DILocation(line: 75, column: 36, scope: !1092)
!1096 = !DILocation(line: 75, column: 38, scope: !1092)
!1097 = !DILocation(line: 75, column: 50, scope: !1092)
!1098 = !DILocation(line: 75, column: 52, scope: !1092)
!1099 = !DILocation(line: 75, column: 57, scope: !1092)
!1100 = !DILocation(line: 75, column: 46, scope: !1092)
!1101 = !DILocation(line: 75, column: 67, scope: !1092)
!1102 = !DILocation(line: 75, column: 69, scope: !1092)
!1103 = !DILocation(line: 75, column: 75, scope: !1092)
!1104 = !DILocation(line: 75, column: 63, scope: !1092)
!1105 = !DILocation(line: 75, column: 35, scope: !1092)
!1106 = !DILocation(line: 75, column: 30, scope: !1092)
!1107 = !DILocation(line: 75, column: 13, scope: !1092)
!1108 = !DILocation(line: 75, column: 33, scope: !1092)
!1109 = !DILocation(line: 74, column: 30, scope: !1110)
!1110 = !DILexicalBlockFile(scope: !1092, file: !905, discriminator: 2)
!1111 = !DILocation(line: 74, column: 9, scope: !1110)
!1112 = distinct !{!1112, !1113}
!1113 = !DILocation(line: 74, column: 9, scope: !1018)
!1114 = !DILocation(line: 76, column: 9, scope: !1018)
!1115 = !DILocation(line: 78, column: 9, scope: !1018)
!1116 = !DILocation(line: 80, column: 5, scope: !1018)
!1117 = !DILocation(line: 81, column: 1, scope: !998)
!1118 = distinct !DISubprogram(name: "ff_put_pixels_clamped_c", scope: !905, file: !905, line: 83, type: !1119, isLocal: false, isDefinition: true, scopeLine: 85, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !921)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{null, !1121, !1125, !1126}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !899, line: 37, baseType: !1124)
!1124 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1125 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !908)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1127, line: 149, baseType: !1128)
!1127 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1128 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1129 = !DILocalVariable(name: "a", arg: 1, scope: !1130, file: !1131, line: 159, type: !930)
!1130 = distinct !DISubprogram(name: "av_clip_uint8_c", scope: !1131, file: !1131, line: 159, type: !1132, isLocal: true, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !921)
!1131 = !DIFile(filename: "./libavutil/common.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1132 = !DISubroutineType(types: !1133)
!1133 = !{!898, !930}
!1134 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1135)
!1135 = distinct !DILocation(line: 91, column: 21, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !905, line: 89, column: 29)
!1137 = distinct !DILexicalBlock(scope: !1138, file: !905, line: 89, column: 5)
!1138 = distinct !DILexicalBlock(scope: !1118, file: !905, line: 89, column: 5)
!1139 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1140)
!1140 = distinct !DILocation(line: 92, column: 21, scope: !1136)
!1141 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1142)
!1142 = distinct !DILocation(line: 93, column: 21, scope: !1136)
!1143 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1144)
!1144 = distinct !DILocation(line: 94, column: 21, scope: !1136)
!1145 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1146)
!1146 = distinct !DILocation(line: 95, column: 21, scope: !1136)
!1147 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1148)
!1148 = distinct !DILocation(line: 96, column: 21, scope: !1136)
!1149 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1150)
!1150 = distinct !DILocation(line: 97, column: 21, scope: !1136)
!1151 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1152)
!1152 = distinct !DILocation(line: 90, column: 21, scope: !1136)
!1153 = !DILocalVariable(name: "block", arg: 1, scope: !1118, file: !905, line: 83, type: !1121)
!1154 = !DILocation(line: 83, column: 45, scope: !1118)
!1155 = !DILocalVariable(name: "pixels", arg: 2, scope: !1118, file: !905, line: 83, type: !1125)
!1156 = !DILocation(line: 83, column: 70, scope: !1118)
!1157 = !DILocalVariable(name: "line_size", arg: 3, scope: !1118, file: !905, line: 84, type: !1126)
!1158 = !DILocation(line: 84, column: 40, scope: !1118)
!1159 = !DILocalVariable(name: "i", scope: !1118, file: !905, line: 86, type: !930)
!1160 = !DILocation(line: 86, column: 9, scope: !1118)
!1161 = !DILocation(line: 89, column: 12, scope: !1138)
!1162 = !DILocation(line: 89, column: 10, scope: !1138)
!1163 = !DILocation(line: 89, column: 17, scope: !1164)
!1164 = !DILexicalBlockFile(scope: !1137, file: !905, discriminator: 1)
!1165 = !DILocation(line: 89, column: 19, scope: !1164)
!1166 = !DILocation(line: 89, column: 5, scope: !1164)
!1167 = !DILocation(line: 90, column: 37, scope: !1136)
!1168 = !DILocation(line: 90, column: 21, scope: !1136)
!1169 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1152)
!1170 = distinct !DILexicalBlock(scope: !1130, file: !1131, line: 161, column: 9)
!1171 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1152)
!1172 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1152)
!1173 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1152)
!1174 = !DILexicalBlockFile(scope: !1170, file: !1131, discriminator: 1)
!1175 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1152)
!1176 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1152)
!1177 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1152)
!1178 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1152)
!1179 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1152)
!1180 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1152)
!1181 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1152)
!1182 = !DILocation(line: 90, column: 9, scope: !1136)
!1183 = !DILocation(line: 90, column: 19, scope: !1136)
!1184 = !DILocation(line: 91, column: 37, scope: !1136)
!1185 = !DILocation(line: 91, column: 21, scope: !1136)
!1186 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1135)
!1187 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1135)
!1188 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1135)
!1189 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1135)
!1190 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1135)
!1191 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1135)
!1192 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1135)
!1193 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1135)
!1194 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1135)
!1195 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1135)
!1196 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1135)
!1197 = !DILocation(line: 91, column: 9, scope: !1136)
!1198 = !DILocation(line: 91, column: 19, scope: !1136)
!1199 = !DILocation(line: 92, column: 37, scope: !1136)
!1200 = !DILocation(line: 92, column: 21, scope: !1136)
!1201 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1140)
!1202 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1140)
!1203 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1140)
!1204 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1140)
!1205 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1140)
!1206 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1140)
!1207 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1140)
!1208 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1140)
!1209 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1140)
!1210 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1140)
!1211 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1140)
!1212 = !DILocation(line: 92, column: 9, scope: !1136)
!1213 = !DILocation(line: 92, column: 19, scope: !1136)
!1214 = !DILocation(line: 93, column: 37, scope: !1136)
!1215 = !DILocation(line: 93, column: 21, scope: !1136)
!1216 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1142)
!1217 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1142)
!1218 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1142)
!1219 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1142)
!1220 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1142)
!1221 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1142)
!1222 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1142)
!1223 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1142)
!1224 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1142)
!1225 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1142)
!1226 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1142)
!1227 = !DILocation(line: 93, column: 9, scope: !1136)
!1228 = !DILocation(line: 93, column: 19, scope: !1136)
!1229 = !DILocation(line: 94, column: 37, scope: !1136)
!1230 = !DILocation(line: 94, column: 21, scope: !1136)
!1231 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1144)
!1232 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1144)
!1233 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1144)
!1234 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1144)
!1235 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1144)
!1236 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1144)
!1237 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1144)
!1238 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1144)
!1239 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1144)
!1240 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1144)
!1241 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1144)
!1242 = !DILocation(line: 94, column: 9, scope: !1136)
!1243 = !DILocation(line: 94, column: 19, scope: !1136)
!1244 = !DILocation(line: 95, column: 37, scope: !1136)
!1245 = !DILocation(line: 95, column: 21, scope: !1136)
!1246 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1146)
!1247 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1146)
!1248 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1146)
!1249 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1146)
!1250 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1146)
!1251 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1146)
!1252 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1146)
!1253 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1146)
!1254 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1146)
!1255 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1146)
!1256 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1146)
!1257 = !DILocation(line: 95, column: 9, scope: !1136)
!1258 = !DILocation(line: 95, column: 19, scope: !1136)
!1259 = !DILocation(line: 96, column: 37, scope: !1136)
!1260 = !DILocation(line: 96, column: 21, scope: !1136)
!1261 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1148)
!1262 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1148)
!1263 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1148)
!1264 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1148)
!1265 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1148)
!1266 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1148)
!1267 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1148)
!1268 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1148)
!1269 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1148)
!1270 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1148)
!1271 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1148)
!1272 = !DILocation(line: 96, column: 9, scope: !1136)
!1273 = !DILocation(line: 96, column: 19, scope: !1136)
!1274 = !DILocation(line: 97, column: 37, scope: !1136)
!1275 = !DILocation(line: 97, column: 21, scope: !1136)
!1276 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1150)
!1277 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1150)
!1278 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1150)
!1279 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1150)
!1280 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1150)
!1281 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1150)
!1282 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1150)
!1283 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1150)
!1284 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1150)
!1285 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1150)
!1286 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1150)
!1287 = !DILocation(line: 97, column: 9, scope: !1136)
!1288 = !DILocation(line: 97, column: 19, scope: !1136)
!1289 = !DILocation(line: 99, column: 19, scope: !1136)
!1290 = !DILocation(line: 99, column: 16, scope: !1136)
!1291 = !DILocation(line: 100, column: 15, scope: !1136)
!1292 = !DILocation(line: 101, column: 5, scope: !1136)
!1293 = !DILocation(line: 89, column: 25, scope: !1294)
!1294 = !DILexicalBlockFile(scope: !1137, file: !905, discriminator: 2)
!1295 = !DILocation(line: 89, column: 5, scope: !1294)
!1296 = distinct !{!1296, !1297}
!1297 = !DILocation(line: 89, column: 5, scope: !1118)
!1298 = !DILocation(line: 102, column: 1, scope: !1118)
!1299 = distinct !DISubprogram(name: "ff_add_pixels_clamped_c", scope: !905, file: !905, line: 157, type: !1119, isLocal: false, isDefinition: true, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !921)
!1300 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1301)
!1301 = distinct !DILocation(line: 165, column: 21, scope: !1302)
!1302 = distinct !DILexicalBlock(scope: !1303, file: !905, line: 163, column: 29)
!1303 = distinct !DILexicalBlock(scope: !1304, file: !905, line: 163, column: 5)
!1304 = distinct !DILexicalBlock(scope: !1299, file: !905, line: 163, column: 5)
!1305 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1306)
!1306 = distinct !DILocation(line: 166, column: 21, scope: !1302)
!1307 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1308)
!1308 = distinct !DILocation(line: 167, column: 21, scope: !1302)
!1309 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1310)
!1310 = distinct !DILocation(line: 168, column: 21, scope: !1302)
!1311 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1312)
!1312 = distinct !DILocation(line: 169, column: 21, scope: !1302)
!1313 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1314)
!1314 = distinct !DILocation(line: 170, column: 21, scope: !1302)
!1315 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1316)
!1316 = distinct !DILocation(line: 171, column: 21, scope: !1302)
!1317 = !DILocation(line: 159, column: 97, scope: !1130, inlinedAt: !1318)
!1318 = distinct !DILocation(line: 164, column: 21, scope: !1302)
!1319 = !DILocalVariable(name: "block", arg: 1, scope: !1299, file: !905, line: 157, type: !1121)
!1320 = !DILocation(line: 157, column: 45, scope: !1299)
!1321 = !DILocalVariable(name: "pixels", arg: 2, scope: !1299, file: !905, line: 157, type: !1125)
!1322 = !DILocation(line: 157, column: 70, scope: !1299)
!1323 = !DILocalVariable(name: "line_size", arg: 3, scope: !1299, file: !905, line: 158, type: !1126)
!1324 = !DILocation(line: 158, column: 40, scope: !1299)
!1325 = !DILocalVariable(name: "i", scope: !1299, file: !905, line: 160, type: !930)
!1326 = !DILocation(line: 160, column: 9, scope: !1299)
!1327 = !DILocation(line: 163, column: 12, scope: !1304)
!1328 = !DILocation(line: 163, column: 10, scope: !1304)
!1329 = !DILocation(line: 163, column: 17, scope: !1330)
!1330 = !DILexicalBlockFile(scope: !1303, file: !905, discriminator: 1)
!1331 = !DILocation(line: 163, column: 19, scope: !1330)
!1332 = !DILocation(line: 163, column: 5, scope: !1330)
!1333 = !DILocation(line: 164, column: 37, scope: !1302)
!1334 = !DILocation(line: 164, column: 49, scope: !1302)
!1335 = !DILocation(line: 164, column: 47, scope: !1302)
!1336 = !DILocation(line: 164, column: 21, scope: !1302)
!1337 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1318)
!1338 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1318)
!1339 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1318)
!1340 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1318)
!1341 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1318)
!1342 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1318)
!1343 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1318)
!1344 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1318)
!1345 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1318)
!1346 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1318)
!1347 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1318)
!1348 = !DILocation(line: 164, column: 9, scope: !1302)
!1349 = !DILocation(line: 164, column: 19, scope: !1302)
!1350 = !DILocation(line: 165, column: 37, scope: !1302)
!1351 = !DILocation(line: 165, column: 49, scope: !1302)
!1352 = !DILocation(line: 165, column: 47, scope: !1302)
!1353 = !DILocation(line: 165, column: 21, scope: !1302)
!1354 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1301)
!1355 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1301)
!1356 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1301)
!1357 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1301)
!1358 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1301)
!1359 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1301)
!1360 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1301)
!1361 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1301)
!1362 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1301)
!1363 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1301)
!1364 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1301)
!1365 = !DILocation(line: 165, column: 9, scope: !1302)
!1366 = !DILocation(line: 165, column: 19, scope: !1302)
!1367 = !DILocation(line: 166, column: 37, scope: !1302)
!1368 = !DILocation(line: 166, column: 49, scope: !1302)
!1369 = !DILocation(line: 166, column: 47, scope: !1302)
!1370 = !DILocation(line: 166, column: 21, scope: !1302)
!1371 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1306)
!1372 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1306)
!1373 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1306)
!1374 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1306)
!1375 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1306)
!1376 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1306)
!1377 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1306)
!1378 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1306)
!1379 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1306)
!1380 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1306)
!1381 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1306)
!1382 = !DILocation(line: 166, column: 9, scope: !1302)
!1383 = !DILocation(line: 166, column: 19, scope: !1302)
!1384 = !DILocation(line: 167, column: 37, scope: !1302)
!1385 = !DILocation(line: 167, column: 49, scope: !1302)
!1386 = !DILocation(line: 167, column: 47, scope: !1302)
!1387 = !DILocation(line: 167, column: 21, scope: !1302)
!1388 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1308)
!1389 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1308)
!1390 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1308)
!1391 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1308)
!1392 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1308)
!1393 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1308)
!1394 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1308)
!1395 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1308)
!1396 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1308)
!1397 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1308)
!1398 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1308)
!1399 = !DILocation(line: 167, column: 9, scope: !1302)
!1400 = !DILocation(line: 167, column: 19, scope: !1302)
!1401 = !DILocation(line: 168, column: 37, scope: !1302)
!1402 = !DILocation(line: 168, column: 49, scope: !1302)
!1403 = !DILocation(line: 168, column: 47, scope: !1302)
!1404 = !DILocation(line: 168, column: 21, scope: !1302)
!1405 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1310)
!1406 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1310)
!1407 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1310)
!1408 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1310)
!1409 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1310)
!1410 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1310)
!1411 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1310)
!1412 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1310)
!1413 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1310)
!1414 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1310)
!1415 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1310)
!1416 = !DILocation(line: 168, column: 9, scope: !1302)
!1417 = !DILocation(line: 168, column: 19, scope: !1302)
!1418 = !DILocation(line: 169, column: 37, scope: !1302)
!1419 = !DILocation(line: 169, column: 49, scope: !1302)
!1420 = !DILocation(line: 169, column: 47, scope: !1302)
!1421 = !DILocation(line: 169, column: 21, scope: !1302)
!1422 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1312)
!1423 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1312)
!1424 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1312)
!1425 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1312)
!1426 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1312)
!1427 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1312)
!1428 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1312)
!1429 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1312)
!1430 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1312)
!1431 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1312)
!1432 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1312)
!1433 = !DILocation(line: 169, column: 9, scope: !1302)
!1434 = !DILocation(line: 169, column: 19, scope: !1302)
!1435 = !DILocation(line: 170, column: 37, scope: !1302)
!1436 = !DILocation(line: 170, column: 49, scope: !1302)
!1437 = !DILocation(line: 170, column: 47, scope: !1302)
!1438 = !DILocation(line: 170, column: 21, scope: !1302)
!1439 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1314)
!1440 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1314)
!1441 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1314)
!1442 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1314)
!1443 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1314)
!1444 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1314)
!1445 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1314)
!1446 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1314)
!1447 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1314)
!1448 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1314)
!1449 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1314)
!1450 = !DILocation(line: 170, column: 9, scope: !1302)
!1451 = !DILocation(line: 170, column: 19, scope: !1302)
!1452 = !DILocation(line: 171, column: 37, scope: !1302)
!1453 = !DILocation(line: 171, column: 49, scope: !1302)
!1454 = !DILocation(line: 171, column: 47, scope: !1302)
!1455 = !DILocation(line: 171, column: 21, scope: !1302)
!1456 = !DILocation(line: 161, column: 9, scope: !1170, inlinedAt: !1316)
!1457 = !DILocation(line: 161, column: 10, scope: !1170, inlinedAt: !1316)
!1458 = !DILocation(line: 161, column: 9, scope: !1130, inlinedAt: !1316)
!1459 = !DILocation(line: 161, column: 29, scope: !1174, inlinedAt: !1316)
!1460 = !DILocation(line: 161, column: 28, scope: !1174, inlinedAt: !1316)
!1461 = !DILocation(line: 161, column: 31, scope: !1174, inlinedAt: !1316)
!1462 = !DILocation(line: 161, column: 27, scope: !1174, inlinedAt: !1316)
!1463 = !DILocation(line: 161, column: 20, scope: !1174, inlinedAt: !1316)
!1464 = !DILocation(line: 162, column: 17, scope: !1170, inlinedAt: !1316)
!1465 = !DILocation(line: 162, column: 10, scope: !1170, inlinedAt: !1316)
!1466 = !DILocation(line: 163, column: 1, scope: !1130, inlinedAt: !1316)
!1467 = !DILocation(line: 171, column: 9, scope: !1302)
!1468 = !DILocation(line: 171, column: 19, scope: !1302)
!1469 = !DILocation(line: 172, column: 19, scope: !1302)
!1470 = !DILocation(line: 172, column: 16, scope: !1302)
!1471 = !DILocation(line: 173, column: 15, scope: !1302)
!1472 = !DILocation(line: 174, column: 5, scope: !1302)
!1473 = !DILocation(line: 163, column: 25, scope: !1474)
!1474 = !DILexicalBlockFile(scope: !1303, file: !905, discriminator: 2)
!1475 = !DILocation(line: 163, column: 5, scope: !1474)
!1476 = distinct !{!1476, !1477}
!1477 = !DILocation(line: 163, column: 5, scope: !1299)
!1478 = !DILocation(line: 175, column: 1, scope: !1299)
!1479 = distinct !DISubprogram(name: "ff_idctdsp_init", scope: !905, file: !905, line: 238, type: !1480, isLocal: false, isDefinition: true, scopeLine: 239, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !921)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{null, !1482, !1503}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "IDCTDSPContext", file: !4, line: 100, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IDCTDSPContext", file: !4, line: 53, size: 960, align: 64, elements: !1485)
!1485 = !{!1486, !1488, !1489, !1490, !1495, !1499, !1500, !1501, !1502}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_clamped", scope: !1484, file: !4, line: 55, baseType: !1487, size: 64, align: 64)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "put_signed_pixels_clamped", scope: !1484, file: !4, line: 58, baseType: !1487, size: 64, align: 64, offset: 64)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "add_pixels_clamped", scope: !1484, file: !4, line: 61, baseType: !1487, size: 64, align: 64, offset: 128)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "idct", scope: !1484, file: !4, line: 65, baseType: !1491, size: 64, align: 64, offset: 192)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{null, !1494}
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "idct_put", scope: !1484, file: !4, line: 72, baseType: !1496, size: 64, align: 64, offset: 256)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DISubroutineType(types: !1498)
!1498 = !{null, !908, !1126, !1494}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "idct_add", scope: !1484, file: !4, line: 79, baseType: !1496, size: 64, align: 64, offset: 320)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "idct_permutation", scope: !1484, file: !4, line: 96, baseType: !917, size: 512, align: 8, offset: 384)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "perm_type", scope: !1484, file: !4, line: 97, baseType: !3, size: 32, align: 32, offset: 896)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg4_studio_profile", scope: !1484, file: !4, line: 99, baseType: !930, size: 32, align: 32, offset: 928)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64, align: 64)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !44, line: 3360, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !44, line: 1556, size: 8448, align: 64, elements: !1506)
!1506 = !{!1507, !1551, !1552, !1553, !1819, !1820, !1821, !1822, !1825, !1826, !1827, !1828, !1829, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1848, !1852, !1853, !1855, !1856, !1857, !1858, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910, !1911, !1912, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2032, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1505, file: !44, line: 1561, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1510 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !13, line: 143, baseType: !1511)
!1511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !13, line: 67, size: 640, align: 64, elements: !1512)
!1512 = !{!1513, !1517, !1521, !1525, !1526, !1527, !1528, !1532, !1538, !1540, !1544}
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1511, file: !13, line: 72, baseType: !1514, size: 64, align: 64)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1516)
!1516 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1511, file: !13, line: 78, baseType: !1518, size: 64, align: 64, offset: 64)
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DISubroutineType(types: !1520)
!1520 = !{!1514, !897}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1511, file: !13, line: 85, baseType: !1522, size: 64, align: 64, offset: 128)
!1522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1523, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1524)
!1524 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !13, line: 85, flags: DIFlagFwdDecl)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1511, file: !13, line: 93, baseType: !930, size: 32, align: 32, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1511, file: !13, line: 99, baseType: !930, size: 32, align: 32, offset: 224)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1511, file: !13, line: 108, baseType: !930, size: 32, align: 32, offset: 256)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1511, file: !13, line: 113, baseType: !1529, size: 64, align: 64, offset: 320)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64, align: 64)
!1530 = !DISubroutineType(types: !1531)
!1531 = !{!897, !897, !897}
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1511, file: !13, line: 123, baseType: !1533, size: 64, align: 64, offset: 384)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64, align: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!1536, !1536}
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1511)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1511, file: !13, line: 130, baseType: !1539, size: 32, align: 32, offset: 448)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !13, line: 48, baseType: !12)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1511, file: !13, line: 136, baseType: !1541, size: 64, align: 64, offset: 512)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!1539, !897}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1511, file: !13, line: 142, baseType: !1545, size: 64, align: 64, offset: 576)
!1545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1546, size: 64, align: 64)
!1546 = !DISubroutineType(types: !1547)
!1547 = !{!930, !1548, !897, !1514, !930}
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64, align: 64)
!1549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1550, size: 64, align: 64)
!1550 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !13, line: 60, flags: DIFlagFwdDecl)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1505, file: !44, line: 1562, baseType: !930, size: 32, align: 32, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1505, file: !44, line: 1564, baseType: !33, size: 32, align: 32, offset: 96)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1505, file: !44, line: 1565, baseType: !1554, size: 64, align: 64, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1555, size: 64, align: 64)
!1555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1556)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !44, line: 3468, size: 1984, align: 64, elements: !1557)
!1557 = !{!1558, !1559, !1560, !1561, !1562, !1563, !1572, !1575, !1578, !1581, !1586, !1587, !1588, !1596, !1597, !1598, !1600, !1604, !1610, !1615, !1619, !1620, !1670, !1790, !1794, !1795, !1799, !1803, !1808, !1812, !1813, !1814}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1556, file: !44, line: 3475, baseType: !1514, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1556, file: !44, line: 3480, baseType: !1514, size: 64, align: 64, offset: 64)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1556, file: !44, line: 3481, baseType: !33, size: 32, align: 32, offset: 128)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1556, file: !44, line: 3482, baseType: !43, size: 32, align: 32, offset: 160)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1556, file: !44, line: 3487, baseType: !930, size: 32, align: 32, offset: 192)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1556, file: !44, line: 3488, baseType: !1564, size: 64, align: 64, offset: 256)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1566)
!1566 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1567, line: 61, baseType: !1568)
!1567 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1567, line: 58, size: 64, align: 32, elements: !1569)
!1569 = !{!1570, !1571}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1568, file: !1567, line: 59, baseType: !930, size: 32, align: 32)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1568, file: !1567, line: 60, baseType: !930, size: 32, align: 32, offset: 32)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1556, file: !44, line: 3489, baseType: !1573, size: 64, align: 64, offset: 320)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1556, file: !44, line: 3490, baseType: !1576, size: 64, align: 64, offset: 384)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1556, file: !44, line: 3491, baseType: !1579, size: 64, align: 64, offset: 448)
!1579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1580, size: 64, align: 64)
!1580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !703)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1556, file: !44, line: 3492, baseType: !1582, size: 64, align: 64, offset: 512)
!1582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1583, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1584)
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !899, line: 55, baseType: !1585)
!1585 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1556, file: !44, line: 3493, baseType: !898, size: 8, align: 8, offset: 576)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1556, file: !44, line: 3494, baseType: !1508, size: 64, align: 64, offset: 640)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1556, file: !44, line: 3495, baseType: !1589, size: 64, align: 64, offset: 704)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1591)
!1591 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !44, line: 3404, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !44, line: 3401, size: 128, align: 64, elements: !1593)
!1593 = !{!1594, !1595}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1592, file: !44, line: 3402, baseType: !930, size: 32, align: 32)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1592, file: !44, line: 3403, baseType: !1514, size: 64, align: 64, offset: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1556, file: !44, line: 3507, baseType: !1514, size: 64, align: 64, offset: 768)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1556, file: !44, line: 3516, baseType: !930, size: 32, align: 32, offset: 832)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1556, file: !44, line: 3517, baseType: !1599, size: 64, align: 64, offset: 896)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1556, file: !44, line: 3527, baseType: !1601, size: 64, align: 64, offset: 960)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!930, !1503}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1556, file: !44, line: 3535, baseType: !1605, size: 64, align: 64, offset: 1024)
!1605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1606, size: 64, align: 64)
!1606 = !DISubroutineType(types: !1607)
!1607 = !{!930, !1503, !1608}
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64, align: 64)
!1609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1504)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1556, file: !44, line: 3541, baseType: !1611, size: 64, align: 64, offset: 1088)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1612, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1613)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !44, line: 3461, baseType: !1614)
!1614 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !44, line: 3461, flags: DIFlagFwdDecl)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1556, file: !44, line: 3549, baseType: !1616, size: 64, align: 64, offset: 1152)
!1616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1617, size: 64, align: 64)
!1617 = !DISubroutineType(types: !1618)
!1618 = !{null, !1599}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1556, file: !44, line: 3551, baseType: !1601, size: 64, align: 64, offset: 1216)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1556, file: !44, line: 3552, baseType: !1621, size: 64, align: 64, offset: 1280)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DISubroutineType(types: !1623)
!1623 = !{!930, !1503, !908, !930, !1624}
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !44, line: 3920, size: 256, align: 64, elements: !1627)
!1627 = !{!1628, !1631, !1634, !1635, !1636, !1668}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1626, file: !44, line: 3921, baseType: !1629, size: 16, align: 16)
!1629 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !899, line: 49, baseType: !1630)
!1630 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1626, file: !44, line: 3922, baseType: !1632, size: 32, align: 32, offset: 32)
!1632 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !899, line: 51, baseType: !1633)
!1633 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1626, file: !44, line: 3923, baseType: !1632, size: 32, align: 32, offset: 64)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1626, file: !44, line: 3924, baseType: !1633, size: 32, align: 32, offset: 96)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1626, file: !44, line: 3925, baseType: !1637, size: 64, align: 64, offset: 128)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1639, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !44, line: 3918, baseType: !1640)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !44, line: 3885, size: 1600, align: 64, elements: !1641)
!1641 = !{!1642, !1643, !1644, !1645, !1646, !1647, !1657, !1661, !1663, !1664, !1666, !1667}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1640, file: !44, line: 3886, baseType: !930, size: 32, align: 32)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1640, file: !44, line: 3887, baseType: !930, size: 32, align: 32, offset: 32)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1640, file: !44, line: 3888, baseType: !930, size: 32, align: 32, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1640, file: !44, line: 3889, baseType: !930, size: 32, align: 32, offset: 96)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1640, file: !44, line: 3890, baseType: !930, size: 32, align: 32, offset: 128)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1640, file: !44, line: 3897, baseType: !1648, size: 768, align: 64, offset: 192)
!1648 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !44, line: 3858, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !44, line: 3853, size: 768, align: 64, elements: !1650)
!1650 = !{!1651, !1655}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1649, file: !44, line: 3855, baseType: !1652, size: 512, align: 64)
!1652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 512, align: 64, elements: !1653)
!1653 = !{!1654}
!1654 = !DISubrange(count: 8)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1649, file: !44, line: 3857, baseType: !1656, size: 256, align: 32, offset: 512)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 256, align: 32, elements: !1653)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1640, file: !44, line: 3903, baseType: !1658, size: 256, align: 64, offset: 960)
!1658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 256, align: 64, elements: !1659)
!1659 = !{!1660}
!1660 = !DISubrange(count: 4)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1640, file: !44, line: 3904, baseType: !1662, size: 128, align: 32, offset: 1216)
!1662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 128, align: 32, elements: !1659)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1640, file: !44, line: 3906, baseType: !720, size: 32, align: 32, offset: 1344)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1640, file: !44, line: 3908, baseType: !1665, size: 64, align: 64, offset: 1408)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1640, file: !44, line: 3915, baseType: !1665, size: 64, align: 64, offset: 1472)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1640, file: !44, line: 3917, baseType: !930, size: 32, align: 32, offset: 1536)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1626, file: !44, line: 3926, baseType: !1669, size: 64, align: 64, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !899, line: 40, baseType: !1128)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1556, file: !44, line: 3564, baseType: !1671, size: 64, align: 64, offset: 1344)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DISubroutineType(types: !1673)
!1673 = !{!930, !1503, !1674, !1708, !1789}
!1674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !44, line: 1499, baseType: !1676)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !44, line: 1445, size: 704, align: 64, elements: !1677)
!1677 = !{!1678, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1704, !1705, !1706, !1707}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1676, file: !44, line: 1451, baseType: !1679, size: 64, align: 64)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1681, line: 94, baseType: !1682)
!1681 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1681, line: 81, size: 192, align: 64, elements: !1683)
!1683 = !{!1684, !1688, !1689}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1682, file: !1681, line: 82, baseType: !1685, size: 64, align: 64)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1681, line: 73, baseType: !1687)
!1687 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1681, line: 73, flags: DIFlagFwdDecl)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1682, file: !1681, line: 89, baseType: !908, size: 64, align: 64, offset: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1682, file: !1681, line: 93, baseType: !930, size: 32, align: 32, offset: 128)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1676, file: !44, line: 1461, baseType: !1669, size: 64, align: 64, offset: 64)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1676, file: !44, line: 1467, baseType: !1669, size: 64, align: 64, offset: 128)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1676, file: !44, line: 1468, baseType: !908, size: 64, align: 64, offset: 192)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1676, file: !44, line: 1469, baseType: !930, size: 32, align: 32, offset: 256)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1676, file: !44, line: 1470, baseType: !930, size: 32, align: 32, offset: 288)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1676, file: !44, line: 1474, baseType: !930, size: 32, align: 32, offset: 320)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1676, file: !44, line: 1479, baseType: !1697, size: 64, align: 64, offset: 384)
!1697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1698, size: 64, align: 64)
!1698 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !44, line: 1415, baseType: !1699)
!1699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !44, line: 1411, size: 128, align: 64, elements: !1700)
!1700 = !{!1701, !1702, !1703}
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1699, file: !44, line: 1412, baseType: !908, size: 64, align: 64)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1699, file: !44, line: 1413, baseType: !930, size: 32, align: 32, offset: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1699, file: !44, line: 1414, baseType: !726, size: 32, align: 32, offset: 96)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1676, file: !44, line: 1480, baseType: !930, size: 32, align: 32, offset: 448)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1676, file: !44, line: 1486, baseType: !1669, size: 64, align: 64, offset: 512)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1676, file: !44, line: 1488, baseType: !1669, size: 64, align: 64, offset: 576)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1676, file: !44, line: 1497, baseType: !1669, size: 64, align: 64, offset: 640)
!1708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1709, size: 64, align: 64)
!1709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1710)
!1710 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1711)
!1711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1712)
!1712 = !{!1713, !1714, !1715, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1742, !1744, !1745, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1778, !1779, !1780, !1781, !1782, !1783, !1785, !1786, !1787, !1788}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1711, file: !767, line: 282, baseType: !1652, size: 512, align: 64)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1711, file: !767, line: 299, baseType: !1656, size: 256, align: 32, offset: 512)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1711, file: !767, line: 315, baseType: !1716, size: 64, align: 64, offset: 768)
!1716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1711, file: !767, line: 326, baseType: !930, size: 32, align: 32, offset: 832)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1711, file: !767, line: 326, baseType: !930, size: 32, align: 32, offset: 864)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1711, file: !767, line: 334, baseType: !930, size: 32, align: 32, offset: 896)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1711, file: !767, line: 341, baseType: !930, size: 32, align: 32, offset: 928)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1711, file: !767, line: 346, baseType: !930, size: 32, align: 32, offset: 960)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1711, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1711, file: !767, line: 356, baseType: !1566, size: 64, align: 32, offset: 1024)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1711, file: !767, line: 361, baseType: !1669, size: 64, align: 64, offset: 1088)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1711, file: !767, line: 369, baseType: !1669, size: 64, align: 64, offset: 1152)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1711, file: !767, line: 377, baseType: !1669, size: 64, align: 64, offset: 1216)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1711, file: !767, line: 382, baseType: !930, size: 32, align: 32, offset: 1280)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1711, file: !767, line: 386, baseType: !930, size: 32, align: 32, offset: 1312)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1711, file: !767, line: 391, baseType: !930, size: 32, align: 32, offset: 1344)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1711, file: !767, line: 396, baseType: !897, size: 64, align: 64, offset: 1408)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1711, file: !767, line: 403, baseType: !1732, size: 512, align: 64, offset: 1472)
!1732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1584, size: 512, align: 64, elements: !1653)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1711, file: !767, line: 410, baseType: !930, size: 32, align: 32, offset: 1984)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1711, file: !767, line: 415, baseType: !930, size: 32, align: 32, offset: 2016)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1711, file: !767, line: 420, baseType: !930, size: 32, align: 32, offset: 2048)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1711, file: !767, line: 425, baseType: !930, size: 32, align: 32, offset: 2080)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1711, file: !767, line: 435, baseType: !1669, size: 64, align: 64, offset: 2112)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1711, file: !767, line: 440, baseType: !930, size: 32, align: 32, offset: 2176)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1711, file: !767, line: 445, baseType: !1584, size: 64, align: 64, offset: 2240)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1711, file: !767, line: 459, baseType: !1741, size: 512, align: 64, offset: 2304)
!1741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1679, size: 512, align: 64, elements: !1653)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1711, file: !767, line: 473, baseType: !1743, size: 64, align: 64, offset: 2816)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1679, size: 64, align: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1711, file: !767, line: 477, baseType: !930, size: 32, align: 32, offset: 2880)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1711, file: !767, line: 479, baseType: !1746, size: 64, align: 64, offset: 2944)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64, align: 64)
!1747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1748, size: 64, align: 64)
!1748 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1749)
!1749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1750)
!1750 = !{!1751, !1752, !1753, !1754, !1759}
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1749, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1749, file: !767, line: 203, baseType: !908, size: 64, align: 64, offset: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1749, file: !767, line: 204, baseType: !930, size: 32, align: 32, offset: 128)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1749, file: !767, line: 205, baseType: !1755, size: 64, align: 64, offset: 192)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64, align: 64)
!1756 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1757, line: 86, baseType: !1758)
!1757 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1758 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1757, line: 86, flags: DIFlagFwdDecl)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1749, file: !767, line: 206, baseType: !1679, size: 64, align: 64, offset: 256)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1711, file: !767, line: 480, baseType: !930, size: 32, align: 32, offset: 3008)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1711, file: !767, line: 505, baseType: !930, size: 32, align: 32, offset: 3040)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1711, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1711, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1711, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1711, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1711, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1711, file: !767, line: 532, baseType: !1669, size: 64, align: 64, offset: 3264)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1711, file: !767, line: 539, baseType: !1669, size: 64, align: 64, offset: 3328)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1711, file: !767, line: 547, baseType: !1669, size: 64, align: 64, offset: 3392)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1711, file: !767, line: 554, baseType: !1755, size: 64, align: 64, offset: 3456)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1711, file: !767, line: 563, baseType: !930, size: 32, align: 32, offset: 3520)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1711, file: !767, line: 572, baseType: !930, size: 32, align: 32, offset: 3552)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1711, file: !767, line: 581, baseType: !930, size: 32, align: 32, offset: 3584)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1711, file: !767, line: 588, baseType: !1775, size: 64, align: 64, offset: 3648)
!1775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1776, size: 64, align: 64)
!1776 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !899, line: 36, baseType: !1777)
!1777 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1711, file: !767, line: 593, baseType: !930, size: 32, align: 32, offset: 3712)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1711, file: !767, line: 596, baseType: !930, size: 32, align: 32, offset: 3744)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1711, file: !767, line: 599, baseType: !1679, size: 64, align: 64, offset: 3776)
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1711, file: !767, line: 605, baseType: !1679, size: 64, align: 64, offset: 3840)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1711, file: !767, line: 616, baseType: !1679, size: 64, align: 64, offset: 3904)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1711, file: !767, line: 626, baseType: !1784, size: 64, align: 64, offset: 3968)
!1784 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1127, line: 216, baseType: !1585)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1711, file: !767, line: 627, baseType: !1784, size: 64, align: 64, offset: 4032)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1711, file: !767, line: 628, baseType: !1784, size: 64, align: 64, offset: 4096)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1711, file: !767, line: 629, baseType: !1784, size: 64, align: 64, offset: 4160)
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1711, file: !767, line: 645, baseType: !1679, size: 64, align: 64, offset: 4224)
!1789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1556, file: !44, line: 3566, baseType: !1791, size: 64, align: 64, offset: 1408)
!1791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1792, size: 64, align: 64)
!1792 = !DISubroutineType(types: !1793)
!1793 = !{!930, !1503, !897, !1789, !1674}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1556, file: !44, line: 3567, baseType: !1601, size: 64, align: 64, offset: 1472)
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1556, file: !44, line: 3576, baseType: !1796, size: 64, align: 64, offset: 1536)
!1796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1797, size: 64, align: 64)
!1797 = !DISubroutineType(types: !1798)
!1798 = !{!930, !1503, !1708}
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1556, file: !44, line: 3577, baseType: !1800, size: 64, align: 64, offset: 1600)
!1800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1801, size: 64, align: 64)
!1801 = !DISubroutineType(types: !1802)
!1802 = !{!930, !1503, !1674}
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1556, file: !44, line: 3584, baseType: !1804, size: 64, align: 64, offset: 1664)
!1804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1805, size: 64, align: 64)
!1805 = !DISubroutineType(types: !1806)
!1806 = !{!930, !1503, !1807}
!1807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1556, file: !44, line: 3589, baseType: !1809, size: 64, align: 64, offset: 1728)
!1809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1810, size: 64, align: 64)
!1810 = !DISubroutineType(types: !1811)
!1811 = !{null, !1503}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1556, file: !44, line: 3594, baseType: !930, size: 32, align: 32, offset: 1792)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1556, file: !44, line: 3600, baseType: !1514, size: 64, align: 64, offset: 1856)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1556, file: !44, line: 3609, baseType: !1815, size: 64, align: 64, offset: 1920)
!1815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1816, size: 64, align: 64)
!1816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1817, size: 64, align: 64)
!1817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1818)
!1818 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !44, line: 3609, flags: DIFlagFwdDecl)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1505, file: !44, line: 1566, baseType: !43, size: 32, align: 32, offset: 192)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1505, file: !44, line: 1581, baseType: !1633, size: 32, align: 32, offset: 224)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1505, file: !44, line: 1583, baseType: !897, size: 64, align: 64, offset: 256)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1505, file: !44, line: 1591, baseType: !1823, size: 64, align: 64, offset: 320)
!1823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1824, size: 64, align: 64)
!1824 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !44, line: 1532, flags: DIFlagFwdDecl)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1505, file: !44, line: 1598, baseType: !897, size: 64, align: 64, offset: 384)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1505, file: !44, line: 1606, baseType: !1669, size: 64, align: 64, offset: 448)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1505, file: !44, line: 1614, baseType: !930, size: 32, align: 32, offset: 512)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1505, file: !44, line: 1622, baseType: !930, size: 32, align: 32, offset: 544)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1505, file: !44, line: 1628, baseType: !930, size: 32, align: 32, offset: 576)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1505, file: !44, line: 1636, baseType: !930, size: 32, align: 32, offset: 608)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1505, file: !44, line: 1643, baseType: !930, size: 32, align: 32, offset: 640)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1505, file: !44, line: 1657, baseType: !908, size: 64, align: 64, offset: 704)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1505, file: !44, line: 1658, baseType: !930, size: 32, align: 32, offset: 768)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1505, file: !44, line: 1679, baseType: !1566, size: 64, align: 32, offset: 800)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1505, file: !44, line: 1688, baseType: !930, size: 32, align: 32, offset: 864)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1505, file: !44, line: 1712, baseType: !930, size: 32, align: 32, offset: 896)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1505, file: !44, line: 1729, baseType: !930, size: 32, align: 32, offset: 928)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1505, file: !44, line: 1729, baseType: !930, size: 32, align: 32, offset: 960)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1505, file: !44, line: 1744, baseType: !930, size: 32, align: 32, offset: 992)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1505, file: !44, line: 1744, baseType: !930, size: 32, align: 32, offset: 1024)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1505, file: !44, line: 1751, baseType: !930, size: 32, align: 32, offset: 1056)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1505, file: !44, line: 1766, baseType: !503, size: 32, align: 32, offset: 1088)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1505, file: !44, line: 1791, baseType: !1844, size: 64, align: 64, offset: 1152)
!1844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1845, size: 64, align: 64)
!1845 = !DISubroutineType(types: !1846)
!1846 = !{null, !1847, !1708, !1789, !930, !930, !930}
!1847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1505, size: 64, align: 64)
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1505, file: !44, line: 1808, baseType: !1849, size: 64, align: 64, offset: 1216)
!1849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1850, size: 64, align: 64)
!1850 = !DISubroutineType(types: !1851)
!1851 = !{!503, !1847, !1573}
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1505, file: !44, line: 1816, baseType: !930, size: 32, align: 32, offset: 1280)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1505, file: !44, line: 1825, baseType: !1854, size: 32, align: 32, offset: 1312)
!1854 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1505, file: !44, line: 1830, baseType: !930, size: 32, align: 32, offset: 1344)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1505, file: !44, line: 1838, baseType: !1854, size: 32, align: 32, offset: 1376)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1505, file: !44, line: 1846, baseType: !930, size: 32, align: 32, offset: 1408)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1505, file: !44, line: 1851, baseType: !930, size: 32, align: 32, offset: 1440)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1505, file: !44, line: 1861, baseType: !1854, size: 32, align: 32, offset: 1472)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1505, file: !44, line: 1868, baseType: !1854, size: 32, align: 32, offset: 1504)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1505, file: !44, line: 1875, baseType: !1854, size: 32, align: 32, offset: 1536)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1505, file: !44, line: 1882, baseType: !1854, size: 32, align: 32, offset: 1568)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1505, file: !44, line: 1889, baseType: !1854, size: 32, align: 32, offset: 1600)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1505, file: !44, line: 1896, baseType: !1854, size: 32, align: 32, offset: 1632)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1505, file: !44, line: 1903, baseType: !1854, size: 32, align: 32, offset: 1664)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1505, file: !44, line: 1910, baseType: !930, size: 32, align: 32, offset: 1696)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1505, file: !44, line: 1915, baseType: !930, size: 32, align: 32, offset: 1728)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1505, file: !44, line: 1926, baseType: !1789, size: 64, align: 64, offset: 1792)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1505, file: !44, line: 1935, baseType: !1566, size: 64, align: 32, offset: 1856)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1505, file: !44, line: 1942, baseType: !930, size: 32, align: 32, offset: 1920)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1505, file: !44, line: 1948, baseType: !930, size: 32, align: 32, offset: 1952)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1505, file: !44, line: 1954, baseType: !930, size: 32, align: 32, offset: 1984)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1505, file: !44, line: 1960, baseType: !930, size: 32, align: 32, offset: 2016)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1505, file: !44, line: 1984, baseType: !930, size: 32, align: 32, offset: 2048)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1505, file: !44, line: 1991, baseType: !930, size: 32, align: 32, offset: 2080)
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1505, file: !44, line: 1996, baseType: !930, size: 32, align: 32, offset: 2112)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1505, file: !44, line: 2004, baseType: !930, size: 32, align: 32, offset: 2144)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1505, file: !44, line: 2011, baseType: !930, size: 32, align: 32, offset: 2176)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1505, file: !44, line: 2018, baseType: !930, size: 32, align: 32, offset: 2208)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1505, file: !44, line: 2027, baseType: !930, size: 32, align: 32, offset: 2240)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1505, file: !44, line: 2034, baseType: !930, size: 32, align: 32, offset: 2272)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1505, file: !44, line: 2044, baseType: !930, size: 32, align: 32, offset: 2304)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1505, file: !44, line: 2054, baseType: !1884, size: 64, align: 64, offset: 2368)
!1884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1629, size: 64, align: 64)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1505, file: !44, line: 2061, baseType: !1884, size: 64, align: 64, offset: 2432)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1505, file: !44, line: 2066, baseType: !930, size: 32, align: 32, offset: 2496)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1505, file: !44, line: 2070, baseType: !930, size: 32, align: 32, offset: 2528)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1505, file: !44, line: 2078, baseType: !930, size: 32, align: 32, offset: 2560)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1505, file: !44, line: 2085, baseType: !930, size: 32, align: 32, offset: 2592)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1505, file: !44, line: 2092, baseType: !930, size: 32, align: 32, offset: 2624)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1505, file: !44, line: 2099, baseType: !930, size: 32, align: 32, offset: 2656)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1505, file: !44, line: 2106, baseType: !930, size: 32, align: 32, offset: 2688)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1505, file: !44, line: 2113, baseType: !930, size: 32, align: 32, offset: 2720)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1505, file: !44, line: 2120, baseType: !930, size: 32, align: 32, offset: 2752)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1505, file: !44, line: 2125, baseType: !930, size: 32, align: 32, offset: 2784)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1505, file: !44, line: 2133, baseType: !930, size: 32, align: 32, offset: 2816)
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1505, file: !44, line: 2140, baseType: !930, size: 32, align: 32, offset: 2848)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1505, file: !44, line: 2145, baseType: !930, size: 32, align: 32, offset: 2880)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1505, file: !44, line: 2153, baseType: !930, size: 32, align: 32, offset: 2912)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1505, file: !44, line: 2158, baseType: !930, size: 32, align: 32, offset: 2944)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1505, file: !44, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1505, file: !44, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1505, file: !44, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1505, file: !44, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1505, file: !44, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1505, file: !44, line: 2203, baseType: !930, size: 32, align: 32, offset: 3136)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1505, file: !44, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1505, file: !44, line: 2212, baseType: !930, size: 32, align: 32, offset: 3200)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1505, file: !44, line: 2213, baseType: !930, size: 32, align: 32, offset: 3232)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1505, file: !44, line: 2220, baseType: !703, size: 32, align: 32, offset: 3264)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1505, file: !44, line: 2232, baseType: !930, size: 32, align: 32, offset: 3296)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1505, file: !44, line: 2243, baseType: !930, size: 32, align: 32, offset: 3328)
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1505, file: !44, line: 2249, baseType: !930, size: 32, align: 32, offset: 3360)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1505, file: !44, line: 2256, baseType: !930, size: 32, align: 32, offset: 3392)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1505, file: !44, line: 2263, baseType: !1584, size: 64, align: 64, offset: 3456)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1505, file: !44, line: 2270, baseType: !1584, size: 64, align: 64, offset: 3520)
!1917 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1505, file: !44, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1505, file: !44, line: 2285, baseType: !703, size: 32, align: 32, offset: 3616)
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1505, file: !44, line: 2367, baseType: !1920, size: 64, align: 64, offset: 3648)
!1920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1921, size: 64, align: 64)
!1921 = !DISubroutineType(types: !1922)
!1922 = !{!930, !1847, !1807, !930}
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1505, file: !44, line: 2383, baseType: !930, size: 32, align: 32, offset: 3712)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1505, file: !44, line: 2386, baseType: !1854, size: 32, align: 32, offset: 3744)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1505, file: !44, line: 2387, baseType: !1854, size: 32, align: 32, offset: 3776)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1505, file: !44, line: 2394, baseType: !930, size: 32, align: 32, offset: 3808)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1505, file: !44, line: 2401, baseType: !930, size: 32, align: 32, offset: 3840)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1505, file: !44, line: 2408, baseType: !930, size: 32, align: 32, offset: 3872)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1505, file: !44, line: 2415, baseType: !930, size: 32, align: 32, offset: 3904)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1505, file: !44, line: 2422, baseType: !930, size: 32, align: 32, offset: 3936)
