; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtmphttp.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtmphttp.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !46, globals: !49)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--rtmphttp.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !25}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVOptionType", file: !4, line: 221, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/opt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24}
!6 = !DIEnumerator(name: "AV_OPT_TYPE_FLAGS", value: 0)
!7 = !DIEnumerator(name: "AV_OPT_TYPE_INT", value: 1)
!8 = !DIEnumerator(name: "AV_OPT_TYPE_INT64", value: 2)
!9 = !DIEnumerator(name: "AV_OPT_TYPE_DOUBLE", value: 3)
!10 = !DIEnumerator(name: "AV_OPT_TYPE_FLOAT", value: 4)
!11 = !DIEnumerator(name: "AV_OPT_TYPE_STRING", value: 5)
!12 = !DIEnumerator(name: "AV_OPT_TYPE_RATIONAL", value: 6)
!13 = !DIEnumerator(name: "AV_OPT_TYPE_BINARY", value: 7)
!14 = !DIEnumerator(name: "AV_OPT_TYPE_DICT", value: 8)
!15 = !DIEnumerator(name: "AV_OPT_TYPE_UINT64", value: 9)
!16 = !DIEnumerator(name: "AV_OPT_TYPE_CONST", value: 10)
!17 = !DIEnumerator(name: "AV_OPT_TYPE_IMAGE_SIZE", value: 11)
!18 = !DIEnumerator(name: "AV_OPT_TYPE_PIXEL_FMT", value: 12)
!19 = !DIEnumerator(name: "AV_OPT_TYPE_SAMPLE_FMT", value: 13)
!20 = !DIEnumerator(name: "AV_OPT_TYPE_VIDEO_RATE", value: 14)
!21 = !DIEnumerator(name: "AV_OPT_TYPE_DURATION", value: 15)
!22 = !DIEnumerator(name: "AV_OPT_TYPE_COLOR", value: 16)
!23 = !DIEnumerator(name: "AV_OPT_TYPE_CHANNEL_LAYOUT", value: 17)
!24 = !DIEnumerator(name: "AV_OPT_TYPE_BOOL", value: 18)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !26, line: 29, size: 32, align: 32, elements: !27)
!26 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45}
!28 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!29 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!30 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!31 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!32 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!33 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!34 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!35 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!36 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!37 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!38 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!39 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!40 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!41 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!42 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!43 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!44 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!45 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!46 = !{!47, !48}
!47 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!48 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!49 = !{!50, !259, !260}
!50 = distinct !DIGlobalVariable(name: "ff_ffrtmphttp_protocol", scope: !0, file: !51, line: 276, type: !52, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_ffrtmphttp_protocol)
!51 = !DIFile(filename: "libavformat/rtmphttp.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !54, line: 100, baseType: !55)
!54 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !54, line: 54, size: 1600, align: 64, elements: !56)
!56 = !{!57, !61, !176, !185, !190, !194, !200, !206, !210, !211, !215, !219, !220, !226, !227, !228, !229, !230, !231, !232, !233, !252, !253, !254, !258}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !55, file: !54, line: 55, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64, align: 64)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !55, file: !54, line: 56, baseType: !62, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{!47, !65, !58, !47}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !54, line: 52, baseType: !67)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !54, line: 38, size: 768, align: 64, elements: !68)
!68 = !{!69, !152, !155, !156, !158, !159, !160, !161, !162, !172, !173, !174, !175}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !67, file: !54, line: 39, baseType: !70, size: 64, align: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !72)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !74)
!74 = !{!75, !76, !81, !111, !112, !113, !114, !118, !124, !126, !130}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !73, file: !26, line: 72, baseType: !58, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !73, file: !26, line: 78, baseType: !77, size: 64, align: 64, offset: 64)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!58, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !73, file: !26, line: 85, baseType: !82, size: 64, align: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !107, !108, !109, !110}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !84, file: !4, line: 247, baseType: !58, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !84, file: !4, line: 253, baseType: !58, size: 64, align: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !84, file: !4, line: 259, baseType: !47, size: 32, align: 32, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !84, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !84, file: !4, line: 271, baseType: !91, size: 64, align: 64, offset: 192)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !84, file: !4, line: 265, size: 64, align: 64, elements: !92)
!92 = !{!93, !97, !99, !100}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !91, file: !4, line: 266, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !95, line: 40, baseType: !96)
!95 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!96 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !91, file: !4, line: 267, baseType: !98, size: 64, align: 64)
!98 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !91, file: !4, line: 268, baseType: !58, size: 64, align: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !91, file: !4, line: 270, baseType: !101, size: 64, align: 32)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !102, line: 61, baseType: !103)
!102 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !102, line: 58, size: 64, align: 32, elements: !104)
!104 = !{!105, !106}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !103, file: !102, line: 59, baseType: !47, size: 32, align: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !103, file: !102, line: 60, baseType: !47, size: 32, align: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !84, file: !4, line: 272, baseType: !98, size: 64, align: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !84, file: !4, line: 273, baseType: !98, size: 64, align: 64, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !84, file: !4, line: 275, baseType: !47, size: 32, align: 32, offset: 384)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !84, file: !4, line: 300, baseType: !58, size: 64, align: 64, offset: 448)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !73, file: !26, line: 93, baseType: !47, size: 32, align: 32, offset: 192)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !73, file: !26, line: 99, baseType: !47, size: 32, align: 32, offset: 224)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !73, file: !26, line: 108, baseType: !47, size: 32, align: 32, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !73, file: !26, line: 113, baseType: !115, size: 64, align: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DISubroutineType(types: !117)
!117 = !{!80, !80, !80}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !73, file: !26, line: 123, baseType: !119, size: 64, align: 64, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64, align: 64)
!120 = !DISubroutineType(types: !121)
!121 = !{!122, !122}
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !73)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !73, file: !26, line: 130, baseType: !125, size: 32, align: 32, offset: 448)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !73, file: !26, line: 136, baseType: !127, size: 64, align: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!125, !80}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !73, file: !26, line: 142, baseType: !131, size: 64, align: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64, align: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!47, !134, !80, !58, !47}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 64, align: 64)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !137)
!137 = !{!138, !150, !151}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !136, file: !4, line: 360, baseType: !139, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !142)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !143)
!143 = !{!144, !145, !146, !147, !148, !149}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !142, file: !4, line: 307, baseType: !58, size: 64, align: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !142, file: !4, line: 313, baseType: !98, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !142, file: !4, line: 313, baseType: !98, size: 64, align: 64, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !142, file: !4, line: 318, baseType: !98, size: 64, align: 64, offset: 192)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !142, file: !4, line: 318, baseType: !98, size: 64, align: 64, offset: 256)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !142, file: !4, line: 323, baseType: !47, size: 32, align: 32, offset: 320)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !136, file: !4, line: 364, baseType: !47, size: 32, align: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !136, file: !4, line: 368, baseType: !47, size: 32, align: 32, offset: 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !67, file: !54, line: 40, baseType: !153, size: 64, align: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !67, file: !54, line: 41, baseType: !80, size: 64, align: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !67, file: !54, line: 42, baseType: !157, size: 64, align: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !54, line: 43, baseType: !47, size: 32, align: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !67, file: !54, line: 44, baseType: !47, size: 32, align: 32, offset: 288)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !67, file: !54, line: 45, baseType: !47, size: 32, align: 32, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !67, file: !54, line: 46, baseType: !47, size: 32, align: 32, offset: 352)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !67, file: !54, line: 47, baseType: !163, size: 128, align: 64, offset: 384)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !164, line: 61, baseType: !165)
!164 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !164, line: 58, size: 128, align: 64, elements: !166)
!166 = !{!167, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !165, file: !164, line: 59, baseType: !168, size: 64, align: 64)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64, align: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{!47, !80}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !165, file: !164, line: 60, baseType: !80, size: 64, align: 64, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !67, file: !54, line: 48, baseType: !94, size: 64, align: 64, offset: 512)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !67, file: !54, line: 49, baseType: !58, size: 64, align: 64, offset: 576)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !67, file: !54, line: 50, baseType: !58, size: 64, align: 64, offset: 640)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !67, file: !54, line: 51, baseType: !47, size: 32, align: 32, offset: 704)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !55, file: !54, line: 62, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64, align: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{!47, !65, !58, !47, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !183, line: 86, baseType: !184)
!183 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !183, line: 86, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !55, file: !54, line: 63, baseType: !186, size: 64, align: 64, offset: 192)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64, align: 64)
!187 = !DISubroutineType(types: !188)
!188 = !{!47, !65, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64, align: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !55, file: !54, line: 64, baseType: !191, size: 64, align: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64, align: 64)
!192 = !DISubroutineType(types: !193)
!193 = !{!47, !65}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !55, file: !54, line: 78, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DISubroutineType(types: !197)
!197 = !{!47, !65, !198, !47}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64, align: 64)
!199 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !55, file: !54, line: 79, baseType: !201, size: 64, align: 64, offset: 384)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!47, !65, !204, !47}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !55, file: !54, line: 80, baseType: !207, size: 64, align: 64, offset: 448)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DISubroutineType(types: !209)
!209 = !{!94, !65, !94, !47}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !55, file: !54, line: 81, baseType: !191, size: 64, align: 64, offset: 512)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !55, file: !54, line: 82, baseType: !212, size: 64, align: 64, offset: 576)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64, align: 64)
!213 = !DISubroutineType(types: !214)
!214 = !{!47, !65, !47}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !55, file: !54, line: 83, baseType: !216, size: 64, align: 64, offset: 640)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = !DISubroutineType(types: !218)
!218 = !{!94, !65, !47, !94, !47}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !55, file: !54, line: 85, baseType: !191, size: 64, align: 64, offset: 704)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !55, file: !54, line: 86, baseType: !221, size: 64, align: 64, offset: 768)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 64, align: 64)
!222 = !DISubroutineType(types: !223)
!223 = !{!47, !65, !224, !225}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64, align: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !55, file: !54, line: 88, baseType: !191, size: 64, align: 64, offset: 832)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !55, file: !54, line: 89, baseType: !212, size: 64, align: 64, offset: 896)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !55, file: !54, line: 90, baseType: !47, size: 32, align: 32, offset: 960)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !55, file: !54, line: 91, baseType: !70, size: 64, align: 64, offset: 1024)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !55, file: !54, line: 92, baseType: !47, size: 32, align: 32, offset: 1088)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !55, file: !54, line: 93, baseType: !212, size: 64, align: 64, offset: 1152)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !55, file: !54, line: 94, baseType: !191, size: 64, align: 64, offset: 1216)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !55, file: !54, line: 95, baseType: !234, size: 64, align: 64, offset: 1280)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{!47, !65, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64, align: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !164, line: 101, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !164, line: 86, size: 576, align: 64, elements: !241)
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250, !251}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !164, line: 87, baseType: !157, size: 64, align: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !240, file: !164, line: 88, baseType: !47, size: 32, align: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !240, file: !164, line: 89, baseType: !47, size: 32, align: 32, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !240, file: !164, line: 91, baseType: !94, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !240, file: !164, line: 92, baseType: !94, size: 64, align: 64, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !240, file: !164, line: 94, baseType: !94, size: 64, align: 64, offset: 256)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !240, file: !164, line: 96, baseType: !94, size: 64, align: 64, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !240, file: !164, line: 98, baseType: !94, size: 64, align: 64, offset: 384)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !240, file: !164, line: 99, baseType: !94, size: 64, align: 64, offset: 448)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !240, file: !164, line: 100, baseType: !94, size: 64, align: 64, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !55, file: !54, line: 96, baseType: !191, size: 64, align: 64, offset: 1344)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !55, file: !54, line: 97, baseType: !191, size: 64, align: 64, offset: 1408)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !55, file: !54, line: 98, baseType: !255, size: 64, align: 64, offset: 1472)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DISubroutineType(types: !257)
!257 = !{!47, !65, !65}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !55, file: !54, line: 99, baseType: !58, size: 64, align: 64, offset: 1536)
!259 = distinct !DIGlobalVariable(name: "ffrtmphttp_class", scope: !0, file: !51, line: 269, type: !71, isLocal: true, isDefinition: true, variable: %struct.AVClass* @ffrtmphttp_class)
!260 = distinct !DIGlobalVariable(name: "ffrtmphttp_options", scope: !0, file: !51, line: 264, type: !261, isLocal: true, isDefinition: true, variable: [2 x %struct.AVOption]* @ffrtmphttp_options)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 1024, align: 64, elements: !264)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !4, line: 301, baseType: !84)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !{i32 2, !"Dwarf Version", i32 4}
!267 = !{i32 2, !"Debug Info Version", i32 3}
!268 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!269 = distinct !DISubprogram(name: "rtmp_http_open", scope: !51, file: !51, line: 184, type: !63, isLocal: true, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !270)
!270 = !{}
!271 = !DILocalVariable(name: "h", arg: 1, scope: !269, file: !51, line: 184, type: !65)
!272 = !DIExpression()
!273 = !DILocation(line: 184, column: 39, scope: !269)
!274 = !DILocalVariable(name: "uri", arg: 2, scope: !269, file: !51, line: 184, type: !58)
!275 = !DILocation(line: 184, column: 54, scope: !269)
!276 = !DILocalVariable(name: "flags", arg: 3, scope: !269, file: !51, line: 184, type: !47)
!277 = !DILocation(line: 184, column: 63, scope: !269)
!278 = !DILocalVariable(name: "rt", scope: !269, file: !51, line: 186, type: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "RTMP_HTTPContext", file: !51, line: 53, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RTMP_HTTPContext", file: !51, line: 39, size: 3008, align: 64, elements: !282)
!282 = !{!283, !284, !285, !289, !290, !294, !295, !298, !299, !300, !301, !302, !303}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !281, file: !51, line: 40, baseType: !70, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !281, file: !51, line: 41, baseType: !65, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !281, file: !51, line: 42, baseType: !286, size: 2048, align: 8, offset: 128)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 2048, align: 8, elements: !287)
!287 = !{!288}
!288 = !DISubrange(count: 256)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !281, file: !51, line: 43, baseType: !47, size: 32, align: 32, offset: 2176)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "client_id", scope: !281, file: !51, line: 44, baseType: !291, size: 512, align: 8, offset: 2208)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, align: 8, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !281, file: !51, line: 45, baseType: !47, size: 32, align: 32, offset: 2720)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "out_data", scope: !281, file: !51, line: 46, baseType: !296, size: 64, align: 64, offset: 2752)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64, align: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !95, line: 48, baseType: !199)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "out_size", scope: !281, file: !51, line: 47, baseType: !47, size: 32, align: 32, offset: 2816)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "out_capacity", scope: !281, file: !51, line: 48, baseType: !47, size: 32, align: 32, offset: 2848)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !281, file: !51, line: 49, baseType: !47, size: 32, align: 32, offset: 2880)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "finishing", scope: !281, file: !51, line: 50, baseType: !47, size: 32, align: 32, offset: 2912)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bytes_read", scope: !281, file: !51, line: 51, baseType: !47, size: 32, align: 32, offset: 2944)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !281, file: !51, line: 52, baseType: !47, size: 32, align: 32, offset: 2976)
!304 = !DILocation(line: 186, column: 23, scope: !269)
!305 = !DILocation(line: 186, column: 28, scope: !269)
!306 = !DILocation(line: 186, column: 31, scope: !269)
!307 = !DILocalVariable(name: "headers", scope: !269, file: !51, line: 187, type: !308)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 8192, align: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 1024)
!311 = !DILocation(line: 187, column: 10, scope: !269)
!312 = !DILocalVariable(name: "url", scope: !269, file: !51, line: 187, type: !308)
!313 = !DILocation(line: 187, column: 25, scope: !269)
!314 = !DILocalVariable(name: "ret", scope: !269, file: !51, line: 188, type: !47)
!315 = !DILocation(line: 188, column: 9, scope: !269)
!316 = !DILocalVariable(name: "off", scope: !269, file: !51, line: 188, type: !47)
!317 = !DILocation(line: 188, column: 14, scope: !269)
!318 = !DILocation(line: 190, column: 35, scope: !269)
!319 = !DILocation(line: 190, column: 39, scope: !269)
!320 = !DILocation(line: 190, column: 64, scope: !269)
!321 = !DILocation(line: 190, column: 68, scope: !269)
!322 = !DILocation(line: 191, column: 26, scope: !269)
!323 = !DILocation(line: 190, column: 5, scope: !269)
!324 = !DILocation(line: 200, column: 9, scope: !325)
!325 = distinct !DILexicalBlock(scope: !269, file: !51, line: 200, column: 9)
!326 = !DILocation(line: 200, column: 13, scope: !325)
!327 = !DILocation(line: 200, column: 9, scope: !269)
!328 = !DILocation(line: 201, column: 13, scope: !329)
!329 = distinct !DILexicalBlock(scope: !330, file: !51, line: 201, column: 13)
!330 = distinct !DILexicalBlock(scope: !325, file: !51, line: 200, column: 18)
!331 = !DILocation(line: 201, column: 17, scope: !329)
!332 = !DILocation(line: 201, column: 22, scope: !329)
!333 = !DILocation(line: 201, column: 13, scope: !330)
!334 = !DILocation(line: 202, column: 13, scope: !329)
!335 = !DILocation(line: 202, column: 17, scope: !329)
!336 = !DILocation(line: 202, column: 22, scope: !329)
!337 = !DILocation(line: 203, column: 21, scope: !330)
!338 = !DILocation(line: 203, column: 53, scope: !330)
!339 = !DILocation(line: 203, column: 57, scope: !330)
!340 = !DILocation(line: 203, column: 63, scope: !330)
!341 = !DILocation(line: 203, column: 67, scope: !330)
!342 = !DILocation(line: 203, column: 9, scope: !330)
!343 = !DILocation(line: 204, column: 5, scope: !330)
!344 = !DILocation(line: 205, column: 13, scope: !345)
!345 = distinct !DILexicalBlock(scope: !346, file: !51, line: 205, column: 13)
!346 = distinct !DILexicalBlock(scope: !325, file: !51, line: 204, column: 12)
!347 = !DILocation(line: 205, column: 17, scope: !345)
!348 = !DILocation(line: 205, column: 22, scope: !345)
!349 = !DILocation(line: 205, column: 13, scope: !346)
!350 = !DILocation(line: 206, column: 13, scope: !345)
!351 = !DILocation(line: 206, column: 17, scope: !345)
!352 = !DILocation(line: 206, column: 22, scope: !345)
!353 = !DILocation(line: 207, column: 21, scope: !346)
!354 = !DILocation(line: 207, column: 52, scope: !346)
!355 = !DILocation(line: 207, column: 56, scope: !346)
!356 = !DILocation(line: 207, column: 62, scope: !346)
!357 = !DILocation(line: 207, column: 66, scope: !346)
!358 = !DILocation(line: 207, column: 9, scope: !346)
!359 = !DILocation(line: 211, column: 29, scope: !360)
!360 = distinct !DILexicalBlock(scope: !269, file: !51, line: 211, column: 9)
!361 = !DILocation(line: 211, column: 33, scope: !360)
!362 = !DILocation(line: 211, column: 41, scope: !360)
!363 = !DILocation(line: 211, column: 54, scope: !360)
!364 = !DILocation(line: 211, column: 57, scope: !360)
!365 = !DILocation(line: 211, column: 16, scope: !360)
!366 = !DILocation(line: 211, column: 14, scope: !360)
!367 = !DILocation(line: 211, column: 78, scope: !360)
!368 = !DILocation(line: 211, column: 9, scope: !269)
!369 = !DILocation(line: 212, column: 9, scope: !360)
