; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg4_unpack_bframes_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--mpeg4_unpack_bframes_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!563 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!564 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!565 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!566 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!567 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!568 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!569 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!570 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!571 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!572 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!573 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !525, line: 493, size: 32, align: 32, elements: !574)
!574 = !{!575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!575 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!576 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!577 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!578 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!579 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!580 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!581 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!582 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!583 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!584 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!585 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!586 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!587 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!588 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!589 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!590 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!591 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !525, line: 538, size: 32, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!595 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!596 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!597 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!598 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!599 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!600 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!601 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!604 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!605 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!606 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!607 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!608 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!609 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!610 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!611 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!612 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!613 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!614 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!615 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!616 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!617 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!618 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!619 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!620 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!621 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!622 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!623 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!624 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!625 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!626 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!627 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!628 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!629 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!630 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!631 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!632 = !{!633, !835}
!633 = distinct !DIGlobalVariable(name: "ff_mpeg4_unpack_bframes_bsf", scope: !0, file: !634, line: 171, type: !635, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_mpeg4_unpack_bframes_bsf)
!634 = !DIFile(filename: "libavcodec/mpeg4_unpack_bframes_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !637)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !638)
!638 = !{!639, !643, !646, !730, !731, !792, !830, !834}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !4, line: 5797, baseType: !640, size: 64, align: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64, align: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !642)
!642 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !637, file: !4, line: 5804, baseType: !644, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64, align: 64)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !637, file: !4, line: 5815, baseType: !647, size: 64, align: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !651)
!651 = !{!652, !653, !658, !689, !690, !691, !692, !696, !702, !704, !708}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !650, file: !486, line: 72, baseType: !640, size: 64, align: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !650, file: !486, line: 78, baseType: !654, size: 64, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!655 = !DISubroutineType(types: !656)
!656 = !{!640, !657}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !650, file: !486, line: 85, baseType: !659, size: 64, align: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64, align: 64)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !662)
!662 = !{!663, !664, !665, !667, !668, !685, !686, !687, !688}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !661, file: !464, line: 247, baseType: !640, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !661, file: !464, line: 253, baseType: !640, size: 64, align: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !661, file: !464, line: 259, baseType: !666, size: 32, align: 32, offset: 128)
!666 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !661, file: !464, line: 271, baseType: !669, size: 64, align: 64, offset: 192)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !661, file: !464, line: 265, size: 64, align: 64, elements: !670)
!670 = !{!671, !675, !677, !678}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !669, file: !464, line: 266, baseType: !672, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !673, line: 40, baseType: !674)
!673 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!674 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !669, file: !464, line: 267, baseType: !676, size: 64, align: 64)
!676 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !669, file: !464, line: 268, baseType: !640, size: 64, align: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !669, file: !464, line: 270, baseType: !679, size: 64, align: 32)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !680, line: 61, baseType: !681)
!680 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !680, line: 58, size: 64, align: 32, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !681, file: !680, line: 59, baseType: !666, size: 32, align: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !681, file: !680, line: 60, baseType: !666, size: 32, align: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !661, file: !464, line: 272, baseType: !676, size: 64, align: 64, offset: 256)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !661, file: !464, line: 273, baseType: !676, size: 64, align: 64, offset: 320)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !464, line: 275, baseType: !666, size: 32, align: 32, offset: 384)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !661, file: !464, line: 300, baseType: !640, size: 64, align: 64, offset: 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !650, file: !486, line: 93, baseType: !666, size: 32, align: 32, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !650, file: !486, line: 99, baseType: !666, size: 32, align: 32, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !650, file: !486, line: 108, baseType: !666, size: 32, align: 32, offset: 256)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !650, file: !486, line: 113, baseType: !693, size: 64, align: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64, align: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{!657, !657, !657}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !650, file: !486, line: 123, baseType: !697, size: 64, align: 64, offset: 384)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64, align: 64)
!698 = !DISubroutineType(types: !699)
!699 = !{!700, !700}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64, align: 64)
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !650, file: !486, line: 130, baseType: !703, size: 32, align: 32, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !650, file: !486, line: 136, baseType: !705, size: 64, align: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64, align: 64)
!706 = !DISubroutineType(types: !707)
!707 = !{!703, !657}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !650, file: !486, line: 142, baseType: !709, size: 64, align: 64, offset: 576)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64, align: 64)
!710 = !DISubroutineType(types: !711)
!711 = !{!666, !712, !657, !640, !666}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64, align: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !715)
!715 = !{!716, !728, !729}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !714, file: !464, line: 360, baseType: !717, size: 64, align: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64, align: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !721)
!721 = !{!722, !723, !724, !725, !726, !727}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !720, file: !464, line: 307, baseType: !640, size: 64, align: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !720, file: !464, line: 313, baseType: !676, size: 64, align: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !720, file: !464, line: 313, baseType: !676, size: 64, align: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !720, file: !464, line: 318, baseType: !676, size: 64, align: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !720, file: !464, line: 318, baseType: !676, size: 64, align: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !720, file: !464, line: 323, baseType: !666, size: 32, align: 32, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !714, file: !464, line: 364, baseType: !666, size: 32, align: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !714, file: !464, line: 368, baseType: !666, size: 32, align: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !637, file: !4, line: 5825, baseType: !666, size: 32, align: 32, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !637, file: !4, line: 5826, baseType: !732, size: 64, align: 64, offset: 256)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64, align: 64)
!733 = !DISubroutineType(types: !734)
!734 = !{!666, !735}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !738)
!738 = !{!739, !740, !743, !747, !748, !789, !790, !791}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !737, file: !4, line: 5751, baseType: !647, size: 64, align: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !737, file: !4, line: 5756, baseType: !741, size: 64, align: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64, align: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !737, file: !4, line: 5762, baseType: !744, size: 64, align: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64, align: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !746)
!746 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !737, file: !4, line: 5768, baseType: !657, size: 64, align: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !737, file: !4, line: 5775, baseType: !749, size: 64, align: 64, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64, align: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !752)
!752 = !{!753, !754, !755, !758, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !782, !783, !784, !785, !786, !787, !788}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !751, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !751, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !751, file: !4, line: 3948, baseType: !756, size: 32, align: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !673, line: 51, baseType: !757)
!757 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !751, file: !4, line: 3958, baseType: !759, size: 64, align: 64, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !673, line: 48, baseType: !761)
!761 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !751, file: !4, line: 3962, baseType: !666, size: 32, align: 32, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !751, file: !4, line: 3968, baseType: !666, size: 32, align: 32, offset: 224)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !751, file: !4, line: 3973, baseType: !672, size: 64, align: 64, offset: 256)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !751, file: !4, line: 3986, baseType: !666, size: 32, align: 32, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !751, file: !4, line: 3999, baseType: !666, size: 32, align: 32, offset: 352)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !751, file: !4, line: 4004, baseType: !666, size: 32, align: 32, offset: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !751, file: !4, line: 4005, baseType: !666, size: 32, align: 32, offset: 416)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !751, file: !4, line: 4010, baseType: !666, size: 32, align: 32, offset: 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !751, file: !4, line: 4011, baseType: !666, size: 32, align: 32, offset: 480)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !751, file: !4, line: 4020, baseType: !679, size: 64, align: 32, offset: 512)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !751, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !751, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !751, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !751, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !751, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !751, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !751, file: !4, line: 4039, baseType: !666, size: 32, align: 32, offset: 768)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !751, file: !4, line: 4046, baseType: !780, size: 64, align: 64, offset: 832)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !673, line: 55, baseType: !781)
!781 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !751, file: !4, line: 4050, baseType: !666, size: 32, align: 32, offset: 896)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !751, file: !4, line: 4054, baseType: !666, size: 32, align: 32, offset: 928)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !751, file: !4, line: 4061, baseType: !666, size: 32, align: 32, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !751, file: !4, line: 4065, baseType: !666, size: 32, align: 32, offset: 992)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !751, file: !4, line: 4073, baseType: !666, size: 32, align: 32, offset: 1024)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !751, file: !4, line: 4080, baseType: !666, size: 32, align: 32, offset: 1056)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !751, file: !4, line: 4084, baseType: !666, size: 32, align: 32, offset: 1088)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !737, file: !4, line: 5781, baseType: !749, size: 64, align: 64, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !737, file: !4, line: 5787, baseType: !679, size: 64, align: 32, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !737, file: !4, line: 5793, baseType: !679, size: 64, align: 32, offset: 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !637, file: !4, line: 5827, baseType: !793, size: 64, align: 64, offset: 320)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64, align: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{!666, !735, !796}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !799)
!799 = !{!800, !812, !813, !814, !815, !816, !817, !818, !826, !827, !828, !829}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !798, file: !4, line: 1451, baseType: !801, size: 64, align: 64)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64, align: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !803, line: 94, baseType: !804)
!803 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !803, line: 81, size: 192, align: 64, elements: !805)
!805 = !{!806, !810, !811}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !804, file: !803, line: 82, baseType: !807, size: 64, align: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64, align: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !803, line: 73, baseType: !809)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !803, line: 73, flags: DIFlagFwdDecl)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !804, file: !803, line: 89, baseType: !759, size: 64, align: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !804, file: !803, line: 93, baseType: !666, size: 32, align: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !798, file: !4, line: 1461, baseType: !672, size: 64, align: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !798, file: !4, line: 1467, baseType: !672, size: 64, align: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !798, file: !4, line: 1468, baseType: !759, size: 64, align: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !798, file: !4, line: 1469, baseType: !666, size: 32, align: 32, offset: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !798, file: !4, line: 1470, baseType: !666, size: 32, align: 32, offset: 288)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !798, file: !4, line: 1474, baseType: !666, size: 32, align: 32, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !798, file: !4, line: 1479, baseType: !819, size: 64, align: 64, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64, align: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !822)
!822 = !{!823, !824, !825}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !821, file: !4, line: 1412, baseType: !759, size: 64, align: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !821, file: !4, line: 1413, baseType: !666, size: 32, align: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !821, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !798, file: !4, line: 1480, baseType: !666, size: 32, align: 32, offset: 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !798, file: !4, line: 1486, baseType: !672, size: 64, align: 64, offset: 512)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !798, file: !4, line: 1488, baseType: !672, size: 64, align: 64, offset: 576)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !798, file: !4, line: 1497, baseType: !672, size: 64, align: 64, offset: 640)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !637, file: !4, line: 5828, baseType: !831, size: 64, align: 64, offset: 384)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64, align: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{null, !735}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !637, file: !4, line: 5829, baseType: !831, size: 64, align: 64, offset: 448)
!835 = distinct !DIGlobalVariable(name: "codec_ids", scope: !0, file: !634, line: 167, type: !836, isLocal: true, isDefinition: true, variable: [2 x i32]* @codec_ids)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 64, align: 32, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 2)
!839 = !{i32 2, !"Dwarf Version", i32 4}
!840 = !{i32 2, !"Debug Info Version", i32 3}
!841 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!842 = distinct !DISubprogram(name: "mpeg4_unpack_bframes_init", scope: !634, file: !634, line: 134, type: !733, isLocal: true, isDefinition: true, scopeLine: 135, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !843)
!843 = !{}
!844 = !DILocalVariable(name: "ctx", arg: 1, scope: !842, file: !634, line: 134, type: !735)
!845 = !DIExpression()
!846 = !DILocation(line: 134, column: 52, scope: !842)
!847 = !DILocalVariable(name: "s", scope: !842, file: !634, line: 136, type: !848)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64, align: 64)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "UnpackBFramesBSFContext", file: !634, line: 29, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnpackBFramesBSFContext", file: !634, line: 27, size: 64, align: 64, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame", scope: !850, file: !634, line: 28, baseType: !796, size: 64, align: 64)
!853 = !DILocation(line: 136, column: 30, scope: !842)
!854 = !DILocation(line: 136, column: 34, scope: !842)
!855 = !DILocation(line: 136, column: 39, scope: !842)
!856 = !DILocation(line: 138, column: 18, scope: !842)
!857 = !DILocation(line: 138, column: 5, scope: !842)
!858 = !DILocation(line: 138, column: 8, scope: !842)
!859 = !DILocation(line: 138, column: 16, scope: !842)
!860 = !DILocation(line: 139, column: 10, scope: !861)
!861 = distinct !DILexicalBlock(scope: !842, file: !634, line: 139, column: 9)
!862 = !DILocation(line: 139, column: 13, scope: !861)
!863 = !DILocation(line: 139, column: 9, scope: !842)
!864 = !DILocation(line: 140, column: 9, scope: !861)
!865 = !DILocation(line: 142, column: 9, scope: !866)
!866 = distinct !DILexicalBlock(scope: !842, file: !634, line: 142, column: 9)
!867 = !DILocation(line: 142, column: 14, scope: !866)
!868 = !DILocation(line: 142, column: 22, scope: !866)
!869 = !DILocation(line: 142, column: 9, scope: !842)
!870 = !DILocalVariable(name: "pos_p_ext", scope: !871, file: !634, line: 143, type: !666)
!871 = distinct !DILexicalBlock(scope: !866, file: !634, line: 142, column: 33)
!872 = !DILocation(line: 143, column: 13, scope: !871)
!873 = !DILocation(line: 144, column: 21, scope: !871)
!874 = !DILocation(line: 144, column: 26, scope: !871)
!875 = !DILocation(line: 144, column: 34, scope: !871)
!876 = !DILocation(line: 144, column: 45, scope: !871)
!877 = !DILocation(line: 144, column: 50, scope: !871)
!878 = !DILocation(line: 144, column: 58, scope: !871)
!879 = !DILocation(line: 144, column: 9, scope: !871)
!880 = !DILocation(line: 145, column: 13, scope: !881)
!881 = distinct !DILexicalBlock(scope: !871, file: !634, line: 145, column: 13)
!882 = !DILocation(line: 145, column: 23, scope: !881)
!883 = !DILocation(line: 145, column: 13, scope: !871)
!884 = !DILocation(line: 146, column: 20, scope: !885)
!885 = distinct !DILexicalBlock(scope: !881, file: !634, line: 145, column: 29)
!886 = !DILocation(line: 146, column: 13, scope: !885)
!887 = !DILocation(line: 148, column: 37, scope: !885)
!888 = !DILocation(line: 148, column: 13, scope: !885)
!889 = !DILocation(line: 148, column: 18, scope: !885)
!890 = !DILocation(line: 148, column: 27, scope: !885)
!891 = !DILocation(line: 148, column: 48, scope: !885)
!892 = !DILocation(line: 149, column: 9, scope: !885)
!893 = !DILocation(line: 150, column: 5, scope: !871)
