; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dct.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dct.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DCTContext = type { i32, i32, %struct.RDFTContext, float*, float*, void (%struct.DCTContext*, float*)*, void (float*, float*)* }
%struct.RDFTContext = type { i32, i32, i32, float*, float*, i32, %struct.FFTContext, void (%struct.RDFTContext*, float*)* }
%struct.FFTContext = type { i32, i32, i16*, %struct.FFTComplex*, i32, i32, float*, float*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, %struct.FFTComplex*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, void (%struct.FFTContext*, float*, float*)*, i32, i32, i32* }
%struct.FFTComplex = type { float, float }

@ff_cos_tabs = external constant [18 x float*], align 16

; Function Attrs: cold nounwind optsize uwtable
define i32 @ff_dct_init(%struct.DCTContext* %s, i32 %nbits, i32 %inverse) #0 !dbg !23 {
entry:
  %retval = alloca i32, align 4
  %s.addr = alloca %struct.DCTContext*, align 8
  %nbits.addr = alloca i32, align 4
  %inverse.addr = alloca i32, align 4
  %n = alloca i32, align 4
  %i = alloca i32, align 4
  %ret = alloca i32, align 4
  store %struct.DCTContext* %s, %struct.DCTContext** %s.addr, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dct.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !9, !13}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fft_permutation_type", file: !4, line: 77, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/fft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "FF_FFT_PERM_DEFAULT", value: 0)
!7 = !DIEnumerator(name: "FF_FFT_PERM_SWAP_LSBS", value: 1)
!8 = !DIEnumerator(name: "FF_FFT_PERM_AVX", value: 2)
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mdct_permutation_type", file: !4, line: 83, size: 32, align: 32, elements: !10)
!10 = !{!11, !12}
!11 = !DIEnumerator(name: "FF_MDCT_PERM_NONE", value: 0)
!12 = !DIEnumerator(name: "FF_MDCT_PERM_INTERLEAVE", value: 1)
!13 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DCTTransformType", file: !14, line: 93, size: 32, align: 32, elements: !15)
!14 = !DIFile(filename: "libavcodec/avfft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!15 = !{!16, !17, !18, !19}
!16 = !DIEnumerator(name: "DCT_II", value: 0)
!17 = !DIEnumerator(name: "DCT_III", value: 1)
!18 = !DIEnumerator(name: "DCT_I", value: 2)
!19 = !DIEnumerator(name: "DST_I", value: 3)
!20 = !{i32 2, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!23 = distinct !DISubprogram(name: "ff_dct_init", scope: !24, file: !24, line: 177, type: !25, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !115)
!24 = !DIFile(filename: "libavcodec/dct.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !28, !27, !13}
!27 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "DCTContext", file: !14, line: 91, baseType: !30)
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DCTContext", file: !31, line: 32, size: 1600, align: 64, elements: !32)
!31 = !DIFile(filename: "libavcodec/dct.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!32 = !{!33, !34, !35, !102, !105, !106, !111}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !30, file: !31, line: 33, baseType: !27, size: 32, align: 32)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !30, file: !31, line: 34, baseType: !27, size: 32, align: 32, offset: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "rdft", scope: !30, file: !31, line: 35, baseType: !36, size: 1280, align: 64, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDFTContext", file: !14, line: 78, baseType: !37)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RDFTContext", file: !38, line: 28, size: 1280, align: 64, elements: !39)
!38 = !DIFile(filename: "libavcodec/rdft.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!39 = !{!40, !41, !42, !43, !48, !49, !50, !97}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !37, file: !38, line: 29, baseType: !27, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !37, file: !38, line: 30, baseType: !27, size: 32, align: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "sign_convention", scope: !37, file: !38, line: 31, baseType: !27, size: 32, align: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !37, file: !38, line: 34, baseType: !44, size: 64, align: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTSample", file: !14, line: 35, baseType: !47)
!47 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !37, file: !38, line: 35, baseType: !44, size: 64, align: 64, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sin", scope: !37, file: !38, line: 36, baseType: !27, size: 32, align: 32, offset: 256)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "fft", scope: !37, file: !38, line: 37, baseType: !51, size: 896, align: 64, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTContext", file: !14, line: 41, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTContext", file: !4, line: 88, size: 896, align: 64, elements: !53)
!53 = !{!54, !55, !56, !61, !68, !69, !70, !72, !73, !78, !79, !83, !84, !85, !91, !92, !93}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "nbits", scope: !52, file: !4, line: 89, baseType: !27, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "inverse", scope: !52, file: !4, line: 90, baseType: !27, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "revtab", scope: !52, file: !4, line: 91, baseType: !57, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !59, line: 49, baseType: !60)
!59 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!60 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_buf", scope: !52, file: !4, line: 92, baseType: !62, size: 64, align: 64, offset: 128)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTComplex", file: !14, line: 39, baseType: !64)
!64 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FFTComplex", file: !14, line: 37, size: 64, align: 32, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "re", scope: !64, file: !14, line: 38, baseType: !46, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "im", scope: !64, file: !14, line: 38, baseType: !46, size: 32, align: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_size", scope: !52, file: !4, line: 93, baseType: !27, size: 32, align: 32, offset: 192)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_bits", scope: !52, file: !4, line: 94, baseType: !27, size: 32, align: 32, offset: 224)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "tcos", scope: !52, file: !4, line: 96, baseType: !71, size: 64, align: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64, align: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "tsin", scope: !52, file: !4, line: 97, baseType: !71, size: 64, align: 64, offset: 320)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permute", scope: !52, file: !4, line: 101, baseType: !74, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !77, !62}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fft_calc", scope: !52, file: !4, line: 106, baseType: !74, size: 64, align: 64, offset: 448)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_calc", scope: !52, file: !4, line: 107, baseType: !80, size: 64, align: 64, offset: 512)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64, align: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !77, !71, !44}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "imdct_half", scope: !52, file: !4, line: 108, baseType: !80, size: 64, align: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calc", scope: !52, file: !4, line: 109, baseType: !80, size: 64, align: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_calcw", scope: !52, file: !4, line: 110, baseType: !86, size: 64, align: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !77, !89, !44}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "FFTDouble", file: !4, line: 43, baseType: !47)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "fft_permutation", scope: !52, file: !4, line: 111, baseType: !3, size: 32, align: 32, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "mdct_permutation", scope: !52, file: !4, line: 112, baseType: !9, size: 32, align: 32, offset: 800)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "revtab32", scope: !52, file: !4, line: 113, baseType: !94, size: 64, align: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64, align: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !59, line: 51, baseType: !96)
!96 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "rdft_calc", scope: !37, file: !38, line: 38, baseType: !98, size: 64, align: 64, offset: 1216)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101, !71}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64, align: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "costab", scope: !30, file: !31, line: 36, baseType: !103, size: 64, align: 64, offset: 1344)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "csc2", scope: !30, file: !31, line: 37, baseType: !71, size: 64, align: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dct_calc", scope: !30, file: !31, line: 38, baseType: !107, size: 64, align: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110, !71}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64, align: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "dct32", scope: !30, file: !31, line: 39, baseType: !112, size: 64, align: 64, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64, align: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{null, !71, !44}
!115 = !{}
!116 = !DILocalVariable(name: "s", arg: 1, scope: !23, file: !24, line: 177, type: !28)
!117 = !DIExpression()
!118 = !DILocation(line: 177, column: 51, scope: !23)
!119 = !DILocalVariable(name: "nbits", arg: 2, scope: !23, file: !24, line: 177, type: !27)
!120 = !DILocation(line: 177, column: 58, scope: !23)
!121 = !DILocalVariable(name: "inverse", arg: 3, scope: !23, file: !24, line: 177, type: !13)
!122 = !DILocation(line: 177, column: 87, scope: !23)
!123 = !DILocalVariable(name: "n", scope: !23, file: !24, line: 179, type: !27)
!124 = !DILocation(line: 179, column: 9, scope: !23)
!125 = !DILocation(line: 179, column: 18, scope: !23)
!126 = !DILocation(line: 179, column: 15, scope: !23)
!127 = !DILocalVariable(name: "i", scope: !23, file: !24, line: 180, type: !27)
!128 = !DILocation(line: 180, column: 9, scope: !23)
!129 = !DILocalVariable(name: "ret", scope: !23, file: !24, line: 181, type: !27)
!130 = !DILocation(line: 181, column: 9, scope: !23)
!131 = !DILocation(line: 183, column: 12, scope: !23)
!132 = !DILocation(line: 183, column: 5, scope: !23)
!133 = !DILocation(line: 185, column: 16, scope: !23)
!134 = !DILocation(line: 185, column: 5, scope: !23)
!135 = !DILocation(line: 185, column: 8, scope: !23)
!136 = !DILocation(line: 185, column: 14, scope: !23)
!137 = !DILocation(line: 186, column: 18, scope: !23)
!138 = !DILocation(line: 186, column: 5, scope: !23)
!139 = !DILocation(line: 186, column: 8, scope: !23)
!140 = !DILocation(line: 186, column: 16, scope: !23)
!141 = !DILocation(line: 188, column: 9, scope: !142)
!142 = distinct !DILexicalBlock(scope: !23, file: !24, line: 188, column: 9)
!143 = !DILocation(line: 188, column: 17, scope: !142)
!144 = !DILocation(line: 188, column: 27, scope: !142)
!145 = !DILocation(line: 188, column: 30, scope: !146)
!146 = !DILexicalBlockFile(scope: !142, file: !24, discriminator: 1)
!147 = !DILocation(line: 188, column: 36, scope: !146)
!148 = !DILocation(line: 188, column: 9, scope: !146)
!149 = !DILocation(line: 189, column: 9, scope: !150)
!150 = distinct !DILexicalBlock(scope: !142, file: !24, line: 188, column: 42)
!151 = !DILocation(line: 189, column: 12, scope: !150)
!152 = !DILocation(line: 189, column: 21, scope: !150)
!153 = !DILocation(line: 190, column: 5, scope: !150)
!154 = !DILocation(line: 191, column: 29, scope: !155)
!155 = distinct !DILexicalBlock(scope: !142, file: !24, line: 190, column: 12)
!156 = !DILocation(line: 191, column: 35, scope: !155)
!157 = !DILocation(line: 191, column: 9, scope: !155)
!158 = !DILocation(line: 193, column: 33, scope: !155)
!159 = !DILocation(line: 193, column: 39, scope: !155)
!160 = !DILocation(line: 193, column: 21, scope: !155)
!161 = !DILocation(line: 193, column: 9, scope: !155)
!162 = !DILocation(line: 193, column: 12, scope: !155)
!163 = !DILocation(line: 193, column: 19, scope: !155)
!164 = !DILocation(line: 194, column: 35, scope: !155)
!165 = !DILocation(line: 194, column: 37, scope: !155)
!166 = !DILocation(line: 194, column: 19, scope: !155)
!167 = !DILocation(line: 194, column: 9, scope: !155)
!168 = !DILocation(line: 194, column: 12, scope: !155)
!169 = !DILocation(line: 194, column: 17, scope: !155)
!170 = !DILocation(line: 195, column: 14, scope: !171)
!171 = distinct !DILexicalBlock(scope: !155, file: !24, line: 195, column: 13)
!172 = !DILocation(line: 195, column: 17, scope: !171)
!173 = !DILocation(line: 195, column: 13, scope: !155)
!174 = !DILocation(line: 196, column: 13, scope: !171)
!175 = !DILocation(line: 198, column: 34, scope: !176)
!176 = distinct !DILexicalBlock(scope: !155, file: !24, line: 198, column: 13)
!177 = !DILocation(line: 198, column: 37, scope: !176)
!178 = !DILocation(line: 198, column: 43, scope: !176)
