; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--apngdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--apngdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVInputFormat = type { i8*, i8*, i32, i8*, %struct.AVCodecTag**, %struct.AVClass*, i8*, %struct.AVInputFormat*, i32, i32, i32 (%struct.AVProbeData*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i32)*, i64 (%struct.AVFormatContext*, i32, i64*, i64)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, i32, i64, i64, i64, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)* }
%struct.AVCodecTag = type { i32, i32 }

!907 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!908 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916, !917}
!911 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!912 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!913 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!914 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!915 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!916 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!917 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !919, line: 782, size: 32, align: 32, elements: !920)
!919 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !{!921, !922, !923, !924, !925, !926}
!921 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!922 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!923 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!924 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!925 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!926 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !928)
!928 = !{!929, !930, !931, !932}
!929 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!930 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!931 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!932 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !919, line: 1315, size: 32, align: 32, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!936 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!937 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 30, size: 32, align: 32, elements: !940)
!939 = !DIFile(filename: "./libavcodec/apng.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!940 = !{!941, !942, !943}
!941 = !DIEnumerator(name: "APNG_DISPOSE_OP_NONE", value: 0)
!942 = !DIEnumerator(name: "APNG_DISPOSE_OP_BACKGROUND", value: 1)
!943 = !DIEnumerator(name: "APNG_DISPOSE_OP_PREVIOUS", value: 2)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 36, size: 32, align: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIEnumerator(name: "APNG_BLEND_OP_SOURCE", value: 0)
!947 = !DIEnumerator(name: "APNG_BLEND_OP_OVER", value: 1)
!948 = !{!949, !950, !951, !957, !960, !966, !967, !968}
!949 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_64", file: !954, line: 220, size: 64, align: 8, elements: !955)
!954 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !953, file: !954, line: 220, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !958, line: 55, baseType: !959)
!958 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!959 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !954, line: 221, size: 32, align: 8, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !962, file: !954, line: 221, baseType: !965, size: 32, align: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !958, line: 51, baseType: !949)
!966 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !958, line: 40, baseType: !969)
!969 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!970 = !{!971, !2212, !2213}
!971 = distinct !DIGlobalVariable(name: "ff_apng_demuxer", scope: !0, file: !972, line: 436, type: !973, isLocal: false, isDefinition: true, variable: %struct.AVInputFormat* @ff_apng_demuxer)
!972 = !DIFile(filename: "libavformat/apngdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVInputFormat", file: !919, line: 777, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !919, line: 633, size: 1344, align: 64, elements: !975)
!975 = !{!976, !980, !981, !982, !983, !993, !1072, !1073, !1075, !1076, !1077, !1091, !2193, !2194, !2195, !2199, !2203, !2204, !2205, !2209, !2210, !2211}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !974, file: !919, line: 638, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!979 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !974, file: !919, line: 645, baseType: !977, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !974, file: !919, line: 652, baseType: !966, size: 32, align: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !974, file: !919, line: 659, baseType: !977, size: 64, align: 64, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !974, file: !919, line: 661, baseType: !984, size: 64, align: 64, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !989, line: 44, size: 64, align: 32, elements: !990)
!989 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !988, file: !989, line: 45, baseType: !3, size: 32, align: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !988, file: !989, line: 46, baseType: !949, size: 32, align: 32, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !974, file: !919, line: 663, baseType: !994, size: 64, align: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !998)
!998 = !{!999, !1000, !1004, !1031, !1032, !1033, !1034, !1038, !1044, !1046, !1050}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !997, file: !486, line: 72, baseType: !977, size: 64, align: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !997, file: !486, line: 78, baseType: !1001, size: 64, align: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!977, !950}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !997, file: !486, line: 85, baseType: !1005, size: 64, align: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !1008)
!1008 = !{!1009, !1010, !1011, !1012, !1013, !1027, !1028, !1029, !1030}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1007, file: !464, line: 247, baseType: !977, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1007, file: !464, line: 253, baseType: !977, size: 64, align: 64, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1007, file: !464, line: 259, baseType: !966, size: 32, align: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1007, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1007, file: !464, line: 271, baseType: !1014, size: 64, align: 64, offset: 192)
!1014 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1007, file: !464, line: 265, size: 64, align: 64, elements: !1015)
!1015 = !{!1016, !1017, !1019, !1020}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1014, file: !464, line: 266, baseType: !968, size: 64, align: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1014, file: !464, line: 267, baseType: !1018, size: 64, align: 64)
!1018 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1014, file: !464, line: 268, baseType: !977, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1014, file: !464, line: 270, baseType: !1021, size: 64, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1022, line: 61, baseType: !1023)
!1022 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1022, line: 58, size: 64, align: 32, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1023, file: !1022, line: 59, baseType: !966, size: 32, align: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1023, file: !1022, line: 60, baseType: !966, size: 32, align: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1007, file: !464, line: 272, baseType: !1018, size: 64, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1007, file: !464, line: 273, baseType: !1018, size: 64, align: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1007, file: !464, line: 275, baseType: !966, size: 32, align: 32, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1007, file: !464, line: 300, baseType: !977, size: 64, align: 64, offset: 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !997, file: !486, line: 93, baseType: !966, size: 32, align: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !997, file: !486, line: 99, baseType: !966, size: 32, align: 32, offset: 224)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !997, file: !486, line: 108, baseType: !966, size: 32, align: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !997, file: !486, line: 113, baseType: !1035, size: 64, align: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!950, !950, !950}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !997, file: !486, line: 123, baseType: !1039, size: 64, align: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!1042, !1042}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !997, file: !486, line: 130, baseType: !1045, size: 32, align: 32, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !997, file: !486, line: 136, baseType: !1047, size: 64, align: 64, offset: 512)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1045, !950}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !997, file: !486, line: 142, baseType: !1051, size: 64, align: 64, offset: 576)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!966, !1054, !950, !977, !966}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64, align: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !1057)
!1057 = !{!1058, !1070, !1071}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1056, file: !464, line: 360, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64, align: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068, !1069}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1062, file: !464, line: 307, baseType: !977, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1062, file: !464, line: 313, baseType: !1018, size: 64, align: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1062, file: !464, line: 313, baseType: !1018, size: 64, align: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1062, file: !464, line: 318, baseType: !1018, size: 64, align: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1062, file: !464, line: 318, baseType: !1018, size: 64, align: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1062, file: !464, line: 323, baseType: !966, size: 32, align: 32, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1056, file: !464, line: 364, baseType: !966, size: 32, align: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1056, file: !464, line: 368, baseType: !966, size: 32, align: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !974, file: !919, line: 670, baseType: !977, size: 64, align: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !974, file: !919, line: 679, baseType: !1074, size: 64, align: 64, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !974, file: !919, line: 684, baseType: !966, size: 32, align: 32, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !974, file: !919, line: 689, baseType: !966, size: 32, align: 32, offset: 544)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !974, file: !919, line: 696, baseType: !1078, size: 64, align: 64, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{!966, !1081}
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !919, line: 453, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !919, line: 448, size: 256, align: 64, elements: !1084)
!1084 = !{!1085, !1086, !1089, !1090}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1083, file: !919, line: 449, baseType: !977, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1083, file: !919, line: 450, baseType: !1087, size: 64, align: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1083, file: !919, line: 451, baseType: !966, size: 32, align: 32, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1083, file: !919, line: 452, baseType: !977, size: 64, align: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !974, file: !919, line: 703, baseType: !1092, size: 64, align: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DISubroutineType(types: !1094)
!1094 = !{!966, !1095}
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !919, line: 1337, size: 11968, align: 64, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1290, !1291, !1356, !1357, !1358, !2050, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2063, !2064, !2065, !2066, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2104, !2105, !2106, !2107, !2108, !2114, !2115, !2116, !2117, !2118, !2119, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2159, !2160, !2163, !2164, !2165, !2166, !2167, !2168, !2170, !2171, !2172, !2173, !2181, !2182, !2186, !2190, !2191, !2192}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1096, file: !919, line: 1342, baseType: !994, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1096, file: !919, line: 1349, baseType: !1074, size: 64, align: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1096, file: !919, line: 1356, baseType: !1101, size: 64, align: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64, align: 64)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !919, line: 497, size: 1600, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1157, !1158, !1162, !1166, !1171, !1177, !1265, !1271, !1277, !1278, !1279, !1280, !1284}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1102, file: !919, line: 498, baseType: !977, size: 64, align: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1102, file: !919, line: 504, baseType: !977, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1102, file: !919, line: 505, baseType: !977, size: 64, align: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1102, file: !919, line: 506, baseType: !977, size: 64, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1102, file: !919, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1102, file: !919, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1102, file: !919, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1102, file: !919, line: 517, baseType: !966, size: 32, align: 32, offset: 352)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1102, file: !919, line: 523, baseType: !984, size: 64, align: 64, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1102, file: !919, line: 526, baseType: !994, size: 64, align: 64, offset: 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1102, file: !919, line: 535, baseType: !1101, size: 64, align: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1102, file: !919, line: 539, baseType: !966, size: 32, align: 32, offset: 576)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1102, file: !919, line: 541, baseType: !1092, size: 64, align: 64, offset: 640)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1102, file: !919, line: 549, baseType: !1118, size: 64, align: 64, offset: 704)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!966, !1095, !1121}
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1124)
!1124 = !{!1125, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1153, !1154, !1155, !1156}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1123, file: !4, line: 1451, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1128, line: 94, baseType: !1129)
!1128 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1128, line: 81, size: 192, align: 64, elements: !1130)
!1130 = !{!1131, !1135, !1138}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1129, file: !1128, line: 82, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1128, line: 73, baseType: !1134)
!1134 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1128, line: 73, flags: DIFlagFwdDecl)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !1128, line: 89, baseType: !1136, size: 64, align: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !958, line: 48, baseType: !1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !1128, line: 93, baseType: !966, size: 32, align: 32, offset: 128)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1123, file: !4, line: 1461, baseType: !968, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1123, file: !4, line: 1467, baseType: !968, size: 64, align: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1123, file: !4, line: 1468, baseType: !1136, size: 64, align: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1123, file: !4, line: 1469, baseType: !966, size: 32, align: 32, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1123, file: !4, line: 1470, baseType: !966, size: 32, align: 32, offset: 288)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1123, file: !4, line: 1474, baseType: !966, size: 32, align: 32, offset: 320)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1123, file: !4, line: 1479, baseType: !1146, size: 64, align: 64, offset: 384)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1148, file: !4, line: 1412, baseType: !1136, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1148, file: !4, line: 1413, baseType: !966, size: 32, align: 32, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1148, file: !4, line: 1414, baseType: !506, size: 32, align: 32, offset: 96)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1123, file: !4, line: 1480, baseType: !966, size: 32, align: 32, offset: 448)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1123, file: !4, line: 1486, baseType: !968, size: 64, align: 64, offset: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1123, file: !4, line: 1488, baseType: !968, size: 64, align: 64, offset: 576)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1123, file: !4, line: 1497, baseType: !968, size: 64, align: 64, offset: 640)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1102, file: !919, line: 550, baseType: !1092, size: 64, align: 64, offset: 768)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1102, file: !919, line: 554, baseType: !1159, size: 64, align: 64, offset: 832)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!966, !1095, !1121, !1121, !966}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1102, file: !919, line: 563, baseType: !1163, size: 64, align: 64, offset: 896)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!966, !3, !966}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1102, file: !919, line: 565, baseType: !1167, size: 64, align: 64, offset: 960)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{null, !1095, !966, !1170, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1102, file: !919, line: 570, baseType: !1172, size: 64, align: 64, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64, align: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!966, !1095, !966, !950, !1175}
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1176, line: 216, baseType: !959)
!1176 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1102, file: !919, line: 581, baseType: !1178, size: 64, align: 64, offset: 1088)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{!966, !1095, !966, !1181, !949}
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !548, line: 646, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !548, line: 268, size: 4288, align: 64, elements: !1185)
!1185 = !{!1186, !1190, !1192, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1219, !1221, !1222, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1184, file: !548, line: 282, baseType: !1187, size: 512, align: 64)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 512, align: 64, elements: !1188)
!1188 = !{!1189}
!1189 = !DISubrange(count: 8)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1184, file: !548, line: 299, baseType: !1191, size: 256, align: 32, offset: 512)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 256, align: 32, elements: !1188)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1184, file: !548, line: 315, baseType: !1193, size: 64, align: 64, offset: 768)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1184, file: !548, line: 326, baseType: !966, size: 32, align: 32, offset: 832)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1184, file: !548, line: 326, baseType: !966, size: 32, align: 32, offset: 864)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1184, file: !548, line: 334, baseType: !966, size: 32, align: 32, offset: 896)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1184, file: !548, line: 341, baseType: !966, size: 32, align: 32, offset: 928)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1184, file: !548, line: 346, baseType: !966, size: 32, align: 32, offset: 960)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1184, file: !548, line: 351, baseType: !536, size: 32, align: 32, offset: 992)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1184, file: !548, line: 356, baseType: !1021, size: 64, align: 32, offset: 1024)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1184, file: !548, line: 361, baseType: !968, size: 64, align: 64, offset: 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1184, file: !548, line: 369, baseType: !968, size: 64, align: 64, offset: 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1184, file: !548, line: 377, baseType: !968, size: 64, align: 64, offset: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1184, file: !548, line: 382, baseType: !966, size: 32, align: 32, offset: 1280)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1184, file: !548, line: 386, baseType: !966, size: 32, align: 32, offset: 1312)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1184, file: !548, line: 391, baseType: !966, size: 32, align: 32, offset: 1344)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1184, file: !548, line: 396, baseType: !950, size: 64, align: 64, offset: 1408)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1184, file: !548, line: 403, baseType: !1209, size: 512, align: 64, offset: 1472)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !957, size: 512, align: 64, elements: !1188)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1184, file: !548, line: 410, baseType: !966, size: 32, align: 32, offset: 1984)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1184, file: !548, line: 415, baseType: !966, size: 32, align: 32, offset: 2016)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1184, file: !548, line: 420, baseType: !966, size: 32, align: 32, offset: 2048)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1184, file: !548, line: 425, baseType: !966, size: 32, align: 32, offset: 2080)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1184, file: !548, line: 435, baseType: !968, size: 64, align: 64, offset: 2112)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1184, file: !548, line: 440, baseType: !966, size: 32, align: 32, offset: 2176)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1184, file: !548, line: 445, baseType: !957, size: 64, align: 64, offset: 2240)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1184, file: !548, line: 459, baseType: !1218, size: 512, align: 64, offset: 2304)
!1218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 512, align: 64, elements: !1188)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1184, file: !548, line: 473, baseType: !1220, size: 64, align: 64, offset: 2816)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1184, file: !548, line: 477, baseType: !966, size: 32, align: 32, offset: 2880)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1184, file: !548, line: 479, baseType: !1223, size: 64, align: 64, offset: 2944)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !548, line: 207, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !548, line: 201, size: 320, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1236}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1226, file: !548, line: 202, baseType: !547, size: 32, align: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1226, file: !548, line: 203, baseType: !1136, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1226, file: !548, line: 204, baseType: !966, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1226, file: !548, line: 205, baseType: !1232, size: 64, align: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1234, line: 86, baseType: !1235)
!1234 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1235 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1234, line: 86, flags: DIFlagFwdDecl)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1226, file: !548, line: 206, baseType: !1126, size: 64, align: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1184, file: !548, line: 480, baseType: !966, size: 32, align: 32, offset: 3008)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1184, file: !548, line: 505, baseType: !966, size: 32, align: 32, offset: 3040)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1184, file: !548, line: 512, baseType: !571, size: 32, align: 32, offset: 3072)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1184, file: !548, line: 514, baseType: !578, size: 32, align: 32, offset: 3104)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1184, file: !548, line: 516, baseType: !596, size: 32, align: 32, offset: 3136)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1184, file: !548, line: 523, baseType: !620, size: 32, align: 32, offset: 3168)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1184, file: !548, line: 525, baseType: !639, size: 32, align: 32, offset: 3200)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1184, file: !548, line: 532, baseType: !968, size: 64, align: 64, offset: 3264)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1184, file: !548, line: 539, baseType: !968, size: 64, align: 64, offset: 3328)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1184, file: !548, line: 547, baseType: !968, size: 64, align: 64, offset: 3392)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1184, file: !548, line: 554, baseType: !1232, size: 64, align: 64, offset: 3456)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1184, file: !548, line: 563, baseType: !966, size: 32, align: 32, offset: 3520)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1184, file: !548, line: 572, baseType: !966, size: 32, align: 32, offset: 3552)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1184, file: !548, line: 581, baseType: !966, size: 32, align: 32, offset: 3584)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1184, file: !548, line: 588, baseType: !1252, size: 64, align: 64, offset: 3648)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !958, line: 36, baseType: !1254)
!1254 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1184, file: !548, line: 593, baseType: !966, size: 32, align: 32, offset: 3712)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1184, file: !548, line: 596, baseType: !966, size: 32, align: 32, offset: 3744)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1184, file: !548, line: 599, baseType: !1126, size: 64, align: 64, offset: 3776)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1184, file: !548, line: 605, baseType: !1126, size: 64, align: 64, offset: 3840)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1184, file: !548, line: 616, baseType: !1126, size: 64, align: 64, offset: 3904)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1184, file: !548, line: 626, baseType: !1175, size: 64, align: 64, offset: 3968)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1184, file: !548, line: 627, baseType: !1175, size: 64, align: 64, offset: 4032)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1184, file: !548, line: 628, baseType: !1175, size: 64, align: 64, offset: 4096)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1184, file: !548, line: 629, baseType: !1175, size: 64, align: 64, offset: 4160)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1184, file: !548, line: 645, baseType: !1126, size: 64, align: 64, offset: 4224)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1102, file: !919, line: 587, baseType: !1266, size: 64, align: 64, offset: 1152)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!966, !1095, !1269}
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !919, line: 328, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1102, file: !919, line: 592, baseType: !1272, size: 64, align: 64, offset: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DISubroutineType(types: !1274)
!1274 = !{!966, !1095, !1275}
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !919, line: 329, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1102, file: !919, line: 597, baseType: !1272, size: 64, align: 64, offset: 1280)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1102, file: !919, line: 598, baseType: !3, size: 32, align: 32, offset: 1344)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1102, file: !919, line: 608, baseType: !1092, size: 64, align: 64, offset: 1408)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1102, file: !919, line: 617, baseType: !1281, size: 64, align: 64, offset: 1472)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DISubroutineType(types: !1283)
!1283 = !{null, !1095}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1102, file: !919, line: 623, baseType: !1285, size: 64, align: 64, offset: 1536)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!966, !1095, !1288}
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1122)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1096, file: !919, line: 1365, baseType: !950, size: 64, align: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1096, file: !919, line: 1379, baseType: !1292, size: 64, align: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !650, line: 352, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !650, line: 161, size: 2112, align: 64, elements: !1295)
!1295 = !{!1296, !1297, !1298, !1299, !1300, !1301, !1302, !1306, !1307, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1323, !1324, !1328, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1346, !1347, !1348, !1349, !1353, !1354, !1355}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1294, file: !650, line: 174, baseType: !994, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1294, file: !650, line: 226, baseType: !1087, size: 64, align: 64, offset: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1294, file: !650, line: 227, baseType: !966, size: 32, align: 32, offset: 128)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1294, file: !650, line: 228, baseType: !1087, size: 64, align: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1294, file: !650, line: 229, baseType: !1087, size: 64, align: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1294, file: !650, line: 233, baseType: !950, size: 64, align: 64, offset: 320)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1294, file: !650, line: 235, baseType: !1303, size: 64, align: 64, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!966, !950, !1136, !966}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1294, file: !650, line: 236, baseType: !1303, size: 64, align: 64, offset: 448)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1294, file: !650, line: 237, baseType: !1308, size: 64, align: 64, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DISubroutineType(types: !1310)
!1310 = !{!968, !950, !968, !966}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1294, file: !650, line: 238, baseType: !968, size: 64, align: 64, offset: 576)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1294, file: !650, line: 239, baseType: !966, size: 32, align: 32, offset: 640)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1294, file: !650, line: 240, baseType: !966, size: 32, align: 32, offset: 672)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1294, file: !650, line: 241, baseType: !966, size: 32, align: 32, offset: 704)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1294, file: !650, line: 242, baseType: !959, size: 64, align: 64, offset: 768)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1294, file: !650, line: 243, baseType: !1087, size: 64, align: 64, offset: 832)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1294, file: !650, line: 244, baseType: !1318, size: 64, align: 64, offset: 896)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64, align: 64)
!1319 = !DISubroutineType(types: !1320)
!1320 = !{!959, !959, !1321, !949}
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64, align: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1137)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1294, file: !650, line: 245, baseType: !966, size: 32, align: 32, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1294, file: !650, line: 249, baseType: !1325, size: 64, align: 64, offset: 1024)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64, align: 64)
!1326 = !DISubroutineType(types: !1327)
!1327 = !{!966, !950, !966}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1294, file: !650, line: 255, baseType: !1329, size: 64, align: 64, offset: 1088)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DISubroutineType(types: !1331)
!1331 = !{!968, !950, !966, !968, !966}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1294, file: !650, line: 260, baseType: !966, size: 32, align: 32, offset: 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1294, file: !650, line: 266, baseType: !968, size: 64, align: 64, offset: 1216)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1294, file: !650, line: 273, baseType: !966, size: 32, align: 32, offset: 1280)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1294, file: !650, line: 279, baseType: !968, size: 64, align: 64, offset: 1344)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1294, file: !650, line: 285, baseType: !966, size: 32, align: 32, offset: 1408)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1294, file: !650, line: 291, baseType: !966, size: 32, align: 32, offset: 1440)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1294, file: !650, line: 298, baseType: !966, size: 32, align: 32, offset: 1472)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1294, file: !650, line: 304, baseType: !966, size: 32, align: 32, offset: 1504)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1294, file: !650, line: 309, baseType: !977, size: 64, align: 64, offset: 1536)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1294, file: !650, line: 314, baseType: !977, size: 64, align: 64, offset: 1600)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1294, file: !650, line: 319, baseType: !1343, size: 64, align: 64, offset: 1664)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{!966, !950, !1136, !966, !649, !968}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1294, file: !650, line: 326, baseType: !966, size: 32, align: 32, offset: 1728)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1294, file: !650, line: 331, baseType: !649, size: 32, align: 32, offset: 1760)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1294, file: !650, line: 332, baseType: !968, size: 64, align: 64, offset: 1792)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1294, file: !650, line: 338, baseType: !1350, size: 64, align: 64, offset: 1856)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!966, !950}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1294, file: !650, line: 340, baseType: !968, size: 64, align: 64, offset: 1920)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1294, file: !650, line: 346, baseType: !1087, size: 64, align: 64, offset: 1984)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1294, file: !650, line: 351, baseType: !966, size: 32, align: 32, offset: 2048)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1096, file: !919, line: 1386, baseType: !966, size: 32, align: 32, offset: 320)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1096, file: !919, line: 1393, baseType: !949, size: 32, align: 32, offset: 352)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1096, file: !919, line: 1405, baseType: !1359, size: 64, align: 64, offset: 384)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !919, line: 1223, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !919, line: 865, size: 6144, align: 64, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1799, !1800, !1801, !1802, !1836, !1859, !1860, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1936, !1942, !1943, !1947, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1979, !1980, !1981, !1982, !1983, !1984}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1362, file: !919, line: 866, baseType: !966, size: 32, align: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1362, file: !919, line: 872, baseType: !966, size: 32, align: 32, offset: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1362, file: !919, line: 878, baseType: !1367, size: 64, align: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64, align: 64)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1374, !1511, !1512, !1513, !1514, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1540, !1544, !1545, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1724, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1369, file: !4, line: 1561, baseType: !994, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1369, file: !4, line: 1562, baseType: !966, size: 32, align: 32, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1369, file: !4, line: 1564, baseType: !658, size: 32, align: 32, offset: 96)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1369, file: !4, line: 1565, baseType: !1375, size: 64, align: 64, offset: 128)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64, align: 64)
!1376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1384, !1387, !1390, !1393, !1396, !1399, !1400, !1401, !1409, !1410, !1411, !1413, !1417, !1423, !1428, !1432, !1433, !1476, !1483, !1487, !1488, !1492, !1496, !1500, !1504, !1505, !1506}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1377, file: !4, line: 3475, baseType: !977, size: 64, align: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1377, file: !4, line: 3480, baseType: !977, size: 64, align: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1377, file: !4, line: 3481, baseType: !658, size: 32, align: 32, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1377, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1377, file: !4, line: 3487, baseType: !966, size: 32, align: 32, offset: 192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1377, file: !4, line: 3488, baseType: !1385, size: 64, align: 64, offset: 256)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1021)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1377, file: !4, line: 3489, baseType: !1388, size: 64, align: 64, offset: 320)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1377, file: !4, line: 3490, baseType: !1391, size: 64, align: 64, offset: 384)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1377, file: !4, line: 3491, baseType: !1394, size: 64, align: 64, offset: 448)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64, align: 64)
!1395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1377, file: !4, line: 3492, baseType: !1397, size: 64, align: 64, offset: 512)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1377, file: !4, line: 3493, baseType: !1137, size: 8, align: 8, offset: 576)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1377, file: !4, line: 3494, baseType: !994, size: 64, align: 64, offset: 640)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1377, file: !4, line: 3495, baseType: !1402, size: 64, align: 64, offset: 704)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1404)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1406)
!1406 = !{!1407, !1408}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1405, file: !4, line: 3402, baseType: !966, size: 32, align: 32)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1405, file: !4, line: 3403, baseType: !977, size: 64, align: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1377, file: !4, line: 3507, baseType: !977, size: 64, align: 64, offset: 768)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1377, file: !4, line: 3516, baseType: !966, size: 32, align: 32, offset: 832)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1377, file: !4, line: 3517, baseType: !1412, size: 64, align: 64, offset: 896)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1377, file: !4, line: 3527, baseType: !1414, size: 64, align: 64, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64, align: 64)
!1415 = !DISubroutineType(types: !1416)
!1416 = !{!966, !1367}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1377, file: !4, line: 3535, baseType: !1418, size: 64, align: 64, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1419, size: 64, align: 64)
!1419 = !DISubroutineType(types: !1420)
!1420 = !{!966, !1367, !1421}
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64, align: 64)
!1422 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1368)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1377, file: !4, line: 3541, baseType: !1424, size: 64, align: 64, offset: 1088)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64, align: 64)
!1425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1426)
!1426 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1427)
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1377, file: !4, line: 3549, baseType: !1429, size: 64, align: 64, offset: 1152)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{null, !1412}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1377, file: !4, line: 3551, baseType: !1414, size: 64, align: 64, offset: 1216)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1377, file: !4, line: 3552, baseType: !1434, size: 64, align: 64, offset: 1280)
!1434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1435, size: 64, align: 64)
!1435 = !DISubroutineType(types: !1436)
!1436 = !{!966, !1367, !1136, !966, !1437}
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64, align: 64)
!1438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1439)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1440)
!1440 = !{!1441, !1444, !1445, !1446, !1447, !1475}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1439, file: !4, line: 3921, baseType: !1442, size: 16, align: 16)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !958, line: 49, baseType: !1443)
!1443 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1439, file: !4, line: 3922, baseType: !965, size: 32, align: 32, offset: 32)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1439, file: !4, line: 3923, baseType: !965, size: 32, align: 32, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1439, file: !4, line: 3924, baseType: !949, size: 32, align: 32, offset: 96)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1439, file: !4, line: 3925, baseType: !1448, size: 64, align: 64, offset: 128)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1452)
!1452 = !{!1453, !1454, !1455, !1456, !1457, !1458, !1464, !1468, !1470, !1471, !1473, !1474}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1451, file: !4, line: 3886, baseType: !966, size: 32, align: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1451, file: !4, line: 3887, baseType: !966, size: 32, align: 32, offset: 32)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1451, file: !4, line: 3888, baseType: !966, size: 32, align: 32, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1451, file: !4, line: 3889, baseType: !966, size: 32, align: 32, offset: 96)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1451, file: !4, line: 3890, baseType: !966, size: 32, align: 32, offset: 128)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1451, file: !4, line: 3897, baseType: !1459, size: 768, align: 64, offset: 192)
!1459 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1460)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1461)
!1461 = !{!1462, !1463}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1460, file: !4, line: 3855, baseType: !1187, size: 512, align: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1460, file: !4, line: 3857, baseType: !1191, size: 256, align: 32, offset: 512)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1451, file: !4, line: 3903, baseType: !1465, size: 256, align: 64, offset: 960)
!1465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 256, align: 64, elements: !1466)
!1466 = !{!1467}
!1467 = !DISubrange(count: 4)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1451, file: !4, line: 3904, baseType: !1469, size: 128, align: 32, offset: 1216)
!1469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !966, size: 128, align: 32, elements: !1466)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1451, file: !4, line: 3906, baseType: !883, size: 32, align: 32, offset: 1344)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1451, file: !4, line: 3908, baseType: !1472, size: 64, align: 64, offset: 1408)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1451, file: !4, line: 3915, baseType: !1472, size: 64, align: 64, offset: 1472)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1451, file: !4, line: 3917, baseType: !966, size: 32, align: 32, offset: 1536)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1439, file: !4, line: 3926, baseType: !968, size: 64, align: 64, offset: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1377, file: !4, line: 3564, baseType: !1477, size: 64, align: 64, offset: 1344)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64, align: 64)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!966, !1367, !1121, !1480, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1183)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1377, file: !4, line: 3566, baseType: !1484, size: 64, align: 64, offset: 1408)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!966, !1367, !950, !1482, !1121}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1377, file: !4, line: 3567, baseType: !1414, size: 64, align: 64, offset: 1472)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1377, file: !4, line: 3576, baseType: !1489, size: 64, align: 64, offset: 1536)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64, align: 64)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{!966, !1367, !1480}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1377, file: !4, line: 3577, baseType: !1493, size: 64, align: 64, offset: 1600)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DISubroutineType(types: !1495)
!1495 = !{!966, !1367, !1121}
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1377, file: !4, line: 3584, baseType: !1497, size: 64, align: 64, offset: 1664)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{!966, !1367, !1182}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1377, file: !4, line: 3589, baseType: !1501, size: 64, align: 64, offset: 1728)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DISubroutineType(types: !1503)
!1503 = !{null, !1367}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1377, file: !4, line: 3594, baseType: !966, size: 32, align: 32, offset: 1792)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1377, file: !4, line: 3600, baseType: !977, size: 64, align: 64, offset: 1856)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1377, file: !4, line: 3609, baseType: !1507, size: 64, align: 64, offset: 1920)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1509, size: 64, align: 64)
!1509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1510)
!1510 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1369, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1369, file: !4, line: 1581, baseType: !949, size: 32, align: 32, offset: 224)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1369, file: !4, line: 1583, baseType: !950, size: 64, align: 64, offset: 256)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1369, file: !4, line: 1591, baseType: !1515, size: 64, align: 64, offset: 320)
!1515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1516, size: 64, align: 64)
!1516 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1369, file: !4, line: 1598, baseType: !950, size: 64, align: 64, offset: 384)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1369, file: !4, line: 1606, baseType: !968, size: 64, align: 64, offset: 448)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1369, file: !4, line: 1614, baseType: !966, size: 32, align: 32, offset: 512)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1369, file: !4, line: 1622, baseType: !966, size: 32, align: 32, offset: 544)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1369, file: !4, line: 1628, baseType: !966, size: 32, align: 32, offset: 576)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1369, file: !4, line: 1636, baseType: !966, size: 32, align: 32, offset: 608)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1369, file: !4, line: 1643, baseType: !966, size: 32, align: 32, offset: 640)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1369, file: !4, line: 1657, baseType: !1136, size: 64, align: 64, offset: 704)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1369, file: !4, line: 1658, baseType: !966, size: 32, align: 32, offset: 768)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1369, file: !4, line: 1679, baseType: !1021, size: 64, align: 32, offset: 800)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1369, file: !4, line: 1688, baseType: !966, size: 32, align: 32, offset: 864)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1369, file: !4, line: 1712, baseType: !966, size: 32, align: 32, offset: 896)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1369, file: !4, line: 1729, baseType: !966, size: 32, align: 32, offset: 928)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1369, file: !4, line: 1729, baseType: !966, size: 32, align: 32, offset: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1369, file: !4, line: 1744, baseType: !966, size: 32, align: 32, offset: 992)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1369, file: !4, line: 1744, baseType: !966, size: 32, align: 32, offset: 1024)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1369, file: !4, line: 1751, baseType: !966, size: 32, align: 32, offset: 1056)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1369, file: !4, line: 1766, baseType: !667, size: 32, align: 32, offset: 1088)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1369, file: !4, line: 1791, baseType: !1536, size: 64, align: 64, offset: 1152)
!1536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1537, size: 64, align: 64)
!1537 = !DISubroutineType(types: !1538)
!1538 = !{null, !1539, !1480, !1482, !966, !966, !966}
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1369, file: !4, line: 1808, baseType: !1541, size: 64, align: 64, offset: 1216)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!667, !1539, !1388}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1369, file: !4, line: 1816, baseType: !966, size: 32, align: 32, offset: 1280)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1369, file: !4, line: 1825, baseType: !1546, size: 32, align: 32, offset: 1312)
!1546 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1369, file: !4, line: 1830, baseType: !966, size: 32, align: 32, offset: 1344)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1369, file: !4, line: 1838, baseType: !1546, size: 32, align: 32, offset: 1376)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1369, file: !4, line: 1846, baseType: !966, size: 32, align: 32, offset: 1408)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1369, file: !4, line: 1851, baseType: !966, size: 32, align: 32, offset: 1440)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1369, file: !4, line: 1861, baseType: !1546, size: 32, align: 32, offset: 1472)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1369, file: !4, line: 1868, baseType: !1546, size: 32, align: 32, offset: 1504)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1369, file: !4, line: 1875, baseType: !1546, size: 32, align: 32, offset: 1536)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1369, file: !4, line: 1882, baseType: !1546, size: 32, align: 32, offset: 1568)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1369, file: !4, line: 1889, baseType: !1546, size: 32, align: 32, offset: 1600)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1369, file: !4, line: 1896, baseType: !1546, size: 32, align: 32, offset: 1632)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1369, file: !4, line: 1903, baseType: !1546, size: 32, align: 32, offset: 1664)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1369, file: !4, line: 1910, baseType: !966, size: 32, align: 32, offset: 1696)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1369, file: !4, line: 1915, baseType: !966, size: 32, align: 32, offset: 1728)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1369, file: !4, line: 1926, baseType: !1482, size: 64, align: 64, offset: 1792)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1369, file: !4, line: 1935, baseType: !1021, size: 64, align: 32, offset: 1856)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1369, file: !4, line: 1942, baseType: !966, size: 32, align: 32, offset: 1920)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1369, file: !4, line: 1948, baseType: !966, size: 32, align: 32, offset: 1952)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1369, file: !4, line: 1954, baseType: !966, size: 32, align: 32, offset: 1984)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1369, file: !4, line: 1960, baseType: !966, size: 32, align: 32, offset: 2016)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1369, file: !4, line: 1984, baseType: !966, size: 32, align: 32, offset: 2048)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1369, file: !4, line: 1991, baseType: !966, size: 32, align: 32, offset: 2080)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1369, file: !4, line: 1996, baseType: !966, size: 32, align: 32, offset: 2112)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1369, file: !4, line: 2004, baseType: !966, size: 32, align: 32, offset: 2144)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1369, file: !4, line: 2011, baseType: !966, size: 32, align: 32, offset: 2176)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1369, file: !4, line: 2018, baseType: !966, size: 32, align: 32, offset: 2208)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1369, file: !4, line: 2027, baseType: !966, size: 32, align: 32, offset: 2240)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1369, file: !4, line: 2034, baseType: !966, size: 32, align: 32, offset: 2272)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1369, file: !4, line: 2044, baseType: !966, size: 32, align: 32, offset: 2304)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1369, file: !4, line: 2054, baseType: !1576, size: 64, align: 64, offset: 2368)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1369, file: !4, line: 2061, baseType: !1576, size: 64, align: 64, offset: 2432)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1369, file: !4, line: 2066, baseType: !966, size: 32, align: 32, offset: 2496)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1369, file: !4, line: 2070, baseType: !966, size: 32, align: 32, offset: 2528)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1369, file: !4, line: 2078, baseType: !966, size: 32, align: 32, offset: 2560)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1369, file: !4, line: 2085, baseType: !966, size: 32, align: 32, offset: 2592)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1369, file: !4, line: 2092, baseType: !966, size: 32, align: 32, offset: 2624)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1369, file: !4, line: 2099, baseType: !966, size: 32, align: 32, offset: 2656)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1369, file: !4, line: 2106, baseType: !966, size: 32, align: 32, offset: 2688)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1369, file: !4, line: 2113, baseType: !966, size: 32, align: 32, offset: 2720)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1369, file: !4, line: 2120, baseType: !966, size: 32, align: 32, offset: 2752)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1369, file: !4, line: 2125, baseType: !966, size: 32, align: 32, offset: 2784)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1369, file: !4, line: 2133, baseType: !966, size: 32, align: 32, offset: 2816)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1369, file: !4, line: 2140, baseType: !966, size: 32, align: 32, offset: 2848)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1369, file: !4, line: 2145, baseType: !966, size: 32, align: 32, offset: 2880)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1369, file: !4, line: 2153, baseType: !966, size: 32, align: 32, offset: 2912)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1369, file: !4, line: 2158, baseType: !966, size: 32, align: 32, offset: 2944)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1369, file: !4, line: 2166, baseType: !578, size: 32, align: 32, offset: 2976)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1369, file: !4, line: 2173, baseType: !596, size: 32, align: 32, offset: 3008)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1369, file: !4, line: 2180, baseType: !620, size: 32, align: 32, offset: 3040)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1369, file: !4, line: 2187, baseType: !571, size: 32, align: 32, offset: 3072)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1369, file: !4, line: 2194, baseType: !639, size: 32, align: 32, offset: 3104)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1369, file: !4, line: 2203, baseType: !966, size: 32, align: 32, offset: 3136)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1369, file: !4, line: 2209, baseType: !889, size: 32, align: 32, offset: 3168)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1369, file: !4, line: 2212, baseType: !966, size: 32, align: 32, offset: 3200)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1369, file: !4, line: 2213, baseType: !966, size: 32, align: 32, offset: 3232)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1369, file: !4, line: 2220, baseType: !866, size: 32, align: 32, offset: 3264)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1369, file: !4, line: 2232, baseType: !966, size: 32, align: 32, offset: 3296)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1369, file: !4, line: 2243, baseType: !966, size: 32, align: 32, offset: 3328)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1369, file: !4, line: 2249, baseType: !966, size: 32, align: 32, offset: 3360)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1369, file: !4, line: 2256, baseType: !966, size: 32, align: 32, offset: 3392)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1369, file: !4, line: 2263, baseType: !957, size: 64, align: 64, offset: 3456)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1369, file: !4, line: 2270, baseType: !957, size: 64, align: 64, offset: 3520)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1369, file: !4, line: 2277, baseType: !897, size: 32, align: 32, offset: 3584)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1369, file: !4, line: 2285, baseType: !866, size: 32, align: 32, offset: 3616)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1369, file: !4, line: 2367, baseType: !1612, size: 64, align: 64, offset: 3648)
!1612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1613, size: 64, align: 64)
!1613 = !DISubroutineType(types: !1614)
!1614 = !{!966, !1539, !1182, !966}
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1369, file: !4, line: 2383, baseType: !966, size: 32, align: 32, offset: 3712)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1369, file: !4, line: 2386, baseType: !1546, size: 32, align: 32, offset: 3744)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1369, file: !4, line: 2387, baseType: !1546, size: 32, align: 32, offset: 3776)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1369, file: !4, line: 2394, baseType: !966, size: 32, align: 32, offset: 3808)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1369, file: !4, line: 2401, baseType: !966, size: 32, align: 32, offset: 3840)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1369, file: !4, line: 2408, baseType: !966, size: 32, align: 32, offset: 3872)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1369, file: !4, line: 2415, baseType: !966, size: 32, align: 32, offset: 3904)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1369, file: !4, line: 2422, baseType: !966, size: 32, align: 32, offset: 3936)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1369, file: !4, line: 2423, baseType: !1624, size: 64, align: 64, offset: 3968)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1626)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1627)
!1627 = !{!1628, !1629, !1630, !1631}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1626, file: !4, line: 827, baseType: !966, size: 32, align: 32)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1626, file: !4, line: 828, baseType: !966, size: 32, align: 32, offset: 32)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1626, file: !4, line: 829, baseType: !966, size: 32, align: 32, offset: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1626, file: !4, line: 830, baseType: !1546, size: 32, align: 32, offset: 96)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1369, file: !4, line: 2430, baseType: !968, size: 64, align: 64, offset: 4032)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1369, file: !4, line: 2437, baseType: !968, size: 64, align: 64, offset: 4096)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1369, file: !4, line: 2444, baseType: !1546, size: 32, align: 32, offset: 4160)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1369, file: !4, line: 2451, baseType: !1546, size: 32, align: 32, offset: 4192)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1369, file: !4, line: 2458, baseType: !966, size: 32, align: 32, offset: 4224)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1369, file: !4, line: 2469, baseType: !966, size: 32, align: 32, offset: 4256)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1369, file: !4, line: 2475, baseType: !966, size: 32, align: 32, offset: 4288)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1369, file: !4, line: 2481, baseType: !966, size: 32, align: 32, offset: 4320)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1369, file: !4, line: 2485, baseType: !966, size: 32, align: 32, offset: 4352)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1369, file: !4, line: 2489, baseType: !966, size: 32, align: 32, offset: 4384)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1369, file: !4, line: 2493, baseType: !966, size: 32, align: 32, offset: 4416)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1369, file: !4, line: 2501, baseType: !966, size: 32, align: 32, offset: 4448)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1369, file: !4, line: 2506, baseType: !966, size: 32, align: 32, offset: 4480)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1369, file: !4, line: 2510, baseType: !966, size: 32, align: 32, offset: 4512)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1369, file: !4, line: 2514, baseType: !968, size: 64, align: 64, offset: 4544)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1369, file: !4, line: 2528, baseType: !1648, size: 64, align: 64, offset: 4608)
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DISubroutineType(types: !1650)
!1650 = !{null, !1539, !950, !966, !966}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1369, file: !4, line: 2534, baseType: !966, size: 32, align: 32, offset: 4672)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1369, file: !4, line: 2545, baseType: !966, size: 32, align: 32, offset: 4704)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1369, file: !4, line: 2547, baseType: !966, size: 32, align: 32, offset: 4736)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1369, file: !4, line: 2549, baseType: !966, size: 32, align: 32, offset: 4768)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1369, file: !4, line: 2551, baseType: !966, size: 32, align: 32, offset: 4800)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1369, file: !4, line: 2553, baseType: !966, size: 32, align: 32, offset: 4832)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1369, file: !4, line: 2555, baseType: !966, size: 32, align: 32, offset: 4864)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1369, file: !4, line: 2557, baseType: !966, size: 32, align: 32, offset: 4896)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1369, file: !4, line: 2559, baseType: !966, size: 32, align: 32, offset: 4928)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1369, file: !4, line: 2563, baseType: !966, size: 32, align: 32, offset: 4960)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1369, file: !4, line: 2571, baseType: !1472, size: 64, align: 64, offset: 4992)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1369, file: !4, line: 2579, baseType: !1472, size: 64, align: 64, offset: 5056)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1369, file: !4, line: 2586, baseType: !966, size: 32, align: 32, offset: 5120)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1369, file: !4, line: 2615, baseType: !966, size: 32, align: 32, offset: 5152)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1369, file: !4, line: 2627, baseType: !966, size: 32, align: 32, offset: 5184)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1369, file: !4, line: 2637, baseType: !966, size: 32, align: 32, offset: 5216)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1369, file: !4, line: 2681, baseType: !966, size: 32, align: 32, offset: 5248)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1369, file: !4, line: 2709, baseType: !968, size: 64, align: 64, offset: 5312)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1369, file: !4, line: 2716, baseType: !1670, size: 64, align: 64, offset: 5376)
!1670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1671, size: 64, align: 64)
!1671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1672)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1673)
!1673 = !{!1674, !1675, !1676, !1677, !1678, !1679, !1680, !1684, !1688, !1689, !1690, !1691, !1697, !1698, !1699, !1700, !1701}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1672, file: !4, line: 3642, baseType: !977, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1672, file: !4, line: 3649, baseType: !658, size: 32, align: 32, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1672, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1672, file: !4, line: 3663, baseType: !667, size: 32, align: 32, offset: 128)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1672, file: !4, line: 3669, baseType: !966, size: 32, align: 32, offset: 160)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1672, file: !4, line: 3682, baseType: !1497, size: 64, align: 64, offset: 192)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1672, file: !4, line: 3698, baseType: !1681, size: 64, align: 64, offset: 256)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64, align: 64)
!1682 = !DISubroutineType(types: !1683)
!1683 = !{!966, !1367, !1321, !965}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1672, file: !4, line: 3712, baseType: !1685, size: 64, align: 64, offset: 320)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DISubroutineType(types: !1687)
!1687 = !{!966, !1367, !966, !1321, !965}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1672, file: !4, line: 3726, baseType: !1681, size: 64, align: 64, offset: 384)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1672, file: !4, line: 3737, baseType: !1414, size: 64, align: 64, offset: 448)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1672, file: !4, line: 3746, baseType: !966, size: 32, align: 32, offset: 512)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1672, file: !4, line: 3757, baseType: !1692, size: 64, align: 64, offset: 576)
!1692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1693, size: 64, align: 64)
!1693 = !DISubroutineType(types: !1694)
!1694 = !{null, !1695}
!1695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1696, size: 64, align: 64)
!1696 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1672, file: !4, line: 3766, baseType: !1414, size: 64, align: 64, offset: 640)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1672, file: !4, line: 3774, baseType: !1414, size: 64, align: 64, offset: 704)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1672, file: !4, line: 3780, baseType: !966, size: 32, align: 32, offset: 768)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1672, file: !4, line: 3785, baseType: !966, size: 32, align: 32, offset: 800)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1672, file: !4, line: 3795, baseType: !1702, size: 64, align: 64, offset: 832)
!1702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1703, size: 64, align: 64)
!1703 = !DISubroutineType(types: !1704)
!1704 = !{!966, !1367, !1126}
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1369, file: !4, line: 2728, baseType: !950, size: 64, align: 64, offset: 5440)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1369, file: !4, line: 2735, baseType: !1209, size: 512, align: 64, offset: 5504)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1369, file: !4, line: 2742, baseType: !966, size: 32, align: 32, offset: 6016)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1369, file: !4, line: 2755, baseType: !966, size: 32, align: 32, offset: 6048)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1369, file: !4, line: 2776, baseType: !966, size: 32, align: 32, offset: 6080)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1369, file: !4, line: 2783, baseType: !966, size: 32, align: 32, offset: 6112)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1369, file: !4, line: 2791, baseType: !966, size: 32, align: 32, offset: 6144)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1369, file: !4, line: 2802, baseType: !1182, size: 64, align: 64, offset: 6208)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1369, file: !4, line: 2811, baseType: !966, size: 32, align: 32, offset: 6272)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1369, file: !4, line: 2821, baseType: !966, size: 32, align: 32, offset: 6304)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1369, file: !4, line: 2830, baseType: !966, size: 32, align: 32, offset: 6336)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1369, file: !4, line: 2840, baseType: !966, size: 32, align: 32, offset: 6368)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1369, file: !4, line: 2851, baseType: !1718, size: 64, align: 64, offset: 6400)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DISubroutineType(types: !1720)
!1720 = !{!966, !1539, !1721, !950, !1482, !966, !966}
!1721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1722, size: 64, align: 64)
!1722 = !DISubroutineType(types: !1723)
!1723 = !{!966, !1539, !950}
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1369, file: !4, line: 2871, baseType: !1725, size: 64, align: 64, offset: 6464)
!1725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1726, size: 64, align: 64)
!1726 = !DISubroutineType(types: !1727)
!1727 = !{!966, !1539, !1728, !950, !1482, !966}
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{!966, !1539, !950, !966, !966}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1369, file: !4, line: 2878, baseType: !966, size: 32, align: 32, offset: 6528)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1369, file: !4, line: 2885, baseType: !966, size: 32, align: 32, offset: 6560)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1369, file: !4, line: 3005, baseType: !966, size: 32, align: 32, offset: 6592)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1369, file: !4, line: 3013, baseType: !909, size: 32, align: 32, offset: 6624)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1369, file: !4, line: 3020, baseType: !909, size: 32, align: 32, offset: 6656)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1369, file: !4, line: 3027, baseType: !909, size: 32, align: 32, offset: 6688)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1369, file: !4, line: 3037, baseType: !1136, size: 64, align: 64, offset: 6720)
