; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--8svx.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--8svx.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!821 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!822 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!824 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!825 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!826 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!827 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!828 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!829 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!830 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!831 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!832 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!833 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!834 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!835 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!836 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!837 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!838 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!839 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!840 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!841 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!842 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!843 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!844 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!845 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!846 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!847 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!848 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!849 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!850 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!851 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !14, line: 1534, size: 32, align: 32, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!855 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!856 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!857 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!858 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!859 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !14, line: 810, size: 32, align: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!864 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!865 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !889}
!888 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!889 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!890 = !{!891, !1625, !1626, !1631}
!891 = distinct !DIGlobalVariable(name: "ff_eightsvx_fib_decoder", scope: !0, file: !892, line: 188, type: !893, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_eightsvx_fib_decoder)
!892 = !DIFile(filename: "libavcodec/8svx.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !895)
!895 = !{!896, !900, !901, !902, !903, !904, !913, !916, !919, !922, !928, !931, !973, !981, !982, !983, !985, !1540, !1546, !1554, !1558, !1559, !1596, !1600, !1604, !1605, !1609, !1613, !1614, !1618, !1619, !1620}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !894, file: !14, line: 3475, baseType: !897, size: 64, align: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64, align: 64)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !894, file: !14, line: 3480, baseType: !897, size: 64, align: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !894, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !894, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !894, file: !14, line: 3487, baseType: !888, size: 32, align: 32, offset: 192)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !894, file: !14, line: 3488, baseType: !905, size: 64, align: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64, align: 64)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !908, line: 61, baseType: !909)
!908 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !908, line: 58, size: 64, align: 32, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !909, file: !908, line: 59, baseType: !888, size: 32, align: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !909, file: !908, line: 60, baseType: !888, size: 32, align: 32, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !894, file: !14, line: 3489, baseType: !914, size: 64, align: 64, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !894, file: !14, line: 3490, baseType: !917, size: 64, align: 64, offset: 384)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !894, file: !14, line: 3491, baseType: !920, size: 64, align: 64, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !894, file: !14, line: 3492, baseType: !923, size: 64, align: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64, align: 64)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !925)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !926, line: 55, baseType: !927)
!926 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !894, file: !14, line: 3493, baseType: !929, size: 8, align: 8, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !926, line: 48, baseType: !930)
!930 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !894, file: !14, line: 3494, baseType: !932, size: 64, align: 64, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64, align: 64)
!933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !936)
!936 = !{!937, !938, !943, !947, !948, !949, !950, !954, !960, !962, !966}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !935, file: !691, line: 72, baseType: !897, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !935, file: !691, line: 78, baseType: !939, size: 64, align: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{!897, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !935, file: !691, line: 85, baseType: !944, size: 64, align: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !935, file: !691, line: 93, baseType: !888, size: 32, align: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !935, file: !691, line: 99, baseType: !888, size: 32, align: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !935, file: !691, line: 108, baseType: !888, size: 32, align: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !935, file: !691, line: 113, baseType: !951, size: 64, align: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!942, !942, !942}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !935, file: !691, line: 123, baseType: !955, size: 64, align: 64, offset: 384)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DISubroutineType(types: !957)
!957 = !{!958, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !935, file: !691, line: 130, baseType: !961, size: 32, align: 32, offset: 448)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !935, file: !691, line: 136, baseType: !963, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!961, !942}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !935, file: !691, line: 142, baseType: !967, size: 64, align: 64, offset: 576)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64, align: 64)
!968 = !DISubroutineType(types: !969)
!969 = !{!888, !970, !942, !897, !888}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !894, file: !14, line: 3495, baseType: !974, size: 64, align: 64, offset: 704)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !977, file: !14, line: 3402, baseType: !888, size: 32, align: 32)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !977, file: !14, line: 3403, baseType: !897, size: 64, align: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !894, file: !14, line: 3507, baseType: !897, size: 64, align: 64, offset: 768)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !894, file: !14, line: 3516, baseType: !888, size: 32, align: 32, offset: 832)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !894, file: !14, line: 3517, baseType: !984, size: 64, align: 64, offset: 896)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !894, file: !14, line: 3527, baseType: !986, size: 64, align: 64, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DISubroutineType(types: !988)
!988 = !{!888, !989}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !992)
!992 = !{!993, !994, !995, !996, !999, !1000, !1001, !1002, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1286, !1290, !1291, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1478, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !991, file: !14, line: 1561, baseType: !932, size: 64, align: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !991, file: !14, line: 1562, baseType: !888, size: 32, align: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !991, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !991, file: !14, line: 1565, baseType: !997, size: 64, align: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !991, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !991, file: !14, line: 1581, baseType: !889, size: 32, align: 32, offset: 224)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !991, file: !14, line: 1583, baseType: !942, size: 64, align: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !991, file: !14, line: 1591, baseType: !1003, size: 64, align: 64, offset: 320)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1005, line: 129, size: 1664, align: 64, elements: !1006)
!1005 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1006 = !{!1007, !1008, !1009, !1010, !1111, !1132, !1133, !1162, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1004, file: !1005, line: 136, baseType: !888, size: 32, align: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1004, file: !1005, line: 151, baseType: !888, size: 32, align: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1004, file: !1005, line: 157, baseType: !888, size: 32, align: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1004, file: !1005, line: 159, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1014)
!1014 = !{!1015, !1020, !1022, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1063, !1065, !1066, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1107, !1108, !1109, !1110}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1013, file: !722, line: 282, baseType: !1016, size: 512, align: 64)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 512, align: 64, elements: !1018)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1018 = !{!1019}
!1019 = !DISubrange(count: 8)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1013, file: !722, line: 299, baseType: !1021, size: 256, align: 32, offset: 512)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 256, align: 32, elements: !1018)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1013, file: !722, line: 315, baseType: !1023, size: 64, align: 64, offset: 768)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1013, file: !722, line: 326, baseType: !888, size: 32, align: 32, offset: 832)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1013, file: !722, line: 326, baseType: !888, size: 32, align: 32, offset: 864)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1013, file: !722, line: 334, baseType: !888, size: 32, align: 32, offset: 896)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1013, file: !722, line: 341, baseType: !888, size: 32, align: 32, offset: 928)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1013, file: !722, line: 346, baseType: !888, size: 32, align: 32, offset: 960)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1013, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1013, file: !722, line: 356, baseType: !907, size: 64, align: 32, offset: 1024)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1013, file: !722, line: 361, baseType: !1032, size: 64, align: 64, offset: 1088)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1033, line: 197, baseType: !1034)
!1033 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1034 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1013, file: !722, line: 369, baseType: !1032, size: 64, align: 64, offset: 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1013, file: !722, line: 377, baseType: !1032, size: 64, align: 64, offset: 1216)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1013, file: !722, line: 382, baseType: !888, size: 32, align: 32, offset: 1280)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1013, file: !722, line: 386, baseType: !888, size: 32, align: 32, offset: 1312)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1013, file: !722, line: 391, baseType: !888, size: 32, align: 32, offset: 1344)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1013, file: !722, line: 396, baseType: !942, size: 64, align: 64, offset: 1408)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1013, file: !722, line: 403, baseType: !1042, size: 512, align: 64, offset: 1472)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 512, align: 64, elements: !1018)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1013, file: !722, line: 410, baseType: !888, size: 32, align: 32, offset: 1984)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1013, file: !722, line: 415, baseType: !888, size: 32, align: 32, offset: 2016)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1013, file: !722, line: 420, baseType: !888, size: 32, align: 32, offset: 2048)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1013, file: !722, line: 425, baseType: !888, size: 32, align: 32, offset: 2080)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1013, file: !722, line: 435, baseType: !1032, size: 64, align: 64, offset: 2112)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1013, file: !722, line: 440, baseType: !888, size: 32, align: 32, offset: 2176)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1013, file: !722, line: 445, baseType: !925, size: 64, align: 64, offset: 2240)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1013, file: !722, line: 459, baseType: !1051, size: 512, align: 64, offset: 2304)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 512, align: 64, elements: !1018)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64, align: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1054, line: 94, baseType: !1055)
!1054 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1054, line: 81, size: 192, align: 64, elements: !1056)
!1056 = !{!1057, !1061, !1062}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1055, file: !1054, line: 82, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1054, line: 73, baseType: !1060)
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1054, line: 73, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1055, file: !1054, line: 89, baseType: !1017, size: 64, align: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1055, file: !1054, line: 93, baseType: !888, size: 32, align: 32, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1013, file: !722, line: 473, baseType: !1064, size: 64, align: 64, offset: 2816)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1013, file: !722, line: 477, baseType: !888, size: 32, align: 32, offset: 2880)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1013, file: !722, line: 479, baseType: !1067, size: 64, align: 64, offset: 2944)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1080}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1070, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1070, file: !722, line: 203, baseType: !1017, size: 64, align: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !722, line: 204, baseType: !888, size: 32, align: 32, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1070, file: !722, line: 205, baseType: !1076, size: 64, align: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1078, line: 86, baseType: !1079)
!1078 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1078, line: 86, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1070, file: !722, line: 206, baseType: !1052, size: 64, align: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1013, file: !722, line: 480, baseType: !888, size: 32, align: 32, offset: 3008)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1013, file: !722, line: 505, baseType: !888, size: 32, align: 32, offset: 3040)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1013, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1013, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1013, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1013, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1013, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1013, file: !722, line: 532, baseType: !1032, size: 64, align: 64, offset: 3264)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1013, file: !722, line: 539, baseType: !1032, size: 64, align: 64, offset: 3328)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1013, file: !722, line: 547, baseType: !1032, size: 64, align: 64, offset: 3392)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1013, file: !722, line: 554, baseType: !1076, size: 64, align: 64, offset: 3456)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1013, file: !722, line: 563, baseType: !888, size: 32, align: 32, offset: 3520)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1013, file: !722, line: 572, baseType: !888, size: 32, align: 32, offset: 3552)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1013, file: !722, line: 581, baseType: !888, size: 32, align: 32, offset: 3584)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1013, file: !722, line: 588, baseType: !1096, size: 64, align: 64, offset: 3648)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1033, line: 194, baseType: !1098)
!1098 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1013, file: !722, line: 593, baseType: !888, size: 32, align: 32, offset: 3712)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1013, file: !722, line: 596, baseType: !888, size: 32, align: 32, offset: 3744)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1013, file: !722, line: 599, baseType: !1052, size: 64, align: 64, offset: 3776)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1013, file: !722, line: 605, baseType: !1052, size: 64, align: 64, offset: 3840)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1013, file: !722, line: 616, baseType: !1052, size: 64, align: 64, offset: 3904)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1013, file: !722, line: 626, baseType: !1105, size: 64, align: 64, offset: 3968)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1106, line: 216, baseType: !927)
!1106 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1013, file: !722, line: 627, baseType: !1105, size: 64, align: 64, offset: 4032)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1013, file: !722, line: 628, baseType: !1105, size: 64, align: 64, offset: 4096)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1013, file: !722, line: 629, baseType: !1105, size: 64, align: 64, offset: 4160)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1013, file: !722, line: 645, baseType: !1052, size: 64, align: 64, offset: 4224)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1004, file: !1005, line: 161, baseType: !1112, size: 64, align: 64, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64, align: 64)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1005, line: 117, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1005, line: 100, size: 832, align: 64, elements: !1115)
!1115 = !{!1116, !1123, !1124, !1125, !1126, !1127, !1129, !1130, !1131}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1114, file: !1005, line: 105, baseType: !1117, size: 256, align: 64)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1118, size: 256, align: 64, elements: !1121)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1054, line: 238, baseType: !1120)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1054, line: 238, flags: DIFlagFwdDecl)
!1121 = !{!1122}
!1122 = !DISubrange(count: 4)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1114, file: !1005, line: 110, baseType: !888, size: 32, align: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1114, file: !1005, line: 111, baseType: !888, size: 32, align: 32, offset: 288)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1114, file: !1005, line: 111, baseType: !888, size: 32, align: 32, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1114, file: !1005, line: 112, baseType: !1021, size: 256, align: 32, offset: 352)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1114, file: !1005, line: 113, baseType: !1128, size: 128, align: 32, offset: 608)
!1128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, align: 32, elements: !1121)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1114, file: !1005, line: 114, baseType: !888, size: 32, align: 32, offset: 736)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1114, file: !1005, line: 115, baseType: !888, size: 32, align: 32, offset: 768)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1114, file: !1005, line: 116, baseType: !888, size: 32, align: 32, offset: 800)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1004, file: !1005, line: 163, baseType: !942, size: 64, align: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1004, file: !1005, line: 165, baseType: !1134, size: 128, align: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1005, line: 122, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1005, line: 119, size: 128, align: 64, elements: !1136)
!1136 = !{!1137, !1161}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1135, file: !1005, line: 120, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1157, !1158, !1159, !1160}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1140, file: !14, line: 1451, baseType: !1052, size: 64, align: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1140, file: !14, line: 1461, baseType: !1032, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1140, file: !14, line: 1467, baseType: !1032, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1140, file: !14, line: 1468, baseType: !1017, size: 64, align: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1140, file: !14, line: 1469, baseType: !888, size: 32, align: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1140, file: !14, line: 1470, baseType: !888, size: 32, align: 32, offset: 288)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1140, file: !14, line: 1474, baseType: !888, size: 32, align: 32, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1140, file: !14, line: 1479, baseType: !1150, size: 64, align: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !14, line: 1412, baseType: !1017, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !14, line: 1413, baseType: !888, size: 32, align: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1140, file: !14, line: 1480, baseType: !888, size: 32, align: 32, offset: 448)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1140, file: !14, line: 1486, baseType: !1032, size: 64, align: 64, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1140, file: !14, line: 1488, baseType: !1032, size: 64, align: 64, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1140, file: !14, line: 1497, baseType: !1032, size: 64, align: 64, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1135, file: !1005, line: 121, baseType: !1011, size: 64, align: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1004, file: !1005, line: 166, baseType: !1163, size: 128, align: 64, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1005, line: 127, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1005, line: 124, size: 128, align: 64, elements: !1165)
!1165 = !{!1166, !1240}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1164, file: !1005, line: 125, baseType: !1167, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1171)
!1171 = !{!1172, !1173, !1197, !1201, !1202, !1237, !1238, !1239}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1170, file: !14, line: 5751, baseType: !932, size: 64, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1170, file: !14, line: 5756, baseType: !1174, size: 64, align: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1177)
!1177 = !{!1178, !1179, !1182, !1183, !1184, !1188, !1192, !1196}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1176, file: !14, line: 5797, baseType: !897, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1176, file: !14, line: 5804, baseType: !1180, size: 64, align: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64, align: 64)
!1181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1176, file: !14, line: 5815, baseType: !932, size: 64, align: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1176, file: !14, line: 5825, baseType: !888, size: 32, align: 32, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1176, file: !14, line: 5826, baseType: !1185, size: 64, align: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!888, !1168}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1176, file: !14, line: 5827, baseType: !1189, size: 64, align: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DISubroutineType(types: !1191)
!1191 = !{!888, !1168, !1138}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1176, file: !14, line: 5828, baseType: !1193, size: 64, align: 64, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64, align: 64)
!1194 = !DISubroutineType(types: !1195)
!1195 = !{null, !1168}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1176, file: !14, line: 5829, baseType: !1193, size: 64, align: 64, offset: 448)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1170, file: !14, line: 5762, baseType: !1198, size: 64, align: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1200)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1170, file: !14, line: 5768, baseType: !942, size: 64, align: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1170, file: !14, line: 5775, baseType: !1203, size: 64, align: 64, offset: 256)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1205)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1205, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1205, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1205, file: !14, line: 3948, baseType: !1210, size: 32, align: 32, offset: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !926, line: 51, baseType: !889)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1205, file: !14, line: 3958, baseType: !1017, size: 64, align: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1205, file: !14, line: 3962, baseType: !888, size: 32, align: 32, offset: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1205, file: !14, line: 3968, baseType: !888, size: 32, align: 32, offset: 224)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1205, file: !14, line: 3973, baseType: !1032, size: 64, align: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1205, file: !14, line: 3986, baseType: !888, size: 32, align: 32, offset: 320)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1205, file: !14, line: 3999, baseType: !888, size: 32, align: 32, offset: 352)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1205, file: !14, line: 4004, baseType: !888, size: 32, align: 32, offset: 384)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1205, file: !14, line: 4005, baseType: !888, size: 32, align: 32, offset: 416)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1205, file: !14, line: 4010, baseType: !888, size: 32, align: 32, offset: 448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1205, file: !14, line: 4011, baseType: !888, size: 32, align: 32, offset: 480)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1205, file: !14, line: 4020, baseType: !907, size: 64, align: 32, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1205, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1205, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1205, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1205, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1205, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1205, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1205, file: !14, line: 4039, baseType: !888, size: 32, align: 32, offset: 768)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1205, file: !14, line: 4046, baseType: !925, size: 64, align: 64, offset: 832)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1205, file: !14, line: 4050, baseType: !888, size: 32, align: 32, offset: 896)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1205, file: !14, line: 4054, baseType: !888, size: 32, align: 32, offset: 928)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1205, file: !14, line: 4061, baseType: !888, size: 32, align: 32, offset: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1205, file: !14, line: 4065, baseType: !888, size: 32, align: 32, offset: 992)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1205, file: !14, line: 4073, baseType: !888, size: 32, align: 32, offset: 1024)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1205, file: !14, line: 4080, baseType: !888, size: 32, align: 32, offset: 1056)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1205, file: !14, line: 4084, baseType: !888, size: 32, align: 32, offset: 1088)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1170, file: !14, line: 5781, baseType: !1203, size: 64, align: 64, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1170, file: !14, line: 5787, baseType: !907, size: 64, align: 32, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1170, file: !14, line: 5793, baseType: !907, size: 64, align: 32, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1164, file: !1005, line: 126, baseType: !888, size: 32, align: 32, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1004, file: !1005, line: 172, baseType: !1138, size: 64, align: 64, offset: 576)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1004, file: !1005, line: 177, baseType: !1017, size: 64, align: 64, offset: 640)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1004, file: !1005, line: 178, baseType: !889, size: 32, align: 32, offset: 704)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1004, file: !1005, line: 180, baseType: !942, size: 64, align: 64, offset: 768)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1004, file: !1005, line: 185, baseType: !888, size: 32, align: 32, offset: 832)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1004, file: !1005, line: 190, baseType: !942, size: 64, align: 64, offset: 896)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1004, file: !1005, line: 195, baseType: !888, size: 32, align: 32, offset: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1004, file: !1005, line: 200, baseType: !1138, size: 64, align: 64, offset: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1004, file: !1005, line: 201, baseType: !888, size: 32, align: 32, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1004, file: !1005, line: 202, baseType: !1011, size: 64, align: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1004, file: !1005, line: 203, baseType: !888, size: 32, align: 32, offset: 1216)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1004, file: !1005, line: 205, baseType: !888, size: 32, align: 32, offset: 1248)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1004, file: !1005, line: 206, baseType: !888, size: 32, align: 32, offset: 1280)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1004, file: !1005, line: 209, baseType: !1105, size: 64, align: 64, offset: 1344)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1004, file: !1005, line: 212, baseType: !1105, size: 64, align: 64, offset: 1408)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1004, file: !1005, line: 213, baseType: !1011, size: 64, align: 64, offset: 1472)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1004, file: !1005, line: 215, baseType: !888, size: 32, align: 32, offset: 1536)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1004, file: !1005, line: 217, baseType: !888, size: 32, align: 32, offset: 1568)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1004, file: !1005, line: 220, baseType: !888, size: 32, align: 32, offset: 1600)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !991, file: !14, line: 1598, baseType: !942, size: 64, align: 64, offset: 384)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !991, file: !14, line: 1606, baseType: !1032, size: 64, align: 64, offset: 448)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !991, file: !14, line: 1614, baseType: !888, size: 32, align: 32, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !991, file: !14, line: 1622, baseType: !888, size: 32, align: 32, offset: 544)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !991, file: !14, line: 1628, baseType: !888, size: 32, align: 32, offset: 576)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !991, file: !14, line: 1636, baseType: !888, size: 32, align: 32, offset: 608)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !991, file: !14, line: 1643, baseType: !888, size: 32, align: 32, offset: 640)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !991, file: !14, line: 1657, baseType: !1017, size: 64, align: 64, offset: 704)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !991, file: !14, line: 1658, baseType: !888, size: 32, align: 32, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !991, file: !14, line: 1679, baseType: !907, size: 64, align: 32, offset: 800)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !991, file: !14, line: 1688, baseType: !888, size: 32, align: 32, offset: 864)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !991, file: !14, line: 1712, baseType: !888, size: 32, align: 32, offset: 896)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !991, file: !14, line: 1729, baseType: !888, size: 32, align: 32, offset: 928)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !991, file: !14, line: 1729, baseType: !888, size: 32, align: 32, offset: 960)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !991, file: !14, line: 1744, baseType: !888, size: 32, align: 32, offset: 992)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !991, file: !14, line: 1744, baseType: !888, size: 32, align: 32, offset: 1024)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !991, file: !14, line: 1751, baseType: !888, size: 32, align: 32, offset: 1056)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !991, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !991, file: !14, line: 1791, baseType: !1279, size: 64, align: 64, offset: 1152)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64, align: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{null, !1282, !1283, !1285, !888, !888, !888}
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !991, file: !14, line: 1808, baseType: !1287, size: 64, align: 64, offset: 1216)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{!473, !1282, !914}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !991, file: !14, line: 1816, baseType: !888, size: 32, align: 32, offset: 1280)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !991, file: !14, line: 1825, baseType: !1292, size: 32, align: 32, offset: 1312)
!1292 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !991, file: !14, line: 1830, baseType: !888, size: 32, align: 32, offset: 1344)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !991, file: !14, line: 1838, baseType: !1292, size: 32, align: 32, offset: 1376)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !991, file: !14, line: 1846, baseType: !888, size: 32, align: 32, offset: 1408)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !991, file: !14, line: 1851, baseType: !888, size: 32, align: 32, offset: 1440)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !991, file: !14, line: 1861, baseType: !1292, size: 32, align: 32, offset: 1472)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !991, file: !14, line: 1868, baseType: !1292, size: 32, align: 32, offset: 1504)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !991, file: !14, line: 1875, baseType: !1292, size: 32, align: 32, offset: 1536)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !991, file: !14, line: 1882, baseType: !1292, size: 32, align: 32, offset: 1568)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !991, file: !14, line: 1889, baseType: !1292, size: 32, align: 32, offset: 1600)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !991, file: !14, line: 1896, baseType: !1292, size: 32, align: 32, offset: 1632)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !991, file: !14, line: 1903, baseType: !1292, size: 32, align: 32, offset: 1664)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !991, file: !14, line: 1910, baseType: !888, size: 32, align: 32, offset: 1696)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !991, file: !14, line: 1915, baseType: !888, size: 32, align: 32, offset: 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !991, file: !14, line: 1926, baseType: !1285, size: 64, align: 64, offset: 1792)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !991, file: !14, line: 1935, baseType: !907, size: 64, align: 32, offset: 1856)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !991, file: !14, line: 1942, baseType: !888, size: 32, align: 32, offset: 1920)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !991, file: !14, line: 1948, baseType: !888, size: 32, align: 32, offset: 1952)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !991, file: !14, line: 1954, baseType: !888, size: 32, align: 32, offset: 1984)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !991, file: !14, line: 1960, baseType: !888, size: 32, align: 32, offset: 2016)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !991, file: !14, line: 1984, baseType: !888, size: 32, align: 32, offset: 2048)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !991, file: !14, line: 1991, baseType: !888, size: 32, align: 32, offset: 2080)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !991, file: !14, line: 1996, baseType: !888, size: 32, align: 32, offset: 2112)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !991, file: !14, line: 2004, baseType: !888, size: 32, align: 32, offset: 2144)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !991, file: !14, line: 2011, baseType: !888, size: 32, align: 32, offset: 2176)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !991, file: !14, line: 2018, baseType: !888, size: 32, align: 32, offset: 2208)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !991, file: !14, line: 2027, baseType: !888, size: 32, align: 32, offset: 2240)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !991, file: !14, line: 2034, baseType: !888, size: 32, align: 32, offset: 2272)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !991, file: !14, line: 2044, baseType: !888, size: 32, align: 32, offset: 2304)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !991, file: !14, line: 2054, baseType: !1322, size: 64, align: 64, offset: 2368)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64, align: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !926, line: 49, baseType: !1324)
!1324 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !991, file: !14, line: 2061, baseType: !1322, size: 64, align: 64, offset: 2432)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !991, file: !14, line: 2066, baseType: !888, size: 32, align: 32, offset: 2496)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !991, file: !14, line: 2070, baseType: !888, size: 32, align: 32, offset: 2528)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !991, file: !14, line: 2078, baseType: !888, size: 32, align: 32, offset: 2560)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !991, file: !14, line: 2085, baseType: !888, size: 32, align: 32, offset: 2592)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !991, file: !14, line: 2092, baseType: !888, size: 32, align: 32, offset: 2624)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !991, file: !14, line: 2099, baseType: !888, size: 32, align: 32, offset: 2656)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !991, file: !14, line: 2106, baseType: !888, size: 32, align: 32, offset: 2688)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !991, file: !14, line: 2113, baseType: !888, size: 32, align: 32, offset: 2720)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !991, file: !14, line: 2120, baseType: !888, size: 32, align: 32, offset: 2752)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !991, file: !14, line: 2125, baseType: !888, size: 32, align: 32, offset: 2784)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !991, file: !14, line: 2133, baseType: !888, size: 32, align: 32, offset: 2816)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !991, file: !14, line: 2140, baseType: !888, size: 32, align: 32, offset: 2848)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !991, file: !14, line: 2145, baseType: !888, size: 32, align: 32, offset: 2880)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !991, file: !14, line: 2153, baseType: !888, size: 32, align: 32, offset: 2912)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !991, file: !14, line: 2158, baseType: !888, size: 32, align: 32, offset: 2944)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !991, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !991, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !991, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !991, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !991, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !991, file: !14, line: 2203, baseType: !888, size: 32, align: 32, offset: 3136)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !991, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !991, file: !14, line: 2212, baseType: !888, size: 32, align: 32, offset: 3200)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !991, file: !14, line: 2213, baseType: !888, size: 32, align: 32, offset: 3232)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !991, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !991, file: !14, line: 2232, baseType: !888, size: 32, align: 32, offset: 3296)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !991, file: !14, line: 2243, baseType: !888, size: 32, align: 32, offset: 3328)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !991, file: !14, line: 2249, baseType: !888, size: 32, align: 32, offset: 3360)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !991, file: !14, line: 2256, baseType: !888, size: 32, align: 32, offset: 3392)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !991, file: !14, line: 2263, baseType: !925, size: 64, align: 64, offset: 3456)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !991, file: !14, line: 2270, baseType: !925, size: 64, align: 64, offset: 3520)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !991, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !991, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !991, file: !14, line: 2367, baseType: !1360, size: 64, align: 64, offset: 3648)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DISubroutineType(types: !1362)
!1362 = !{!888, !1282, !1011, !888}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !991, file: !14, line: 2383, baseType: !888, size: 32, align: 32, offset: 3712)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !991, file: !14, line: 2386, baseType: !1292, size: 32, align: 32, offset: 3744)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !991, file: !14, line: 2387, baseType: !1292, size: 32, align: 32, offset: 3776)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !991, file: !14, line: 2394, baseType: !888, size: 32, align: 32, offset: 3808)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !991, file: !14, line: 2401, baseType: !888, size: 32, align: 32, offset: 3840)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !991, file: !14, line: 2408, baseType: !888, size: 32, align: 32, offset: 3872)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !991, file: !14, line: 2415, baseType: !888, size: 32, align: 32, offset: 3904)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !991, file: !14, line: 2422, baseType: !888, size: 32, align: 32, offset: 3936)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !991, file: !14, line: 2423, baseType: !1372, size: 64, align: 64, offset: 3968)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1374, file: !14, line: 827, baseType: !888, size: 32, align: 32)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1374, file: !14, line: 828, baseType: !888, size: 32, align: 32, offset: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1374, file: !14, line: 829, baseType: !888, size: 32, align: 32, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1374, file: !14, line: 830, baseType: !1292, size: 32, align: 32, offset: 96)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !991, file: !14, line: 2430, baseType: !1032, size: 64, align: 64, offset: 4032)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !991, file: !14, line: 2437, baseType: !1032, size: 64, align: 64, offset: 4096)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !991, file: !14, line: 2444, baseType: !1292, size: 32, align: 32, offset: 4160)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !991, file: !14, line: 2451, baseType: !1292, size: 32, align: 32, offset: 4192)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !991, file: !14, line: 2458, baseType: !888, size: 32, align: 32, offset: 4224)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !991, file: !14, line: 2469, baseType: !888, size: 32, align: 32, offset: 4256)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !991, file: !14, line: 2475, baseType: !888, size: 32, align: 32, offset: 4288)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !991, file: !14, line: 2481, baseType: !888, size: 32, align: 32, offset: 4320)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !991, file: !14, line: 2485, baseType: !888, size: 32, align: 32, offset: 4352)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !991, file: !14, line: 2489, baseType: !888, size: 32, align: 32, offset: 4384)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !991, file: !14, line: 2493, baseType: !888, size: 32, align: 32, offset: 4416)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !991, file: !14, line: 2501, baseType: !888, size: 32, align: 32, offset: 4448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !991, file: !14, line: 2506, baseType: !888, size: 32, align: 32, offset: 4480)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !991, file: !14, line: 2510, baseType: !888, size: 32, align: 32, offset: 4512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !991, file: !14, line: 2514, baseType: !1032, size: 64, align: 64, offset: 4544)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !991, file: !14, line: 2528, baseType: !1396, size: 64, align: 64, offset: 4608)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{null, !1282, !942, !888, !888}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !991, file: !14, line: 2534, baseType: !888, size: 32, align: 32, offset: 4672)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !991, file: !14, line: 2545, baseType: !888, size: 32, align: 32, offset: 4704)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !991, file: !14, line: 2547, baseType: !888, size: 32, align: 32, offset: 4736)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !991, file: !14, line: 2549, baseType: !888, size: 32, align: 32, offset: 4768)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !991, file: !14, line: 2551, baseType: !888, size: 32, align: 32, offset: 4800)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !991, file: !14, line: 2553, baseType: !888, size: 32, align: 32, offset: 4832)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !991, file: !14, line: 2555, baseType: !888, size: 32, align: 32, offset: 4864)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !991, file: !14, line: 2557, baseType: !888, size: 32, align: 32, offset: 4896)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !991, file: !14, line: 2559, baseType: !888, size: 32, align: 32, offset: 4928)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !991, file: !14, line: 2563, baseType: !888, size: 32, align: 32, offset: 4960)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !991, file: !14, line: 2571, baseType: !1410, size: 64, align: 64, offset: 4992)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !991, file: !14, line: 2579, baseType: !1410, size: 64, align: 64, offset: 5056)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !991, file: !14, line: 2586, baseType: !888, size: 32, align: 32, offset: 5120)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !991, file: !14, line: 2615, baseType: !888, size: 32, align: 32, offset: 5152)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !991, file: !14, line: 2627, baseType: !888, size: 32, align: 32, offset: 5184)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !991, file: !14, line: 2637, baseType: !888, size: 32, align: 32, offset: 5216)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !991, file: !14, line: 2681, baseType: !888, size: 32, align: 32, offset: 5248)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !991, file: !14, line: 2709, baseType: !1032, size: 64, align: 64, offset: 5312)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !991, file: !14, line: 2716, baseType: !1419, size: 64, align: 64, offset: 5376)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64, align: 64)
!1420 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1427, !1428, !1432, !1438, !1442, !1443, !1444, !1445, !1451, !1452, !1453, !1454, !1455}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1421, file: !14, line: 3642, baseType: !897, size: 64, align: 64)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1421, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1421, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1421, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1421, file: !14, line: 3669, baseType: !888, size: 32, align: 32, offset: 160)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1421, file: !14, line: 3682, baseType: !1429, size: 64, align: 64, offset: 192)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64, align: 64)
!1430 = !DISubroutineType(types: !1431)
!1431 = !{!888, !989, !1011}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1421, file: !14, line: 3698, baseType: !1433, size: 64, align: 64, offset: 256)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64, align: 64)
!1434 = !DISubroutineType(types: !1435)
!1435 = !{!888, !989, !1436, !1210}
!1436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1437, size: 64, align: 64)
!1437 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1421, file: !14, line: 3712, baseType: !1439, size: 64, align: 64, offset: 320)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64, align: 64)
!1440 = !DISubroutineType(types: !1441)
!1441 = !{!888, !989, !888, !1436, !1210}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1421, file: !14, line: 3726, baseType: !1433, size: 64, align: 64, offset: 384)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1421, file: !14, line: 3737, baseType: !986, size: 64, align: 64, offset: 448)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1421, file: !14, line: 3746, baseType: !888, size: 32, align: 32, offset: 512)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1421, file: !14, line: 3757, baseType: !1446, size: 64, align: 64, offset: 576)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64, align: 64)
!1447 = !DISubroutineType(types: !1448)
!1448 = !{null, !1449}
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1421, file: !14, line: 3766, baseType: !986, size: 64, align: 64, offset: 640)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1421, file: !14, line: 3774, baseType: !986, size: 64, align: 64, offset: 704)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1421, file: !14, line: 3780, baseType: !888, size: 32, align: 32, offset: 768)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1421, file: !14, line: 3785, baseType: !888, size: 32, align: 32, offset: 800)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1421, file: !14, line: 3795, baseType: !1456, size: 64, align: 64, offset: 832)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!888, !989, !1052}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !991, file: !14, line: 2728, baseType: !942, size: 64, align: 64, offset: 5440)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !991, file: !14, line: 2735, baseType: !1042, size: 512, align: 64, offset: 5504)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !991, file: !14, line: 2742, baseType: !888, size: 32, align: 32, offset: 6016)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !991, file: !14, line: 2755, baseType: !888, size: 32, align: 32, offset: 6048)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !991, file: !14, line: 2776, baseType: !888, size: 32, align: 32, offset: 6080)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !991, file: !14, line: 2783, baseType: !888, size: 32, align: 32, offset: 6112)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !991, file: !14, line: 2791, baseType: !888, size: 32, align: 32, offset: 6144)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !991, file: !14, line: 2802, baseType: !1011, size: 64, align: 64, offset: 6208)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !991, file: !14, line: 2811, baseType: !888, size: 32, align: 32, offset: 6272)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !991, file: !14, line: 2821, baseType: !888, size: 32, align: 32, offset: 6304)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !991, file: !14, line: 2830, baseType: !888, size: 32, align: 32, offset: 6336)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !991, file: !14, line: 2840, baseType: !888, size: 32, align: 32, offset: 6368)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !991, file: !14, line: 2851, baseType: !1472, size: 64, align: 64, offset: 6400)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!888, !1282, !1475, !942, !1285, !888, !888}
!1475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1476, size: 64, align: 64)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{!888, !1282, !942}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !991, file: !14, line: 2871, baseType: !1479, size: 64, align: 64, offset: 6464)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DISubroutineType(types: !1481)
!1481 = !{!888, !1282, !1482, !942, !1285, !888}
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{!888, !1282, !942, !888, !888}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !991, file: !14, line: 2878, baseType: !888, size: 32, align: 32, offset: 6528)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !991, file: !14, line: 2885, baseType: !888, size: 32, align: 32, offset: 6560)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !991, file: !14, line: 3005, baseType: !888, size: 32, align: 32, offset: 6592)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !991, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !991, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !991, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !991, file: !14, line: 3037, baseType: !1017, size: 64, align: 64, offset: 6720)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !991, file: !14, line: 3038, baseType: !888, size: 32, align: 32, offset: 6784)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !991, file: !14, line: 3050, baseType: !925, size: 64, align: 64, offset: 6848)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !991, file: !14, line: 3065, baseType: !888, size: 32, align: 32, offset: 6912)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !991, file: !14, line: 3083, baseType: !888, size: 32, align: 32, offset: 6944)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !991, file: !14, line: 3092, baseType: !907, size: 64, align: 32, offset: 6976)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !991, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !991, file: !14, line: 3106, baseType: !907, size: 64, align: 32, offset: 7072)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !991, file: !14, line: 3113, baseType: !1500, size: 64, align: 64, offset: 7168)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1501, size: 64, align: 64)
!1501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1502)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1503)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508, !1509, !1510, !1513}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1503, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1503, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1503, file: !14, line: 720, baseType: !897, size: 64, align: 64, offset: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1503, file: !14, line: 724, baseType: !897, size: 64, align: 64, offset: 128)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1503, file: !14, line: 728, baseType: !888, size: 32, align: 32, offset: 192)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1503, file: !14, line: 734, baseType: !1511, size: 64, align: 64, offset: 256)
!1511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1512, size: 64, align: 64)
!1512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1503, file: !14, line: 739, baseType: !1514, size: 64, align: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1515, size: 64, align: 64)
!1515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !991, file: !14, line: 3129, baseType: !1032, size: 64, align: 64, offset: 7232)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !991, file: !14, line: 3130, baseType: !1032, size: 64, align: 64, offset: 7296)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !991, file: !14, line: 3131, baseType: !1032, size: 64, align: 64, offset: 7360)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !991, file: !14, line: 3132, baseType: !1032, size: 64, align: 64, offset: 7424)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !991, file: !14, line: 3139, baseType: !1410, size: 64, align: 64, offset: 7488)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !991, file: !14, line: 3147, baseType: !888, size: 32, align: 32, offset: 7552)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !991, file: !14, line: 3165, baseType: !888, size: 32, align: 32, offset: 7584)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !991, file: !14, line: 3172, baseType: !888, size: 32, align: 32, offset: 7616)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !991, file: !14, line: 3180, baseType: !888, size: 32, align: 32, offset: 7648)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !991, file: !14, line: 3191, baseType: !1322, size: 64, align: 64, offset: 7680)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !991, file: !14, line: 3199, baseType: !1017, size: 64, align: 64, offset: 7744)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !991, file: !14, line: 3207, baseType: !1410, size: 64, align: 64, offset: 7808)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !991, file: !14, line: 3214, baseType: !889, size: 32, align: 32, offset: 7872)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !991, file: !14, line: 3224, baseType: !1150, size: 64, align: 64, offset: 7936)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !991, file: !14, line: 3225, baseType: !888, size: 32, align: 32, offset: 8000)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !991, file: !14, line: 3249, baseType: !1052, size: 64, align: 64, offset: 8064)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !991, file: !14, line: 3256, baseType: !888, size: 32, align: 32, offset: 8128)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !991, file: !14, line: 3271, baseType: !888, size: 32, align: 32, offset: 8160)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !991, file: !14, line: 3279, baseType: !1032, size: 64, align: 64, offset: 8192)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !991, file: !14, line: 3301, baseType: !1052, size: 64, align: 64, offset: 8256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !991, file: !14, line: 3310, baseType: !888, size: 32, align: 32, offset: 8320)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !991, file: !14, line: 3337, baseType: !888, size: 32, align: 32, offset: 8352)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !991, file: !14, line: 3351, baseType: !888, size: 32, align: 32, offset: 8384)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !991, file: !14, line: 3359, baseType: !888, size: 32, align: 32, offset: 8416)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !894, file: !14, line: 3535, baseType: !1541, size: 64, align: 64, offset: 1024)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!888, !989, !1544}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !894, file: !14, line: 3541, baseType: !1547, size: 64, align: 64, offset: 1088)
!1547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1548, size: 64, align: 64)
!1548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1549)
!1549 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1550)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1005, line: 223, size: 128, align: 64, elements: !1551)
!1551 = !{!1552, !1553}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1550, file: !1005, line: 224, baseType: !1436, size: 64, align: 64)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1550, file: !1005, line: 225, baseType: !1436, size: 64, align: 64, offset: 64)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !894, file: !14, line: 3549, baseType: !1555, size: 64, align: 64, offset: 1152)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{null, !984}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !894, file: !14, line: 3551, baseType: !986, size: 64, align: 64, offset: 1216)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !894, file: !14, line: 3552, baseType: !1560, size: 64, align: 64, offset: 1280)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!888, !989, !1017, !888, !1563}
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1566)
!1566 = !{!1567, !1568, !1569, !1570, !1571, !1595}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1565, file: !14, line: 3921, baseType: !1323, size: 16, align: 16)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1565, file: !14, line: 3922, baseType: !1210, size: 32, align: 32, offset: 32)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1565, file: !14, line: 3923, baseType: !1210, size: 32, align: 32, offset: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1565, file: !14, line: 3924, baseType: !889, size: 32, align: 32, offset: 96)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1565, file: !14, line: 3925, baseType: !1572, size: 64, align: 64, offset: 128)
!1572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1573, size: 64, align: 64)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1575)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1576)
!1576 = !{!1577, !1578, !1579, !1580, !1581, !1582, !1588, !1590, !1591, !1592, !1593, !1594}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1575, file: !14, line: 3886, baseType: !888, size: 32, align: 32)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1575, file: !14, line: 3887, baseType: !888, size: 32, align: 32, offset: 32)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1575, file: !14, line: 3888, baseType: !888, size: 32, align: 32, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1575, file: !14, line: 3889, baseType: !888, size: 32, align: 32, offset: 96)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1575, file: !14, line: 3890, baseType: !888, size: 32, align: 32, offset: 128)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1575, file: !14, line: 3897, baseType: !1583, size: 768, align: 64, offset: 192)
!1583 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1584)
!1584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1585)
!1585 = !{!1586, !1587}
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1584, file: !14, line: 3855, baseType: !1016, size: 512, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1584, file: !14, line: 3857, baseType: !1021, size: 256, align: 32, offset: 512)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1575, file: !14, line: 3903, baseType: !1589, size: 256, align: 64, offset: 960)
!1589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 256, align: 64, elements: !1121)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1575, file: !14, line: 3904, baseType: !1128, size: 128, align: 32, offset: 1216)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1575, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1575, file: !14, line: 3908, baseType: !1410, size: 64, align: 64, offset: 1408)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1575, file: !14, line: 3915, baseType: !1410, size: 64, align: 64, offset: 1472)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1575, file: !14, line: 3917, baseType: !888, size: 32, align: 32, offset: 1536)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1565, file: !14, line: 3926, baseType: !1032, size: 64, align: 64, offset: 192)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !894, file: !14, line: 3564, baseType: !1597, size: 64, align: 64, offset: 1344)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!888, !989, !1138, !1283, !1285}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !894, file: !14, line: 3566, baseType: !1601, size: 64, align: 64, offset: 1408)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!888, !989, !942, !1285, !1138}
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !894, file: !14, line: 3567, baseType: !986, size: 64, align: 64, offset: 1472)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !894, file: !14, line: 3576, baseType: !1606, size: 64, align: 64, offset: 1536)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DISubroutineType(types: !1608)
!1608 = !{!888, !989, !1283}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !894, file: !14, line: 3577, baseType: !1610, size: 64, align: 64, offset: 1600)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!888, !989, !1138}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !894, file: !14, line: 3584, baseType: !1429, size: 64, align: 64, offset: 1664)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !894, file: !14, line: 3589, baseType: !1615, size: 64, align: 64, offset: 1728)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DISubroutineType(types: !1617)
!1617 = !{null, !989}
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !894, file: !14, line: 3594, baseType: !888, size: 32, align: 32, offset: 1792)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !894, file: !14, line: 3600, baseType: !897, size: 64, align: 64, offset: 1856)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !894, file: !14, line: 3609, baseType: !1621, size: 64, align: 64, offset: 1920)
!1621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1622, size: 64, align: 64)
!1622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1623, size: 64, align: 64)
!1623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1624)
!1624 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1625 = distinct !DIGlobalVariable(name: "ff_eightsvx_exp_decoder", scope: !0, file: !892, line: 203, type: !893, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_eightsvx_exp_decoder)
!1626 = distinct !DIGlobalVariable(name: "fibonacci", scope: !0, file: !892, line: 57, type: !1627, isLocal: true, isDefinition: true, variable: [16 x i8]* @fibonacci)
!1627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1628, size: 128, align: 8, elements: !1629)
!1628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1629 = !{!1630}
!1630 = !DISubrange(count: 16)
!1631 = distinct !DIGlobalVariable(name: "exponential", scope: !0, file: !892, line: 58, type: !1627, isLocal: true, isDefinition: true, variable: [16 x i8]* @exponential)
!1632 = !{i32 2, !"Dwarf Version", i32 4}
!1633 = !{i32 2, !"Debug Info Version", i32 3}
!1634 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1635 = distinct !DISubprogram(name: "eightsvx_decode_init", scope: !892, file: !892, line: 154, type: !987, isLocal: true, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1636)
!1636 = !{}
