; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp56.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp56.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.VP56Tree = type { i8, i8 }
%struct.vp56_context = type { %struct.AVCodecContext*, %struct.H264ChromaContext, %struct.HpelDSPContext, %struct.VideoDSPContext, %struct.VP3DSPContext, %struct.VP56DSPContext, [64 x i8], [4 x %struct.AVFrame*], i8*, i8*, %struct.VP56RangeCoder, %struct.VP56RangeCoder, %struct.VP56RangeCoder*, i32, i32, [4 x i32], [4 x i32], i32, i32, [6 x i32], i32, i16, i16, %struct.VP56RefDc*, [4 x %struct.VP56RefDc], [6 x i32], [3 x [3 x i16]], i32, %struct.VP56Macroblock*, [8 x i8], [6 x [64 x i16]], [6 x i32], [6 x %struct.VP56mv], [2 x %struct.VP56mv], i32, i32, i32, i32, i32, i32, i32, [4 x i8], [256 x i32], [4 x [64 x i8]], [4 x i8], i32, i32, i32, i32, [4 x i64], i8*, void (%struct.vp56_context*, %struct.VP56mv*)*, void (%struct.vp56_context*, i8*, i8*, i32, i32, i64, i32, i32, i32, i32)*, i32 (%struct.vp56_context*)*, void (%struct.vp56_context*)*, void (%struct.vp56_context*)*, i32 (%struct.vp56_context*)*, i32 (%struct.vp56_context*, i8*, i32)*, %struct.vp56_context*, %struct.VP56Model*, %struct.VP56Model, i32, %struct.GetBitContext, [2 x %struct.VLC], [2 x %struct.VLC], [2 x [3 x [6 x %struct.VLC]]], [2 x [2 x i32]], i32, i32 }

!899 = !DIEnumerator(name: "VP56_MB_INTER_DELTA_PF", value: 2)
!900 = !DIEnumerator(name: "VP56_MB_INTER_V1_PF", value: 3)
!901 = !DIEnumerator(name: "VP56_MB_INTER_V2_PF", value: 4)
!902 = !DIEnumerator(name: "VP56_MB_INTER_NOVEC_GF", value: 5)
!903 = !DIEnumerator(name: "VP56_MB_INTER_DELTA_GF", value: 6)
!904 = !DIEnumerator(name: "VP56_MB_INTER_4V", value: 7)
!905 = !DIEnumerator(name: "VP56_MB_INTER_V1_GF", value: 8)
!906 = !DIEnumerator(name: "VP56_MB_INTER_V2_GF", value: 9)
!907 = !{!908, !909, !910, !915}
!908 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!909 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !913, line: 48, baseType: !914)
!913 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!914 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !918, line: 222, size: 16, align: 8, elements: !919)
!918 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !917, file: !918, line: 222, baseType: !921, size: 16, align: 16)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !913, line: 49, baseType: !922)
!922 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!923 = !{i32 2, !"Dwarf Version", i32 4}
!924 = !{i32 2, !"Debug Info Version", i32 3}
!925 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!926 = distinct !DISubprogram(name: "ff_vp56_init_dequant", scope: !927, file: !927, line: 34, type: !928, isLocal: false, isDefinition: true, scopeLine: 35, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1942)
!927 = !DIFile(filename: "libavcodec/vp56.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !DISubroutineType(types: !929)
!929 = !{null, !930, !908}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP56Context", file: !888, line: 38, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vp56_context", file: !888, line: 123, size: 49536, align: 128, elements: !933)
!933 = !{!934, !1658, !1671, !1687, !1700, !1723, !1736, !1740, !1742, !1743, !1744, !1753, !1754, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1766, !1767, !1768, !1769, !1778, !1780, !1781, !1785, !1787, !1799, !1802, !1803, !1805, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1820, !1823, !1825, !1826, !1827, !1828, !1829, !1831, !1832, !1838, !1843, !1848, !1853, !1855, !1857, !1862, !1863, !1910, !1911, !1912, !1922, !1934, !1935, !1938, !1940, !1941}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !932, file: !888, line: 124, baseType: !935, size: 64, align: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64, align: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !938)
!938 = !{!939, !984, !985, !986, !1256, !1257, !1258, !1259, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1412, !1416, !1417, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1596, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !937, file: !35, line: 1561, baseType: !940, size: 64, align: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !944)
!944 = !{!945, !949, !954, !958, !959, !960, !961, !965, !971, !973, !977}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !943, file: !4, line: 72, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !948)
!948 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !943, file: !4, line: 78, baseType: !950, size: 64, align: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DISubroutineType(types: !952)
!952 = !{!946, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !943, file: !4, line: 85, baseType: !955, size: 64, align: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !943, file: !4, line: 93, baseType: !908, size: 32, align: 32, offset: 192)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !943, file: !4, line: 99, baseType: !908, size: 32, align: 32, offset: 224)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !943, file: !4, line: 108, baseType: !908, size: 32, align: 32, offset: 256)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !943, file: !4, line: 113, baseType: !962, size: 64, align: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!953, !953, !953}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !943, file: !4, line: 123, baseType: !966, size: 64, align: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64, align: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !943, file: !4, line: 130, baseType: !972, size: 32, align: 32, offset: 448)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !943, file: !4, line: 136, baseType: !974, size: 64, align: 64, offset: 512)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DISubroutineType(types: !976)
!976 = !{!972, !953}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !943, file: !4, line: 142, baseType: !978, size: 64, align: 64, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!908, !981, !953, !946, !908}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !937, file: !35, line: 1562, baseType: !908, size: 32, align: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !937, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !937, file: !35, line: 1565, baseType: !987, size: 64, align: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !996, !1005, !1008, !1011, !1014, !1019, !1020, !1021, !1029, !1030, !1031, !1033, !1037, !1043, !1052, !1056, !1057, !1106, !1227, !1231, !1232, !1236, !1240, !1245, !1249, !1250, !1251}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !35, line: 3475, baseType: !946, size: 64, align: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !989, file: !35, line: 3480, baseType: !946, size: 64, align: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !989, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !989, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !989, file: !35, line: 3487, baseType: !908, size: 32, align: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !989, file: !35, line: 3488, baseType: !997, size: 64, align: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1000, line: 61, baseType: !1001)
!1000 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1000, line: 58, size: 64, align: 32, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1001, file: !1000, line: 59, baseType: !908, size: 32, align: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1001, file: !1000, line: 60, baseType: !908, size: 32, align: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !989, file: !35, line: 3489, baseType: !1006, size: 64, align: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !989, file: !35, line: 3490, baseType: !1009, size: 64, align: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !989, file: !35, line: 3491, baseType: !1012, size: 64, align: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !989, file: !35, line: 3492, baseType: !1015, size: 64, align: 64, offset: 512)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !913, line: 55, baseType: !1018)
!1018 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !989, file: !35, line: 3493, baseType: !912, size: 8, align: 8, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !989, file: !35, line: 3494, baseType: !940, size: 64, align: 64, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !989, file: !35, line: 3495, baseType: !1022, size: 64, align: 64, offset: 704)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1025, file: !35, line: 3402, baseType: !908, size: 32, align: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !35, line: 3403, baseType: !946, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !989, file: !35, line: 3507, baseType: !946, size: 64, align: 64, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !989, file: !35, line: 3516, baseType: !908, size: 32, align: 32, offset: 832)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !989, file: !35, line: 3517, baseType: !1032, size: 64, align: 64, offset: 896)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !989, file: !35, line: 3527, baseType: !1034, size: 64, align: 64, offset: 960)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!908, !935}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !989, file: !35, line: 3535, baseType: !1038, size: 64, align: 64, offset: 1024)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!908, !935, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !989, file: !35, line: 3541, baseType: !1044, size: 64, align: 64, offset: 1088)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1048, line: 223, size: 128, align: 64, elements: !1049)
!1048 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1047, file: !1048, line: 224, baseType: !910, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1047, file: !1048, line: 225, baseType: !910, size: 64, align: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !989, file: !35, line: 3549, baseType: !1053, size: 64, align: 64, offset: 1152)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !1032}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !989, file: !35, line: 3551, baseType: !1034, size: 64, align: 64, offset: 1216)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !989, file: !35, line: 3552, baseType: !1058, size: 64, align: 64, offset: 1280)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64, align: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!908, !935, !1061, !908, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64, align: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1065)
!1065 = !{!1066, !1067, !1069, !1070, !1071, !1103}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1064, file: !35, line: 3921, baseType: !921, size: 16, align: 16)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1064, file: !35, line: 3922, baseType: !1068, size: 32, align: 32, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !913, line: 51, baseType: !909)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1064, file: !35, line: 3923, baseType: !1068, size: 32, align: 32, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1064, file: !35, line: 3924, baseType: !909, size: 32, align: 32, offset: 96)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1064, file: !35, line: 3925, baseType: !1072, size: 64, align: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64, align: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082, !1092, !1096, !1098, !1099, !1101, !1102}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1075, file: !35, line: 3886, baseType: !908, size: 32, align: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1075, file: !35, line: 3887, baseType: !908, size: 32, align: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1075, file: !35, line: 3888, baseType: !908, size: 32, align: 32, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1075, file: !35, line: 3889, baseType: !908, size: 32, align: 32, offset: 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1075, file: !35, line: 3890, baseType: !908, size: 32, align: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1075, file: !35, line: 3897, baseType: !1083, size: 768, align: 64, offset: 192)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1085)
!1085 = !{!1086, !1090}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1084, file: !35, line: 3855, baseType: !1087, size: 512, align: 64)
!1087 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 512, align: 64, elements: !1088)
!1088 = !{!1089}
!1089 = !DISubrange(count: 8)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1084, file: !35, line: 3857, baseType: !1091, size: 256, align: 32, offset: 512)
!1091 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 256, align: 32, elements: !1088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1075, file: !35, line: 3903, baseType: !1093, size: 256, align: 64, offset: 960)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 256, align: 64, elements: !1094)
!1094 = !{!1095}
!1095 = !DISubrange(count: 4)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1075, file: !35, line: 3904, baseType: !1097, size: 128, align: 32, offset: 1216)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 128, align: 32, elements: !1094)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1075, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1075, file: !35, line: 3908, baseType: !1100, size: 64, align: 64, offset: 1408)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1075, file: !35, line: 3915, baseType: !1100, size: 64, align: 64, offset: 1472)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1075, file: !35, line: 3917, baseType: !908, size: 32, align: 32, offset: 1536)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1064, file: !35, line: 3926, baseType: !1104, size: 64, align: 64, offset: 192)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !913, line: 40, baseType: !1105)
!1105 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !989, file: !35, line: 3564, baseType: !1107, size: 64, align: 64, offset: 1344)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!908, !935, !1110, !1144, !1226}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1113)
!1113 = !{!1114, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1140, !1141, !1142, !1143}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1112, file: !35, line: 1451, baseType: !1115, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1117, line: 94, baseType: !1118)
!1117 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1117, line: 81, size: 192, align: 64, elements: !1119)
!1119 = !{!1120, !1124, !1125}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1118, file: !1117, line: 82, baseType: !1121, size: 64, align: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1117, line: 73, baseType: !1123)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1117, line: 73, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1118, file: !1117, line: 89, baseType: !1061, size: 64, align: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1118, file: !1117, line: 93, baseType: !908, size: 32, align: 32, offset: 128)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1112, file: !35, line: 1461, baseType: !1104, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1112, file: !35, line: 1467, baseType: !1104, size: 64, align: 64, offset: 128)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !35, line: 1468, baseType: !1061, size: 64, align: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !35, line: 1469, baseType: !908, size: 32, align: 32, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1112, file: !35, line: 1470, baseType: !908, size: 32, align: 32, offset: 288)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1112, file: !35, line: 1474, baseType: !908, size: 32, align: 32, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1112, file: !35, line: 1479, baseType: !1133, size: 64, align: 64, offset: 384)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1136)
!1136 = !{!1137, !1138, !1139}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1135, file: !35, line: 1412, baseType: !1061, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !35, line: 1413, baseType: !908, size: 32, align: 32, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1135, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1112, file: !35, line: 1480, baseType: !908, size: 32, align: 32, offset: 448)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1112, file: !35, line: 1486, baseType: !1104, size: 64, align: 64, offset: 512)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1112, file: !35, line: 1488, baseType: !1104, size: 64, align: 64, offset: 576)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1112, file: !35, line: 1497, baseType: !1104, size: 64, align: 64, offset: 640)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1148)
!1148 = !{!1149, !1150, !1151, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1178, !1180, !1181, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1214, !1215, !1216, !1217, !1218, !1219, !1222, !1223, !1224, !1225}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1147, file: !758, line: 282, baseType: !1087, size: 512, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1147, file: !758, line: 299, baseType: !1091, size: 256, align: 32, offset: 512)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1147, file: !758, line: 315, baseType: !1152, size: 64, align: 64, offset: 768)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1147, file: !758, line: 326, baseType: !908, size: 32, align: 32, offset: 832)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1147, file: !758, line: 326, baseType: !908, size: 32, align: 32, offset: 864)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1147, file: !758, line: 334, baseType: !908, size: 32, align: 32, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1147, file: !758, line: 341, baseType: !908, size: 32, align: 32, offset: 928)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1147, file: !758, line: 346, baseType: !908, size: 32, align: 32, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1147, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1147, file: !758, line: 356, baseType: !999, size: 64, align: 32, offset: 1024)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1147, file: !758, line: 361, baseType: !1104, size: 64, align: 64, offset: 1088)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1147, file: !758, line: 369, baseType: !1104, size: 64, align: 64, offset: 1152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1147, file: !758, line: 377, baseType: !1104, size: 64, align: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1147, file: !758, line: 382, baseType: !908, size: 32, align: 32, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1147, file: !758, line: 386, baseType: !908, size: 32, align: 32, offset: 1312)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1147, file: !758, line: 391, baseType: !908, size: 32, align: 32, offset: 1344)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1147, file: !758, line: 396, baseType: !953, size: 64, align: 64, offset: 1408)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1147, file: !758, line: 403, baseType: !1168, size: 512, align: 64, offset: 1472)
!1168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1017, size: 512, align: 64, elements: !1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1147, file: !758, line: 410, baseType: !908, size: 32, align: 32, offset: 1984)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1147, file: !758, line: 415, baseType: !908, size: 32, align: 32, offset: 2016)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1147, file: !758, line: 420, baseType: !908, size: 32, align: 32, offset: 2048)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1147, file: !758, line: 425, baseType: !908, size: 32, align: 32, offset: 2080)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1147, file: !758, line: 435, baseType: !1104, size: 64, align: 64, offset: 2112)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1147, file: !758, line: 440, baseType: !908, size: 32, align: 32, offset: 2176)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1147, file: !758, line: 445, baseType: !1017, size: 64, align: 64, offset: 2240)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1147, file: !758, line: 459, baseType: !1177, size: 512, align: 64, offset: 2304)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1115, size: 512, align: 64, elements: !1088)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1147, file: !758, line: 473, baseType: !1179, size: 64, align: 64, offset: 2816)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1147, file: !758, line: 477, baseType: !908, size: 32, align: 32, offset: 2880)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1147, file: !758, line: 479, baseType: !1182, size: 64, align: 64, offset: 2944)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1195}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1185, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1185, file: !758, line: 203, baseType: !1061, size: 64, align: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1185, file: !758, line: 204, baseType: !908, size: 32, align: 32, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1185, file: !758, line: 205, baseType: !1191, size: 64, align: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1193, line: 86, baseType: !1194)
!1193 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1193, line: 86, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1185, file: !758, line: 206, baseType: !1115, size: 64, align: 64, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1147, file: !758, line: 480, baseType: !908, size: 32, align: 32, offset: 3008)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1147, file: !758, line: 505, baseType: !908, size: 32, align: 32, offset: 3040)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1147, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1147, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1147, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1147, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1147, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1147, file: !758, line: 532, baseType: !1104, size: 64, align: 64, offset: 3264)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1147, file: !758, line: 539, baseType: !1104, size: 64, align: 64, offset: 3328)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1147, file: !758, line: 547, baseType: !1104, size: 64, align: 64, offset: 3392)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1147, file: !758, line: 554, baseType: !1191, size: 64, align: 64, offset: 3456)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1147, file: !758, line: 563, baseType: !908, size: 32, align: 32, offset: 3520)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1147, file: !758, line: 572, baseType: !908, size: 32, align: 32, offset: 3552)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1147, file: !758, line: 581, baseType: !908, size: 32, align: 32, offset: 3584)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1147, file: !758, line: 588, baseType: !1211, size: 64, align: 64, offset: 3648)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !913, line: 36, baseType: !1213)
!1213 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1147, file: !758, line: 593, baseType: !908, size: 32, align: 32, offset: 3712)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1147, file: !758, line: 596, baseType: !908, size: 32, align: 32, offset: 3744)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1147, file: !758, line: 599, baseType: !1115, size: 64, align: 64, offset: 3776)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1147, file: !758, line: 605, baseType: !1115, size: 64, align: 64, offset: 3840)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1147, file: !758, line: 616, baseType: !1115, size: 64, align: 64, offset: 3904)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1147, file: !758, line: 626, baseType: !1220, size: 64, align: 64, offset: 3968)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1221, line: 216, baseType: !1018)
!1221 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1147, file: !758, line: 627, baseType: !1220, size: 64, align: 64, offset: 4032)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1147, file: !758, line: 628, baseType: !1220, size: 64, align: 64, offset: 4096)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1147, file: !758, line: 629, baseType: !1220, size: 64, align: 64, offset: 4160)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1147, file: !758, line: 645, baseType: !1115, size: 64, align: 64, offset: 4224)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !989, file: !35, line: 3566, baseType: !1228, size: 64, align: 64, offset: 1408)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DISubroutineType(types: !1230)
!1230 = !{!908, !935, !953, !1226, !1110}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !989, file: !35, line: 3567, baseType: !1034, size: 64, align: 64, offset: 1472)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !989, file: !35, line: 3576, baseType: !1233, size: 64, align: 64, offset: 1536)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!908, !935, !1144}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !989, file: !35, line: 3577, baseType: !1237, size: 64, align: 64, offset: 1600)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DISubroutineType(types: !1239)
!1239 = !{!908, !935, !1110}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !989, file: !35, line: 3584, baseType: !1241, size: 64, align: 64, offset: 1664)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64, align: 64)
!1242 = !DISubroutineType(types: !1243)
!1243 = !{!908, !935, !1244}
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64, align: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !989, file: !35, line: 3589, baseType: !1246, size: 64, align: 64, offset: 1728)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{null, !935}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !989, file: !35, line: 3594, baseType: !908, size: 32, align: 32, offset: 1792)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !989, file: !35, line: 3600, baseType: !946, size: 64, align: 64, offset: 1856)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !989, file: !35, line: 3609, baseType: !1252, size: 64, align: 64, offset: 1920)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1255)
!1255 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !937, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !937, file: !35, line: 1581, baseType: !909, size: 32, align: 32, offset: 224)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !937, file: !35, line: 1583, baseType: !953, size: 64, align: 64, offset: 256)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !937, file: !35, line: 1591, baseType: !1260, size: 64, align: 64, offset: 320)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1048, line: 129, size: 1664, align: 64, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1267, !1285, !1286, !1292, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1261, file: !1048, line: 136, baseType: !908, size: 32, align: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1261, file: !1048, line: 151, baseType: !908, size: 32, align: 32, offset: 32)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1261, file: !1048, line: 157, baseType: !908, size: 32, align: 32, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1261, file: !1048, line: 159, baseType: !1244, size: 64, align: 64, offset: 128)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1261, file: !1048, line: 161, baseType: !1268, size: 64, align: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1048, line: 117, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1048, line: 100, size: 832, align: 64, elements: !1271)
!1271 = !{!1272, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1270, file: !1048, line: 105, baseType: !1273, size: 256, align: 64)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1274, size: 256, align: 64, elements: !1094)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1117, line: 238, baseType: !1276)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1117, line: 238, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1270, file: !1048, line: 110, baseType: !908, size: 32, align: 32, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1270, file: !1048, line: 111, baseType: !908, size: 32, align: 32, offset: 288)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1270, file: !1048, line: 111, baseType: !908, size: 32, align: 32, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1270, file: !1048, line: 112, baseType: !1091, size: 256, align: 32, offset: 352)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1270, file: !1048, line: 113, baseType: !1097, size: 128, align: 32, offset: 608)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1270, file: !1048, line: 114, baseType: !908, size: 32, align: 32, offset: 736)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1270, file: !1048, line: 115, baseType: !908, size: 32, align: 32, offset: 768)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1270, file: !1048, line: 116, baseType: !908, size: 32, align: 32, offset: 800)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1261, file: !1048, line: 163, baseType: !953, size: 64, align: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1261, file: !1048, line: 165, baseType: !1287, size: 128, align: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1048, line: 122, baseType: !1288)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1048, line: 119, size: 128, align: 64, elements: !1289)
!1289 = !{!1290, !1291}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1288, file: !1048, line: 120, baseType: !1110, size: 64, align: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1288, file: !1048, line: 121, baseType: !1244, size: 64, align: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1261, file: !1048, line: 166, baseType: !1293, size: 128, align: 64, offset: 448)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1048, line: 127, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1048, line: 124, size: 128, align: 64, elements: !1295)
!1295 = !{!1296, !1369}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1294, file: !1048, line: 125, baseType: !1297, size: 64, align: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64, align: 64)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !35, line: 5794, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !35, line: 5747, size: 512, align: 64, elements: !1301)
!1301 = !{!1302, !1303, !1327, !1331, !1332, !1366, !1367, !1368}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1300, file: !35, line: 5751, baseType: !940, size: 64, align: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1300, file: !35, line: 5756, baseType: !1304, size: 64, align: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !35, line: 5796, size: 512, align: 64, elements: !1307)
!1307 = !{!1308, !1309, !1312, !1313, !1314, !1318, !1322, !1326}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1306, file: !35, line: 5797, baseType: !946, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1306, file: !35, line: 5804, baseType: !1310, size: 64, align: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !34)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1306, file: !35, line: 5815, baseType: !940, size: 64, align: 64, offset: 128)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1306, file: !35, line: 5825, baseType: !908, size: 32, align: 32, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1306, file: !35, line: 5826, baseType: !1315, size: 64, align: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!908, !1298}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1306, file: !35, line: 5827, baseType: !1319, size: 64, align: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64, align: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!908, !1298, !1110}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1306, file: !35, line: 5828, baseType: !1323, size: 64, align: 64, offset: 384)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DISubroutineType(types: !1325)
!1325 = !{null, !1298}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1306, file: !35, line: 5829, baseType: !1323, size: 64, align: 64, offset: 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1300, file: !35, line: 5762, baseType: !1328, size: 64, align: 64, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !35, line: 5735, baseType: !1330)
!1330 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !35, line: 5735, flags: DIFlagFwdDecl)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1300, file: !35, line: 5768, baseType: !953, size: 64, align: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1300, file: !35, line: 5775, baseType: !1333, size: 64, align: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64, align: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !35, line: 4085, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !35, line: 3936, size: 1152, align: 64, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1335, file: !35, line: 3940, baseType: !24, size: 32, align: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1335, file: !35, line: 3944, baseType: !34, size: 32, align: 32, offset: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1335, file: !35, line: 3948, baseType: !1068, size: 32, align: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1335, file: !35, line: 3958, baseType: !1061, size: 64, align: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1335, file: !35, line: 3962, baseType: !908, size: 32, align: 32, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1335, file: !35, line: 3968, baseType: !908, size: 32, align: 32, offset: 224)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1335, file: !35, line: 3973, baseType: !1104, size: 64, align: 64, offset: 256)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1335, file: !35, line: 3986, baseType: !908, size: 32, align: 32, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1335, file: !35, line: 3999, baseType: !908, size: 32, align: 32, offset: 352)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1335, file: !35, line: 4004, baseType: !908, size: 32, align: 32, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1335, file: !35, line: 4005, baseType: !908, size: 32, align: 32, offset: 416)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1335, file: !35, line: 4010, baseType: !908, size: 32, align: 32, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1335, file: !35, line: 4011, baseType: !908, size: 32, align: 32, offset: 480)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1335, file: !35, line: 4020, baseType: !999, size: 64, align: 32, offset: 512)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1335, file: !35, line: 4025, baseType: !858, size: 32, align: 32, offset: 576)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1335, file: !35, line: 4030, baseType: !781, size: 32, align: 32, offset: 608)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1335, file: !35, line: 4031, baseType: !787, size: 32, align: 32, offset: 640)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1335, file: !35, line: 4032, baseType: !805, size: 32, align: 32, offset: 672)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1335, file: !35, line: 4033, baseType: !829, size: 32, align: 32, offset: 704)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1335, file: !35, line: 4034, baseType: !848, size: 32, align: 32, offset: 736)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1335, file: !35, line: 4039, baseType: !908, size: 32, align: 32, offset: 768)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1335, file: !35, line: 4046, baseType: !1017, size: 64, align: 64, offset: 832)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1335, file: !35, line: 4050, baseType: !908, size: 32, align: 32, offset: 896)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1335, file: !35, line: 4054, baseType: !908, size: 32, align: 32, offset: 928)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1335, file: !35, line: 4061, baseType: !908, size: 32, align: 32, offset: 960)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1335, file: !35, line: 4065, baseType: !908, size: 32, align: 32, offset: 992)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1335, file: !35, line: 4073, baseType: !908, size: 32, align: 32, offset: 1024)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1335, file: !35, line: 4080, baseType: !908, size: 32, align: 32, offset: 1056)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1335, file: !35, line: 4084, baseType: !908, size: 32, align: 32, offset: 1088)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1300, file: !35, line: 5781, baseType: !1333, size: 64, align: 64, offset: 320)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1300, file: !35, line: 5787, baseType: !999, size: 64, align: 32, offset: 384)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1300, file: !35, line: 5793, baseType: !999, size: 64, align: 32, offset: 448)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1294, file: !1048, line: 126, baseType: !908, size: 32, align: 32, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1261, file: !1048, line: 172, baseType: !1110, size: 64, align: 64, offset: 576)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1261, file: !1048, line: 177, baseType: !1061, size: 64, align: 64, offset: 640)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1261, file: !1048, line: 178, baseType: !909, size: 32, align: 32, offset: 704)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1261, file: !1048, line: 180, baseType: !953, size: 64, align: 64, offset: 768)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1261, file: !1048, line: 185, baseType: !908, size: 32, align: 32, offset: 832)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1261, file: !1048, line: 190, baseType: !953, size: 64, align: 64, offset: 896)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1261, file: !1048, line: 195, baseType: !908, size: 32, align: 32, offset: 960)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1261, file: !1048, line: 200, baseType: !1110, size: 64, align: 64, offset: 1024)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1261, file: !1048, line: 201, baseType: !908, size: 32, align: 32, offset: 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1261, file: !1048, line: 202, baseType: !1244, size: 64, align: 64, offset: 1152)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1261, file: !1048, line: 203, baseType: !908, size: 32, align: 32, offset: 1216)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1261, file: !1048, line: 205, baseType: !908, size: 32, align: 32, offset: 1248)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1261, file: !1048, line: 206, baseType: !908, size: 32, align: 32, offset: 1280)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1261, file: !1048, line: 209, baseType: !1220, size: 64, align: 64, offset: 1344)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1261, file: !1048, line: 212, baseType: !1220, size: 64, align: 64, offset: 1408)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1261, file: !1048, line: 213, baseType: !1244, size: 64, align: 64, offset: 1472)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1261, file: !1048, line: 215, baseType: !908, size: 32, align: 32, offset: 1536)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1261, file: !1048, line: 217, baseType: !908, size: 32, align: 32, offset: 1568)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1261, file: !1048, line: 220, baseType: !908, size: 32, align: 32, offset: 1600)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !937, file: !35, line: 1598, baseType: !953, size: 64, align: 64, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !937, file: !35, line: 1606, baseType: !1104, size: 64, align: 64, offset: 448)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !937, file: !35, line: 1614, baseType: !908, size: 32, align: 32, offset: 512)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !937, file: !35, line: 1622, baseType: !908, size: 32, align: 32, offset: 544)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !937, file: !35, line: 1628, baseType: !908, size: 32, align: 32, offset: 576)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !35, line: 1636, baseType: !908, size: 32, align: 32, offset: 608)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !937, file: !35, line: 1643, baseType: !908, size: 32, align: 32, offset: 640)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !937, file: !35, line: 1657, baseType: !1061, size: 64, align: 64, offset: 704)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !937, file: !35, line: 1658, baseType: !908, size: 32, align: 32, offset: 768)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !937, file: !35, line: 1679, baseType: !999, size: 64, align: 32, offset: 800)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !937, file: !35, line: 1688, baseType: !908, size: 32, align: 32, offset: 864)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !937, file: !35, line: 1712, baseType: !908, size: 32, align: 32, offset: 896)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !937, file: !35, line: 1729, baseType: !908, size: 32, align: 32, offset: 928)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !937, file: !35, line: 1729, baseType: !908, size: 32, align: 32, offset: 960)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !937, file: !35, line: 1744, baseType: !908, size: 32, align: 32, offset: 992)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !937, file: !35, line: 1744, baseType: !908, size: 32, align: 32, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !937, file: !35, line: 1751, baseType: !908, size: 32, align: 32, offset: 1056)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !937, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !937, file: !35, line: 1791, baseType: !1408, size: 64, align: 64, offset: 1152)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1409, size: 64, align: 64)
!1409 = !DISubroutineType(types: !1410)
!1410 = !{null, !1411, !1144, !1226, !908, !908, !908}
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !937, file: !35, line: 1808, baseType: !1413, size: 64, align: 64, offset: 1216)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64, align: 64)
!1414 = !DISubroutineType(types: !1415)
!1415 = !{!494, !1411, !1006}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !937, file: !35, line: 1816, baseType: !908, size: 32, align: 32, offset: 1280)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !937, file: !35, line: 1825, baseType: !1418, size: 32, align: 32, offset: 1312)
!1418 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !937, file: !35, line: 1830, baseType: !908, size: 32, align: 32, offset: 1344)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !937, file: !35, line: 1838, baseType: !1418, size: 32, align: 32, offset: 1376)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !937, file: !35, line: 1846, baseType: !908, size: 32, align: 32, offset: 1408)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !937, file: !35, line: 1851, baseType: !908, size: 32, align: 32, offset: 1440)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !937, file: !35, line: 1861, baseType: !1418, size: 32, align: 32, offset: 1472)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !937, file: !35, line: 1868, baseType: !1418, size: 32, align: 32, offset: 1504)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !937, file: !35, line: 1875, baseType: !1418, size: 32, align: 32, offset: 1536)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !937, file: !35, line: 1882, baseType: !1418, size: 32, align: 32, offset: 1568)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !937, file: !35, line: 1889, baseType: !1418, size: 32, align: 32, offset: 1600)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !937, file: !35, line: 1896, baseType: !1418, size: 32, align: 32, offset: 1632)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !937, file: !35, line: 1903, baseType: !1418, size: 32, align: 32, offset: 1664)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !937, file: !35, line: 1910, baseType: !908, size: 32, align: 32, offset: 1696)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !937, file: !35, line: 1915, baseType: !908, size: 32, align: 32, offset: 1728)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !937, file: !35, line: 1926, baseType: !1226, size: 64, align: 64, offset: 1792)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !937, file: !35, line: 1935, baseType: !999, size: 64, align: 32, offset: 1856)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !937, file: !35, line: 1942, baseType: !908, size: 32, align: 32, offset: 1920)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !937, file: !35, line: 1948, baseType: !908, size: 32, align: 32, offset: 1952)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !937, file: !35, line: 1954, baseType: !908, size: 32, align: 32, offset: 1984)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !937, file: !35, line: 1960, baseType: !908, size: 32, align: 32, offset: 2016)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !937, file: !35, line: 1984, baseType: !908, size: 32, align: 32, offset: 2048)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !937, file: !35, line: 1991, baseType: !908, size: 32, align: 32, offset: 2080)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !937, file: !35, line: 1996, baseType: !908, size: 32, align: 32, offset: 2112)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !937, file: !35, line: 2004, baseType: !908, size: 32, align: 32, offset: 2144)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !937, file: !35, line: 2011, baseType: !908, size: 32, align: 32, offset: 2176)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !937, file: !35, line: 2018, baseType: !908, size: 32, align: 32, offset: 2208)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !937, file: !35, line: 2027, baseType: !908, size: 32, align: 32, offset: 2240)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !937, file: !35, line: 2034, baseType: !908, size: 32, align: 32, offset: 2272)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !937, file: !35, line: 2044, baseType: !908, size: 32, align: 32, offset: 2304)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !937, file: !35, line: 2054, baseType: !1448, size: 64, align: 64, offset: 2368)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !937, file: !35, line: 2061, baseType: !1448, size: 64, align: 64, offset: 2432)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !937, file: !35, line: 2066, baseType: !908, size: 32, align: 32, offset: 2496)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !937, file: !35, line: 2070, baseType: !908, size: 32, align: 32, offset: 2528)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !937, file: !35, line: 2078, baseType: !908, size: 32, align: 32, offset: 2560)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !937, file: !35, line: 2085, baseType: !908, size: 32, align: 32, offset: 2592)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !937, file: !35, line: 2092, baseType: !908, size: 32, align: 32, offset: 2624)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !937, file: !35, line: 2099, baseType: !908, size: 32, align: 32, offset: 2656)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !937, file: !35, line: 2106, baseType: !908, size: 32, align: 32, offset: 2688)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !937, file: !35, line: 2113, baseType: !908, size: 32, align: 32, offset: 2720)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !937, file: !35, line: 2120, baseType: !908, size: 32, align: 32, offset: 2752)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !937, file: !35, line: 2125, baseType: !908, size: 32, align: 32, offset: 2784)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !937, file: !35, line: 2133, baseType: !908, size: 32, align: 32, offset: 2816)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !937, file: !35, line: 2140, baseType: !908, size: 32, align: 32, offset: 2848)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !937, file: !35, line: 2145, baseType: !908, size: 32, align: 32, offset: 2880)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !937, file: !35, line: 2153, baseType: !908, size: 32, align: 32, offset: 2912)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !937, file: !35, line: 2158, baseType: !908, size: 32, align: 32, offset: 2944)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !937, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !937, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !937, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !937, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !937, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !937, file: !35, line: 2203, baseType: !908, size: 32, align: 32, offset: 3136)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !937, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !937, file: !35, line: 2212, baseType: !908, size: 32, align: 32, offset: 3200)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !937, file: !35, line: 2213, baseType: !908, size: 32, align: 32, offset: 3232)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !937, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !937, file: !35, line: 2232, baseType: !908, size: 32, align: 32, offset: 3296)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !937, file: !35, line: 2243, baseType: !908, size: 32, align: 32, offset: 3328)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !937, file: !35, line: 2249, baseType: !908, size: 32, align: 32, offset: 3360)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !937, file: !35, line: 2256, baseType: !908, size: 32, align: 32, offset: 3392)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !937, file: !35, line: 2263, baseType: !1017, size: 64, align: 64, offset: 3456)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !937, file: !35, line: 2270, baseType: !1017, size: 64, align: 64, offset: 3520)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !937, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !937, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !937, file: !35, line: 2367, baseType: !1484, size: 64, align: 64, offset: 3648)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!908, !1411, !1244, !908}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !937, file: !35, line: 2383, baseType: !908, size: 32, align: 32, offset: 3712)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !937, file: !35, line: 2386, baseType: !1418, size: 32, align: 32, offset: 3744)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !937, file: !35, line: 2387, baseType: !1418, size: 32, align: 32, offset: 3776)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !937, file: !35, line: 2394, baseType: !908, size: 32, align: 32, offset: 3808)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !937, file: !35, line: 2401, baseType: !908, size: 32, align: 32, offset: 3840)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !937, file: !35, line: 2408, baseType: !908, size: 32, align: 32, offset: 3872)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !937, file: !35, line: 2415, baseType: !908, size: 32, align: 32, offset: 3904)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !937, file: !35, line: 2422, baseType: !908, size: 32, align: 32, offset: 3936)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !937, file: !35, line: 2423, baseType: !1496, size: 64, align: 64, offset: 3968)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64, align: 64)
!1497 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1498)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1499)
!1499 = !{!1500, !1501, !1502, !1503}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1498, file: !35, line: 827, baseType: !908, size: 32, align: 32)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1498, file: !35, line: 828, baseType: !908, size: 32, align: 32, offset: 32)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1498, file: !35, line: 829, baseType: !908, size: 32, align: 32, offset: 64)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1498, file: !35, line: 830, baseType: !1418, size: 32, align: 32, offset: 96)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !937, file: !35, line: 2430, baseType: !1104, size: 64, align: 64, offset: 4032)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !937, file: !35, line: 2437, baseType: !1104, size: 64, align: 64, offset: 4096)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !937, file: !35, line: 2444, baseType: !1418, size: 32, align: 32, offset: 4160)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !937, file: !35, line: 2451, baseType: !1418, size: 32, align: 32, offset: 4192)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !937, file: !35, line: 2458, baseType: !908, size: 32, align: 32, offset: 4224)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !937, file: !35, line: 2469, baseType: !908, size: 32, align: 32, offset: 4256)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !937, file: !35, line: 2475, baseType: !908, size: 32, align: 32, offset: 4288)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !937, file: !35, line: 2481, baseType: !908, size: 32, align: 32, offset: 4320)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !937, file: !35, line: 2485, baseType: !908, size: 32, align: 32, offset: 4352)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !937, file: !35, line: 2489, baseType: !908, size: 32, align: 32, offset: 4384)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !937, file: !35, line: 2493, baseType: !908, size: 32, align: 32, offset: 4416)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !937, file: !35, line: 2501, baseType: !908, size: 32, align: 32, offset: 4448)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !937, file: !35, line: 2506, baseType: !908, size: 32, align: 32, offset: 4480)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !937, file: !35, line: 2510, baseType: !908, size: 32, align: 32, offset: 4512)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !937, file: !35, line: 2514, baseType: !1104, size: 64, align: 64, offset: 4544)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !937, file: !35, line: 2528, baseType: !1520, size: 64, align: 64, offset: 4608)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{null, !1411, !953, !908, !908}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !937, file: !35, line: 2534, baseType: !908, size: 32, align: 32, offset: 4672)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !937, file: !35, line: 2545, baseType: !908, size: 32, align: 32, offset: 4704)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !937, file: !35, line: 2547, baseType: !908, size: 32, align: 32, offset: 4736)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !937, file: !35, line: 2549, baseType: !908, size: 32, align: 32, offset: 4768)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !937, file: !35, line: 2551, baseType: !908, size: 32, align: 32, offset: 4800)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !937, file: !35, line: 2553, baseType: !908, size: 32, align: 32, offset: 4832)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !937, file: !35, line: 2555, baseType: !908, size: 32, align: 32, offset: 4864)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !937, file: !35, line: 2557, baseType: !908, size: 32, align: 32, offset: 4896)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !937, file: !35, line: 2559, baseType: !908, size: 32, align: 32, offset: 4928)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !937, file: !35, line: 2563, baseType: !908, size: 32, align: 32, offset: 4960)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !937, file: !35, line: 2571, baseType: !1100, size: 64, align: 64, offset: 4992)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !937, file: !35, line: 2579, baseType: !1100, size: 64, align: 64, offset: 5056)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !937, file: !35, line: 2586, baseType: !908, size: 32, align: 32, offset: 5120)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !937, file: !35, line: 2615, baseType: !908, size: 32, align: 32, offset: 5152)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !937, file: !35, line: 2627, baseType: !908, size: 32, align: 32, offset: 5184)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !937, file: !35, line: 2637, baseType: !908, size: 32, align: 32, offset: 5216)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !937, file: !35, line: 2681, baseType: !908, size: 32, align: 32, offset: 5248)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !937, file: !35, line: 2709, baseType: !1104, size: 64, align: 64, offset: 5312)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !937, file: !35, line: 2716, baseType: !1542, size: 64, align: 64, offset: 5376)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1544)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1545)
!1545 = !{!1546, !1547, !1548, !1549, !1550, !1551, !1552, !1556, !1560, !1561, !1562, !1563, !1569, !1570, !1571, !1572, !1573}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1544, file: !35, line: 3642, baseType: !946, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1544, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1544, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1544, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1544, file: !35, line: 3669, baseType: !908, size: 32, align: 32, offset: 160)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1544, file: !35, line: 3682, baseType: !1241, size: 64, align: 64, offset: 192)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1544, file: !35, line: 3698, baseType: !1553, size: 64, align: 64, offset: 256)
!1553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1554, size: 64, align: 64)
!1554 = !DISubroutineType(types: !1555)
!1555 = !{!908, !935, !910, !1068}
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1544, file: !35, line: 3712, baseType: !1557, size: 64, align: 64, offset: 320)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!908, !935, !908, !910, !1068}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1544, file: !35, line: 3726, baseType: !1553, size: 64, align: 64, offset: 384)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1544, file: !35, line: 3737, baseType: !1034, size: 64, align: 64, offset: 448)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1544, file: !35, line: 3746, baseType: !908, size: 32, align: 32, offset: 512)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1544, file: !35, line: 3757, baseType: !1564, size: 64, align: 64, offset: 576)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{null, !1567}
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1544, file: !35, line: 3766, baseType: !1034, size: 64, align: 64, offset: 640)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1544, file: !35, line: 3774, baseType: !1034, size: 64, align: 64, offset: 704)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1544, file: !35, line: 3780, baseType: !908, size: 32, align: 32, offset: 768)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1544, file: !35, line: 3785, baseType: !908, size: 32, align: 32, offset: 800)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1544, file: !35, line: 3795, baseType: !1574, size: 64, align: 64, offset: 832)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!908, !935, !1115}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !937, file: !35, line: 2728, baseType: !953, size: 64, align: 64, offset: 5440)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !937, file: !35, line: 2735, baseType: !1168, size: 512, align: 64, offset: 5504)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !937, file: !35, line: 2742, baseType: !908, size: 32, align: 32, offset: 6016)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !937, file: !35, line: 2755, baseType: !908, size: 32, align: 32, offset: 6048)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !937, file: !35, line: 2776, baseType: !908, size: 32, align: 32, offset: 6080)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !937, file: !35, line: 2783, baseType: !908, size: 32, align: 32, offset: 6112)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !937, file: !35, line: 2791, baseType: !908, size: 32, align: 32, offset: 6144)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !937, file: !35, line: 2802, baseType: !1244, size: 64, align: 64, offset: 6208)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !937, file: !35, line: 2811, baseType: !908, size: 32, align: 32, offset: 6272)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !937, file: !35, line: 2821, baseType: !908, size: 32, align: 32, offset: 6304)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !937, file: !35, line: 2830, baseType: !908, size: 32, align: 32, offset: 6336)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !937, file: !35, line: 2840, baseType: !908, size: 32, align: 32, offset: 6368)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !937, file: !35, line: 2851, baseType: !1590, size: 64, align: 64, offset: 6400)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DISubroutineType(types: !1592)
!1592 = !{!908, !1411, !1593, !953, !1226, !908, !908}
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!908, !1411, !953}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !937, file: !35, line: 2871, baseType: !1597, size: 64, align: 64, offset: 6464)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!908, !1411, !1600, !953, !1226, !908}
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!908, !1411, !953, !908, !908}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !937, file: !35, line: 2878, baseType: !908, size: 32, align: 32, offset: 6528)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !937, file: !35, line: 2885, baseType: !908, size: 32, align: 32, offset: 6560)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !937, file: !35, line: 3005, baseType: !908, size: 32, align: 32, offset: 6592)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !937, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !937, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !937, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !937, file: !35, line: 3037, baseType: !1061, size: 64, align: 64, offset: 6720)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !937, file: !35, line: 3038, baseType: !908, size: 32, align: 32, offset: 6784)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !937, file: !35, line: 3050, baseType: !1017, size: 64, align: 64, offset: 6848)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !937, file: !35, line: 3065, baseType: !908, size: 32, align: 32, offset: 6912)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !937, file: !35, line: 3083, baseType: !908, size: 32, align: 32, offset: 6944)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !937, file: !35, line: 3092, baseType: !999, size: 64, align: 32, offset: 6976)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !937, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !937, file: !35, line: 3106, baseType: !999, size: 64, align: 32, offset: 7072)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !937, file: !35, line: 3113, baseType: !1618, size: 64, align: 64, offset: 7168)
!1618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1619, size: 64, align: 64)
!1619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1620)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1628, !1631}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1621, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1621, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1621, file: !35, line: 720, baseType: !946, size: 64, align: 64, offset: 64)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1621, file: !35, line: 724, baseType: !946, size: 64, align: 64, offset: 128)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1621, file: !35, line: 728, baseType: !908, size: 32, align: 32, offset: 192)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1621, file: !35, line: 734, baseType: !1629, size: 64, align: 64, offset: 256)
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1621, file: !35, line: 739, baseType: !1632, size: 64, align: 64, offset: 320)
!1632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1633, size: 64, align: 64)
!1633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !937, file: !35, line: 3129, baseType: !1104, size: 64, align: 64, offset: 7232)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !937, file: !35, line: 3130, baseType: !1104, size: 64, align: 64, offset: 7296)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !937, file: !35, line: 3131, baseType: !1104, size: 64, align: 64, offset: 7360)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !937, file: !35, line: 3132, baseType: !1104, size: 64, align: 64, offset: 7424)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !937, file: !35, line: 3139, baseType: !1100, size: 64, align: 64, offset: 7488)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !937, file: !35, line: 3147, baseType: !908, size: 32, align: 32, offset: 7552)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !937, file: !35, line: 3165, baseType: !908, size: 32, align: 32, offset: 7584)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !937, file: !35, line: 3172, baseType: !908, size: 32, align: 32, offset: 7616)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !937, file: !35, line: 3180, baseType: !908, size: 32, align: 32, offset: 7648)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !937, file: !35, line: 3191, baseType: !1448, size: 64, align: 64, offset: 7680)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !937, file: !35, line: 3199, baseType: !1061, size: 64, align: 64, offset: 7744)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !937, file: !35, line: 3207, baseType: !1100, size: 64, align: 64, offset: 7808)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !937, file: !35, line: 3214, baseType: !909, size: 32, align: 32, offset: 7872)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !937, file: !35, line: 3224, baseType: !1133, size: 64, align: 64, offset: 7936)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !937, file: !35, line: 3225, baseType: !908, size: 32, align: 32, offset: 8000)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !937, file: !35, line: 3249, baseType: !1115, size: 64, align: 64, offset: 8064)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !937, file: !35, line: 3256, baseType: !908, size: 32, align: 32, offset: 8128)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !937, file: !35, line: 3271, baseType: !908, size: 32, align: 32, offset: 8160)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !937, file: !35, line: 3279, baseType: !1104, size: 64, align: 64, offset: 8192)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !937, file: !35, line: 3301, baseType: !1115, size: 64, align: 64, offset: 8256)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !937, file: !35, line: 3310, baseType: !908, size: 32, align: 32, offset: 8320)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !937, file: !35, line: 3337, baseType: !908, size: 32, align: 32, offset: 8352)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !937, file: !35, line: 3351, baseType: !908, size: 32, align: 32, offset: 8384)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !937, file: !35, line: 3359, baseType: !908, size: 32, align: 32, offset: 8416)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "h264chroma", scope: !932, file: !888, line: 125, baseType: !1659, size: 512, align: 64, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_typedef, name: "H264ChromaContext", file: !1660, line: 30, baseType: !1661)
!1660 = !DIFile(filename: "libavcodec/h264chroma.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "H264ChromaContext", file: !1660, line: 27, size: 512, align: 64, elements: !1662)
!1662 = !{!1663, !1670}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "put_h264_chroma_pixels_tab", scope: !1661, file: !1660, line: 28, baseType: !1664, size: 256, align: 64)
!1664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1665, size: 256, align: 64, elements: !1094)
!1665 = !DIDerivedType(tag: DW_TAG_typedef, name: "h264_chroma_mc_func", file: !1660, line: 25, baseType: !1666)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DISubroutineType(types: !1668)
!1668 = !{null, !1061, !1061, !1669, !908, !908, !908}
!1669 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1221, line: 149, baseType: !1105)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "avg_h264_chroma_pixels_tab", scope: !1661, file: !1660, line: 29, baseType: !1664, size: 256, align: 64, offset: 256)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "hdsp", scope: !932, file: !888, line: 126, baseType: !1672, size: 3328, align: 64, offset: 576)
!1672 = !DIDerivedType(tag: DW_TAG_typedef, name: "HpelDSPContext", file: !1673, line: 95, baseType: !1674)
!1673 = !DIFile(filename: "libavcodec/hpeldsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HpelDSPContext", file: !1673, line: 45, size: 3328, align: 64, elements: !1675)
!1675 = !{!1676, !1683, !1684, !1685}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "put_pixels_tab", scope: !1674, file: !1673, line: 56, baseType: !1677, size: 1024, align: 64)
!1677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1678, size: 1024, align: 64, elements: !1682)
!1678 = !DIDerivedType(tag: DW_TAG_typedef, name: "op_pixels_func", file: !1673, line: 38, baseType: !1679)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DISubroutineType(types: !1681)
!1681 = !{null, !1061, !910, !1669, !908}
!1682 = !{!1095, !1095}
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "avg_pixels_tab", scope: !1674, file: !1673, line: 68, baseType: !1677, size: 1024, align: 64, offset: 1024)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "put_no_rnd_pixels_tab", scope: !1674, file: !1673, line: 82, baseType: !1677, size: 1024, align: 64, offset: 2048)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "avg_no_rnd_pixels_tab", scope: !1674, file: !1673, line: 94, baseType: !1686, size: 256, align: 64, offset: 3072)
!1686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1678, size: 256, align: 64, elements: !1094)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "vdsp", scope: !932, file: !888, line: 127, baseType: !1688, size: 128, align: 64, offset: 3904)
!1688 = !DIDerivedType(tag: DW_TAG_typedef, name: "VideoDSPContext", file: !1689, line: 77, baseType: !1690)
!1689 = !DIFile(filename: "libavcodec/videodsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VideoDSPContext", file: !1689, line: 41, size: 128, align: 64, elements: !1691)
!1691 = !{!1692, !1696}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "emulated_edge_mc", scope: !1690, file: !1689, line: 63, baseType: !1693, size: 64, align: 64)
