; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--fraps.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--fraps.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%struct.AVProfile = type { i32, i8* }

!866 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!867 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!868 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!869 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!870 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!871 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880}
!874 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!875 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!876 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!877 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!878 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!879 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!880 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !882)
!882 = !{!883, !884, !885, !886}
!883 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!884 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!885 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!886 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!887 = !{!888, !889, !890, !898, !900, !901, !903}
!888 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!889 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64, align: 64)
!891 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !893, line: 221, size: 32, align: 8, elements: !894)
!893 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !892, file: !893, line: 221, baseType: !896, size: 32, align: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !897, line: 51, baseType: !889)
!897 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64, align: 64)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !897, line: 48, baseType: !902)
!902 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64, align: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "FrapsContext", file: !905, line: 53, baseType: !906)
!905 = !DIFile(filename: "libavcodec/fraps.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FrapsContext", file: !905, line: 48, size: 320, align: 64, elements: !907)
!907 = !{!908, !1635, !1650, !1651}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !906, file: !905, line: 49, baseType: !909, size: 64, align: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64, align: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !912)
!912 = !{!913, !958, !959, !960, !1233, !1234, !1235, !1236, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1389, !1393, !1394, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1573, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !911, file: !14, line: 1561, baseType: !914, size: 64, align: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64, align: 64)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !691, line: 143, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !691, line: 67, size: 640, align: 64, elements: !918)
!918 = !{!919, !923, !928, !932, !933, !934, !935, !939, !945, !947, !951}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !917, file: !691, line: 72, baseType: !920, size: 64, align: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64, align: 64)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !917, file: !691, line: 78, baseType: !924, size: 64, align: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64, align: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!920, !927}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !917, file: !691, line: 85, baseType: !929, size: 64, align: 64, offset: 128)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 85, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !917, file: !691, line: 93, baseType: !888, size: 32, align: 32, offset: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !917, file: !691, line: 99, baseType: !888, size: 32, align: 32, offset: 224)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !917, file: !691, line: 108, baseType: !888, size: 32, align: 32, offset: 256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !917, file: !691, line: 113, baseType: !936, size: 64, align: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64, align: 64)
!937 = !DISubroutineType(types: !938)
!938 = !{!927, !927, !927}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !917, file: !691, line: 123, baseType: !940, size: 64, align: 64, offset: 384)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!941 = !DISubroutineType(types: !942)
!942 = !{!943, !943}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64, align: 64)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !917, file: !691, line: 130, baseType: !946, size: 32, align: 32, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !691, line: 48, baseType: !690)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !917, file: !691, line: 136, baseType: !948, size: 64, align: 64, offset: 512)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!946, !927}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !917, file: !691, line: 142, baseType: !952, size: 64, align: 64, offset: 576)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64, align: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{!888, !955, !927, !920, !888}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 60, flags: DIFlagFwdDecl)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !911, file: !14, line: 1562, baseType: !888, size: 32, align: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !911, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !911, file: !14, line: 1565, baseType: !961, size: 64, align: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !979, !982, !985, !988, !993, !994, !995, !1003, !1004, !1005, !1007, !1011, !1017, !1028, !1032, !1033, !1083, !1204, !1208, !1209, !1213, !1217, !1222, !1226, !1227, !1228}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !963, file: !14, line: 3475, baseType: !920, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !963, file: !14, line: 3480, baseType: !920, size: 64, align: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !963, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !963, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !963, file: !14, line: 3487, baseType: !888, size: 32, align: 32, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !963, file: !14, line: 3488, baseType: !971, size: 64, align: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !974, line: 61, baseType: !975)
!974 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !974, line: 58, size: 64, align: 32, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !975, file: !974, line: 59, baseType: !888, size: 32, align: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !975, file: !974, line: 60, baseType: !888, size: 32, align: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !963, file: !14, line: 3489, baseType: !980, size: 64, align: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64, align: 64)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !963, file: !14, line: 3490, baseType: !983, size: 64, align: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !888)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !963, file: !14, line: 3491, baseType: !986, size: 64, align: 64, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !963, file: !14, line: 3492, baseType: !989, size: 64, align: 64, offset: 512)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !897, line: 55, baseType: !992)
!992 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !963, file: !14, line: 3493, baseType: !901, size: 8, align: 8, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !963, file: !14, line: 3494, baseType: !914, size: 64, align: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !963, file: !14, line: 3495, baseType: !996, size: 64, align: 64, offset: 704)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1000)
!1000 = !{!1001, !1002}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !999, file: !14, line: 3402, baseType: !888, size: 32, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !999, file: !14, line: 3403, baseType: !920, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !963, file: !14, line: 3507, baseType: !920, size: 64, align: 64, offset: 768)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !963, file: !14, line: 3516, baseType: !888, size: 32, align: 32, offset: 832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !963, file: !14, line: 3517, baseType: !1006, size: 64, align: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !963, file: !14, line: 3527, baseType: !1008, size: 64, align: 64, offset: 960)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!888, !909}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !963, file: !14, line: 3535, baseType: !1012, size: 64, align: 64, offset: 1024)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64, align: 64)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{!888, !909, !1015}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !963, file: !14, line: 3541, baseType: !1018, size: 64, align: 64, offset: 1088)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1022, line: 223, size: 128, align: 64, elements: !1023)
!1022 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1023 = !{!1024, !1027}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1021, file: !1022, line: 224, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1021, file: !1022, line: 225, baseType: !1025, size: 64, align: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !963, file: !14, line: 3549, baseType: !1029, size: 64, align: 64, offset: 1152)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !1006}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !963, file: !14, line: 3551, baseType: !1008, size: 64, align: 64, offset: 1216)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !963, file: !14, line: 3552, baseType: !1034, size: 64, align: 64, offset: 1280)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!888, !909, !1037, !888, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64, align: 64)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1041)
!1041 = !{!1042, !1045, !1046, !1047, !1048, !1080}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1040, file: !14, line: 3921, baseType: !1043, size: 16, align: 16)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !897, line: 49, baseType: !1044)
!1044 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1040, file: !14, line: 3922, baseType: !896, size: 32, align: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1040, file: !14, line: 3923, baseType: !896, size: 32, align: 32, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1040, file: !14, line: 3924, baseType: !889, size: 32, align: 32, offset: 96)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1040, file: !14, line: 3925, baseType: !1049, size: 64, align: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058, !1059, !1069, !1073, !1075, !1076, !1078, !1079}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1052, file: !14, line: 3886, baseType: !888, size: 32, align: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1052, file: !14, line: 3887, baseType: !888, size: 32, align: 32, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1052, file: !14, line: 3888, baseType: !888, size: 32, align: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1052, file: !14, line: 3889, baseType: !888, size: 32, align: 32, offset: 96)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1052, file: !14, line: 3890, baseType: !888, size: 32, align: 32, offset: 128)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1052, file: !14, line: 3897, baseType: !1060, size: 768, align: 64, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1062)
!1062 = !{!1063, !1067}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1061, file: !14, line: 3855, baseType: !1064, size: 512, align: 64)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 512, align: 64, elements: !1065)
!1065 = !{!1066}
!1066 = !DISubrange(count: 8)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1061, file: !14, line: 3857, baseType: !1068, size: 256, align: 32, offset: 512)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 256, align: 32, elements: !1065)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1052, file: !14, line: 3903, baseType: !1070, size: 256, align: 64, offset: 960)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 256, align: 64, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 4)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1052, file: !14, line: 3904, baseType: !1074, size: 128, align: 32, offset: 1216)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, align: 32, elements: !1071)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1052, file: !14, line: 3906, baseType: !881, size: 32, align: 32, offset: 1344)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1052, file: !14, line: 3908, baseType: !1077, size: 64, align: 64, offset: 1408)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1052, file: !14, line: 3915, baseType: !1077, size: 64, align: 64, offset: 1472)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !14, line: 3917, baseType: !888, size: 32, align: 32, offset: 1536)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1040, file: !14, line: 3926, baseType: !1081, size: 64, align: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !897, line: 40, baseType: !1082)
!1082 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !963, file: !14, line: 3564, baseType: !1084, size: 64, align: 64, offset: 1344)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!888, !909, !1087, !1121, !1203}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1090)
!1090 = !{!1091, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1117, !1118, !1119, !1120}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1089, file: !14, line: 1451, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1094, line: 94, baseType: !1095)
!1094 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1094, line: 81, size: 192, align: 64, elements: !1096)
!1096 = !{!1097, !1101, !1102}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1095, file: !1094, line: 82, baseType: !1098, size: 64, align: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64, align: 64)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1094, line: 73, baseType: !1100)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1094, line: 73, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1095, file: !1094, line: 89, baseType: !1037, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1095, file: !1094, line: 93, baseType: !888, size: 32, align: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1089, file: !14, line: 1461, baseType: !1081, size: 64, align: 64, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1089, file: !14, line: 1467, baseType: !1081, size: 64, align: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1089, file: !14, line: 1468, baseType: !1037, size: 64, align: 64, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !14, line: 1469, baseType: !888, size: 32, align: 32, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1089, file: !14, line: 1470, baseType: !888, size: 32, align: 32, offset: 288)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !14, line: 1474, baseType: !888, size: 32, align: 32, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1089, file: !14, line: 1479, baseType: !1110, size: 64, align: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1112)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1113)
!1113 = !{!1114, !1115, !1116}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1112, file: !14, line: 1412, baseType: !1037, size: 64, align: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1112, file: !14, line: 1413, baseType: !888, size: 32, align: 32, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1112, file: !14, line: 1414, baseType: !822, size: 32, align: 32, offset: 96)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1089, file: !14, line: 1480, baseType: !888, size: 32, align: 32, offset: 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1089, file: !14, line: 1486, baseType: !1081, size: 64, align: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1089, file: !14, line: 1488, baseType: !1081, size: 64, align: 64, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1089, file: !14, line: 1497, baseType: !1081, size: 64, align: 64, offset: 640)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1123)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !722, line: 646, baseType: !1124)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !722, line: 268, size: 4288, align: 64, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1155, !1157, !1158, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1191, !1192, !1193, !1194, !1195, !1196, !1199, !1200, !1201, !1202}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1124, file: !722, line: 282, baseType: !1064, size: 512, align: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1124, file: !722, line: 299, baseType: !1068, size: 256, align: 32, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1124, file: !722, line: 315, baseType: !1129, size: 64, align: 64, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1124, file: !722, line: 326, baseType: !888, size: 32, align: 32, offset: 832)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1124, file: !722, line: 326, baseType: !888, size: 32, align: 32, offset: 864)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1124, file: !722, line: 334, baseType: !888, size: 32, align: 32, offset: 896)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1124, file: !722, line: 341, baseType: !888, size: 32, align: 32, offset: 928)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1124, file: !722, line: 346, baseType: !888, size: 32, align: 32, offset: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1124, file: !722, line: 351, baseType: !711, size: 32, align: 32, offset: 992)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1124, file: !722, line: 356, baseType: !973, size: 64, align: 32, offset: 1024)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1124, file: !722, line: 361, baseType: !1081, size: 64, align: 64, offset: 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1124, file: !722, line: 369, baseType: !1081, size: 64, align: 64, offset: 1152)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1124, file: !722, line: 377, baseType: !1081, size: 64, align: 64, offset: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1124, file: !722, line: 382, baseType: !888, size: 32, align: 32, offset: 1280)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1124, file: !722, line: 386, baseType: !888, size: 32, align: 32, offset: 1312)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1124, file: !722, line: 391, baseType: !888, size: 32, align: 32, offset: 1344)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1124, file: !722, line: 396, baseType: !927, size: 64, align: 64, offset: 1408)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1124, file: !722, line: 403, baseType: !1145, size: 512, align: 64, offset: 1472)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 512, align: 64, elements: !1065)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1124, file: !722, line: 410, baseType: !888, size: 32, align: 32, offset: 1984)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1124, file: !722, line: 415, baseType: !888, size: 32, align: 32, offset: 2016)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1124, file: !722, line: 420, baseType: !888, size: 32, align: 32, offset: 2048)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1124, file: !722, line: 425, baseType: !888, size: 32, align: 32, offset: 2080)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1124, file: !722, line: 435, baseType: !1081, size: 64, align: 64, offset: 2112)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1124, file: !722, line: 440, baseType: !888, size: 32, align: 32, offset: 2176)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1124, file: !722, line: 445, baseType: !991, size: 64, align: 64, offset: 2240)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1124, file: !722, line: 459, baseType: !1154, size: 512, align: 64, offset: 2304)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1092, size: 512, align: 64, elements: !1065)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1124, file: !722, line: 473, baseType: !1156, size: 64, align: 64, offset: 2816)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1124, file: !722, line: 477, baseType: !888, size: 32, align: 32, offset: 2880)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1124, file: !722, line: 479, baseType: !1159, size: 64, align: 64, offset: 2944)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !722, line: 207, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !722, line: 201, size: 320, align: 64, elements: !1163)
!1163 = !{!1164, !1165, !1166, !1167, !1172}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1162, file: !722, line: 202, baseType: !721, size: 32, align: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1162, file: !722, line: 203, baseType: !1037, size: 64, align: 64, offset: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !722, line: 204, baseType: !888, size: 32, align: 32, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1162, file: !722, line: 205, baseType: !1168, size: 64, align: 64, offset: 192)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1170, line: 86, baseType: !1171)
!1170 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1171 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1170, line: 86, flags: DIFlagFwdDecl)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1162, file: !722, line: 206, baseType: !1092, size: 64, align: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1124, file: !722, line: 480, baseType: !888, size: 32, align: 32, offset: 3008)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1124, file: !722, line: 505, baseType: !888, size: 32, align: 32, offset: 3040)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1124, file: !722, line: 512, baseType: !745, size: 32, align: 32, offset: 3072)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1124, file: !722, line: 514, baseType: !751, size: 32, align: 32, offset: 3104)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1124, file: !722, line: 516, baseType: !769, size: 32, align: 32, offset: 3136)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1124, file: !722, line: 523, baseType: !793, size: 32, align: 32, offset: 3168)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1124, file: !722, line: 525, baseType: !812, size: 32, align: 32, offset: 3200)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1124, file: !722, line: 532, baseType: !1081, size: 64, align: 64, offset: 3264)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1124, file: !722, line: 539, baseType: !1081, size: 64, align: 64, offset: 3328)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1124, file: !722, line: 547, baseType: !1081, size: 64, align: 64, offset: 3392)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1124, file: !722, line: 554, baseType: !1168, size: 64, align: 64, offset: 3456)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1124, file: !722, line: 563, baseType: !888, size: 32, align: 32, offset: 3520)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1124, file: !722, line: 572, baseType: !888, size: 32, align: 32, offset: 3552)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1124, file: !722, line: 581, baseType: !888, size: 32, align: 32, offset: 3584)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1124, file: !722, line: 588, baseType: !1188, size: 64, align: 64, offset: 3648)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !897, line: 36, baseType: !1190)
!1190 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1124, file: !722, line: 593, baseType: !888, size: 32, align: 32, offset: 3712)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1124, file: !722, line: 596, baseType: !888, size: 32, align: 32, offset: 3744)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1124, file: !722, line: 599, baseType: !1092, size: 64, align: 64, offset: 3776)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1124, file: !722, line: 605, baseType: !1092, size: 64, align: 64, offset: 3840)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1124, file: !722, line: 616, baseType: !1092, size: 64, align: 64, offset: 3904)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1124, file: !722, line: 626, baseType: !1197, size: 64, align: 64, offset: 3968)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1198, line: 216, baseType: !992)
!1198 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1124, file: !722, line: 627, baseType: !1197, size: 64, align: 64, offset: 4032)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1124, file: !722, line: 628, baseType: !1197, size: 64, align: 64, offset: 4096)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1124, file: !722, line: 629, baseType: !1197, size: 64, align: 64, offset: 4160)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1124, file: !722, line: 645, baseType: !1092, size: 64, align: 64, offset: 4224)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64, align: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !963, file: !14, line: 3566, baseType: !1205, size: 64, align: 64, offset: 1408)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DISubroutineType(types: !1207)
!1207 = !{!888, !909, !927, !1203, !1087}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !963, file: !14, line: 3567, baseType: !1008, size: 64, align: 64, offset: 1472)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !963, file: !14, line: 3576, baseType: !1210, size: 64, align: 64, offset: 1536)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!888, !909, !1121}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !963, file: !14, line: 3577, baseType: !1214, size: 64, align: 64, offset: 1600)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!888, !909, !1087}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !963, file: !14, line: 3584, baseType: !1218, size: 64, align: 64, offset: 1664)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!888, !909, !1221}
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !963, file: !14, line: 3589, baseType: !1223, size: 64, align: 64, offset: 1728)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DISubroutineType(types: !1225)
!1225 = !{null, !909}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !963, file: !14, line: 3594, baseType: !888, size: 32, align: 32, offset: 1792)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !963, file: !14, line: 3600, baseType: !920, size: 64, align: 64, offset: 1856)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !963, file: !14, line: 3609, baseType: !1229, size: 64, align: 64, offset: 1920)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64, align: 64)
!1231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1232)
!1232 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !911, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !911, file: !14, line: 1581, baseType: !889, size: 32, align: 32, offset: 224)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !911, file: !14, line: 1583, baseType: !927, size: 64, align: 64, offset: 256)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !911, file: !14, line: 1591, baseType: !1237, size: 64, align: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1022, line: 129, size: 1664, align: 64, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1262, !1263, !1269, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1238, file: !1022, line: 136, baseType: !888, size: 32, align: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1238, file: !1022, line: 151, baseType: !888, size: 32, align: 32, offset: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1238, file: !1022, line: 157, baseType: !888, size: 32, align: 32, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1238, file: !1022, line: 159, baseType: !1221, size: 64, align: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1238, file: !1022, line: 161, baseType: !1245, size: 64, align: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1022, line: 117, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1022, line: 100, size: 832, align: 64, elements: !1248)
!1248 = !{!1249, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1247, file: !1022, line: 105, baseType: !1250, size: 256, align: 64)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1251, size: 256, align: 64, elements: !1071)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1094, line: 238, baseType: !1253)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1094, line: 238, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1247, file: !1022, line: 110, baseType: !888, size: 32, align: 32, offset: 256)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1247, file: !1022, line: 111, baseType: !888, size: 32, align: 32, offset: 288)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1247, file: !1022, line: 111, baseType: !888, size: 32, align: 32, offset: 320)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1247, file: !1022, line: 112, baseType: !1068, size: 256, align: 32, offset: 352)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1247, file: !1022, line: 113, baseType: !1074, size: 128, align: 32, offset: 608)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1247, file: !1022, line: 114, baseType: !888, size: 32, align: 32, offset: 736)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1247, file: !1022, line: 115, baseType: !888, size: 32, align: 32, offset: 768)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1247, file: !1022, line: 116, baseType: !888, size: 32, align: 32, offset: 800)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1238, file: !1022, line: 163, baseType: !927, size: 64, align: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1238, file: !1022, line: 165, baseType: !1264, size: 128, align: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1022, line: 122, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1022, line: 119, size: 128, align: 64, elements: !1266)
!1266 = !{!1267, !1268}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1265, file: !1022, line: 120, baseType: !1087, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1265, file: !1022, line: 121, baseType: !1221, size: 64, align: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1238, file: !1022, line: 166, baseType: !1270, size: 128, align: 64, offset: 448)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1022, line: 127, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1022, line: 124, size: 128, align: 64, elements: !1272)
!1272 = !{!1273, !1346}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1271, file: !1022, line: 125, baseType: !1274, size: 64, align: 64)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1278)
!1278 = !{!1279, !1280, !1304, !1308, !1309, !1343, !1344, !1345}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1277, file: !14, line: 5751, baseType: !914, size: 64, align: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1277, file: !14, line: 5756, baseType: !1281, size: 64, align: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1284)
!1284 = !{!1285, !1286, !1289, !1290, !1291, !1295, !1299, !1303}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1283, file: !14, line: 5797, baseType: !920, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1283, file: !14, line: 5804, baseType: !1287, size: 64, align: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64, align: 64)
!1288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1283, file: !14, line: 5815, baseType: !914, size: 64, align: 64, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1283, file: !14, line: 5825, baseType: !888, size: 32, align: 32, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1283, file: !14, line: 5826, baseType: !1292, size: 64, align: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1293 = !DISubroutineType(types: !1294)
!1294 = !{!888, !1275}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1283, file: !14, line: 5827, baseType: !1296, size: 64, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64, align: 64)
!1297 = !DISubroutineType(types: !1298)
!1298 = !{!888, !1275, !1087}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1283, file: !14, line: 5828, baseType: !1300, size: 64, align: 64, offset: 384)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{null, !1275}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1283, file: !14, line: 5829, baseType: !1300, size: 64, align: 64, offset: 448)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1277, file: !14, line: 5762, baseType: !1305, size: 64, align: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1307)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1277, file: !14, line: 5768, baseType: !927, size: 64, align: 64, offset: 192)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1277, file: !14, line: 5775, baseType: !1310, size: 64, align: 64, offset: 256)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1313)
!1313 = !{!1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1312, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1312, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1312, file: !14, line: 3948, baseType: !896, size: 32, align: 32, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1312, file: !14, line: 3958, baseType: !1037, size: 64, align: 64, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1312, file: !14, line: 3962, baseType: !888, size: 32, align: 32, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1312, file: !14, line: 3968, baseType: !888, size: 32, align: 32, offset: 224)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1312, file: !14, line: 3973, baseType: !1081, size: 64, align: 64, offset: 256)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1312, file: !14, line: 3986, baseType: !888, size: 32, align: 32, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1312, file: !14, line: 3999, baseType: !888, size: 32, align: 32, offset: 352)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1312, file: !14, line: 4004, baseType: !888, size: 32, align: 32, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1312, file: !14, line: 4005, baseType: !888, size: 32, align: 32, offset: 416)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1312, file: !14, line: 4010, baseType: !888, size: 32, align: 32, offset: 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1312, file: !14, line: 4011, baseType: !888, size: 32, align: 32, offset: 480)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1312, file: !14, line: 4020, baseType: !973, size: 64, align: 32, offset: 512)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1312, file: !14, line: 4025, baseType: !852, size: 32, align: 32, offset: 576)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1312, file: !14, line: 4030, baseType: !745, size: 32, align: 32, offset: 608)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1312, file: !14, line: 4031, baseType: !751, size: 32, align: 32, offset: 640)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1312, file: !14, line: 4032, baseType: !769, size: 32, align: 32, offset: 672)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1312, file: !14, line: 4033, baseType: !793, size: 32, align: 32, offset: 704)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1312, file: !14, line: 4034, baseType: !812, size: 32, align: 32, offset: 736)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1312, file: !14, line: 4039, baseType: !888, size: 32, align: 32, offset: 768)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1312, file: !14, line: 4046, baseType: !991, size: 64, align: 64, offset: 832)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1312, file: !14, line: 4050, baseType: !888, size: 32, align: 32, offset: 896)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1312, file: !14, line: 4054, baseType: !888, size: 32, align: 32, offset: 928)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1312, file: !14, line: 4061, baseType: !888, size: 32, align: 32, offset: 960)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1312, file: !14, line: 4065, baseType: !888, size: 32, align: 32, offset: 992)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1312, file: !14, line: 4073, baseType: !888, size: 32, align: 32, offset: 1024)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1312, file: !14, line: 4080, baseType: !888, size: 32, align: 32, offset: 1056)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1312, file: !14, line: 4084, baseType: !888, size: 32, align: 32, offset: 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1277, file: !14, line: 5781, baseType: !1310, size: 64, align: 64, offset: 320)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1277, file: !14, line: 5787, baseType: !973, size: 64, align: 32, offset: 384)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1277, file: !14, line: 5793, baseType: !973, size: 64, align: 32, offset: 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1271, file: !1022, line: 126, baseType: !888, size: 32, align: 32, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1238, file: !1022, line: 172, baseType: !1087, size: 64, align: 64, offset: 576)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1238, file: !1022, line: 177, baseType: !1037, size: 64, align: 64, offset: 640)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1238, file: !1022, line: 178, baseType: !889, size: 32, align: 32, offset: 704)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1238, file: !1022, line: 180, baseType: !927, size: 64, align: 64, offset: 768)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1238, file: !1022, line: 185, baseType: !888, size: 32, align: 32, offset: 832)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1238, file: !1022, line: 190, baseType: !927, size: 64, align: 64, offset: 896)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1238, file: !1022, line: 195, baseType: !888, size: 32, align: 32, offset: 960)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1238, file: !1022, line: 200, baseType: !1087, size: 64, align: 64, offset: 1024)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1238, file: !1022, line: 201, baseType: !888, size: 32, align: 32, offset: 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1238, file: !1022, line: 202, baseType: !1221, size: 64, align: 64, offset: 1152)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1238, file: !1022, line: 203, baseType: !888, size: 32, align: 32, offset: 1216)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1238, file: !1022, line: 205, baseType: !888, size: 32, align: 32, offset: 1248)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1238, file: !1022, line: 206, baseType: !888, size: 32, align: 32, offset: 1280)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1238, file: !1022, line: 209, baseType: !1197, size: 64, align: 64, offset: 1344)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1238, file: !1022, line: 212, baseType: !1197, size: 64, align: 64, offset: 1408)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1238, file: !1022, line: 213, baseType: !1221, size: 64, align: 64, offset: 1472)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1238, file: !1022, line: 215, baseType: !888, size: 32, align: 32, offset: 1536)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1238, file: !1022, line: 217, baseType: !888, size: 32, align: 32, offset: 1568)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1238, file: !1022, line: 220, baseType: !888, size: 32, align: 32, offset: 1600)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !911, file: !14, line: 1598, baseType: !927, size: 64, align: 64, offset: 384)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !911, file: !14, line: 1606, baseType: !1081, size: 64, align: 64, offset: 448)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !911, file: !14, line: 1614, baseType: !888, size: 32, align: 32, offset: 512)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !911, file: !14, line: 1622, baseType: !888, size: 32, align: 32, offset: 544)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !911, file: !14, line: 1628, baseType: !888, size: 32, align: 32, offset: 576)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !911, file: !14, line: 1636, baseType: !888, size: 32, align: 32, offset: 608)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !911, file: !14, line: 1643, baseType: !888, size: 32, align: 32, offset: 640)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !911, file: !14, line: 1657, baseType: !1037, size: 64, align: 64, offset: 704)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !911, file: !14, line: 1658, baseType: !888, size: 32, align: 32, offset: 768)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !911, file: !14, line: 1679, baseType: !973, size: 64, align: 32, offset: 800)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !911, file: !14, line: 1688, baseType: !888, size: 32, align: 32, offset: 864)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !911, file: !14, line: 1712, baseType: !888, size: 32, align: 32, offset: 896)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !911, file: !14, line: 1729, baseType: !888, size: 32, align: 32, offset: 928)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !911, file: !14, line: 1729, baseType: !888, size: 32, align: 32, offset: 960)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !911, file: !14, line: 1744, baseType: !888, size: 32, align: 32, offset: 992)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !911, file: !14, line: 1744, baseType: !888, size: 32, align: 32, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !911, file: !14, line: 1751, baseType: !888, size: 32, align: 32, offset: 1056)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !911, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !911, file: !14, line: 1791, baseType: !1385, size: 64, align: 64, offset: 1152)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DISubroutineType(types: !1387)
!1387 = !{null, !1388, !1121, !1203, !888, !888, !888}
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64, align: 64)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !911, file: !14, line: 1808, baseType: !1390, size: 64, align: 64, offset: 1216)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64, align: 64)
!1391 = !DISubroutineType(types: !1392)
!1392 = !{!473, !1388, !980}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !911, file: !14, line: 1816, baseType: !888, size: 32, align: 32, offset: 1280)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !911, file: !14, line: 1825, baseType: !1395, size: 32, align: 32, offset: 1312)
!1395 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !911, file: !14, line: 1830, baseType: !888, size: 32, align: 32, offset: 1344)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !911, file: !14, line: 1838, baseType: !1395, size: 32, align: 32, offset: 1376)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !911, file: !14, line: 1846, baseType: !888, size: 32, align: 32, offset: 1408)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !911, file: !14, line: 1851, baseType: !888, size: 32, align: 32, offset: 1440)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !911, file: !14, line: 1861, baseType: !1395, size: 32, align: 32, offset: 1472)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !911, file: !14, line: 1868, baseType: !1395, size: 32, align: 32, offset: 1504)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !911, file: !14, line: 1875, baseType: !1395, size: 32, align: 32, offset: 1536)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !911, file: !14, line: 1882, baseType: !1395, size: 32, align: 32, offset: 1568)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !911, file: !14, line: 1889, baseType: !1395, size: 32, align: 32, offset: 1600)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !911, file: !14, line: 1896, baseType: !1395, size: 32, align: 32, offset: 1632)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !911, file: !14, line: 1903, baseType: !1395, size: 32, align: 32, offset: 1664)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !911, file: !14, line: 1910, baseType: !888, size: 32, align: 32, offset: 1696)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !911, file: !14, line: 1915, baseType: !888, size: 32, align: 32, offset: 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !911, file: !14, line: 1926, baseType: !1203, size: 64, align: 64, offset: 1792)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !911, file: !14, line: 1935, baseType: !973, size: 64, align: 32, offset: 1856)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !911, file: !14, line: 1942, baseType: !888, size: 32, align: 32, offset: 1920)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !911, file: !14, line: 1948, baseType: !888, size: 32, align: 32, offset: 1952)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !911, file: !14, line: 1954, baseType: !888, size: 32, align: 32, offset: 1984)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !911, file: !14, line: 1960, baseType: !888, size: 32, align: 32, offset: 2016)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !911, file: !14, line: 1984, baseType: !888, size: 32, align: 32, offset: 2048)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !911, file: !14, line: 1991, baseType: !888, size: 32, align: 32, offset: 2080)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !911, file: !14, line: 1996, baseType: !888, size: 32, align: 32, offset: 2112)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !911, file: !14, line: 2004, baseType: !888, size: 32, align: 32, offset: 2144)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !911, file: !14, line: 2011, baseType: !888, size: 32, align: 32, offset: 2176)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !911, file: !14, line: 2018, baseType: !888, size: 32, align: 32, offset: 2208)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !911, file: !14, line: 2027, baseType: !888, size: 32, align: 32, offset: 2240)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !911, file: !14, line: 2034, baseType: !888, size: 32, align: 32, offset: 2272)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !911, file: !14, line: 2044, baseType: !888, size: 32, align: 32, offset: 2304)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !911, file: !14, line: 2054, baseType: !1425, size: 64, align: 64, offset: 2368)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !911, file: !14, line: 2061, baseType: !1425, size: 64, align: 64, offset: 2432)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !911, file: !14, line: 2066, baseType: !888, size: 32, align: 32, offset: 2496)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !911, file: !14, line: 2070, baseType: !888, size: 32, align: 32, offset: 2528)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !911, file: !14, line: 2078, baseType: !888, size: 32, align: 32, offset: 2560)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !911, file: !14, line: 2085, baseType: !888, size: 32, align: 32, offset: 2592)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !911, file: !14, line: 2092, baseType: !888, size: 32, align: 32, offset: 2624)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !911, file: !14, line: 2099, baseType: !888, size: 32, align: 32, offset: 2656)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !911, file: !14, line: 2106, baseType: !888, size: 32, align: 32, offset: 2688)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !911, file: !14, line: 2113, baseType: !888, size: 32, align: 32, offset: 2720)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !911, file: !14, line: 2120, baseType: !888, size: 32, align: 32, offset: 2752)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !911, file: !14, line: 2125, baseType: !888, size: 32, align: 32, offset: 2784)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !911, file: !14, line: 2133, baseType: !888, size: 32, align: 32, offset: 2816)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !911, file: !14, line: 2140, baseType: !888, size: 32, align: 32, offset: 2848)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !911, file: !14, line: 2145, baseType: !888, size: 32, align: 32, offset: 2880)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !911, file: !14, line: 2153, baseType: !888, size: 32, align: 32, offset: 2912)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !911, file: !14, line: 2158, baseType: !888, size: 32, align: 32, offset: 2944)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !911, file: !14, line: 2166, baseType: !751, size: 32, align: 32, offset: 2976)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !911, file: !14, line: 2173, baseType: !769, size: 32, align: 32, offset: 3008)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !911, file: !14, line: 2180, baseType: !793, size: 32, align: 32, offset: 3040)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !911, file: !14, line: 2187, baseType: !745, size: 32, align: 32, offset: 3072)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !911, file: !14, line: 2194, baseType: !812, size: 32, align: 32, offset: 3104)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !911, file: !14, line: 2203, baseType: !888, size: 32, align: 32, offset: 3136)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !911, file: !14, line: 2209, baseType: !852, size: 32, align: 32, offset: 3168)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !911, file: !14, line: 2212, baseType: !888, size: 32, align: 32, offset: 3200)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !911, file: !14, line: 2213, baseType: !888, size: 32, align: 32, offset: 3232)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !911, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !911, file: !14, line: 2232, baseType: !888, size: 32, align: 32, offset: 3296)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !911, file: !14, line: 2243, baseType: !888, size: 32, align: 32, offset: 3328)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !911, file: !14, line: 2249, baseType: !888, size: 32, align: 32, offset: 3360)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !911, file: !14, line: 2256, baseType: !888, size: 32, align: 32, offset: 3392)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !911, file: !14, line: 2263, baseType: !991, size: 64, align: 64, offset: 3456)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !911, file: !14, line: 2270, baseType: !991, size: 64, align: 64, offset: 3520)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !911, file: !14, line: 2277, baseType: !860, size: 32, align: 32, offset: 3584)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !911, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !911, file: !14, line: 2367, baseType: !1461, size: 64, align: 64, offset: 3648)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64, align: 64)
!1462 = !DISubroutineType(types: !1463)
!1463 = !{!888, !1388, !1221, !888}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !911, file: !14, line: 2383, baseType: !888, size: 32, align: 32, offset: 3712)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !911, file: !14, line: 2386, baseType: !1395, size: 32, align: 32, offset: 3744)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !911, file: !14, line: 2387, baseType: !1395, size: 32, align: 32, offset: 3776)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !911, file: !14, line: 2394, baseType: !888, size: 32, align: 32, offset: 3808)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !911, file: !14, line: 2401, baseType: !888, size: 32, align: 32, offset: 3840)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !911, file: !14, line: 2408, baseType: !888, size: 32, align: 32, offset: 3872)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !911, file: !14, line: 2415, baseType: !888, size: 32, align: 32, offset: 3904)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !911, file: !14, line: 2422, baseType: !888, size: 32, align: 32, offset: 3936)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !911, file: !14, line: 2423, baseType: !1473, size: 64, align: 64, offset: 3968)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1475)
!1475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1476)
!1476 = !{!1477, !1478, !1479, !1480}
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1475, file: !14, line: 827, baseType: !888, size: 32, align: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1475, file: !14, line: 828, baseType: !888, size: 32, align: 32, offset: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1475, file: !14, line: 829, baseType: !888, size: 32, align: 32, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1475, file: !14, line: 830, baseType: !1395, size: 32, align: 32, offset: 96)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !911, file: !14, line: 2430, baseType: !1081, size: 64, align: 64, offset: 4032)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !911, file: !14, line: 2437, baseType: !1081, size: 64, align: 64, offset: 4096)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !911, file: !14, line: 2444, baseType: !1395, size: 32, align: 32, offset: 4160)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !911, file: !14, line: 2451, baseType: !1395, size: 32, align: 32, offset: 4192)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !911, file: !14, line: 2458, baseType: !888, size: 32, align: 32, offset: 4224)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !911, file: !14, line: 2469, baseType: !888, size: 32, align: 32, offset: 4256)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !911, file: !14, line: 2475, baseType: !888, size: 32, align: 32, offset: 4288)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !911, file: !14, line: 2481, baseType: !888, size: 32, align: 32, offset: 4320)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !911, file: !14, line: 2485, baseType: !888, size: 32, align: 32, offset: 4352)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !911, file: !14, line: 2489, baseType: !888, size: 32, align: 32, offset: 4384)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !911, file: !14, line: 2493, baseType: !888, size: 32, align: 32, offset: 4416)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !911, file: !14, line: 2501, baseType: !888, size: 32, align: 32, offset: 4448)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !911, file: !14, line: 2506, baseType: !888, size: 32, align: 32, offset: 4480)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !911, file: !14, line: 2510, baseType: !888, size: 32, align: 32, offset: 4512)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !911, file: !14, line: 2514, baseType: !1081, size: 64, align: 64, offset: 4544)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !911, file: !14, line: 2528, baseType: !1497, size: 64, align: 64, offset: 4608)
!1497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1498, size: 64, align: 64)
!1498 = !DISubroutineType(types: !1499)
!1499 = !{null, !1388, !927, !888, !888}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !911, file: !14, line: 2534, baseType: !888, size: 32, align: 32, offset: 4672)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !911, file: !14, line: 2545, baseType: !888, size: 32, align: 32, offset: 4704)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !911, file: !14, line: 2547, baseType: !888, size: 32, align: 32, offset: 4736)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !911, file: !14, line: 2549, baseType: !888, size: 32, align: 32, offset: 4768)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !911, file: !14, line: 2551, baseType: !888, size: 32, align: 32, offset: 4800)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !911, file: !14, line: 2553, baseType: !888, size: 32, align: 32, offset: 4832)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !911, file: !14, line: 2555, baseType: !888, size: 32, align: 32, offset: 4864)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !911, file: !14, line: 2557, baseType: !888, size: 32, align: 32, offset: 4896)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !911, file: !14, line: 2559, baseType: !888, size: 32, align: 32, offset: 4928)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !911, file: !14, line: 2563, baseType: !888, size: 32, align: 32, offset: 4960)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !911, file: !14, line: 2571, baseType: !1077, size: 64, align: 64, offset: 4992)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !911, file: !14, line: 2579, baseType: !1077, size: 64, align: 64, offset: 5056)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !911, file: !14, line: 2586, baseType: !888, size: 32, align: 32, offset: 5120)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !911, file: !14, line: 2615, baseType: !888, size: 32, align: 32, offset: 5152)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !911, file: !14, line: 2627, baseType: !888, size: 32, align: 32, offset: 5184)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !911, file: !14, line: 2637, baseType: !888, size: 32, align: 32, offset: 5216)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !911, file: !14, line: 2681, baseType: !888, size: 32, align: 32, offset: 5248)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !911, file: !14, line: 2709, baseType: !1081, size: 64, align: 64, offset: 5312)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !911, file: !14, line: 2716, baseType: !1519, size: 64, align: 64, offset: 5376)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1521)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1522)
!1522 = !{!1523, !1524, !1525, !1526, !1527, !1528, !1529, !1533, !1537, !1538, !1539, !1540, !1546, !1547, !1548, !1549, !1550}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1521, file: !14, line: 3642, baseType: !920, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1521, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1521, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1521, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1521, file: !14, line: 3669, baseType: !888, size: 32, align: 32, offset: 160)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1521, file: !14, line: 3682, baseType: !1218, size: 64, align: 64, offset: 192)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1521, file: !14, line: 3698, baseType: !1530, size: 64, align: 64, offset: 256)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DISubroutineType(types: !1532)
!1532 = !{!888, !909, !1025, !896}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1521, file: !14, line: 3712, baseType: !1534, size: 64, align: 64, offset: 320)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!888, !909, !888, !1025, !896}
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1521, file: !14, line: 3726, baseType: !1530, size: 64, align: 64, offset: 384)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1521, file: !14, line: 3737, baseType: !1008, size: 64, align: 64, offset: 448)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1521, file: !14, line: 3746, baseType: !888, size: 32, align: 32, offset: 512)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1521, file: !14, line: 3757, baseType: !1541, size: 64, align: 64, offset: 576)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{null, !1544}
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64, align: 64)
!1545 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1521, file: !14, line: 3766, baseType: !1008, size: 64, align: 64, offset: 640)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1521, file: !14, line: 3774, baseType: !1008, size: 64, align: 64, offset: 704)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1521, file: !14, line: 3780, baseType: !888, size: 32, align: 32, offset: 768)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1521, file: !14, line: 3785, baseType: !888, size: 32, align: 32, offset: 800)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1521, file: !14, line: 3795, baseType: !1551, size: 64, align: 64, offset: 832)
!1551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1552, size: 64, align: 64)
!1552 = !DISubroutineType(types: !1553)
!1553 = !{!888, !909, !1092}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !911, file: !14, line: 2728, baseType: !927, size: 64, align: 64, offset: 5440)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !911, file: !14, line: 2735, baseType: !1145, size: 512, align: 64, offset: 5504)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !911, file: !14, line: 2742, baseType: !888, size: 32, align: 32, offset: 6016)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !911, file: !14, line: 2755, baseType: !888, size: 32, align: 32, offset: 6048)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !911, file: !14, line: 2776, baseType: !888, size: 32, align: 32, offset: 6080)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !911, file: !14, line: 2783, baseType: !888, size: 32, align: 32, offset: 6112)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !911, file: !14, line: 2791, baseType: !888, size: 32, align: 32, offset: 6144)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !911, file: !14, line: 2802, baseType: !1221, size: 64, align: 64, offset: 6208)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !911, file: !14, line: 2811, baseType: !888, size: 32, align: 32, offset: 6272)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !911, file: !14, line: 2821, baseType: !888, size: 32, align: 32, offset: 6304)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !911, file: !14, line: 2830, baseType: !888, size: 32, align: 32, offset: 6336)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !911, file: !14, line: 2840, baseType: !888, size: 32, align: 32, offset: 6368)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !911, file: !14, line: 2851, baseType: !1567, size: 64, align: 64, offset: 6400)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{!888, !1388, !1570, !927, !1203, !888, !888}
!1570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1571, size: 64, align: 64)
!1571 = !DISubroutineType(types: !1572)
!1572 = !{!888, !1388, !927}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !911, file: !14, line: 2871, baseType: !1574, size: 64, align: 64, offset: 6464)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DISubroutineType(types: !1576)
!1576 = !{!888, !1388, !1577, !927, !1203, !888}
!1577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1578, size: 64, align: 64)
!1578 = !DISubroutineType(types: !1579)
!1579 = !{!888, !1388, !927, !888, !888}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !911, file: !14, line: 2878, baseType: !888, size: 32, align: 32, offset: 6528)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !911, file: !14, line: 2885, baseType: !888, size: 32, align: 32, offset: 6560)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !911, file: !14, line: 3005, baseType: !888, size: 32, align: 32, offset: 6592)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !911, file: !14, line: 3013, baseType: !872, size: 32, align: 32, offset: 6624)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !911, file: !14, line: 3020, baseType: !872, size: 32, align: 32, offset: 6656)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !911, file: !14, line: 3027, baseType: !872, size: 32, align: 32, offset: 6688)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !911, file: !14, line: 3037, baseType: !1037, size: 64, align: 64, offset: 6720)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !911, file: !14, line: 3038, baseType: !888, size: 32, align: 32, offset: 6784)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !911, file: !14, line: 3050, baseType: !991, size: 64, align: 64, offset: 6848)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !911, file: !14, line: 3065, baseType: !888, size: 32, align: 32, offset: 6912)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !911, file: !14, line: 3083, baseType: !888, size: 32, align: 32, offset: 6944)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !911, file: !14, line: 3092, baseType: !973, size: 64, align: 32, offset: 6976)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !911, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !911, file: !14, line: 3106, baseType: !973, size: 64, align: 32, offset: 7072)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !911, file: !14, line: 3113, baseType: !1595, size: 64, align: 64, offset: 7168)
!1595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1596, size: 64, align: 64)
!1596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1597)
!1597 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1598)
!1598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1599)
!1599 = !{!1600, !1601, !1602, !1603, !1604, !1605, !1608}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1598, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1598, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1598, file: !14, line: 720, baseType: !920, size: 64, align: 64, offset: 64)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1598, file: !14, line: 724, baseType: !920, size: 64, align: 64, offset: 128)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1598, file: !14, line: 728, baseType: !888, size: 32, align: 32, offset: 192)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1598, file: !14, line: 734, baseType: !1606, size: 64, align: 64, offset: 256)
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1598, file: !14, line: 739, baseType: !1609, size: 64, align: 64, offset: 320)
!1609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1610, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !911, file: !14, line: 3129, baseType: !1081, size: 64, align: 64, offset: 7232)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !911, file: !14, line: 3130, baseType: !1081, size: 64, align: 64, offset: 7296)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !911, file: !14, line: 3131, baseType: !1081, size: 64, align: 64, offset: 7360)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !911, file: !14, line: 3132, baseType: !1081, size: 64, align: 64, offset: 7424)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !911, file: !14, line: 3139, baseType: !1077, size: 64, align: 64, offset: 7488)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !911, file: !14, line: 3147, baseType: !888, size: 32, align: 32, offset: 7552)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !911, file: !14, line: 3165, baseType: !888, size: 32, align: 32, offset: 7584)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !911, file: !14, line: 3172, baseType: !888, size: 32, align: 32, offset: 7616)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !911, file: !14, line: 3180, baseType: !888, size: 32, align: 32, offset: 7648)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !911, file: !14, line: 3191, baseType: !1425, size: 64, align: 64, offset: 7680)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !911, file: !14, line: 3199, baseType: !1037, size: 64, align: 64, offset: 7744)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !911, file: !14, line: 3207, baseType: !1077, size: 64, align: 64, offset: 7808)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !911, file: !14, line: 3214, baseType: !889, size: 32, align: 32, offset: 7872)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !911, file: !14, line: 3224, baseType: !1110, size: 64, align: 64, offset: 7936)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !911, file: !14, line: 3225, baseType: !888, size: 32, align: 32, offset: 8000)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !911, file: !14, line: 3249, baseType: !1092, size: 64, align: 64, offset: 8064)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !911, file: !14, line: 3256, baseType: !888, size: 32, align: 32, offset: 8128)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !911, file: !14, line: 3271, baseType: !888, size: 32, align: 32, offset: 8160)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !911, file: !14, line: 3279, baseType: !1081, size: 64, align: 64, offset: 8192)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !911, file: !14, line: 3301, baseType: !1092, size: 64, align: 64, offset: 8256)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !911, file: !14, line: 3310, baseType: !888, size: 32, align: 32, offset: 8320)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !911, file: !14, line: 3337, baseType: !888, size: 32, align: 32, offset: 8352)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !911, file: !14, line: 3351, baseType: !888, size: 32, align: 32, offset: 8384)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !911, file: !14, line: 3359, baseType: !888, size: 32, align: 32, offset: 8416)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bdsp", scope: !906, file: !905, line: 50, baseType: !1636, size: 128, align: 64, offset: 64)
!1636 = !DIDerivedType(tag: DW_TAG_typedef, name: "BswapDSPContext", file: !1637, line: 27, baseType: !1638)
!1637 = !DIFile(filename: "libavcodec/bswapdsp.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BswapDSPContext", file: !1637, line: 24, size: 128, align: 64, elements: !1639)
!1639 = !{!1640, !1644}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "bswap_buf", scope: !1638, file: !1637, line: 25, baseType: !1641, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1642, size: 64, align: 64)
!1642 = !DISubroutineType(types: !1643)
!1643 = !{null, !900, !898, !888}
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "bswap16_buf", scope: !1638, file: !1637, line: 26, baseType: !1645, size: 64, align: 64, offset: 64)
!1645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1646, size: 64, align: 64)
!1646 = !DISubroutineType(types: !1647)
!1647 = !{null, !1425, !1648, !888}
!1648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64, align: 64)
!1649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "tmpbuf", scope: !906, file: !905, line: 51, baseType: !1037, size: 64, align: 64, offset: 192)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "tmpbuf_size", scope: !906, file: !905, line: 52, baseType: !888, size: 32, align: 32, offset: 256)
!1652 = !{!1653}
!1653 = distinct !DIGlobalVariable(name: "ff_fraps_decoder", scope: !0, file: !905, line: 341, type: !1654, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_fraps_decoder)
!1654 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !963)
!1655 = !{i32 2, !"Dwarf Version", i32 4}
!1656 = !{i32 2, !"Debug Info Version", i32 3}
!1657 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1658 = distinct !DISubprogram(name: "decode_init", scope: !905, file: !905, line: 61, type: !1009, isLocal: true, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1659)
!1659 = !{}
!1660 = !DILocalVariable(name: "avctx", arg: 1, scope: !1658, file: !905, line: 61, type: !909)
!1661 = !DIExpression()
!1662 = !DILocation(line: 61, column: 62, scope: !1658)
!1663 = !DILocalVariable(name: "s", scope: !1658, file: !905, line: 63, type: !1664)
!1664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!1665 = !DILocation(line: 63, column: 26, scope: !1658)
!1666 = !DILocation(line: 63, column: 30, scope: !1658)
!1667 = !DILocation(line: 63, column: 37, scope: !1658)
!1668 = !DILocation(line: 65, column: 16, scope: !1658)
!1669 = !DILocation(line: 65, column: 5, scope: !1658)
!1670 = !DILocation(line: 65, column: 8, scope: !1658)
!1671 = !DILocation(line: 65, column: 14, scope: !1658)
!1672 = !DILocation(line: 66, column: 5, scope: !1658)
!1673 = !DILocation(line: 66, column: 8, scope: !1658)
!1674 = !DILocation(line: 66, column: 15, scope: !1658)
!1675 = !DILocation(line: 68, column: 23, scope: !1658)
!1676 = !DILocation(line: 68, column: 26, scope: !1658)
!1677 = !DILocation(line: 68, column: 5, scope: !1658)
!1678 = !DILocation(line: 70, column: 5, scope: !1658)
