; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--movenccenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--movenccenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.MOVMuxCencContext = type { %struct.AVAESCTR*, i8*, i64, i64, i32, i32, i16, i64, i8*, i64 }
%struct.AVAESCTR = type opaque
%struct.AVIOContext = type { %struct.AVClass*, i8*, i32, i8*, i8*, i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i8*, i32)*, i64 (i8*, i64, i32)*, i64, i32, i32, i32, i64, i8*, i64 (i64, i8*, i32)*, i32, i32 (i8*, i32)*, i64 (i8*, i32, i64, i32)*, i32, i64, i32, i64, i32, i32, i32, i32, i8*, i8*, i32 (i8*, i8*, i32, i32, i64)*, i32, i32, i64, i32 (i8*)*, i64, i8*, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque
%union.unaligned_16 = type { i16 }
%union.unaligned_32 = type { i32 }

!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !34, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !34, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !{!917, !921, !928, !933}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64, align: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !919, line: 48, baseType: !920)
!919 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!920 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64, align: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !923, line: 222, size: 16, align: 8, elements: !924)
!923 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!924 = !{!925}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !922, file: !923, line: 222, baseType: !926, size: 16, align: 16)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !919, line: 49, baseType: !927)
!927 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!929 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !923, line: 221, size: 32, align: 8, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !929, file: !923, line: 221, baseType: !932, size: 32, align: 32)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !919, line: 51, baseType: !933)
!933 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!934 = !{i32 2, !"Dwarf Version", i32 4}
!935 = !{i32 2, !"Debug Info Version", i32 3}
!936 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!937 = distinct !DISubprogram(name: "ff_mov_cenc_write_packet", scope: !938, file: !938, line: 167, type: !939, isLocal: false, isDefinition: true, scopeLine: 169, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!938 = !DIFile(filename: "libavformat/movenccenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!939 = !DISubroutineType(types: !940)
!940 = !{!941, !942, !963, !1039, !941}
!941 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "MOVMuxCencContext", file: !944, line: 46, baseType: !945)
!944 = !DIFile(filename: "libavformat/movenccenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !944, line: 33, size: 576, align: 64, elements: !946)
!946 = !{!947, !951, !952, !956, !957, !958, !959, !960, !961, !962}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "aes_ctr", scope: !945, file: !944, line: 34, baseType: !948, size: 64, align: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64, align: 64)
!949 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVAESCTR", file: !950, line: 33, flags: DIFlagFwdDecl)
!950 = !DIFile(filename: "./libavutil/aes_ctr.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !DIDerivedType(tag: DW_TAG_member, name: "auxiliary_info", scope: !945, file: !944, line: 35, baseType: !917, size: 64, align: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "auxiliary_info_size", scope: !945, file: !944, line: 36, baseType: !953, size: 64, align: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !954, line: 216, baseType: !955)
!954 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!955 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "auxiliary_info_alloc_size", scope: !945, file: !944, line: 37, baseType: !953, size: 64, align: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "auxiliary_info_entries", scope: !945, file: !944, line: 38, baseType: !932, size: 32, align: 32, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "use_subsamples", scope: !945, file: !944, line: 41, baseType: !941, size: 32, align: 32, offset: 288)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "subsample_count", scope: !945, file: !944, line: 42, baseType: !926, size: 16, align: 16, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "auxiliary_info_subsample_start", scope: !945, file: !944, line: 43, baseType: !953, size: 64, align: 64, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "auxiliary_info_sizes", scope: !945, file: !944, line: 44, baseType: !917, size: 64, align: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "auxiliary_info_sizes_alloc_size", scope: !945, file: !944, line: 45, baseType: !953, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !25, line: 352, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !25, line: 161, size: 2112, align: 64, elements: !966)
!966 = !{!967, !1012, !1014, !1015, !1016, !1017, !1018, !1022, !1023, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1041, !1042, !1046, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1064, !1065, !1066, !1067, !1071, !1072, !1073}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !965, file: !25, line: 174, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !972)
!972 = !{!973, !977, !982, !986, !987, !988, !989, !993, !999, !1001, !1005}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !971, file: !4, line: 72, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !971, file: !4, line: 78, baseType: !978, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!974, !981}
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !971, file: !4, line: 85, baseType: !983, size: 64, align: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64, align: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !971, file: !4, line: 93, baseType: !941, size: 32, align: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !971, file: !4, line: 99, baseType: !941, size: 32, align: 32, offset: 224)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !971, file: !4, line: 108, baseType: !941, size: 32, align: 32, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !971, file: !4, line: 113, baseType: !990, size: 64, align: 64, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!981, !981, !981}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !971, file: !4, line: 123, baseType: !994, size: 64, align: 64, offset: 384)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!997, !997}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !971, file: !4, line: 130, baseType: !1000, size: 32, align: 32, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !971, file: !4, line: 136, baseType: !1002, size: 64, align: 64, offset: 512)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64, align: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!1000, !981}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !971, file: !4, line: 142, baseType: !1006, size: 64, align: 64, offset: 576)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!941, !1009, !981, !974, !941}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !965, file: !25, line: 226, baseType: !1013, size: 64, align: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !965, file: !25, line: 227, baseType: !941, size: 32, align: 32, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !965, file: !25, line: 228, baseType: !1013, size: 64, align: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !965, file: !25, line: 229, baseType: !1013, size: 64, align: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !965, file: !25, line: 233, baseType: !981, size: 64, align: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !965, file: !25, line: 235, baseType: !1019, size: 64, align: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!941, !981, !917, !941}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !965, file: !25, line: 236, baseType: !1019, size: 64, align: 64, offset: 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !965, file: !25, line: 237, baseType: !1024, size: 64, align: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!1027, !981, !1027, !941}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !919, line: 40, baseType: !1028)
!1028 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !965, file: !25, line: 238, baseType: !1027, size: 64, align: 64, offset: 576)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !965, file: !25, line: 239, baseType: !941, size: 32, align: 32, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !965, file: !25, line: 240, baseType: !941, size: 32, align: 32, offset: 672)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !965, file: !25, line: 241, baseType: !941, size: 32, align: 32, offset: 704)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !965, file: !25, line: 242, baseType: !955, size: 64, align: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !965, file: !25, line: 243, baseType: !1013, size: 64, align: 64, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !965, file: !25, line: 244, baseType: !1036, size: 64, align: 64, offset: 896)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!955, !955, !1039, !933}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !965, file: !25, line: 245, baseType: !941, size: 32, align: 32, offset: 960)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !965, file: !25, line: 249, baseType: !1043, size: 64, align: 64, offset: 1024)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64, align: 64)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!941, !981, !941}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !965, file: !25, line: 255, baseType: !1047, size: 64, align: 64, offset: 1088)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64, align: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!1027, !981, !941, !1027, !941}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !965, file: !25, line: 260, baseType: !941, size: 32, align: 32, offset: 1152)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !965, file: !25, line: 266, baseType: !1027, size: 64, align: 64, offset: 1216)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !965, file: !25, line: 273, baseType: !941, size: 32, align: 32, offset: 1280)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !965, file: !25, line: 279, baseType: !1027, size: 64, align: 64, offset: 1344)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !965, file: !25, line: 285, baseType: !941, size: 32, align: 32, offset: 1408)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !965, file: !25, line: 291, baseType: !941, size: 32, align: 32, offset: 1440)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !965, file: !25, line: 298, baseType: !941, size: 32, align: 32, offset: 1472)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !965, file: !25, line: 304, baseType: !941, size: 32, align: 32, offset: 1504)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !965, file: !25, line: 309, baseType: !974, size: 64, align: 64, offset: 1536)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !965, file: !25, line: 314, baseType: !974, size: 64, align: 64, offset: 1600)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !965, file: !25, line: 319, baseType: !1061, size: 64, align: 64, offset: 1664)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!941, !981, !917, !941, !24, !1027}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !965, file: !25, line: 326, baseType: !941, size: 32, align: 32, offset: 1728)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !965, file: !25, line: 331, baseType: !24, size: 32, align: 32, offset: 1760)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !965, file: !25, line: 332, baseType: !1027, size: 64, align: 64, offset: 1792)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !965, file: !25, line: 338, baseType: !1068, size: 64, align: 64, offset: 1856)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!941, !981}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !965, file: !25, line: 340, baseType: !1027, size: 64, align: 64, offset: 1920)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !965, file: !25, line: 346, baseType: !1013, size: 64, align: 64, offset: 1984)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !965, file: !25, line: 351, baseType: !941, size: 32, align: 32, offset: 2048)
!1074 = !{}
!1075 = !DILocalVariable(name: "ctx", arg: 1, scope: !937, file: !938, line: 167, type: !942)
!1076 = !DIExpression()
!1077 = !DILocation(line: 167, column: 49, scope: !937)
!1078 = !DILocalVariable(name: "pb", arg: 2, scope: !937, file: !938, line: 167, type: !963)
!1079 = !DILocation(line: 167, column: 67, scope: !937)
!1080 = !DILocalVariable(name: "buf_in", arg: 3, scope: !937, file: !938, line: 168, type: !1039)
!1081 = !DILocation(line: 168, column: 42, scope: !937)
!1082 = !DILocalVariable(name: "size", arg: 4, scope: !937, file: !938, line: 168, type: !941)
!1083 = !DILocation(line: 168, column: 54, scope: !937)
!1084 = !DILocalVariable(name: "ret", scope: !937, file: !938, line: 170, type: !941)
!1085 = !DILocation(line: 170, column: 9, scope: !937)
!1086 = !DILocation(line: 172, column: 33, scope: !937)
!1087 = !DILocation(line: 172, column: 11, scope: !937)
!1088 = !DILocation(line: 172, column: 9, scope: !937)
!1089 = !DILocation(line: 173, column: 9, scope: !1090)
!1090 = distinct !DILexicalBlock(scope: !937, file: !938, line: 173, column: 9)
!1091 = !DILocation(line: 173, column: 9, scope: !937)
!1092 = !DILocation(line: 174, column: 16, scope: !1093)
!1093 = distinct !DILexicalBlock(scope: !1090, file: !938, line: 173, column: 14)
!1094 = !DILocation(line: 174, column: 9, scope: !1093)
!1095 = !DILocation(line: 177, column: 40, scope: !937)
!1096 = !DILocation(line: 177, column: 48, scope: !937)
!1097 = !DILocation(line: 177, column: 11, scope: !937)
!1098 = !DILocation(line: 177, column: 9, scope: !937)
!1099 = !DILocation(line: 178, column: 9, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !937, file: !938, line: 178, column: 9)
!1101 = !DILocation(line: 178, column: 9, scope: !937)
!1102 = !DILocation(line: 179, column: 16, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1100, file: !938, line: 178, column: 14)
!1104 = !DILocation(line: 179, column: 9, scope: !1103)
!1105 = !DILocation(line: 182, column: 30, scope: !937)
!1106 = !DILocation(line: 182, column: 35, scope: !937)
!1107 = !DILocation(line: 182, column: 39, scope: !937)
!1108 = !DILocation(line: 182, column: 47, scope: !937)
!1109 = !DILocation(line: 182, column: 5, scope: !937)
!1110 = !DILocation(line: 184, column: 31, scope: !937)
!1111 = !DILocation(line: 184, column: 11, scope: !937)
!1112 = !DILocation(line: 184, column: 9, scope: !937)
!1113 = !DILocation(line: 185, column: 9, scope: !1114)
!1114 = distinct !DILexicalBlock(scope: !937, file: !938, line: 185, column: 9)
!1115 = !DILocation(line: 185, column: 9, scope: !937)
!1116 = !DILocation(line: 186, column: 16, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1114, file: !938, line: 185, column: 14)
!1118 = !DILocation(line: 186, column: 9, scope: !1117)
!1119 = !DILocation(line: 189, column: 5, scope: !937)
!1120 = !DILocation(line: 190, column: 1, scope: !937)
!1121 = distinct !DISubprogram(name: "mov_cenc_start_packet", scope: !938, file: !938, line: 109, type: !1122, isLocal: true, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!941, !942}
!1124 = !DILocalVariable(name: "ctx", arg: 1, scope: !1121, file: !938, line: 109, type: !942)
!1125 = !DILocation(line: 109, column: 53, scope: !1121)
!1126 = !DILocalVariable(name: "ret", scope: !1121, file: !938, line: 111, type: !941)
!1127 = !DILocation(line: 111, column: 9, scope: !1121)
!1128 = !DILocation(line: 114, column: 32, scope: !1121)
!1129 = !DILocation(line: 114, column: 55, scope: !1121)
!1130 = !DILocation(line: 114, column: 60, scope: !1121)
!1131 = !DILocation(line: 114, column: 37, scope: !1121)
!1132 = !DILocation(line: 114, column: 11, scope: !1133)
!1133 = !DILexicalBlockFile(scope: !1121, file: !938, discriminator: 1)
!1134 = !DILocation(line: 114, column: 9, scope: !1121)
!1135 = !DILocation(line: 115, column: 9, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1121, file: !938, line: 115, column: 9)
!1137 = !DILocation(line: 115, column: 9, scope: !1121)
!1138 = !DILocation(line: 116, column: 16, scope: !1139)
!1139 = distinct !DILexicalBlock(scope: !1136, file: !938, line: 115, column: 14)
!1140 = !DILocation(line: 116, column: 9, scope: !1139)
!1141 = !DILocation(line: 119, column: 10, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1121, file: !938, line: 119, column: 9)
!1143 = !DILocation(line: 119, column: 15, scope: !1142)
!1144 = !DILocation(line: 119, column: 9, scope: !1121)
!1145 = !DILocation(line: 120, column: 9, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1142, file: !938, line: 119, column: 31)
!1147 = !DILocation(line: 124, column: 43, scope: !1121)
!1148 = !DILocation(line: 124, column: 48, scope: !1121)
!1149 = !DILocation(line: 124, column: 5, scope: !1121)
!1150 = !DILocation(line: 124, column: 10, scope: !1121)
!1151 = !DILocation(line: 124, column: 41, scope: !1121)
!1152 = !DILocation(line: 125, column: 5, scope: !1121)
!1153 = !DILocation(line: 125, column: 10, scope: !1121)
!1154 = !DILocation(line: 125, column: 26, scope: !1121)
!1155 = !DILocation(line: 126, column: 32, scope: !1121)
!1156 = !DILocation(line: 126, column: 48, scope: !1121)
!1157 = !DILocation(line: 126, column: 53, scope: !1121)
!1158 = !DILocation(line: 126, column: 37, scope: !1121)
!1159 = !DILocation(line: 126, column: 11, scope: !1121)
!1160 = !DILocation(line: 126, column: 9, scope: !1121)
!1161 = !DILocation(line: 127, column: 9, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1121, file: !938, line: 127, column: 9)
!1163 = !DILocation(line: 127, column: 9, scope: !1121)
!1164 = !DILocation(line: 128, column: 16, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1162, file: !938, line: 127, column: 14)
!1166 = !DILocation(line: 128, column: 9, scope: !1165)
!1167 = !DILocation(line: 131, column: 5, scope: !1121)
!1168 = !DILocation(line: 132, column: 1, scope: !1121)
!1169 = distinct !DISubprogram(name: "auxiliary_info_add_subsample", scope: !938, file: !938, line: 58, type: !1170, isLocal: true, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!941, !942, !926, !932}
!1172 = !DILocalVariable(name: "x", arg: 1, scope: !1173, file: !1174, line: 66, type: !932)
!1173 = distinct !DISubprogram(name: "av_bswap32", scope: !1174, file: !1174, line: 66, type: !1175, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1174 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1175 = !DISubroutineType(types: !1176)
!1176 = !{!932, !932}
!1177 = !DILocation(line: 66, column: 98, scope: !1173, inlinedAt: !1178)
!1178 = distinct !DILocation(line: 78, column: 43, scope: !1169)
!1179 = !DILocalVariable(name: "x", arg: 1, scope: !1180, file: !1174, line: 58, type: !926)
!1180 = distinct !DISubprogram(name: "av_bswap16", scope: !1174, file: !1174, line: 58, type: !1181, isLocal: true, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1181 = !DISubroutineType(types: !1182)
!1182 = !{!926, !926}
!1183 = !DILocation(line: 58, column: 98, scope: !1180, inlinedAt: !1184)
!1184 = distinct !DILocation(line: 75, column: 43, scope: !1169)
!1185 = !DILocalVariable(name: "ctx", arg: 1, scope: !1169, file: !938, line: 58, type: !942)
!1186 = !DILocation(line: 58, column: 60, scope: !1169)
!1187 = !DILocalVariable(name: "clear_bytes", arg: 2, scope: !1169, file: !938, line: 59, type: !926)
!1188 = !DILocation(line: 59, column: 14, scope: !1169)
!1189 = !DILocalVariable(name: "encrypted_bytes", arg: 3, scope: !1169, file: !938, line: 59, type: !932)
!1190 = !DILocation(line: 59, column: 36, scope: !1169)
!1191 = !DILocalVariable(name: "p", scope: !1169, file: !938, line: 61, type: !917)
!1192 = !DILocation(line: 61, column: 14, scope: !1169)
!1193 = !DILocalVariable(name: "ret", scope: !1169, file: !938, line: 62, type: !941)
!1194 = !DILocation(line: 62, column: 9, scope: !1169)
!1195 = !DILocation(line: 64, column: 10, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1169, file: !938, line: 64, column: 9)
!1197 = !DILocation(line: 64, column: 15, scope: !1196)
!1198 = !DILocation(line: 64, column: 9, scope: !1169)
!1199 = !DILocation(line: 65, column: 9, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1196, file: !938, line: 64, column: 31)
!1201 = !DILocation(line: 68, column: 37, scope: !1169)
!1202 = !DILocation(line: 68, column: 11, scope: !1169)
!1203 = !DILocation(line: 68, column: 9, scope: !1169)
!1204 = !DILocation(line: 69, column: 9, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1169, file: !938, line: 69, column: 9)
!1206 = !DILocation(line: 69, column: 9, scope: !1169)
!1207 = !DILocation(line: 70, column: 16, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1205, file: !938, line: 69, column: 14)
!1209 = !DILocation(line: 70, column: 9, scope: !1208)
!1210 = !DILocation(line: 73, column: 9, scope: !1169)
!1211 = !DILocation(line: 73, column: 14, scope: !1169)
!1212 = !DILocation(line: 73, column: 31, scope: !1169)
!1213 = !DILocation(line: 73, column: 36, scope: !1169)
!1214 = !DILocation(line: 73, column: 29, scope: !1169)
!1215 = !DILocation(line: 73, column: 7, scope: !1169)
!1216 = !DILocation(line: 75, column: 54, scope: !1169)
!1217 = !DILocation(line: 75, column: 43, scope: !1169)
!1218 = !DILocation(line: 60, column: 9, scope: !1180, inlinedAt: !1184)
!1219 = !DILocation(line: 60, column: 10, scope: !1180, inlinedAt: !1184)
!1220 = !DILocation(line: 60, column: 18, scope: !1180, inlinedAt: !1184)
!1221 = !DILocation(line: 60, column: 19, scope: !1180, inlinedAt: !1184)
!1222 = !DILocation(line: 60, column: 15, scope: !1180, inlinedAt: !1184)
!1223 = !DILocation(line: 60, column: 8, scope: !1180, inlinedAt: !1184)
!1224 = !DILocation(line: 60, column: 6, scope: !1180, inlinedAt: !1184)
!1225 = !DILocation(line: 61, column: 12, scope: !1180, inlinedAt: !1184)
!1226 = !DILocation(line: 75, column: 32, scope: !1169)
!1227 = !DILocation(line: 75, column: 37, scope: !1169)
!1228 = !DILocation(line: 75, column: 40, scope: !1169)
!1229 = !DILocation(line: 76, column: 7, scope: !1169)
!1230 = !DILocation(line: 78, column: 54, scope: !1169)
!1231 = !DILocation(line: 78, column: 43, scope: !1169)
!1232 = !DILocation(line: 68, column: 16, scope: !1173, inlinedAt: !1178)
!1233 = !DILocation(line: 68, column: 19, scope: !1173, inlinedAt: !1178)
!1234 = !DILocation(line: 68, column: 24, scope: !1173, inlinedAt: !1178)
!1235 = !DILocation(line: 68, column: 38, scope: !1173, inlinedAt: !1178)
!1236 = !DILocation(line: 68, column: 41, scope: !1173, inlinedAt: !1178)
!1237 = !DILocation(line: 68, column: 46, scope: !1173, inlinedAt: !1178)
!1238 = !DILocation(line: 68, column: 34, scope: !1173, inlinedAt: !1178)
!1239 = !DILocation(line: 68, column: 57, scope: !1173, inlinedAt: !1178)
!1240 = !DILocation(line: 68, column: 69, scope: !1173, inlinedAt: !1178)
!1241 = !DILocation(line: 68, column: 72, scope: !1173, inlinedAt: !1178)
!1242 = !DILocation(line: 68, column: 79, scope: !1173, inlinedAt: !1178)
!1243 = !DILocation(line: 68, column: 84, scope: !1173, inlinedAt: !1178)
!1244 = !DILocation(line: 68, column: 99, scope: !1173, inlinedAt: !1178)
!1245 = !DILocation(line: 68, column: 102, scope: !1173, inlinedAt: !1178)
!1246 = !DILocation(line: 68, column: 109, scope: !1173, inlinedAt: !1178)
!1247 = !DILocation(line: 68, column: 114, scope: !1173, inlinedAt: !1178)
!1248 = !DILocation(line: 68, column: 94, scope: !1173, inlinedAt: !1178)
!1249 = !DILocation(line: 68, column: 63, scope: !1173, inlinedAt: !1178)
!1250 = !DILocation(line: 78, column: 32, scope: !1169)
!1251 = !DILocation(line: 78, column: 37, scope: !1169)
!1252 = !DILocation(line: 78, column: 40, scope: !1169)
!1253 = !DILocation(line: 80, column: 5, scope: !1169)
!1254 = !DILocation(line: 80, column: 10, scope: !1169)
!1255 = !DILocation(line: 80, column: 30, scope: !1169)
!1256 = !DILocation(line: 81, column: 5, scope: !1169)
!1257 = !DILocation(line: 81, column: 10, scope: !1169)
!1258 = !DILocation(line: 81, column: 25, scope: !1169)
!1259 = !DILocation(line: 83, column: 5, scope: !1169)
!1260 = !DILocation(line: 84, column: 1, scope: !1169)
!1261 = distinct !DISubprogram(name: "mov_cenc_write_encrypted", scope: !938, file: !938, line: 89, type: !1262, isLocal: true, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{null, !942, !963, !1039, !941}
!1264 = !DILocalVariable(name: "ctx", arg: 1, scope: !1261, file: !938, line: 89, type: !942)
!1265 = !DILocation(line: 89, column: 57, scope: !1261)
!1266 = !DILocalVariable(name: "pb", arg: 2, scope: !1261, file: !938, line: 89, type: !963)
!1267 = !DILocation(line: 89, column: 75, scope: !1261)
!1268 = !DILocalVariable(name: "buf_in", arg: 3, scope: !1261, file: !938, line: 90, type: !1039)
!1269 = !DILocation(line: 90, column: 53, scope: !1261)
!1270 = !DILocalVariable(name: "size", arg: 4, scope: !1261, file: !938, line: 90, type: !941)
!1271 = !DILocation(line: 90, column: 65, scope: !1261)
!1272 = !DILocalVariable(name: "chunk", scope: !1261, file: !938, line: 92, type: !1273)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 32768, align: 8, elements: !1274)
!1274 = !{!1275}
!1275 = !DISubrange(count: 4096)
!1276 = !DILocation(line: 92, column: 13, scope: !1261)
!1277 = !DILocalVariable(name: "cur_pos", scope: !1261, file: !938, line: 93, type: !1039)
!1278 = !DILocation(line: 93, column: 20, scope: !1261)
!1279 = !DILocation(line: 93, column: 30, scope: !1261)
!1280 = !DILocalVariable(name: "size_left", scope: !1261, file: !938, line: 94, type: !941)
!1281 = !DILocation(line: 94, column: 9, scope: !1261)
!1282 = !DILocation(line: 94, column: 21, scope: !1261)
!1283 = !DILocalVariable(name: "cur_size", scope: !1261, file: !938, line: 95, type: !941)
!1284 = !DILocation(line: 95, column: 9, scope: !1261)
!1285 = !DILocation(line: 97, column: 5, scope: !1261)
!1286 = !DILocation(line: 97, column: 12, scope: !1287)
!1287 = !DILexicalBlockFile(scope: !1261, file: !938, discriminator: 1)
!1288 = !DILocation(line: 97, column: 22, scope: !1287)
!1289 = !DILocation(line: 97, column: 5, scope: !1287)
!1290 = !DILocation(line: 98, column: 22, scope: !1291)
!1291 = distinct !DILexicalBlock(scope: !1261, file: !938, line: 97, column: 27)
!1292 = !DILocation(line: 98, column: 21, scope: !1291)
!1293 = !DILocation(line: 98, column: 33, scope: !1291)
!1294 = !DILocation(line: 98, column: 21, scope: !1295)
!1295 = !DILexicalBlockFile(scope: !1291, file: !938, discriminator: 1)
!1296 = !DILocation(line: 98, column: 72, scope: !1297)
!1297 = !DILexicalBlockFile(scope: !1291, file: !938, discriminator: 2)
!1298 = !DILocation(line: 98, column: 71, scope: !1297)
!1299 = !DILocation(line: 98, column: 21, scope: !1297)
!1300 = !DILocation(line: 98, column: 21, scope: !1301)
!1301 = !DILexicalBlockFile(scope: !1291, file: !938, discriminator: 3)
!1302 = !DILocation(line: 98, column: 20, scope: !1301)
!1303 = !DILocation(line: 98, column: 18, scope: !1301)
!1304 = !DILocation(line: 99, column: 26, scope: !1291)
!1305 = !DILocation(line: 99, column: 31, scope: !1291)
!1306 = !DILocation(line: 99, column: 40, scope: !1291)
!1307 = !DILocation(line: 99, column: 47, scope: !1291)
!1308 = !DILocation(line: 99, column: 56, scope: !1291)
!1309 = !DILocation(line: 99, column: 9, scope: !1291)
!1310 = !DILocation(line: 100, column: 20, scope: !1291)
!1311 = !DILocation(line: 100, column: 24, scope: !1291)
!1312 = !DILocation(line: 100, column: 31, scope: !1291)
!1313 = !DILocation(line: 100, column: 9, scope: !1291)
!1314 = !DILocation(line: 101, column: 20, scope: !1291)
!1315 = !DILocation(line: 101, column: 17, scope: !1291)
!1316 = !DILocation(line: 102, column: 22, scope: !1291)
!1317 = !DILocation(line: 102, column: 19, scope: !1291)
!1318 = !DILocation(line: 97, column: 5, scope: !1319)
!1319 = !DILexicalBlockFile(scope: !1261, file: !938, discriminator: 2)
!1320 = distinct !{!1320, !1285}
!1321 = !DILocation(line: 104, column: 1, scope: !1261)
!1322 = distinct !DISubprogram(name: "mov_cenc_end_packet", scope: !938, file: !938, line: 137, type: !1122, isLocal: true, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1323 = !DILocation(line: 58, column: 98, scope: !1180, inlinedAt: !1324)
!1324 = distinct !DILocation(line: 162, column: 99, scope: !1322)
!1325 = !DILocalVariable(name: "ctx", arg: 1, scope: !1322, file: !938, line: 137, type: !942)
!1326 = !DILocation(line: 137, column: 51, scope: !1322)
!1327 = !DILocalVariable(name: "new_alloc_size", scope: !1322, file: !938, line: 139, type: !953)
!1328 = !DILocation(line: 139, column: 12, scope: !1322)
!1329 = !DILocation(line: 141, column: 29, scope: !1322)
!1330 = !DILocation(line: 141, column: 34, scope: !1322)
!1331 = !DILocation(line: 141, column: 5, scope: !1322)
!1332 = !DILocation(line: 143, column: 10, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1322, file: !938, line: 143, column: 9)
!1334 = !DILocation(line: 143, column: 15, scope: !1333)
!1335 = !DILocation(line: 143, column: 9, scope: !1322)
!1336 = !DILocation(line: 144, column: 9, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1333, file: !938, line: 143, column: 31)
!1338 = !DILocation(line: 144, column: 14, scope: !1337)
!1339 = !DILocation(line: 144, column: 36, scope: !1337)
!1340 = !DILocation(line: 145, column: 9, scope: !1337)
!1341 = !DILocation(line: 149, column: 9, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1322, file: !938, line: 149, column: 9)
!1343 = !DILocation(line: 149, column: 14, scope: !1342)
!1344 = !DILocation(line: 149, column: 40, scope: !1342)
!1345 = !DILocation(line: 149, column: 45, scope: !1342)
!1346 = !DILocation(line: 149, column: 37, scope: !1342)
!1347 = !DILocation(line: 149, column: 9, scope: !1322)
!1348 = !DILocation(line: 150, column: 26, scope: !1349)
!1349 = distinct !DILexicalBlock(scope: !1342, file: !938, line: 149, column: 78)
!1350 = !DILocation(line: 150, column: 31, scope: !1349)
!1351 = !DILocation(line: 150, column: 54, scope: !1349)
!1352 = !DILocation(line: 150, column: 58, scope: !1349)
!1353 = !DILocation(line: 150, column: 24, scope: !1349)
!1354 = !DILocation(line: 151, column: 26, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1349, file: !938, line: 151, column: 13)
!1356 = !DILocation(line: 151, column: 31, scope: !1355)
!1357 = !DILocation(line: 151, column: 25, scope: !1355)
!1358 = !DILocation(line: 151, column: 53, scope: !1355)
!1359 = !DILocation(line: 151, column: 13, scope: !1355)
!1360 = !DILocation(line: 151, column: 13, scope: !1349)
!1361 = !DILocation(line: 152, column: 13, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1355, file: !938, line: 151, column: 70)
!1363 = !DILocation(line: 155, column: 48, scope: !1349)
!1364 = !DILocation(line: 155, column: 9, scope: !1349)
!1365 = !DILocation(line: 155, column: 14, scope: !1349)
!1366 = !DILocation(line: 155, column: 46, scope: !1349)
!1367 = !DILocation(line: 156, column: 5, scope: !1349)
!1368 = !DILocation(line: 158, column: 15, scope: !1322)
!1369 = !DILocation(line: 158, column: 20, scope: !1322)
!1370 = !DILocation(line: 158, column: 13, scope: !1322)
!1371 = !DILocation(line: 158, column: 42, scope: !1322)
!1372 = !DILocation(line: 158, column: 47, scope: !1322)
!1373 = !DILocation(line: 158, column: 40, scope: !1322)
!1374 = !DILocation(line: 158, column: 9, scope: !1322)
!1375 = !DILocation(line: 157, column: 31, scope: !1322)
!1376 = !DILocation(line: 157, column: 36, scope: !1322)
!1377 = !DILocation(line: 157, column: 5, scope: !1322)
!1378 = !DILocation(line: 157, column: 10, scope: !1322)
!1379 = !DILocation(line: 157, column: 60, scope: !1322)
!1380 = !DILocation(line: 159, column: 5, scope: !1322)
!1381 = !DILocation(line: 159, column: 10, scope: !1322)
!1382 = !DILocation(line: 159, column: 32, scope: !1322)
!1383 = !DILocation(line: 162, column: 110, scope: !1322)
!1384 = !DILocation(line: 162, column: 115, scope: !1322)
!1385 = !DILocation(line: 162, column: 99, scope: !1322)
!1386 = !DILocation(line: 60, column: 9, scope: !1180, inlinedAt: !1324)
!1387 = !DILocation(line: 60, column: 10, scope: !1180, inlinedAt: !1324)
!1388 = !DILocation(line: 60, column: 18, scope: !1180, inlinedAt: !1324)
!1389 = !DILocation(line: 60, column: 19, scope: !1180, inlinedAt: !1324)
!1390 = !DILocation(line: 60, column: 15, scope: !1180, inlinedAt: !1324)
!1391 = !DILocation(line: 60, column: 8, scope: !1180, inlinedAt: !1324)
!1392 = !DILocation(line: 60, column: 6, scope: !1180, inlinedAt: !1324)
!1393 = !DILocation(line: 61, column: 12, scope: !1180, inlinedAt: !1324)
!1394 = !DILocation(line: 162, column: 32, scope: !1322)
!1395 = !DILocation(line: 162, column: 37, scope: !1322)
!1396 = !DILocation(line: 162, column: 54, scope: !1322)
!1397 = !DILocation(line: 162, column: 59, scope: !1322)
!1398 = !DILocation(line: 162, column: 52, scope: !1322)
!1399 = !DILocation(line: 162, column: 93, scope: !1322)
!1400 = !DILocation(line: 162, column: 96, scope: !1322)
!1401 = !DILocation(line: 164, column: 5, scope: !1322)
!1402 = !DILocation(line: 165, column: 1, scope: !1322)
!1403 = distinct !DISubprogram(name: "ff_mov_cenc_avc_parse_nal_units", scope: !938, file: !938, line: 192, type: !939, isLocal: false, isDefinition: true, scopeLine: 194, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1404 = !DILocalVariable(name: "ctx", arg: 1, scope: !1403, file: !938, line: 192, type: !942)
!1405 = !DILocation(line: 192, column: 56, scope: !1403)
!1406 = !DILocalVariable(name: "pb", arg: 2, scope: !1403, file: !938, line: 192, type: !963)
!1407 = !DILocation(line: 192, column: 74, scope: !1403)
!1408 = !DILocalVariable(name: "buf_in", arg: 3, scope: !1403, file: !938, line: 193, type: !1039)
!1409 = !DILocation(line: 193, column: 49, scope: !1403)
!1410 = !DILocalVariable(name: "size", arg: 4, scope: !1403, file: !938, line: 193, type: !941)
!1411 = !DILocation(line: 193, column: 61, scope: !1403)
!1412 = !DILocalVariable(name: "p", scope: !1403, file: !938, line: 195, type: !1039)
!1413 = !DILocation(line: 195, column: 20, scope: !1403)
!1414 = !DILocation(line: 195, column: 24, scope: !1403)
!1415 = !DILocalVariable(name: "end", scope: !1403, file: !938, line: 196, type: !1039)
!1416 = !DILocation(line: 196, column: 20, scope: !1403)
!1417 = !DILocation(line: 196, column: 26, scope: !1403)
!1418 = !DILocation(line: 196, column: 30, scope: !1403)
!1419 = !DILocation(line: 196, column: 28, scope: !1403)
!1420 = !DILocalVariable(name: "nal_start", scope: !1403, file: !938, line: 197, type: !1039)
!1421 = !DILocation(line: 197, column: 20, scope: !1403)
!1422 = !DILocalVariable(name: "nal_end", scope: !1403, file: !938, line: 197, type: !1039)
!1423 = !DILocation(line: 197, column: 32, scope: !1403)
!1424 = !DILocalVariable(name: "ret", scope: !1403, file: !938, line: 198, type: !941)
!1425 = !DILocation(line: 198, column: 9, scope: !1403)
!1426 = !DILocation(line: 200, column: 33, scope: !1403)
!1427 = !DILocation(line: 200, column: 11, scope: !1403)
!1428 = !DILocation(line: 200, column: 9, scope: !1403)
!1429 = !DILocation(line: 201, column: 9, scope: !1430)
!1430 = distinct !DILexicalBlock(scope: !1403, file: !938, line: 201, column: 9)
!1431 = !DILocation(line: 201, column: 9, scope: !1403)
!1432 = !DILocation(line: 202, column: 16, scope: !1433)
!1433 = distinct !DILexicalBlock(scope: !1430, file: !938, line: 201, column: 14)
!1434 = !DILocation(line: 202, column: 9, scope: !1433)
!1435 = !DILocation(line: 205, column: 10, scope: !1403)
!1436 = !DILocation(line: 206, column: 39, scope: !1403)
!1437 = !DILocation(line: 206, column: 42, scope: !1403)
!1438 = !DILocation(line: 206, column: 17, scope: !1403)
!1439 = !DILocation(line: 206, column: 15, scope: !1403)
!1440 = !DILocation(line: 207, column: 5, scope: !1403)
!1441 = !DILocation(line: 208, column: 9, scope: !1442)
!1442 = distinct !DILexicalBlock(scope: !1443, file: !938, line: 207, column: 14)
!1443 = distinct !DILexicalBlock(scope: !1444, file: !938, line: 207, column: 5)
!1444 = distinct !DILexicalBlock(scope: !1403, file: !938, line: 207, column: 5)
!1445 = !DILocation(line: 208, column: 16, scope: !1446)
!1446 = !DILexicalBlockFile(scope: !1442, file: !938, discriminator: 1)
!1447 = !DILocation(line: 208, column: 28, scope: !1446)
!1448 = !DILocation(line: 208, column: 26, scope: !1446)
!1449 = !DILocation(line: 208, column: 32, scope: !1446)
!1450 = !DILocation(line: 208, column: 47, scope: !1451)
!1451 = !DILexicalBlockFile(scope: !1442, file: !938, discriminator: 2)
!1452 = !DILocation(line: 208, column: 36, scope: !1451)
!1453 = !DILocation(line: 208, column: 35, scope: !1451)
!1454 = !DILocation(line: 208, column: 9, scope: !1455)
!1455 = !DILexicalBlockFile(scope: !1442, file: !938, discriminator: 3)
!1456 = !DILocation(line: 208, column: 9, scope: !1457)
!1457 = !DILexicalBlockFile(scope: !1442, file: !938, discriminator: 4)
!1458 = distinct !{!1458, !1441}
!1459 = !DILocation(line: 209, column: 13, scope: !1460)
!1460 = distinct !DILexicalBlock(scope: !1442, file: !938, line: 209, column: 13)
!1461 = !DILocation(line: 209, column: 26, scope: !1460)
!1462 = !DILocation(line: 209, column: 23, scope: !1460)
!1463 = !DILocation(line: 209, column: 13, scope: !1442)
!1464 = !DILocation(line: 210, column: 13, scope: !1460)
!1465 = !DILocation(line: 212, column: 41, scope: !1442)
!1466 = !DILocation(line: 212, column: 52, scope: !1442)
!1467 = !DILocation(line: 212, column: 19, scope: !1442)
!1468 = !DILocation(line: 212, column: 17, scope: !1442)
!1469 = !DILocation(line: 214, column: 19, scope: !1442)
!1470 = !DILocation(line: 214, column: 23, scope: !1442)
!1471 = !DILocation(line: 214, column: 33, scope: !1442)
!1472 = !DILocation(line: 214, column: 31, scope: !1442)
!1473 = !DILocation(line: 214, column: 9, scope: !1442)
!1474 = !DILocation(line: 215, column: 17, scope: !1442)
!1475 = !DILocation(line: 215, column: 22, scope: !1442)
!1476 = !DILocation(line: 215, column: 21, scope: !1442)
!1477 = !DILocation(line: 215, column: 9, scope: !1442)
!1478 = !DILocation(line: 216, column: 34, scope: !1442)
!1479 = !DILocation(line: 216, column: 39, scope: !1442)
!1480 = !DILocation(line: 216, column: 43, scope: !1442)
!1481 = !DILocation(line: 216, column: 53, scope: !1442)
!1482 = !DILocation(line: 216, column: 58, scope: !1442)
!1483 = !DILocation(line: 216, column: 68, scope: !1442)
!1484 = !DILocation(line: 216, column: 66, scope: !1442)
!1485 = !DILocation(line: 216, column: 78, scope: !1442)
!1486 = !DILocation(line: 216, column: 9, scope: !1442)
!1487 = !DILocation(line: 218, column: 38, scope: !1442)
!1488 = !DILocation(line: 218, column: 46, scope: !1442)
!1489 = !DILocation(line: 218, column: 56, scope: !1442)
!1490 = !DILocation(line: 218, column: 54, scope: !1442)
!1491 = !DILocation(line: 218, column: 66, scope: !1442)
!1492 = !DILocation(line: 218, column: 9, scope: !1442)
!1493 = !DILocation(line: 220, column: 21, scope: !1442)
!1494 = !DILocation(line: 220, column: 19, scope: !1442)
!1495 = !DILocation(line: 220, column: 31, scope: !1442)
!1496 = !DILocation(line: 220, column: 29, scope: !1442)
!1497 = !DILocation(line: 220, column: 14, scope: !1442)
!1498 = !DILocation(line: 221, column: 21, scope: !1442)
!1499 = !DILocation(line: 221, column: 19, scope: !1442)
!1500 = !DILocation(line: 207, column: 5, scope: !1501)
!1501 = !DILexicalBlockFile(scope: !1443, file: !938, discriminator: 1)
!1502 = distinct !{!1502, !1440}
!1503 = !DILocation(line: 224, column: 31, scope: !1403)
!1504 = !DILocation(line: 224, column: 11, scope: !1403)
!1505 = !DILocation(line: 224, column: 9, scope: !1403)
!1506 = !DILocation(line: 225, column: 9, scope: !1507)
!1507 = distinct !DILexicalBlock(scope: !1403, file: !938, line: 225, column: 9)
!1508 = !DILocation(line: 225, column: 9, scope: !1403)
!1509 = !DILocation(line: 226, column: 16, scope: !1510)
!1510 = distinct !DILexicalBlock(scope: !1507, file: !938, line: 225, column: 14)
!1511 = !DILocation(line: 226, column: 9, scope: !1510)
!1512 = !DILocation(line: 229, column: 12, scope: !1403)
!1513 = !DILocation(line: 229, column: 5, scope: !1403)
!1514 = !DILocation(line: 230, column: 1, scope: !1403)
!1515 = distinct !DISubprogram(name: "ff_mov_cenc_avc_write_nal_units", scope: !938, file: !938, line: 232, type: !1516, isLocal: false, isDefinition: true, scopeLine: 234, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1074)
!1516 = !DISubroutineType(types: !1517)
!1517 = !{!941, !1518, !942, !941, !963, !1039, !941}
!1518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1519, size: 64, align: 64)
!1519 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFormatContext", file: !897, line: 1947, baseType: !1520)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1521)
!1521 = !{!1522, !1523, !1626, !1771, !1772, !1773, !1774, !1775, !2404, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2458, !2459, !2460, !2461, !2462, !2468, !2469, !2470, !2471, !2472, !2473, !2474, !2475, !2476, !2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2493, !2494, !2497, !2498, !2499, !2500, !2501, !2502, !2504, !2505, !2506, !2507, !2515, !2516, !2520, !2524, !2525, !2526}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1520, file: !897, line: 1342, baseType: !968, size: 64, align: 64)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !1520, file: !897, line: 1349, baseType: !1524, size: 64, align: 64, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1526)
!1526 = !{!1527, !1528, !1529, !1530, !1531, !1537, !1538, !1539, !1540, !1541, !1542, !1554, !1559, !1597, !1598, !1602, !1607, !1608, !1609, !1613, !1619, !1625}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1525, file: !897, line: 638, baseType: !974, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1525, file: !897, line: 645, baseType: !974, size: 64, align: 64, offset: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1525, file: !897, line: 652, baseType: !941, size: 32, align: 32, offset: 128)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1525, file: !897, line: 659, baseType: !974, size: 64, align: 64, offset: 192)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1525, file: !897, line: 661, baseType: !1532, size: 64, align: 64, offset: 256)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1534)
!1534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1535, size: 64, align: 64)
!1535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1536)
!1536 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !897, line: 443, flags: DIFlagFwdDecl)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1525, file: !897, line: 663, baseType: !968, size: 64, align: 64, offset: 320)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1525, file: !897, line: 670, baseType: !974, size: 64, align: 64, offset: 384)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1525, file: !897, line: 679, baseType: !1524, size: 64, align: 64, offset: 448)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1525, file: !897, line: 684, baseType: !941, size: 32, align: 32, offset: 512)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1525, file: !897, line: 689, baseType: !941, size: 32, align: 32, offset: 544)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1525, file: !897, line: 696, baseType: !1543, size: 64, align: 64, offset: 576)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DISubroutineType(types: !1545)
!1545 = !{!941, !1546}
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1548)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1548, file: !897, line: 449, baseType: !974, size: 64, align: 64)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1548, file: !897, line: 450, baseType: !1013, size: 64, align: 64, offset: 64)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1548, file: !897, line: 451, baseType: !941, size: 32, align: 32, offset: 128)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1548, file: !897, line: 452, baseType: !974, size: 64, align: 64, offset: 192)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1525, file: !897, line: 703, baseType: !1555, size: 64, align: 64, offset: 640)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{!941, !1558}
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1525, file: !897, line: 714, baseType: !1560, size: 64, align: 64, offset: 704)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DISubroutineType(types: !1562)
!1562 = !{!941, !1558, !1563}
!1563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1564, size: 64, align: 64)
!1564 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !34, line: 1499, baseType: !1565)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !34, line: 1445, size: 704, align: 64, elements: !1566)
!1566 = !{!1567, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1593, !1594, !1595, !1596}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1565, file: !34, line: 1451, baseType: !1568, size: 64, align: 64)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64, align: 64)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1570, line: 94, baseType: !1571)
!1570 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1570, line: 81, size: 192, align: 64, elements: !1572)
!1572 = !{!1573, !1577, !1578}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1571, file: !1570, line: 82, baseType: !1574, size: 64, align: 64)
!1574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1575, size: 64, align: 64)
!1575 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1570, line: 73, baseType: !1576)
!1576 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1570, line: 73, flags: DIFlagFwdDecl)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1571, file: !1570, line: 89, baseType: !917, size: 64, align: 64, offset: 64)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1571, file: !1570, line: 93, baseType: !941, size: 32, align: 32, offset: 128)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1565, file: !34, line: 1461, baseType: !1027, size: 64, align: 64, offset: 64)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1565, file: !34, line: 1467, baseType: !1027, size: 64, align: 64, offset: 128)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1565, file: !34, line: 1468, baseType: !917, size: 64, align: 64, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1565, file: !34, line: 1469, baseType: !941, size: 32, align: 32, offset: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1565, file: !34, line: 1470, baseType: !941, size: 32, align: 32, offset: 288)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1565, file: !34, line: 1474, baseType: !941, size: 32, align: 32, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1565, file: !34, line: 1479, baseType: !1586, size: 64, align: 64, offset: 384)
!1586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1587, size: 64, align: 64)
!1587 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !34, line: 1415, baseType: !1588)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !34, line: 1411, size: 128, align: 64, elements: !1589)
!1589 = !{!1590, !1591, !1592}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1588, file: !34, line: 1412, baseType: !917, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1588, file: !34, line: 1413, baseType: !941, size: 32, align: 32, offset: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1588, file: !34, line: 1414, baseType: !33, size: 32, align: 32, offset: 96)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1565, file: !34, line: 1480, baseType: !941, size: 32, align: 32, offset: 448)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1565, file: !34, line: 1486, baseType: !1027, size: 64, align: 64, offset: 512)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1565, file: !34, line: 1488, baseType: !1027, size: 64, align: 64, offset: 576)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1565, file: !34, line: 1497, baseType: !1027, size: 64, align: 64, offset: 640)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1525, file: !897, line: 720, baseType: !1555, size: 64, align: 64, offset: 768)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1525, file: !897, line: 730, baseType: !1599, size: 64, align: 64, offset: 832)
!1599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1600, size: 64, align: 64)
!1600 = !DISubroutineType(types: !1601)
!1601 = !{!941, !1558, !941, !1027, !941}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1525, file: !897, line: 737, baseType: !1603, size: 64, align: 64, offset: 896)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{!1027, !1558, !941, !1606, !1027}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1525, file: !897, line: 744, baseType: !1555, size: 64, align: 64, offset: 960)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1525, file: !897, line: 750, baseType: !1555, size: 64, align: 64, offset: 1024)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1525, file: !897, line: 758, baseType: !1610, size: 64, align: 64, offset: 1088)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!941, !1558, !941, !1027, !1027, !1027, !941}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1525, file: !897, line: 764, baseType: !1614, size: 64, align: 64, offset: 1152)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{!941, !1558, !1617}
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1525, file: !897, line: 770, baseType: !1620, size: 64, align: 64, offset: 1216)
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DISubroutineType(types: !1622)
!1622 = !{!941, !1558, !1623}
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64, align: 64)
!1624 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1525, file: !897, line: 776, baseType: !1620, size: 64, align: 64, offset: 1280)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !1520, file: !897, line: 1356, baseType: !1627, size: 64, align: 64, offset: 128)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1649, !1653, !1657, !1661, !1756, !1757, !1758, !1759, !1760, !1761, !1765}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1628, file: !897, line: 498, baseType: !974, size: 64, align: 64)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1628, file: !897, line: 504, baseType: !974, size: 64, align: 64, offset: 64)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1628, file: !897, line: 505, baseType: !974, size: 64, align: 64, offset: 128)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1628, file: !897, line: 506, baseType: !974, size: 64, align: 64, offset: 192)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !1628, file: !897, line: 508, baseType: !64, size: 32, align: 32, offset: 256)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !1628, file: !897, line: 509, baseType: !64, size: 32, align: 32, offset: 288)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !1628, file: !897, line: 510, baseType: !64, size: 32, align: 32, offset: 320)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1628, file: !897, line: 517, baseType: !941, size: 32, align: 32, offset: 352)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1628, file: !897, line: 523, baseType: !1532, size: 64, align: 64, offset: 384)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1628, file: !897, line: 526, baseType: !968, size: 64, align: 64, offset: 448)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1628, file: !897, line: 535, baseType: !1627, size: 64, align: 64, offset: 512)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1628, file: !897, line: 539, baseType: !941, size: 32, align: 32, offset: 576)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !1628, file: !897, line: 541, baseType: !1555, size: 64, align: 64, offset: 640)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1628, file: !897, line: 549, baseType: !1560, size: 64, align: 64, offset: 704)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "write_trailer", scope: !1628, file: !897, line: 550, baseType: !1555, size: 64, align: 64, offset: 768)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "interleave_packet", scope: !1628, file: !897, line: 554, baseType: !1646, size: 64, align: 64, offset: 832)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!941, !1558, !1563, !1563, !941}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "query_codec", scope: !1628, file: !897, line: 563, baseType: !1650, size: 64, align: 64, offset: 896)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!941, !64, !941}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "get_output_timestamp", scope: !1628, file: !897, line: 565, baseType: !1654, size: 64, align: 64, offset: 960)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DISubroutineType(types: !1656)
!1656 = !{null, !1558, !941, !1606, !1606}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "control_message", scope: !1628, file: !897, line: 570, baseType: !1658, size: 64, align: 64, offset: 1024)
!1658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1659, size: 64, align: 64)
!1659 = !DISubroutineType(types: !1660)
!1660 = !{!941, !1558, !941, !981, !953}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "write_uncoded_frame", scope: !1628, file: !897, line: 581, baseType: !1662, size: 64, align: 64, offset: 1088)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!941, !1558, !941, !1665, !933}
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1667, size: 64, align: 64)
!1667 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !535, line: 646, baseType: !1668)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !535, line: 268, size: 4288, align: 64, elements: !1669)
!1669 = !{!1670, !1674, !1676, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1710, !1712, !1713, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1668, file: !535, line: 282, baseType: !1671, size: 512, align: 64)
!1671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 512, align: 64, elements: !1672)
!1672 = !{!1673}
!1673 = !DISubrange(count: 8)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1668, file: !535, line: 299, baseType: !1675, size: 256, align: 32, offset: 512)
!1675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 256, align: 32, elements: !1672)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1668, file: !535, line: 315, baseType: !1677, size: 64, align: 64, offset: 768)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64, align: 64)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1668, file: !535, line: 326, baseType: !941, size: 32, align: 32, offset: 832)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1668, file: !535, line: 326, baseType: !941, size: 32, align: 32, offset: 864)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1668, file: !535, line: 334, baseType: !941, size: 32, align: 32, offset: 896)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1668, file: !535, line: 341, baseType: !941, size: 32, align: 32, offset: 928)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1668, file: !535, line: 346, baseType: !941, size: 32, align: 32, offset: 960)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1668, file: !535, line: 351, baseType: !523, size: 32, align: 32, offset: 992)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1668, file: !535, line: 356, baseType: !1685, size: 64, align: 32, offset: 1024)
!1685 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1686, line: 61, baseType: !1687)
!1686 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1686, line: 58, size: 64, align: 32, elements: !1688)
!1688 = !{!1689, !1690}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1687, file: !1686, line: 59, baseType: !941, size: 32, align: 32)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1687, file: !1686, line: 60, baseType: !941, size: 32, align: 32, offset: 32)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1668, file: !535, line: 361, baseType: !1027, size: 64, align: 64, offset: 1088)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1668, file: !535, line: 369, baseType: !1027, size: 64, align: 64, offset: 1152)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1668, file: !535, line: 377, baseType: !1027, size: 64, align: 64, offset: 1216)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1668, file: !535, line: 382, baseType: !941, size: 32, align: 32, offset: 1280)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1668, file: !535, line: 386, baseType: !941, size: 32, align: 32, offset: 1312)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1668, file: !535, line: 391, baseType: !941, size: 32, align: 32, offset: 1344)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1668, file: !535, line: 396, baseType: !981, size: 64, align: 64, offset: 1408)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1668, file: !535, line: 403, baseType: !1699, size: 512, align: 64, offset: 1472)
!1699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1700, size: 512, align: 64, elements: !1672)
!1700 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !919, line: 55, baseType: !955)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1668, file: !535, line: 410, baseType: !941, size: 32, align: 32, offset: 1984)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1668, file: !535, line: 415, baseType: !941, size: 32, align: 32, offset: 2016)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1668, file: !535, line: 420, baseType: !941, size: 32, align: 32, offset: 2048)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1668, file: !535, line: 425, baseType: !941, size: 32, align: 32, offset: 2080)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1668, file: !535, line: 435, baseType: !1027, size: 64, align: 64, offset: 2112)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1668, file: !535, line: 440, baseType: !941, size: 32, align: 32, offset: 2176)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1668, file: !535, line: 445, baseType: !1700, size: 64, align: 64, offset: 2240)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1668, file: !535, line: 459, baseType: !1709, size: 512, align: 64, offset: 2304)
!1709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1568, size: 512, align: 64, elements: !1672)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1668, file: !535, line: 473, baseType: !1711, size: 64, align: 64, offset: 2816)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1668, file: !535, line: 477, baseType: !941, size: 32, align: 32, offset: 2880)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1668, file: !535, line: 479, baseType: !1714, size: 64, align: 64, offset: 2944)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64, align: 64)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !535, line: 207, baseType: !1717)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !535, line: 201, size: 320, align: 64, elements: !1718)
!1718 = !{!1719, !1720, !1721, !1722, !1727}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1717, file: !535, line: 202, baseType: !534, size: 32, align: 32)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1717, file: !535, line: 203, baseType: !917, size: 64, align: 64, offset: 64)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1717, file: !535, line: 204, baseType: !941, size: 32, align: 32, offset: 128)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1717, file: !535, line: 205, baseType: !1723, size: 64, align: 64, offset: 192)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1725, line: 86, baseType: !1726)
!1725 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1726 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1725, line: 86, flags: DIFlagFwdDecl)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1717, file: !535, line: 206, baseType: !1568, size: 64, align: 64, offset: 256)
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1668, file: !535, line: 480, baseType: !941, size: 32, align: 32, offset: 3008)
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1668, file: !535, line: 505, baseType: !941, size: 32, align: 32, offset: 3040)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1668, file: !535, line: 512, baseType: !558, size: 32, align: 32, offset: 3072)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1668, file: !535, line: 514, baseType: !565, size: 32, align: 32, offset: 3104)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1668, file: !535, line: 516, baseType: !583, size: 32, align: 32, offset: 3136)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1668, file: !535, line: 523, baseType: !607, size: 32, align: 32, offset: 3168)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1668, file: !535, line: 525, baseType: !626, size: 32, align: 32, offset: 3200)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1668, file: !535, line: 532, baseType: !1027, size: 64, align: 64, offset: 3264)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1668, file: !535, line: 539, baseType: !1027, size: 64, align: 64, offset: 3328)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1668, file: !535, line: 547, baseType: !1027, size: 64, align: 64, offset: 3392)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1668, file: !535, line: 554, baseType: !1723, size: 64, align: 64, offset: 3456)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1668, file: !535, line: 563, baseType: !941, size: 32, align: 32, offset: 3520)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1668, file: !535, line: 572, baseType: !941, size: 32, align: 32, offset: 3552)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1668, file: !535, line: 581, baseType: !941, size: 32, align: 32, offset: 3584)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1668, file: !535, line: 588, baseType: !1743, size: 64, align: 64, offset: 3648)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64, align: 64)
!1744 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !919, line: 36, baseType: !1745)
!1745 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1668, file: !535, line: 593, baseType: !941, size: 32, align: 32, offset: 3712)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1668, file: !535, line: 596, baseType: !941, size: 32, align: 32, offset: 3744)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1668, file: !535, line: 599, baseType: !1568, size: 64, align: 64, offset: 3776)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1668, file: !535, line: 605, baseType: !1568, size: 64, align: 64, offset: 3840)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1668, file: !535, line: 616, baseType: !1568, size: 64, align: 64, offset: 3904)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1668, file: !535, line: 626, baseType: !953, size: 64, align: 64, offset: 3968)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1668, file: !535, line: 627, baseType: !953, size: 64, align: 64, offset: 4032)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1668, file: !535, line: 628, baseType: !953, size: 64, align: 64, offset: 4096)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1668, file: !535, line: 629, baseType: !953, size: 64, align: 64, offset: 4160)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1668, file: !535, line: 645, baseType: !1568, size: 64, align: 64, offset: 4224)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1628, file: !897, line: 587, baseType: !1614, size: 64, align: 64, offset: 1152)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1628, file: !897, line: 592, baseType: !1620, size: 64, align: 64, offset: 1216)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1628, file: !897, line: 597, baseType: !1620, size: 64, align: 64, offset: 1280)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "data_codec", scope: !1628, file: !897, line: 598, baseType: !64, size: 32, align: 32, offset: 1344)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1628, file: !897, line: 608, baseType: !1555, size: 64, align: 64, offset: 1408)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "deinit", scope: !1628, file: !897, line: 617, baseType: !1762, size: 64, align: 64, offset: 1472)
!1762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1763, size: 64, align: 64)
!1763 = !DISubroutineType(types: !1764)
!1764 = !{null, !1558}
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "check_bitstream", scope: !1628, file: !897, line: 623, baseType: !1766, size: 64, align: 64, offset: 1536)
!1766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1767, size: 64, align: 64)
!1767 = !DISubroutineType(types: !1768)
!1768 = !{!941, !1558, !1769}
!1769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1770, size: 64, align: 64)
!1770 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1564)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1520, file: !897, line: 1365, baseType: !981, size: 64, align: 64, offset: 192)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !1520, file: !897, line: 1379, baseType: !963, size: 64, align: 64, offset: 256)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !1520, file: !897, line: 1386, baseType: !941, size: 32, align: 32, offset: 320)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !1520, file: !897, line: 1393, baseType: !933, size: 32, align: 32, offset: 352)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1520, file: !897, line: 1405, baseType: !1776, size: 64, align: 64, offset: 384)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64, align: 64)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64, align: 64)
!1778 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1779)
!1779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1780)
!1780 = !{!1781, !1782, !1783, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2251, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2352, !2358, !2359, !2363, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2395, !2396, !2397, !2398, !2399, !2400}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1779, file: !897, line: 866, baseType: !941, size: 32, align: 32)
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1779, file: !897, line: 872, baseType: !941, size: 32, align: 32, offset: 32)
!1783 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1779, file: !897, line: 878, baseType: !1784, size: 64, align: 64, offset: 64)
!1784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1785, size: 64, align: 64)
!1785 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !34, line: 3360, baseType: !1786)
!1786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !34, line: 1556, size: 8448, align: 64, elements: !1787)
!1787 = !{!1788, !1789, !1790, !1791, !1926, !1927, !1928, !1929, !1932, !1933, !1934, !1935, !1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1955, !1959, !1960, !1962, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988, !1989, !1990, !1992, !1993, !1994, !1995, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025, !2026, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058, !2059, !2060, !2061, !2062, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2120, !2121, !2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2139, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158, !2159, !2160, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200}
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1786, file: !34, line: 1561, baseType: !968, size: 64, align: 64)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1786, file: !34, line: 1562, baseType: !941, size: 32, align: 32, offset: 64)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1786, file: !34, line: 1564, baseType: !636, size: 32, align: 32, offset: 96)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1786, file: !34, line: 1565, baseType: !1792, size: 64, align: 64, offset: 128)
!1792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1793, size: 64, align: 64)
!1793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1794)
!1794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !34, line: 3468, size: 1984, align: 64, elements: !1795)
!1795 = !{!1796, !1797, !1798, !1799, !1800, !1801, !1804, !1807, !1810, !1813, !1816, !1817, !1818, !1826, !1827, !1828, !1830, !1834, !1840, !1845, !1849, !1850, !1891, !1898, !1902, !1903, !1907, !1911, !1915, !1919, !1920, !1921}
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1794, file: !34, line: 3475, baseType: !974, size: 64, align: 64)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1794, file: !34, line: 3480, baseType: !974, size: 64, align: 64, offset: 64)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1794, file: !34, line: 3481, baseType: !636, size: 32, align: 32, offset: 128)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1794, file: !34, line: 3482, baseType: !64, size: 32, align: 32, offset: 160)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1794, file: !34, line: 3487, baseType: !941, size: 32, align: 32, offset: 192)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1794, file: !34, line: 3488, baseType: !1802, size: 64, align: 64, offset: 256)
!1802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1803, size: 64, align: 64)
!1803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1685)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1794, file: !34, line: 3489, baseType: !1805, size: 64, align: 64, offset: 320)
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1806, size: 64, align: 64)
!1806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1794, file: !34, line: 3490, baseType: !1808, size: 64, align: 64, offset: 384)
!1808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1809, size: 64, align: 64)
!1809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1794, file: !34, line: 3491, baseType: !1811, size: 64, align: 64, offset: 448)
!1811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1812, size: 64, align: 64)
!1812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1794, file: !34, line: 3492, baseType: !1814, size: 64, align: 64, offset: 512)
!1814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1815, size: 64, align: 64)
!1815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1700)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1794, file: !34, line: 3493, baseType: !918, size: 8, align: 8, offset: 576)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1794, file: !34, line: 3494, baseType: !968, size: 64, align: 64, offset: 640)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1794, file: !34, line: 3495, baseType: !1819, size: 64, align: 64, offset: 704)
!1819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1820, size: 64, align: 64)
!1820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1821)
!1821 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !34, line: 3404, baseType: !1822)
!1822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !34, line: 3401, size: 128, align: 64, elements: !1823)
!1823 = !{!1824, !1825}
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1822, file: !34, line: 3402, baseType: !941, size: 32, align: 32)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1822, file: !34, line: 3403, baseType: !974, size: 64, align: 64, offset: 64)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1794, file: !34, line: 3507, baseType: !974, size: 64, align: 64, offset: 768)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1794, file: !34, line: 3516, baseType: !941, size: 32, align: 32, offset: 832)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1794, file: !34, line: 3517, baseType: !1829, size: 64, align: 64, offset: 896)
!1829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1794, size: 64, align: 64)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1794, file: !34, line: 3527, baseType: !1831, size: 64, align: 64, offset: 960)
!1831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1832, size: 64, align: 64)
!1832 = !DISubroutineType(types: !1833)
!1833 = !{!941, !1784}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1794, file: !34, line: 3535, baseType: !1835, size: 64, align: 64, offset: 1024)
!1835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1836, size: 64, align: 64)
!1836 = !DISubroutineType(types: !1837)
!1837 = !{!941, !1784, !1838}
!1838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1839, size: 64, align: 64)
!1839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1785)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1794, file: !34, line: 3541, baseType: !1841, size: 64, align: 64, offset: 1088)
!1841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1842, size: 64, align: 64)
!1842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1843)
!1843 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !34, line: 3461, baseType: !1844)
!1844 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !34, line: 3461, flags: DIFlagFwdDecl)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1794, file: !34, line: 3549, baseType: !1846, size: 64, align: 64, offset: 1152)
!1846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1847, size: 64, align: 64)
!1847 = !DISubroutineType(types: !1848)
!1848 = !{null, !1829}
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1794, file: !34, line: 3551, baseType: !1831, size: 64, align: 64, offset: 1216)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1794, file: !34, line: 3552, baseType: !1851, size: 64, align: 64, offset: 1280)
!1851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1852, size: 64, align: 64)
!1852 = !DISubroutineType(types: !1853)
!1853 = !{!941, !1784, !917, !941, !1854}
!1854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1855, size: 64, align: 64)
!1855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1856)
!1856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !34, line: 3920, size: 256, align: 64, elements: !1857)
!1857 = !{!1858, !1859, !1860, !1861, !1862, !1890}
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1856, file: !34, line: 3921, baseType: !926, size: 16, align: 16)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1856, file: !34, line: 3922, baseType: !932, size: 32, align: 32, offset: 32)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1856, file: !34, line: 3923, baseType: !932, size: 32, align: 32, offset: 64)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1856, file: !34, line: 3924, baseType: !933, size: 32, align: 32, offset: 96)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1856, file: !34, line: 3925, baseType: !1863, size: 64, align: 64, offset: 128)
!1863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1864, size: 64, align: 64)
!1864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1865, size: 64, align: 64)
!1865 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !34, line: 3918, baseType: !1866)
!1866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !34, line: 3885, size: 1600, align: 64, elements: !1867)
!1867 = !{!1868, !1869, !1870, !1871, !1872, !1873, !1879, !1883, !1885, !1886, !1888, !1889}
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1866, file: !34, line: 3886, baseType: !941, size: 32, align: 32)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1866, file: !34, line: 3887, baseType: !941, size: 32, align: 32, offset: 32)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1866, file: !34, line: 3888, baseType: !941, size: 32, align: 32, offset: 64)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1866, file: !34, line: 3889, baseType: !941, size: 32, align: 32, offset: 96)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1866, file: !34, line: 3890, baseType: !941, size: 32, align: 32, offset: 128)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1866, file: !34, line: 3897, baseType: !1874, size: 768, align: 64, offset: 192)
!1874 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !34, line: 3858, baseType: !1875)
!1875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !34, line: 3853, size: 768, align: 64, elements: !1876)
!1876 = !{!1877, !1878}
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1875, file: !34, line: 3855, baseType: !1671, size: 512, align: 64)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1875, file: !34, line: 3857, baseType: !1675, size: 256, align: 32, offset: 512)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1866, file: !34, line: 3903, baseType: !1880, size: 256, align: 64, offset: 960)
!1880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 256, align: 64, elements: !1881)
!1881 = !{!1882}
!1882 = !DISubrange(count: 4)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1866, file: !34, line: 3904, baseType: !1884, size: 128, align: 32, offset: 1216)
!1884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !941, size: 128, align: 32, elements: !1881)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1866, file: !34, line: 3906, baseType: !861, size: 32, align: 32, offset: 1344)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1866, file: !34, line: 3908, baseType: !1887, size: 64, align: 64, offset: 1408)
!1887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1888 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1866, file: !34, line: 3915, baseType: !1887, size: 64, align: 64, offset: 1472)
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1866, file: !34, line: 3917, baseType: !941, size: 32, align: 32, offset: 1536)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1856, file: !34, line: 3926, baseType: !1027, size: 64, align: 64, offset: 192)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1794, file: !34, line: 3564, baseType: !1892, size: 64, align: 64, offset: 1344)
!1892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1893, size: 64, align: 64)
!1893 = !DISubroutineType(types: !1894)
!1894 = !{!941, !1784, !1563, !1895, !1897}
!1895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1896, size: 64, align: 64)
!1896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1667)
!1897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64, align: 64)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1794, file: !34, line: 3566, baseType: !1899, size: 64, align: 64, offset: 1408)
!1899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1900, size: 64, align: 64)
!1900 = !DISubroutineType(types: !1901)
!1901 = !{!941, !1784, !981, !1897, !1563}
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1794, file: !34, line: 3567, baseType: !1831, size: 64, align: 64, offset: 1472)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1794, file: !34, line: 3576, baseType: !1904, size: 64, align: 64, offset: 1536)
!1904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1905, size: 64, align: 64)
!1905 = !DISubroutineType(types: !1906)
!1906 = !{!941, !1784, !1895}
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1794, file: !34, line: 3577, baseType: !1908, size: 64, align: 64, offset: 1600)
!1908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1909, size: 64, align: 64)
!1909 = !DISubroutineType(types: !1910)
!1910 = !{!941, !1784, !1563}
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1794, file: !34, line: 3584, baseType: !1912, size: 64, align: 64, offset: 1664)
!1912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1913, size: 64, align: 64)
!1913 = !DISubroutineType(types: !1914)
!1914 = !{!941, !1784, !1666}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1794, file: !34, line: 3589, baseType: !1916, size: 64, align: 64, offset: 1728)
!1916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1917, size: 64, align: 64)
!1917 = !DISubroutineType(types: !1918)
!1918 = !{null, !1784}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1794, file: !34, line: 3594, baseType: !941, size: 32, align: 32, offset: 1792)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1794, file: !34, line: 3600, baseType: !974, size: 64, align: 64, offset: 1856)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1794, file: !34, line: 3609, baseType: !1922, size: 64, align: 64, offset: 1920)
!1922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1923, size: 64, align: 64)
!1923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1924, size: 64, align: 64)
!1924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1925)
!1925 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !34, line: 3609, flags: DIFlagFwdDecl)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1786, file: !34, line: 1566, baseType: !64, size: 32, align: 32, offset: 192)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1786, file: !34, line: 1581, baseType: !933, size: 32, align: 32, offset: 224)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1786, file: !34, line: 1583, baseType: !981, size: 64, align: 64, offset: 256)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1786, file: !34, line: 1591, baseType: !1930, size: 64, align: 64, offset: 320)
!1930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1931, size: 64, align: 64)
!1931 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !34, line: 1532, flags: DIFlagFwdDecl)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1786, file: !34, line: 1598, baseType: !981, size: 64, align: 64, offset: 384)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1786, file: !34, line: 1606, baseType: !1027, size: 64, align: 64, offset: 448)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1786, file: !34, line: 1614, baseType: !941, size: 32, align: 32, offset: 512)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1786, file: !34, line: 1622, baseType: !941, size: 32, align: 32, offset: 544)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1786, file: !34, line: 1628, baseType: !941, size: 32, align: 32, offset: 576)
