; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--scale.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--scale.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVFilterLink = type { %struct.AVFilterContext*, %struct.AVFilterPad*, %struct.AVFilterContext*, %struct.AVFilterPad*, i32, i32, i32, %struct.AVRational, i64, i32, i32, %struct.AVRational, %struct.AVFilterFormats*, %struct.AVFilterFormats*, %struct.AVFilterFormats*, %struct.AVFilterFormats*, %struct.AVFilterChannelLayouts*, %struct.AVFilterChannelLayouts*, i32, i32, %struct.AVFilterGraph*, i64, i64, i32, %struct.AVRational, %struct.AVFrame*, i32, i32, i32, i32, i32, i64, i64, i8*, i32, %struct.AVBufferRef*, [61440 x i8] }
%struct.AVFilterContext = type { %struct.AVClass*, %struct.AVFilter*, i8*, %struct.AVFilterPad*, %struct.AVFilterLink**, i32, %struct.AVFilterPad*, %struct.AVFilterLink**, i32, i8*, %struct.AVFilterGraph*, i32, %struct.AVFilterInternal*, %struct.AVFilterCommand*, i8*, i8*, double*, i32, %struct.AVBufferRef*, i32, i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !499, globals: !500)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavfilter--scale.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3, !24, !34, !274, !313, !343, !351, !370, !395, !415, !466, !488}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVMediaType", file: !25, line: 199, size: 32, align: 32, elements: !26)
!25 = !DIFile(filename: "./libavutil/avutil.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!26 = !{!27, !28, !29, !30, !31, !32, !33}
!27 = !DIEnumerator(name: "AVMEDIA_TYPE_UNKNOWN", value: -1)
!28 = !DIEnumerator(name: "AVMEDIA_TYPE_VIDEO", value: 0)
!29 = !DIEnumerator(name: "AVMEDIA_TYPE_AUDIO", value: 1)
!30 = !DIEnumerator(name: "AVMEDIA_TYPE_DATA", value: 2)
!31 = !DIEnumerator(name: "AVMEDIA_TYPE_SUBTITLE", value: 3)
!32 = !DIEnumerator(name: "AVMEDIA_TYPE_ATTACHMENT", value: 4)
!33 = !DIEnumerator(name: "AVMEDIA_TYPE_NB", value: 5)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !36, file: !35, line: 503, size: 32, align: 32, elements: !462)
!35 = !DIFile(filename: "libavfilter/avfilter.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterLink", file: !35, line: 439, size: 493504, align: 64, elements: !37)
!37 = !{!38, !215, !216, !217, !218, !219, !220, !221, !228, !231, !232, !233, !234, !238, !239, !240, !241, !244, !245, !246, !247, !248, !251, !252, !253, !254, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !36, file: !35, line: 440, baseType: !39, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterContext", file: !35, line: 67, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterContext", file: !35, line: 338, size: 1344, align: 64, elements: !42)
!42 = !{!43, !89, !138, !139, !141, !145, !147, !148, !149, !150, !151, !182, !183, !187, !190, !191, !192, !195, !196, !212, !213, !214}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !41, file: !35, line: 339, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !48)
!48 = !{!49, !53, !58, !62, !64, !65, !66, !70, !76, !78, !82}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !47, file: !4, line: 72, baseType: !50, size: 64, align: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !47, file: !4, line: 78, baseType: !54, size: 64, align: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{!50, !57}
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !47, file: !4, line: 85, baseType: !59, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !47, file: !4, line: 93, baseType: !63, size: 32, align: 32, offset: 192)
!63 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !47, file: !4, line: 99, baseType: !63, size: 32, align: 32, offset: 224)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !47, file: !4, line: 108, baseType: !63, size: 32, align: 32, offset: 256)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !47, file: !4, line: 113, baseType: !67, size: 64, align: 64, offset: 320)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64, align: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!57, !57, !57}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !47, file: !4, line: 123, baseType: !71, size: 64, align: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64, align: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !47, file: !4, line: 130, baseType: !77, size: 32, align: 32, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !47, file: !4, line: 136, baseType: !79, size: 64, align: 64, offset: 512)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64, align: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!77, !57}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !47, file: !4, line: 142, baseType: !83, size: 64, align: 64, offset: 576)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64, align: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!63, !86, !57, !50, !63}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64, align: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !41, file: !35, line: 341, baseType: !90, size: 64, align: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilter", file: !35, line: 328, baseType: !93)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilter", file: !35, line: 144, size: 1024, align: 64, elements: !94)
!94 = !{!95, !96, !97, !102, !103, !104, !105, !109, !110, !119, !123, !124, !125, !126, !128, !133, !137}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !93, file: !35, line: 148, baseType: !50, size: 64, align: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !93, file: !35, line: 155, baseType: !50, size: 64, align: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !93, file: !35, line: 164, baseType: !98, size: 64, align: 64, offset: 128)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64, align: 64)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterPad", file: !35, line: 69, baseType: !101)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterPad", file: !35, line: 69, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !93, file: !35, line: 172, baseType: !98, size: 64, align: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !93, file: !35, line: 182, baseType: !44, size: 64, align: 64, offset: 256)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !93, file: !35, line: 187, baseType: !63, size: 32, align: 32, offset: 320)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "preinit", scope: !93, file: !35, line: 210, baseType: !106, size: 64, align: 64, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64, align: 64)
!107 = !DISubroutineType(types: !108)
!108 = !{!63, !39}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !93, file: !35, line: 233, baseType: !106, size: 64, align: 64, offset: 448)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "init_dict", scope: !93, file: !35, line: 246, baseType: !111, size: 64, align: 64, offset: 512)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64, align: 64)
!112 = !DISubroutineType(types: !113)
!113 = !{!63, !39, !114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64, align: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !117, line: 86, baseType: !118)
!117 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !117, line: 86, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !93, file: !35, line: 258, baseType: !120, size: 64, align: 64, offset: 576)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64, align: 64)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !39}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "query_formats", scope: !93, file: !35, line: 282, baseType: !106, size: 64, align: 64, offset: 640)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "priv_size", scope: !93, file: !35, line: 284, baseType: !63, size: 32, align: 32, offset: 704)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "flags_internal", scope: !93, file: !35, line: 286, baseType: !63, size: 32, align: 32, offset: 736)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !93, file: !35, line: 292, baseType: !127, size: 64, align: 64, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64, align: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "process_command", scope: !93, file: !35, line: 306, baseType: !129, size: 64, align: 64, offset: 832)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64, align: 64)
!130 = !DISubroutineType(types: !131)
!131 = !{!63, !39, !50, !50, !132, !63, !63}
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64, align: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "init_opaque", scope: !93, file: !35, line: 313, baseType: !134, size: 64, align: 64, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64, align: 64)
!135 = !DISubroutineType(types: !136)
!136 = !{!63, !39, !57}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !93, file: !35, line: 327, baseType: !106, size: 64, align: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !41, file: !35, line: 343, baseType: !132, size: 64, align: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "input_pads", scope: !41, file: !35, line: 345, baseType: !140, size: 64, align: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "inputs", scope: !41, file: !35, line: 346, baseType: !142, size: 64, align: 64, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64, align: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterLink", file: !35, line: 68, baseType: !36)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_inputs", scope: !41, file: !35, line: 347, baseType: !146, size: 32, align: 32, offset: 320)
!146 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "output_pads", scope: !41, file: !35, line: 349, baseType: !140, size: 64, align: 64, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "outputs", scope: !41, file: !35, line: 350, baseType: !142, size: 64, align: 64, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "nb_outputs", scope: !41, file: !35, line: 351, baseType: !146, size: 32, align: 32, offset: 512)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !41, file: !35, line: 353, baseType: !57, size: 64, align: 64, offset: 576)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !41, file: !35, line: 355, baseType: !152, size: 64, align: 64, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraph", file: !35, line: 840, size: 768, align: 64, elements: !154)
!154 = !{!155, !156, !158, !159, !160, !161, !162, !163, !167, !168, !178, !179, !180, !181}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !153, file: !35, line: 841, baseType: !44, size: 64, align: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !153, file: !35, line: 842, baseType: !157, size: 64, align: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "nb_filters", scope: !153, file: !35, line: 843, baseType: !146, size: 32, align: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "scale_sws_opts", scope: !153, file: !35, line: 845, baseType: !132, size: 64, align: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "resample_lavr_opts", scope: !153, file: !35, line: 847, baseType: !132, size: 64, align: 64, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !153, file: !35, line: 862, baseType: !63, size: 32, align: 32, offset: 320)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !153, file: !35, line: 869, baseType: !63, size: 32, align: 32, offset: 352)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !153, file: !35, line: 874, baseType: !164, size: 64, align: 64, offset: 384)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterGraphInternal", file: !35, line: 809, baseType: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterGraphInternal", file: !35, line: 809, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !153, file: !35, line: 881, baseType: !57, size: 64, align: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !153, file: !35, line: 895, baseType: !169, size: 64, align: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_execute_func", file: !35, line: 837, baseType: !171)
!171 = !DISubroutineType(types: !172)
!172 = !{!63, !39, !173, !57, !177, !63}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "avfilter_action_func", file: !35, line: 823, baseType: !175)
!175 = !DISubroutineType(types: !176)
!176 = !{!63, !39, !57, !63, !63}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "aresample_swr_opts", scope: !153, file: !35, line: 897, baseType: !132, size: 64, align: 64, offset: 576)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links", scope: !153, file: !35, line: 906, baseType: !142, size: 64, align: 64, offset: 640)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sink_links_count", scope: !153, file: !35, line: 907, baseType: !63, size: 32, align: 32, offset: 704)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "disable_auto_convert", scope: !153, file: !35, line: 909, baseType: !146, size: 32, align: 32, offset: 736)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !41, file: !35, line: 373, baseType: !63, size: 32, align: 32, offset: 704)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !41, file: !35, line: 378, baseType: !184, size: 64, align: 64, offset: 768)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterInternal", file: !35, line: 335, baseType: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterInternal", file: !35, line: 335, flags: DIFlagFwdDecl)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "command_queue", scope: !41, file: !35, line: 380, baseType: !188, size: 64, align: 64, offset: 832)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterCommand", file: !35, line: 380, flags: DIFlagFwdDecl)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "enable_str", scope: !41, file: !35, line: 382, baseType: !132, size: 64, align: 64, offset: 896)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "enable", scope: !41, file: !35, line: 383, baseType: !57, size: 64, align: 64, offset: 960)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "var_values", scope: !41, file: !35, line: 384, baseType: !193, size: 64, align: 64, offset: 1024)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "is_disabled", scope: !41, file: !35, line: 385, baseType: !63, size: 32, align: 32, offset: 1088)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !41, file: !35, line: 394, baseType: !197, size: 64, align: 64, offset: 1152)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !199, line: 94, baseType: !200)
!199 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !199, line: 81, size: 192, align: 64, elements: !201)
!201 = !{!202, !206, !211}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !200, file: !199, line: 82, baseType: !203, size: 64, align: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !199, line: 73, baseType: !205)
!205 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !199, line: 73, flags: DIFlagFwdDecl)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !200, file: !199, line: 89, baseType: !207, size: 64, align: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !209, line: 48, baseType: !210)
!209 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!210 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !200, file: !199, line: 93, baseType: !63, size: 32, align: 32, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "nb_threads", scope: !41, file: !35, line: 401, baseType: !63, size: 32, align: 32, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ready", scope: !41, file: !35, line: 408, baseType: !146, size: 32, align: 32, offset: 1248)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !41, file: !35, line: 424, baseType: !63, size: 32, align: 32, offset: 1280)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "srcpad", scope: !36, file: !35, line: 441, baseType: !140, size: 64, align: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dst", scope: !36, file: !35, line: 443, baseType: !39, size: 64, align: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dstpad", scope: !36, file: !35, line: 444, baseType: !140, size: 64, align: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !36, file: !35, line: 446, baseType: !24, size: 32, align: 32, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !36, file: !35, line: 449, baseType: !63, size: 32, align: 32, offset: 288)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !36, file: !35, line: 450, baseType: !63, size: 32, align: 32, offset: 320)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !36, file: !35, line: 451, baseType: !222, size: 64, align: 32, offset: 352)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !223, line: 61, baseType: !224)
!223 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !223, line: 58, size: 64, align: 32, elements: !225)
!225 = !{!226, !227}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !224, file: !223, line: 59, baseType: !63, size: 32, align: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !224, file: !223, line: 60, baseType: !63, size: 32, align: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !36, file: !35, line: 453, baseType: !229, size: 64, align: 64, offset: 448)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !209, line: 55, baseType: !230)
!230 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !36, file: !35, line: 454, baseType: !63, size: 32, align: 32, offset: 512)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !36, file: !35, line: 456, baseType: !63, size: 32, align: 32, offset: 544)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !36, file: !35, line: 465, baseType: !222, size: 64, align: 32, offset: 576)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "in_formats", scope: !36, file: !35, line: 481, baseType: !235, size: 64, align: 64, offset: 640)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFilterFormats", file: !35, line: 70, baseType: !237)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterFormats", file: !35, line: 70, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "out_formats", scope: !36, file: !35, line: 482, baseType: !235, size: 64, align: 64, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "in_samplerates", scope: !36, file: !35, line: 488, baseType: !235, size: 64, align: 64, offset: 768)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "out_samplerates", scope: !36, file: !35, line: 489, baseType: !235, size: 64, align: 64, offset: 832)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "in_channel_layouts", scope: !36, file: !35, line: 490, baseType: !242, size: 64, align: 64, offset: 896)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVFilterChannelLayouts", file: !35, line: 490, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "out_channel_layouts", scope: !36, file: !35, line: 491, baseType: !242, size: 64, align: 64, offset: 960)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "request_samples", scope: !36, file: !35, line: 500, baseType: !63, size: 32, align: 32, offset: 1024)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_state", scope: !36, file: !35, line: 507, baseType: !34, size: 32, align: 32, offset: 1056)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "graph", scope: !36, file: !35, line: 512, baseType: !152, size: 64, align: 64, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts", scope: !36, file: !35, line: 518, baseType: !249, size: 64, align: 64, offset: 1152)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !209, line: 40, baseType: !250)
!250 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "current_pts_us", scope: !36, file: !35, line: 524, baseType: !249, size: 64, align: 64, offset: 1216)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "age_index", scope: !36, file: !35, line: 529, baseType: !63, size: 32, align: 32, offset: 1280)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "frame_rate", scope: !36, file: !35, line: 542, baseType: !222, size: 64, align: 32, offset: 1312)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf", scope: !36, file: !35, line: 547, baseType: !255, size: 64, align: 64, offset: 1408)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !257, line: 646, baseType: !258)
!257 = !DIFile(filename: "./libavutil/frame.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !257, line: 268, size: 4288, align: 64, elements: !259)
!259 = !{!260, !264, !266, !268, !269, !270, !271, !272, !273, !284, !285, !286, !287, !288, !289, !290, !291, !292, !294, !295, !296, !297, !298, !299, !300, !301, !303, !305, !306, !340, !341, !342, !350, !369, !394, !414, !425, !426, !427, !428, !429, !430, !431, !432, !436, !437, !438, !439, !440, !441, !444, !445, !446, !447}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !258, file: !257, line: 282, baseType: !261, size: 512, align: 64)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 512, align: 64, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !258, file: !257, line: 299, baseType: !265, size: 256, align: 32, offset: 512)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 256, align: 32, elements: !262)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !258, file: !257, line: 315, baseType: !267, size: 64, align: 64, offset: 768)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !258, file: !257, line: 326, baseType: !63, size: 32, align: 32, offset: 832)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !258, file: !257, line: 326, baseType: !63, size: 32, align: 32, offset: 864)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !258, file: !257, line: 334, baseType: !63, size: 32, align: 32, offset: 896)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !258, file: !257, line: 341, baseType: !63, size: 32, align: 32, offset: 928)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !258, file: !257, line: 346, baseType: !63, size: 32, align: 32, offset: 960)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !258, file: !257, line: 351, baseType: !274, size: 32, align: 32, offset: 992)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureType", file: !25, line: 272, size: 32, align: 32, elements: !275)
!275 = !{!276, !277, !278, !279, !280, !281, !282, !283}
!276 = !DIEnumerator(name: "AV_PICTURE_TYPE_NONE", value: 0)
!277 = !DIEnumerator(name: "AV_PICTURE_TYPE_I", value: 1)
!278 = !DIEnumerator(name: "AV_PICTURE_TYPE_P", value: 2)
!279 = !DIEnumerator(name: "AV_PICTURE_TYPE_B", value: 3)
!280 = !DIEnumerator(name: "AV_PICTURE_TYPE_S", value: 4)
!281 = !DIEnumerator(name: "AV_PICTURE_TYPE_SI", value: 5)
!282 = !DIEnumerator(name: "AV_PICTURE_TYPE_SP", value: 6)
!283 = !DIEnumerator(name: "AV_PICTURE_TYPE_BI", value: 7)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !258, file: !257, line: 356, baseType: !222, size: 64, align: 32, offset: 1024)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !258, file: !257, line: 361, baseType: !249, size: 64, align: 64, offset: 1088)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !258, file: !257, line: 369, baseType: !249, size: 64, align: 64, offset: 1152)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !258, file: !257, line: 377, baseType: !249, size: 64, align: 64, offset: 1216)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !258, file: !257, line: 382, baseType: !63, size: 32, align: 32, offset: 1280)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !258, file: !257, line: 386, baseType: !63, size: 32, align: 32, offset: 1312)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !258, file: !257, line: 391, baseType: !63, size: 32, align: 32, offset: 1344)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !258, file: !257, line: 396, baseType: !57, size: 64, align: 64, offset: 1408)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !258, file: !257, line: 403, baseType: !293, size: 512, align: 64, offset: 1472)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 512, align: 64, elements: !262)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !258, file: !257, line: 410, baseType: !63, size: 32, align: 32, offset: 1984)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !258, file: !257, line: 415, baseType: !63, size: 32, align: 32, offset: 2016)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !258, file: !257, line: 420, baseType: !63, size: 32, align: 32, offset: 2048)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !258, file: !257, line: 425, baseType: !63, size: 32, align: 32, offset: 2080)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !258, file: !257, line: 435, baseType: !249, size: 64, align: 64, offset: 2112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !258, file: !257, line: 440, baseType: !63, size: 32, align: 32, offset: 2176)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !258, file: !257, line: 445, baseType: !229, size: 64, align: 64, offset: 2240)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !258, file: !257, line: 459, baseType: !302, size: 512, align: 64, offset: 2304)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 512, align: 64, elements: !262)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !258, file: !257, line: 473, baseType: !304, size: 64, align: 64, offset: 2816)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !258, file: !257, line: 477, baseType: !63, size: 32, align: 32, offset: 2880)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !258, file: !257, line: 479, baseType: !307, size: 64, align: 64, offset: 2944)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !257, line: 207, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !257, line: 201, size: 320, align: 64, elements: !311)
!311 = !{!312, !336, !337, !338, !339}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !310, file: !257, line: 202, baseType: !313, size: 32, align: 32)
!313 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFrameSideDataType", file: !257, line: 48, size: 32, align: 32, elements: !314)
!314 = !{!315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335}
!315 = !DIEnumerator(name: "AV_FRAME_DATA_PANSCAN", value: 0)
!316 = !DIEnumerator(name: "AV_FRAME_DATA_A53_CC", value: 1)
!317 = !DIEnumerator(name: "AV_FRAME_DATA_STEREO3D", value: 2)
!318 = !DIEnumerator(name: "AV_FRAME_DATA_MATRIXENCODING", value: 3)
!319 = !DIEnumerator(name: "AV_FRAME_DATA_DOWNMIX_INFO", value: 4)
!320 = !DIEnumerator(name: "AV_FRAME_DATA_REPLAYGAIN", value: 5)
!321 = !DIEnumerator(name: "AV_FRAME_DATA_DISPLAYMATRIX", value: 6)
!322 = !DIEnumerator(name: "AV_FRAME_DATA_AFD", value: 7)
!323 = !DIEnumerator(name: "AV_FRAME_DATA_MOTION_VECTORS", value: 8)
!324 = !DIEnumerator(name: "AV_FRAME_DATA_SKIP_SAMPLES", value: 9)
!325 = !DIEnumerator(name: "AV_FRAME_DATA_AUDIO_SERVICE_TYPE", value: 10)
!326 = !DIEnumerator(name: "AV_FRAME_DATA_MASTERING_DISPLAY_METADATA", value: 11)
!327 = !DIEnumerator(name: "AV_FRAME_DATA_GOP_TIMECODE", value: 12)
!328 = !DIEnumerator(name: "AV_FRAME_DATA_SPHERICAL", value: 13)
!329 = !DIEnumerator(name: "AV_FRAME_DATA_CONTENT_LIGHT_LEVEL", value: 14)
!330 = !DIEnumerator(name: "AV_FRAME_DATA_ICC_PROFILE", value: 15)
!331 = !DIEnumerator(name: "AV_FRAME_DATA_QP_TABLE_PROPERTIES", value: 16)
!332 = !DIEnumerator(name: "AV_FRAME_DATA_QP_TABLE_DATA", value: 17)
!333 = !DIEnumerator(name: "AV_FRAME_DATA_S12M_TIMECODE", value: 18)
!334 = !DIEnumerator(name: "AV_FRAME_DATA_DYNAMIC_HDR_PLUS", value: 19)
!335 = !DIEnumerator(name: "AV_FRAME_DATA_REGIONS_OF_INTEREST", value: 20)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !257, line: 203, baseType: !207, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !310, file: !257, line: 204, baseType: !63, size: 32, align: 32, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !310, file: !257, line: 205, baseType: !115, size: 64, align: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !310, file: !257, line: 206, baseType: !197, size: 64, align: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !258, file: !257, line: 480, baseType: !63, size: 32, align: 32, offset: 3008)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !257, line: 505, baseType: !63, size: 32, align: 32, offset: 3040)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !258, file: !257, line: 512, baseType: !343, size: 32, align: 32, offset: 3072)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorRange", file: !344, line: 516, size: 32, align: 32, elements: !345)
!344 = !DIFile(filename: "./libavutil/pixfmt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!345 = !{!346, !347, !348, !349}
!346 = !DIEnumerator(name: "AVCOL_RANGE_UNSPECIFIED", value: 0)
!347 = !DIEnumerator(name: "AVCOL_RANGE_MPEG", value: 1)
!348 = !DIEnumerator(name: "AVCOL_RANGE_JPEG", value: 2)
!349 = !DIEnumerator(name: "AVCOL_RANGE_NB", value: 3)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !258, file: !257, line: 514, baseType: !351, size: 32, align: 32, offset: 3104)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorPrimaries", file: !344, line: 440, size: 32, align: 32, elements: !352)
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!353 = !DIEnumerator(name: "AVCOL_PRI_RESERVED0", value: 0)
!354 = !DIEnumerator(name: "AVCOL_PRI_BT709", value: 1)
!355 = !DIEnumerator(name: "AVCOL_PRI_UNSPECIFIED", value: 2)
!356 = !DIEnumerator(name: "AVCOL_PRI_RESERVED", value: 3)
!357 = !DIEnumerator(name: "AVCOL_PRI_BT470M", value: 4)
!358 = !DIEnumerator(name: "AVCOL_PRI_BT470BG", value: 5)
!359 = !DIEnumerator(name: "AVCOL_PRI_SMPTE170M", value: 6)
!360 = !DIEnumerator(name: "AVCOL_PRI_SMPTE240M", value: 7)
!361 = !DIEnumerator(name: "AVCOL_PRI_FILM", value: 8)
!362 = !DIEnumerator(name: "AVCOL_PRI_BT2020", value: 9)
!363 = !DIEnumerator(name: "AVCOL_PRI_SMPTE428", value: 10)
!364 = !DIEnumerator(name: "AVCOL_PRI_SMPTEST428_1", value: 10)
!365 = !DIEnumerator(name: "AVCOL_PRI_SMPTE431", value: 11)
!366 = !DIEnumerator(name: "AVCOL_PRI_SMPTE432", value: 12)
!367 = !DIEnumerator(name: "AVCOL_PRI_JEDEC_P22", value: 22)
!368 = !DIEnumerator(name: "AVCOL_PRI_NB", value: 23)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !258, file: !257, line: 516, baseType: !370, size: 32, align: 32, offset: 3136)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !344, line: 464, size: 32, align: 32, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393}
!372 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!373 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!374 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!375 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!376 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!377 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!378 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!379 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!380 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!381 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!382 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!383 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!384 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!385 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!386 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!387 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!388 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!389 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!390 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!391 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!392 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!393 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !258, file: !257, line: 523, baseType: !395, size: 32, align: 32, offset: 3168)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !344, line: 493, size: 32, align: 32, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413}
!397 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!398 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!399 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!400 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!401 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!402 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!403 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!404 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!405 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!406 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!407 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!408 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!409 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!410 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!411 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!412 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!413 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !258, file: !257, line: 525, baseType: !415, size: 32, align: 32, offset: 3200)
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !344, line: 538, size: 32, align: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424}
!417 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!418 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!419 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!420 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!421 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!422 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!423 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!424 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !258, file: !257, line: 532, baseType: !249, size: 64, align: 64, offset: 3264)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !258, file: !257, line: 539, baseType: !249, size: 64, align: 64, offset: 3328)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !258, file: !257, line: 547, baseType: !249, size: 64, align: 64, offset: 3392)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !258, file: !257, line: 554, baseType: !115, size: 64, align: 64, offset: 3456)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !258, file: !257, line: 563, baseType: !63, size: 32, align: 32, offset: 3520)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !258, file: !257, line: 572, baseType: !63, size: 32, align: 32, offset: 3552)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !258, file: !257, line: 581, baseType: !63, size: 32, align: 32, offset: 3584)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !258, file: !257, line: 588, baseType: !433, size: 64, align: 64, offset: 3648)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !209, line: 36, baseType: !435)
!435 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !258, file: !257, line: 593, baseType: !63, size: 32, align: 32, offset: 3712)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !258, file: !257, line: 596, baseType: !63, size: 32, align: 32, offset: 3744)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !258, file: !257, line: 599, baseType: !197, size: 64, align: 64, offset: 3776)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !258, file: !257, line: 605, baseType: !197, size: 64, align: 64, offset: 3840)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !258, file: !257, line: 616, baseType: !197, size: 64, align: 64, offset: 3904)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !258, file: !257, line: 626, baseType: !442, size: 64, align: 64, offset: 3968)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !443, line: 216, baseType: !230)
!443 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!444 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !258, file: !257, line: 627, baseType: !442, size: 64, align: 64, offset: 4032)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !258, file: !257, line: 628, baseType: !442, size: 64, align: 64, offset: 4096)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !258, file: !257, line: 629, baseType: !442, size: 64, align: 64, offset: 4160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !258, file: !257, line: 645, baseType: !197, size: 64, align: 64, offset: 4224)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "partial_buf_size", scope: !36, file: !35, line: 553, baseType: !63, size: 32, align: 32, offset: 1472)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "min_samples", scope: !36, file: !35, line: 562, baseType: !63, size: 32, align: 32, offset: 1504)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "max_samples", scope: !36, file: !35, line: 568, baseType: !63, size: 32, align: 32, offset: 1536)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !36, file: !35, line: 573, baseType: !63, size: 32, align: 32, offset: 1568)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !36, file: !35, line: 578, baseType: !146, size: 32, align: 32, offset: 1600)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_in", scope: !36, file: !35, line: 583, baseType: !249, size: 64, align: 64, offset: 1664)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count_out", scope: !36, file: !35, line: 583, baseType: !249, size: 64, align: 64, offset: 1728)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "frame_pool", scope: !36, file: !35, line: 588, baseType: !57, size: 64, align: 64, offset: 1792)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "frame_wanted_out", scope: !36, file: !35, line: 595, baseType: !63, size: 32, align: 32, offset: 1856)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !36, file: !35, line: 601, baseType: !197, size: 64, align: 64, offset: 1920)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !36, file: !35, line: 610, baseType: !459, size: 491520, align: 8, offset: 1984)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 491520, align: 8, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 61440)
!462 = !{!463, !464, !465}
!463 = !DIEnumerator(name: "AVLINK_UNINIT", value: 0)
!464 = !DIEnumerator(name: "AVLINK_STARTINIT", value: 1)
!465 = !DIEnumerator(name: "AVLINK_INIT", value: 2)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "var_name", file: !467, line: 45, size: 32, align: 32, elements: !468)
!467 = !DIFile(filename: "libavfilter/scale.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!469 = !DIEnumerator(name: "VAR_PI", value: 0)
!470 = !DIEnumerator(name: "VAR_PHI", value: 1)
!471 = !DIEnumerator(name: "VAR_E", value: 2)
!472 = !DIEnumerator(name: "VAR_IN_W", value: 3)
!473 = !DIEnumerator(name: "VAR_IW", value: 4)
!474 = !DIEnumerator(name: "VAR_IN_H", value: 5)
!475 = !DIEnumerator(name: "VAR_IH", value: 6)
!476 = !DIEnumerator(name: "VAR_OUT_W", value: 7)
!477 = !DIEnumerator(name: "VAR_OW", value: 8)
!478 = !DIEnumerator(name: "VAR_OUT_H", value: 9)
!479 = !DIEnumerator(name: "VAR_OH", value: 10)
!480 = !DIEnumerator(name: "VAR_A", value: 11)
!481 = !DIEnumerator(name: "VAR_SAR", value: 12)
!482 = !DIEnumerator(name: "VAR_DAR", value: 13)
!483 = !DIEnumerator(name: "VAR_HSUB", value: 14)
!484 = !DIEnumerator(name: "VAR_VSUB", value: 15)
!485 = !DIEnumerator(name: "VAR_OHSUB", value: 16)
!486 = !DIEnumerator(name: "VAR_OVSUB", value: 17)
!487 = !DIEnumerator(name: "VARS_NB", value: 18)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "var_name_scale2ref", file: !467, line: 95, size: 32, align: 32, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498}
!490 = !DIEnumerator(name: "VAR_S2R_MAIN_W", value: 0)
!491 = !DIEnumerator(name: "VAR_S2R_MAIN_H", value: 1)
!492 = !DIEnumerator(name: "VAR_S2R_MAIN_A", value: 2)
!493 = !DIEnumerator(name: "VAR_S2R_MAIN_SAR", value: 3)
!494 = !DIEnumerator(name: "VAR_S2R_MAIN_DAR", value: 4)
!495 = !DIEnumerator(name: "VAR_S2R_MDAR", value: 5)
!496 = !DIEnumerator(name: "VAR_S2R_MAIN_HSUB", value: 6)
!497 = !DIEnumerator(name: "VAR_S2R_MAIN_VSUB", value: 7)
!498 = !DIEnumerator(name: "VARS_S2R_NB", value: 8)
!499 = !{!194, !57, !63}
!500 = !{!501, !506}
!501 = distinct !DIGlobalVariable(name: "var_names_scale2ref", scope: !0, file: !467, line: 70, type: !502, isLocal: true, isDefinition: true, variable: [27 x i8*]* @var_names_scale2ref)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 1728, align: 64, elements: !504)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!504 = !{!505}
!505 = !DISubrange(count: 27)
!506 = distinct !DIGlobalVariable(name: "var_names", scope: !0, file: !467, line: 27, type: !507, isLocal: true, isDefinition: true, variable: [19 x i8*]* @var_names)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !503, size: 1216, align: 64, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 19)
!510 = !{i32 2, !"Dwarf Version", i32 4}
!511 = !{i32 2, !"Debug Info Version", i32 3}
!512 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!513 = distinct !DISubprogram(name: "ff_scale_eval_dimensions", scope: !467, file: !467, line: 106, type: !514, isLocal: false, isDefinition: true, scopeLine: 110, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !516)
!514 = !DISubroutineType(types: !515)
!515 = !{!63, !57, !50, !50, !143, !143, !177, !177}
!516 = !{}
!517 = !DILocalVariable(name: "log_ctx", arg: 1, scope: !513, file: !467, line: 106, type: !57)
!518 = !DIExpression()
!519 = !DILocation(line: 106, column: 36, scope: !513)
!520 = !DILocalVariable(name: "w_expr", arg: 2, scope: !513, file: !467, line: 107, type: !50)
!521 = !DILocation(line: 107, column: 17, scope: !513)
!522 = !DILocalVariable(name: "h_expr", arg: 3, scope: !513, file: !467, line: 107, type: !50)
!523 = !DILocation(line: 107, column: 37, scope: !513)
!524 = !DILocalVariable(name: "inlink", arg: 4, scope: !513, file: !467, line: 108, type: !143)
!525 = !DILocation(line: 108, column: 19, scope: !513)
!526 = !DILocalVariable(name: "outlink", arg: 5, scope: !513, file: !467, line: 108, type: !143)
!527 = !DILocation(line: 108, column: 41, scope: !513)
!528 = !DILocalVariable(name: "ret_w", arg: 6, scope: !513, file: !467, line: 109, type: !177)
!529 = !DILocation(line: 109, column: 10, scope: !513)
!530 = !DILocalVariable(name: "ret_h", arg: 7, scope: !513, file: !467, line: 109, type: !177)
!531 = !DILocation(line: 109, column: 22, scope: !513)
!532 = !DILocalVariable(name: "desc", scope: !513, file: !467, line: 111, type: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPixFmtDescriptor", file: !536, line: 123, baseType: !537)
!536 = !DIFile(filename: "./libavutil/pixdesc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPixFmtDescriptor", file: !536, line: 81, size: 1280, align: 64, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !559}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !537, file: !536, line: 82, baseType: !50, size: 64, align: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !537, file: !536, line: 83, baseType: !208, size: 8, align: 8, offset: 64)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_w", scope: !537, file: !536, line: 92, baseType: !208, size: 8, align: 8, offset: 72)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "log2_chroma_h", scope: !537, file: !536, line: 101, baseType: !208, size: 8, align: 8, offset: 80)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !537, file: !536, line: 106, baseType: !229, size: 64, align: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !537, file: !536, line: 117, baseType: !545, size: 1024, align: 32, offset: 192)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1024, align: 32, elements: !557)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVComponentDescriptor", file: !536, line: 70, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVComponentDescriptor", file: !536, line: 31, size: 256, align: 32, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "plane", scope: !547, file: !536, line: 35, baseType: !63, size: 32, align: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !547, file: !536, line: 41, baseType: !63, size: 32, align: 32, offset: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !547, file: !536, line: 47, baseType: !63, size: 32, align: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !547, file: !536, line: 53, baseType: !63, size: 32, align: 32, offset: 96)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !547, file: !536, line: 58, baseType: !63, size: 32, align: 32, offset: 128)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "step_minus1", scope: !547, file: !536, line: 62, baseType: !63, size: 32, align: 32, offset: 160)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "depth_minus1", scope: !547, file: !536, line: 65, baseType: !63, size: 32, align: 32, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "offset_plus1", scope: !547, file: !536, line: 68, baseType: !63, size: 32, align: 32, offset: 224)
!557 = !{!558}
!558 = !DISubrange(count: 4)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !537, file: !536, line: 122, baseType: !50, size: 64, align: 64, offset: 1216)
!560 = !DILocation(line: 111, column: 31, scope: !513)
!561 = !DILocation(line: 111, column: 58, scope: !513)
!562 = !DILocation(line: 111, column: 66, scope: !513)
!563 = !DILocation(line: 111, column: 38, scope: !513)
!564 = !DILocalVariable(name: "out_desc", scope: !513, file: !467, line: 112, type: !533)
!565 = !DILocation(line: 112, column: 31, scope: !513)
!566 = !DILocation(line: 112, column: 62, scope: !513)
!567 = !DILocation(line: 112, column: 71, scope: !513)
!568 = !DILocation(line: 112, column: 42, scope: !513)
!569 = !DILocalVariable(name: "expr", scope: !513, file: !467, line: 113, type: !50)
!570 = !DILocation(line: 113, column: 17, scope: !513)
!571 = !DILocalVariable(name: "w", scope: !513, file: !467, line: 114, type: !63)
!572 = !DILocation(line: 114, column: 9, scope: !513)
!573 = !DILocalVariable(name: "h", scope: !513, file: !467, line: 114, type: !63)
!574 = !DILocation(line: 114, column: 12, scope: !513)
!575 = !DILocalVariable(name: "factor_w", scope: !513, file: !467, line: 115, type: !63)
!576 = !DILocation(line: 115, column: 9, scope: !513)
!577 = !DILocalVariable(name: "factor_h", scope: !513, file: !467, line: 115, type: !63)
!578 = !DILocation(line: 115, column: 19, scope: !513)
!579 = !DILocalVariable(name: "eval_w", scope: !513, file: !467, line: 116, type: !63)
!580 = !DILocation(line: 116, column: 9, scope: !513)
!581 = !DILocalVariable(name: "eval_h", scope: !513, file: !467, line: 116, type: !63)
!582 = !DILocation(line: 116, column: 17, scope: !513)
!583 = !DILocalVariable(name: "ret", scope: !513, file: !467, line: 117, type: !63)
!584 = !DILocation(line: 117, column: 9, scope: !513)
!585 = !DILocalVariable(name: "scale2ref", scope: !513, file: !467, line: 118, type: !51)
!586 = !DILocation(line: 118, column: 16, scope: !513)
!587 = !DILocation(line: 118, column: 28, scope: !513)
!588 = !DILocation(line: 118, column: 37, scope: !513)
!589 = !DILocation(line: 118, column: 42, scope: !513)
!590 = !DILocation(line: 118, column: 52, scope: !513)
!591 = !DILocation(line: 118, column: 57, scope: !513)
!592 = !DILocation(line: 118, column: 60, scope: !593)
!593 = !DILexicalBlockFile(scope: !513, file: !467, discriminator: 1)
!594 = !DILocation(line: 118, column: 69, scope: !593)
!595 = !DILocation(line: 118, column: 74, scope: !593)
!596 = !DILocation(line: 118, column: 87, scope: !593)
!597 = !DILocation(line: 118, column: 84, scope: !593)
!598 = !DILocation(line: 118, column: 57, scope: !599)
!599 = !DILexicalBlockFile(scope: !513, file: !467, discriminator: 2)
!600 = !DILocation(line: 118, column: 28, scope: !599)
!601 = !DILocation(line: 118, column: 16, scope: !599)
!602 = !DILocalVariable(name: "var_values", scope: !513, file: !467, line: 119, type: !603)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 1664, align: 64, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 26)
!606 = !DILocation(line: 119, column: 12, scope: !513)
!607 = !DILocalVariable(name: "res", scope: !513, file: !467, line: 119, type: !194)
!608 = !DILocation(line: 119, column: 47, scope: !513)
!609 = !DILocalVariable(name: "main_desc", scope: !513, file: !467, line: 120, type: !533)
!610 = !DILocation(line: 120, column: 31, scope: !513)
!611 = !DILocalVariable(name: "main_link", scope: !513, file: !467, line: 121, type: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!614 = !DILocation(line: 121, column: 25, scope: !513)
!615 = !DILocalVariable(name: "names", scope: !513, file: !467, line: 122, type: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64, align: 64)
!617 = !DILocation(line: 122, column: 24, scope: !513)
!618 = !DILocation(line: 122, column: 32, scope: !513)
!619 = !DILocation(line: 124, column: 9, scope: !620)
