; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--h264_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!903 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_DOUBLING", value: 7)
!904 = !DIEnumerator(name: "H264_SEI_PIC_STRUCT_FRAME_TRIPLING", value: 8)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !894, line: 60, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913}
!907 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_CHECKERBOARD", value: 0)
!908 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_COLUMN", value: 1)
!909 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_ROW", value: 2)
!910 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_SIDE_BY_SIDE", value: 3)
!911 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_TOP_BOTTOM", value: 4)
!912 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_INTERLEAVE_TEMPORAL", value: 5)
!913 = !DIEnumerator(name: "H264_SEI_FPA_TYPE_2D", value: 6)
!914 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !915, line: 33, size: 32, align: 32, elements: !916)
!915 = !DIFile(filename: "libavcodec/h264.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!917 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED", value: 0)
!918 = !DIEnumerator(name: "H264_NAL_SLICE", value: 1)
!919 = !DIEnumerator(name: "H264_NAL_DPA", value: 2)
!920 = !DIEnumerator(name: "H264_NAL_DPB", value: 3)
!921 = !DIEnumerator(name: "H264_NAL_DPC", value: 4)
!922 = !DIEnumerator(name: "H264_NAL_IDR_SLICE", value: 5)
!923 = !DIEnumerator(name: "H264_NAL_SEI", value: 6)
!924 = !DIEnumerator(name: "H264_NAL_SPS", value: 7)
!925 = !DIEnumerator(name: "H264_NAL_PPS", value: 8)
!926 = !DIEnumerator(name: "H264_NAL_AUD", value: 9)
!927 = !DIEnumerator(name: "H264_NAL_END_SEQUENCE", value: 10)
!928 = !DIEnumerator(name: "H264_NAL_END_STREAM", value: 11)
!929 = !DIEnumerator(name: "H264_NAL_FILLER_DATA", value: 12)
!930 = !DIEnumerator(name: "H264_NAL_SPS_EXT", value: 13)
!931 = !DIEnumerator(name: "H264_NAL_PREFIX", value: 14)
!932 = !DIEnumerator(name: "H264_NAL_SUB_SPS", value: 15)
!933 = !DIEnumerator(name: "H264_NAL_DPS", value: 16)
!934 = !DIEnumerator(name: "H264_NAL_RESERVED17", value: 17)
!935 = !DIEnumerator(name: "H264_NAL_RESERVED18", value: 18)
!936 = !DIEnumerator(name: "H264_NAL_AUXILIARY_SLICE", value: 19)
!937 = !DIEnumerator(name: "H264_NAL_EXTEN_SLICE", value: 20)
!938 = !DIEnumerator(name: "H264_NAL_DEPTH_EXTEN_SLICE", value: 21)
!939 = !DIEnumerator(name: "H264_NAL_RESERVED22", value: 22)
!940 = !DIEnumerator(name: "H264_NAL_RESERVED23", value: 23)
!941 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED24", value: 24)
!942 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED25", value: 25)
!943 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED26", value: 26)
!944 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED27", value: 27)
!945 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED28", value: 28)
!946 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED29", value: 29)
!947 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED30", value: 30)
!948 = !DIEnumerator(name: "H264_NAL_UNSPECIFIED31", value: 31)
!949 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MMCOOpcode", file: !950, line: 109, size: 32, align: 32, elements: !951)
!950 = !DIFile(filename: "libavcodec/h264dec.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!951 = !{!952, !953, !954, !955, !956, !957, !958}
!952 = !DIEnumerator(name: "MMCO_END", value: 0)
!953 = !DIEnumerator(name: "MMCO_SHORT2UNUSED", value: 1)
!954 = !DIEnumerator(name: "MMCO_LONG2UNUSED", value: 2)
!955 = !DIEnumerator(name: "MMCO_SHORT2LONG", value: 3)
!956 = !DIEnumerator(name: "MMCO_SET_MAX_LONG", value: 4)
!957 = !DIEnumerator(name: "MMCO_RESET", value: 5)
!958 = !DIEnumerator(name: "MMCO_LONG", value: 6)
!959 = !{!960, !963, !964, !965, !972, !974, !1038, !971, !1109}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !961, line: 40, baseType: !962)
!961 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!962 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!963 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!964 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !968, line: 221, size: 32, align: 8, elements: !969)
!968 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !967, file: !968, line: 221, baseType: !971, size: 32, align: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !961, line: 51, baseType: !964)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !961, line: 48, baseType: !973)
!973 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "PPS", file: !977, line: 136, baseType: !978)
!977 = !DIFile(filename: "libavcodec/h264_ps.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PPS", file: !977, line: 109, size: 1391104, align: 64, elements: !979)
!979 = !{!980, !981, !982, !983, !984, !985, !989, !990, !991, !992, !993, !995, !996, !997, !998, !999, !1004, !1008, !1012, !1013, !1017, !1021, !1024, !1027, !1033}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !978, file: !977, line: 110, baseType: !964, size: 32, align: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "cabac", scope: !978, file: !977, line: 111, baseType: !963, size: 32, align: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pic_order_present", scope: !978, file: !977, line: 112, baseType: !963, size: 32, align: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "slice_group_count", scope: !978, file: !977, line: 113, baseType: !963, size: 32, align: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "mb_slice_group_map_type", scope: !978, file: !977, line: 114, baseType: !963, size: 32, align: 32, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ref_count", scope: !978, file: !977, line: 115, baseType: !986, size: 64, align: 32, offset: 160)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 64, align: 32, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 2)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_pred", scope: !978, file: !977, line: 116, baseType: !963, size: 32, align: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "weighted_bipred_idc", scope: !978, file: !977, line: 117, baseType: !963, size: 32, align: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "init_qp", scope: !978, file: !977, line: 118, baseType: !963, size: 32, align: 32, offset: 288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "init_qs", scope: !978, file: !977, line: 119, baseType: !963, size: 32, align: 32, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_index_offset", scope: !978, file: !977, line: 120, baseType: !994, size: 64, align: 32, offset: 352)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 64, align: 32, elements: !987)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "deblocking_filter_parameters_present", scope: !978, file: !977, line: 121, baseType: !963, size: 32, align: 32, offset: 416)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "constrained_intra_pred", scope: !978, file: !977, line: 122, baseType: !963, size: 32, align: 32, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "redundant_pic_cnt_present", scope: !978, file: !977, line: 123, baseType: !963, size: 32, align: 32, offset: 480)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "transform_8x8_mode", scope: !978, file: !977, line: 124, baseType: !963, size: 32, align: 32, offset: 512)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !978, file: !977, line: 125, baseType: !1000, size: 768, align: 8, offset: 544)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 768, align: 8, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DISubrange(count: 6)
!1003 = !DISubrange(count: 16)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !978, file: !977, line: 126, baseType: !1005, size: 3072, align: 8, offset: 1312)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 3072, align: 8, elements: !1006)
!1006 = !{!1002, !1007}
!1007 = !DISubrange(count: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_table", scope: !978, file: !977, line: 127, baseType: !1009, size: 1408, align: 8, offset: 4384)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 1408, align: 8, elements: !1010)
!1010 = !{!988, !1011}
!1011 = !DISubrange(count: 88)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_qp_diff", scope: !978, file: !977, line: 128, baseType: !963, size: 32, align: 32, offset: 5792)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !978, file: !977, line: 129, baseType: !1014, size: 32768, align: 8, offset: 5824)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 32768, align: 8, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 4096)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !978, file: !977, line: 130, baseType: !1018, size: 64, align: 64, offset: 38592)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1019, line: 216, baseType: !1020)
!1019 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1020 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_buffer", scope: !978, file: !977, line: 132, baseType: !1022, size: 270336, align: 32, offset: 38656)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 270336, align: 32, elements: !1023)
!1023 = !{!1002, !1011, !1003}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_buffer", scope: !978, file: !977, line: 133, baseType: !1025, size: 1081344, align: 32, offset: 308992)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 1081344, align: 32, elements: !1026)
!1026 = !{!1002, !1011, !1007}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "dequant4_coeff", scope: !978, file: !977, line: 134, baseType: !1028, size: 384, align: 64, offset: 1390336)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 384, align: 64, elements: !1032)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 512, align: 32, elements: !1031)
!1031 = !{!1003}
!1032 = !{!1002}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "dequant8_coeff", scope: !978, file: !977, line: 135, baseType: !1034, size: 384, align: 64, offset: 1390720)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1035, size: 384, align: 64, elements: !1032)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 2048, align: 32, elements: !1037)
!1037 = !{!1007}
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "SPS", file: !977, line: 104, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SPS", file: !977, line: 44, size: 42432, align: 64, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "sps_id", scope: !1041, file: !977, line: 45, baseType: !964, size: 32, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "profile_idc", scope: !1041, file: !977, line: 46, baseType: !963, size: 32, align: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "level_idc", scope: !1041, file: !977, line: 47, baseType: !963, size: 32, align: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_format_idc", scope: !1041, file: !977, line: 48, baseType: !963, size: 32, align: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "transform_bypass", scope: !1041, file: !977, line: 49, baseType: !963, size: 32, align: 32, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_frame_num", scope: !1041, file: !977, line: 50, baseType: !963, size: 32, align: 32, offset: 160)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "poc_type", scope: !1041, file: !977, line: 51, baseType: !963, size: 32, align: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "log2_max_poc_lsb", scope: !1041, file: !977, line: 52, baseType: !963, size: 32, align: 32, offset: 224)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "delta_pic_order_always_zero_flag", scope: !1041, file: !977, line: 53, baseType: !963, size: 32, align: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_non_ref_pic", scope: !1041, file: !977, line: 54, baseType: !963, size: 32, align: 32, offset: 288)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_top_to_bottom_field", scope: !1041, file: !977, line: 55, baseType: !963, size: 32, align: 32, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "poc_cycle_length", scope: !1041, file: !977, line: 56, baseType: !963, size: 32, align: 32, offset: 352)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ref_frame_count", scope: !1041, file: !977, line: 57, baseType: !963, size: 32, align: 32, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gaps_in_frame_num_allowed_flag", scope: !1041, file: !977, line: 58, baseType: !963, size: 32, align: 32, offset: 416)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1041, file: !977, line: 59, baseType: !963, size: 32, align: 32, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1041, file: !977, line: 61, baseType: !963, size: 32, align: 32, offset: 480)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "frame_mbs_only_flag", scope: !1041, file: !977, line: 62, baseType: !963, size: 32, align: 32, offset: 512)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "mb_aff", scope: !1041, file: !977, line: 63, baseType: !963, size: 32, align: 32, offset: 544)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "direct_8x8_inference_flag", scope: !1041, file: !977, line: 64, baseType: !963, size: 32, align: 32, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "crop", scope: !1041, file: !977, line: 65, baseType: !963, size: 32, align: 32, offset: 608)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1041, file: !977, line: 68, baseType: !964, size: 32, align: 32, offset: 640)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1041, file: !977, line: 69, baseType: !964, size: 32, align: 32, offset: 672)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1041, file: !977, line: 70, baseType: !964, size: 32, align: 32, offset: 704)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1041, file: !977, line: 71, baseType: !964, size: 32, align: 32, offset: 736)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vui_parameters_present_flag", scope: !1041, file: !977, line: 72, baseType: !963, size: 32, align: 32, offset: 768)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sar", scope: !1041, file: !977, line: 73, baseType: !1069, size: 64, align: 32, offset: 800)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1070, line: 61, baseType: !1071)
!1070 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1070, line: 58, size: 64, align: 32, elements: !1072)
!1072 = !{!1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1071, file: !1070, line: 59, baseType: !963, size: 32, align: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1071, file: !1070, line: 60, baseType: !963, size: 32, align: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "video_signal_type_present_flag", scope: !1041, file: !977, line: 74, baseType: !963, size: 32, align: 32, offset: 864)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "full_range", scope: !1041, file: !977, line: 75, baseType: !963, size: 32, align: 32, offset: 896)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "colour_description_present_flag", scope: !1041, file: !977, line: 76, baseType: !963, size: 32, align: 32, offset: 928)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1041, file: !977, line: 77, baseType: !801, size: 32, align: 32, offset: 960)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1041, file: !977, line: 78, baseType: !819, size: 32, align: 32, offset: 992)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1041, file: !977, line: 79, baseType: !843, size: 32, align: 32, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "timing_info_present_flag", scope: !1041, file: !977, line: 80, baseType: !963, size: 32, align: 32, offset: 1056)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "num_units_in_tick", scope: !1041, file: !977, line: 81, baseType: !971, size: 32, align: 32, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "time_scale", scope: !1041, file: !977, line: 82, baseType: !971, size: 32, align: 32, offset: 1120)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_frame_rate_flag", scope: !1041, file: !977, line: 83, baseType: !963, size: 32, align: 32, offset: 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "offset_for_ref_frame", scope: !1041, file: !977, line: 84, baseType: !1086, size: 4096, align: 16, offset: 1184)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 4096, align: 16, elements: !1088)
!1087 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1088 = !{!1089}
!1089 = !DISubrange(count: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "bitstream_restriction_flag", scope: !1041, file: !977, line: 85, baseType: !963, size: 32, align: 32, offset: 5280)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "num_reorder_frames", scope: !1041, file: !977, line: 86, baseType: !963, size: 32, align: 32, offset: 5312)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix_present", scope: !1041, file: !977, line: 87, baseType: !963, size: 32, align: 32, offset: 5344)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix4", scope: !1041, file: !977, line: 88, baseType: !1000, size: 768, align: 8, offset: 5376)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "scaling_matrix8", scope: !1041, file: !977, line: 89, baseType: !1005, size: 3072, align: 8, offset: 6144)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "nal_hrd_parameters_present_flag", scope: !1041, file: !977, line: 90, baseType: !963, size: 32, align: 32, offset: 9216)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "vcl_hrd_parameters_present_flag", scope: !1041, file: !977, line: 91, baseType: !963, size: 32, align: 32, offset: 9248)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pic_struct_present_flag", scope: !1041, file: !977, line: 92, baseType: !963, size: 32, align: 32, offset: 9280)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "time_offset_length", scope: !1041, file: !977, line: 93, baseType: !963, size: 32, align: 32, offset: 9312)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_cnt", scope: !1041, file: !977, line: 94, baseType: !963, size: 32, align: 32, offset: 9344)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "initial_cpb_removal_delay_length", scope: !1041, file: !977, line: 95, baseType: !963, size: 32, align: 32, offset: 9376)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cpb_removal_delay_length", scope: !1041, file: !977, line: 96, baseType: !963, size: 32, align: 32, offset: 9408)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "dpb_output_delay_length", scope: !1041, file: !977, line: 97, baseType: !963, size: 32, align: 32, offset: 9440)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_luma", scope: !1041, file: !977, line: 98, baseType: !963, size: 32, align: 32, offset: 9472)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth_chroma", scope: !1041, file: !977, line: 99, baseType: !963, size: 32, align: 32, offset: 9504)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "residual_color_transform_flag", scope: !1041, file: !977, line: 100, baseType: !963, size: 32, align: 32, offset: 9536)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "constraint_set_flags", scope: !1041, file: !977, line: 101, baseType: !963, size: 32, align: 32, offset: 9568)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1041, file: !977, line: 102, baseType: !1014, size: 32768, align: 8, offset: 9600)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "data_size", scope: !1041, file: !977, line: 103, baseType: !1018, size: 64, align: 64, offset: 42368)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1110 = !{!1111}
!1111 = distinct !DIGlobalVariable(name: "ff_h264_parser", scope: !0, file: !1112, line: 708, type: !1113, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_h264_parser)
!1112 = !DIFile(filename: "libavcodec/h264_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !1115)
!1115 = !{!1116, !1120, !1121, !1169, !1886, !1890, !1894}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1114, file: !4, line: 5260, baseType: !1117, size: 160, align: 32)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 160, align: 32, elements: !1118)
!1118 = !{!1119}
!1119 = !DISubrange(count: 5)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1114, file: !4, line: 5261, baseType: !963, size: 32, align: 32, offset: 160)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !1114, file: !4, line: 5262, baseType: !1122, size: 64, align: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!963, !1125}
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !1128)
!1128 = !{!1129, !1130, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1127, file: !4, line: 5093, baseType: !1109, size: 64, align: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !1127, file: !4, line: 5094, baseType: !1131, size: 64, align: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !1127, file: !4, line: 5095, baseType: !960, size: 64, align: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !1127, file: !4, line: 5096, baseType: !960, size: 64, align: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !1127, file: !4, line: 5098, baseType: !960, size: 64, align: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1127, file: !4, line: 5100, baseType: !963, size: 32, align: 32, offset: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1127, file: !4, line: 5110, baseType: !963, size: 32, align: 32, offset: 352)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1127, file: !4, line: 5111, baseType: !960, size: 64, align: 64, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1127, file: !4, line: 5112, baseType: !960, size: 64, align: 64, offset: 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !1127, file: !4, line: 5115, baseType: !960, size: 64, align: 64, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !1127, file: !4, line: 5116, baseType: !960, size: 64, align: 64, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !1127, file: !4, line: 5117, baseType: !963, size: 32, align: 32, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !1127, file: !4, line: 5120, baseType: !963, size: 32, align: 32, offset: 672)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !1127, file: !4, line: 5121, baseType: !1144, size: 256, align: 64, offset: 704)
!1144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 256, align: 64, elements: !1145)
!1145 = !{!1146}
!1146 = !DISubrange(count: 4)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !1127, file: !4, line: 5122, baseType: !1144, size: 256, align: 64, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !1127, file: !4, line: 5123, baseType: !1144, size: 256, align: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1127, file: !4, line: 5125, baseType: !963, size: 32, align: 32, offset: 1472)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1127, file: !4, line: 5132, baseType: !960, size: 64, align: 64, offset: 1536)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !1127, file: !4, line: 5133, baseType: !1144, size: 256, align: 64, offset: 1600)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1127, file: !4, line: 5141, baseType: !963, size: 32, align: 32, offset: 1856)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1127, file: !4, line: 5148, baseType: !960, size: 64, align: 64, offset: 1920)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !1127, file: !4, line: 5161, baseType: !963, size: 32, align: 32, offset: 1984)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !1127, file: !4, line: 5176, baseType: !963, size: 32, align: 32, offset: 2016)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !1127, file: !4, line: 5190, baseType: !963, size: 32, align: 32, offset: 2048)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !1127, file: !4, line: 5197, baseType: !1144, size: 256, align: 64, offset: 2112)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1127, file: !4, line: 5202, baseType: !960, size: 64, align: 64, offset: 2368)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !1127, file: !4, line: 5207, baseType: !960, size: 64, align: 64, offset: 2432)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1127, file: !4, line: 5214, baseType: !963, size: 32, align: 32, offset: 2496)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1127, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !1127, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !1127, file: !4, line: 5234, baseType: !963, size: 32, align: 32, offset: 2592)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1127, file: !4, line: 5239, baseType: !963, size: 32, align: 32, offset: 2624)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1127, file: !4, line: 5240, baseType: !963, size: 32, align: 32, offset: 2656)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1127, file: !4, line: 5245, baseType: !963, size: 32, align: 32, offset: 2688)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1127, file: !4, line: 5246, baseType: !963, size: 32, align: 32, offset: 2720)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1127, file: !4, line: 5256, baseType: !963, size: 32, align: 32, offset: 2752)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !1114, file: !4, line: 5265, baseType: !1170, size: 64, align: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!963, !1125, !1173, !1885, !1453, !1281, !963}
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64, align: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1176)
!1176 = !{!1177, !1221, !1222, !1223, !1483, !1484, !1485, !1486, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1639, !1643, !1644, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764, !1765, !1766, !1767, !1768, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1823, !1830, !1831, !1832, !1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1861, !1862, !1863, !1864, !1865, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1175, file: !4, line: 1561, baseType: !1178, size: 64, align: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !1182)
!1182 = !{!1183, !1187, !1191, !1195, !1196, !1197, !1198, !1202, !1208, !1210, !1214}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1181, file: !19, line: 72, baseType: !1184, size: 64, align: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1186 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1181, file: !19, line: 78, baseType: !1188, size: 64, align: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{!1184, !1109}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1181, file: !19, line: 85, baseType: !1192, size: 64, align: 64, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64, align: 64)
!1193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1194)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1181, file: !19, line: 93, baseType: !963, size: 32, align: 32, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1181, file: !19, line: 99, baseType: !963, size: 32, align: 32, offset: 224)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1181, file: !19, line: 108, baseType: !963, size: 32, align: 32, offset: 256)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1181, file: !19, line: 113, baseType: !1199, size: 64, align: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DISubroutineType(types: !1201)
!1201 = !{!1109, !1109, !1109}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1181, file: !19, line: 123, baseType: !1203, size: 64, align: 64, offset: 384)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64, align: 64)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!1206, !1206}
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1181)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1181, file: !19, line: 130, baseType: !1209, size: 32, align: 32, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1181, file: !19, line: 136, baseType: !1211, size: 64, align: 64, offset: 512)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64, align: 64)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{!1209, !1109}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1181, file: !19, line: 142, baseType: !1215, size: 64, align: 64, offset: 576)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{!963, !1218, !1109, !1184, !963}
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1220 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1175, file: !4, line: 1562, baseType: !963, size: 32, align: 32, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1175, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1175, file: !4, line: 1565, baseType: !1224, size: 64, align: 64, offset: 128)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1227)
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1236, !1239, !1242, !1245, !1249, !1250, !1251, !1259, !1260, !1261, !1263, !1267, !1273, !1284, !1288, !1289, !1335, !1454, !1458, !1459, !1463, !1467, !1472, !1476, !1477, !1478}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1226, file: !4, line: 3475, baseType: !1184, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1226, file: !4, line: 3480, baseType: !1184, size: 64, align: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1226, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1226, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1226, file: !4, line: 3487, baseType: !963, size: 32, align: 32, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1226, file: !4, line: 3488, baseType: !1234, size: 64, align: 64, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1226, file: !4, line: 3489, baseType: !1237, size: 64, align: 64, offset: 320)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1226, file: !4, line: 3490, baseType: !1240, size: 64, align: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1226, file: !4, line: 3491, baseType: !1243, size: 64, align: 64, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1226, file: !4, line: 3492, baseType: !1246, size: 64, align: 64, offset: 512)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !961, line: 55, baseType: !1020)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1226, file: !4, line: 3493, baseType: !972, size: 8, align: 8, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1226, file: !4, line: 3494, baseType: !1178, size: 64, align: 64, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1226, file: !4, line: 3495, baseType: !1252, size: 64, align: 64, offset: 704)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1256)
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1255, file: !4, line: 3402, baseType: !963, size: 32, align: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1255, file: !4, line: 3403, baseType: !1184, size: 64, align: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1226, file: !4, line: 3507, baseType: !1184, size: 64, align: 64, offset: 768)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1226, file: !4, line: 3516, baseType: !963, size: 32, align: 32, offset: 832)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1226, file: !4, line: 3517, baseType: !1262, size: 64, align: 64, offset: 896)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1226, file: !4, line: 3527, baseType: !1264, size: 64, align: 64, offset: 960)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!963, !1173}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1226, file: !4, line: 3535, baseType: !1268, size: 64, align: 64, offset: 1024)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64, align: 64)
!1269 = !DISubroutineType(types: !1270)
!1270 = !{!963, !1173, !1271}
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1174)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1226, file: !4, line: 3541, baseType: !1274, size: 64, align: 64, offset: 1088)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1276)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1278, line: 223, size: 128, align: 64, elements: !1279)
!1278 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1279 = !{!1280, !1283}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1277, file: !1278, line: 224, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64, align: 64)
!1282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1277, file: !1278, line: 225, baseType: !1281, size: 64, align: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1226, file: !4, line: 3549, baseType: !1285, size: 64, align: 64, offset: 1152)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{null, !1262}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1226, file: !4, line: 3551, baseType: !1264, size: 64, align: 64, offset: 1216)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1226, file: !4, line: 3552, baseType: !1290, size: 64, align: 64, offset: 1280)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64, align: 64)
!1291 = !DISubroutineType(types: !1292)
!1292 = !{!963, !1173, !1293, !963, !1294}
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64, align: 64)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64, align: 64)
!1295 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1297)
!1297 = !{!1298, !1301, !1302, !1303, !1304, !1334}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1296, file: !4, line: 3921, baseType: !1299, size: 16, align: 16)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !961, line: 49, baseType: !1300)
!1300 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1296, file: !4, line: 3922, baseType: !971, size: 32, align: 32, offset: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1296, file: !4, line: 3923, baseType: !971, size: 32, align: 32, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1296, file: !4, line: 3924, baseType: !964, size: 32, align: 32, offset: 96)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1296, file: !4, line: 3925, baseType: !1305, size: 64, align: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64, align: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64, align: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1309)
!1309 = !{!1310, !1311, !1312, !1313, !1314, !1315, !1325, !1327, !1329, !1330, !1332, !1333}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1308, file: !4, line: 3886, baseType: !963, size: 32, align: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1308, file: !4, line: 3887, baseType: !963, size: 32, align: 32, offset: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1308, file: !4, line: 3888, baseType: !963, size: 32, align: 32, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1308, file: !4, line: 3889, baseType: !963, size: 32, align: 32, offset: 96)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1308, file: !4, line: 3890, baseType: !963, size: 32, align: 32, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1308, file: !4, line: 3897, baseType: !1316, size: 768, align: 64, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1318)
!1318 = !{!1319, !1323}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1317, file: !4, line: 3855, baseType: !1320, size: 512, align: 64)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1293, size: 512, align: 64, elements: !1321)
!1321 = !{!1322}
!1322 = !DISubrange(count: 8)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1317, file: !4, line: 3857, baseType: !1324, size: 256, align: 32, offset: 512)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 256, align: 32, elements: !1321)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1308, file: !4, line: 3903, baseType: !1326, size: 256, align: 64, offset: 960)
!1326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1293, size: 256, align: 64, elements: !1145)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1308, file: !4, line: 3904, baseType: !1328, size: 128, align: 32, offset: 1216)
!1328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 128, align: 32, elements: !1145)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1308, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1308, file: !4, line: 3908, baseType: !1331, size: 64, align: 64, offset: 1408)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1308, file: !4, line: 3915, baseType: !1331, size: 64, align: 64, offset: 1472)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1308, file: !4, line: 3917, baseType: !963, size: 32, align: 32, offset: 1536)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1296, file: !4, line: 3926, baseType: !960, size: 64, align: 64, offset: 192)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1226, file: !4, line: 3564, baseType: !1336, size: 64, align: 64, offset: 1344)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{!963, !1173, !1339, !1373, !1453}
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1341)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1342)
!1342 = !{!1343, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1369, !1370, !1371, !1372}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1341, file: !4, line: 1451, baseType: !1344, size: 64, align: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1346, line: 94, baseType: !1347)
!1346 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1346, line: 81, size: 192, align: 64, elements: !1348)
!1348 = !{!1349, !1353, !1354}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1347, file: !1346, line: 82, baseType: !1350, size: 64, align: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1346, line: 73, baseType: !1352)
!1352 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1346, line: 73, flags: DIFlagFwdDecl)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1347, file: !1346, line: 89, baseType: !1293, size: 64, align: 64, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1347, file: !1346, line: 93, baseType: !963, size: 32, align: 32, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1341, file: !4, line: 1461, baseType: !960, size: 64, align: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1341, file: !4, line: 1467, baseType: !960, size: 64, align: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1341, file: !4, line: 1468, baseType: !1293, size: 64, align: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1341, file: !4, line: 1469, baseType: !963, size: 32, align: 32, offset: 256)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1341, file: !4, line: 1470, baseType: !963, size: 32, align: 32, offset: 288)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1341, file: !4, line: 1474, baseType: !963, size: 32, align: 32, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1341, file: !4, line: 1479, baseType: !1362, size: 64, align: 64, offset: 384)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1364, file: !4, line: 1412, baseType: !1293, size: 64, align: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1364, file: !4, line: 1413, baseType: !963, size: 32, align: 32, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1364, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1341, file: !4, line: 1480, baseType: !963, size: 32, align: 32, offset: 448)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1341, file: !4, line: 1486, baseType: !960, size: 64, align: 64, offset: 512)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1341, file: !4, line: 1488, baseType: !960, size: 64, align: 64, offset: 576)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1341, file: !4, line: 1497, baseType: !960, size: 64, align: 64, offset: 640)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1375)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1376)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1377)
!1377 = !{!1378, !1379, !1380, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1407, !1409, !1410, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1376, file: !772, line: 282, baseType: !1320, size: 512, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1376, file: !772, line: 299, baseType: !1324, size: 256, align: 32, offset: 512)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1376, file: !772, line: 315, baseType: !1381, size: 64, align: 64, offset: 768)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64, align: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1376, file: !772, line: 326, baseType: !963, size: 32, align: 32, offset: 832)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1376, file: !772, line: 326, baseType: !963, size: 32, align: 32, offset: 864)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1376, file: !772, line: 334, baseType: !963, size: 32, align: 32, offset: 896)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1376, file: !772, line: 341, baseType: !963, size: 32, align: 32, offset: 928)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1376, file: !772, line: 346, baseType: !963, size: 32, align: 32, offset: 960)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1376, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1376, file: !772, line: 356, baseType: !1069, size: 64, align: 32, offset: 1024)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1376, file: !772, line: 361, baseType: !960, size: 64, align: 64, offset: 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1376, file: !772, line: 369, baseType: !960, size: 64, align: 64, offset: 1152)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1376, file: !772, line: 377, baseType: !960, size: 64, align: 64, offset: 1216)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1376, file: !772, line: 382, baseType: !963, size: 32, align: 32, offset: 1280)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1376, file: !772, line: 386, baseType: !963, size: 32, align: 32, offset: 1312)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1376, file: !772, line: 391, baseType: !963, size: 32, align: 32, offset: 1344)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1376, file: !772, line: 396, baseType: !1109, size: 64, align: 64, offset: 1408)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1376, file: !772, line: 403, baseType: !1397, size: 512, align: 64, offset: 1472)
!1397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 512, align: 64, elements: !1321)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1376, file: !772, line: 410, baseType: !963, size: 32, align: 32, offset: 1984)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1376, file: !772, line: 415, baseType: !963, size: 32, align: 32, offset: 2016)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1376, file: !772, line: 420, baseType: !963, size: 32, align: 32, offset: 2048)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1376, file: !772, line: 425, baseType: !963, size: 32, align: 32, offset: 2080)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1376, file: !772, line: 435, baseType: !960, size: 64, align: 64, offset: 2112)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1376, file: !772, line: 440, baseType: !963, size: 32, align: 32, offset: 2176)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1376, file: !772, line: 445, baseType: !1248, size: 64, align: 64, offset: 2240)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1376, file: !772, line: 459, baseType: !1406, size: 512, align: 64, offset: 2304)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1344, size: 512, align: 64, elements: !1321)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1376, file: !772, line: 473, baseType: !1408, size: 64, align: 64, offset: 2816)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64, align: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1376, file: !772, line: 477, baseType: !963, size: 32, align: 32, offset: 2880)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1376, file: !772, line: 479, baseType: !1411, size: 64, align: 64, offset: 2944)
!1411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1412, size: 64, align: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64, align: 64)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1414)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1424}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1414, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1414, file: !772, line: 203, baseType: !1293, size: 64, align: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1414, file: !772, line: 204, baseType: !963, size: 32, align: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1414, file: !772, line: 205, baseType: !1420, size: 64, align: 64, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64, align: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1422, line: 86, baseType: !1423)
!1422 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1423 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1422, line: 86, flags: DIFlagFwdDecl)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1414, file: !772, line: 206, baseType: !1344, size: 64, align: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1376, file: !772, line: 480, baseType: !963, size: 32, align: 32, offset: 3008)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1376, file: !772, line: 505, baseType: !963, size: 32, align: 32, offset: 3040)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1376, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1376, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1376, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1376, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1376, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1376, file: !772, line: 532, baseType: !960, size: 64, align: 64, offset: 3264)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1376, file: !772, line: 539, baseType: !960, size: 64, align: 64, offset: 3328)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1376, file: !772, line: 547, baseType: !960, size: 64, align: 64, offset: 3392)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1376, file: !772, line: 554, baseType: !1420, size: 64, align: 64, offset: 3456)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1376, file: !772, line: 563, baseType: !963, size: 32, align: 32, offset: 3520)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1376, file: !772, line: 572, baseType: !963, size: 32, align: 32, offset: 3552)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1376, file: !772, line: 581, baseType: !963, size: 32, align: 32, offset: 3584)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1376, file: !772, line: 588, baseType: !1440, size: 64, align: 64, offset: 3648)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !961, line: 36, baseType: !1442)
!1442 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1376, file: !772, line: 593, baseType: !963, size: 32, align: 32, offset: 3712)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1376, file: !772, line: 596, baseType: !963, size: 32, align: 32, offset: 3744)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1376, file: !772, line: 599, baseType: !1344, size: 64, align: 64, offset: 3776)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1376, file: !772, line: 605, baseType: !1344, size: 64, align: 64, offset: 3840)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1376, file: !772, line: 616, baseType: !1344, size: 64, align: 64, offset: 3904)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1376, file: !772, line: 626, baseType: !1018, size: 64, align: 64, offset: 3968)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1376, file: !772, line: 627, baseType: !1018, size: 64, align: 64, offset: 4032)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1376, file: !772, line: 628, baseType: !1018, size: 64, align: 64, offset: 4096)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1376, file: !772, line: 629, baseType: !1018, size: 64, align: 64, offset: 4160)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1376, file: !772, line: 645, baseType: !1344, size: 64, align: 64, offset: 4224)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1226, file: !4, line: 3566, baseType: !1455, size: 64, align: 64, offset: 1408)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!963, !1173, !1109, !1453, !1339}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1226, file: !4, line: 3567, baseType: !1264, size: 64, align: 64, offset: 1472)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1226, file: !4, line: 3576, baseType: !1460, size: 64, align: 64, offset: 1536)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64, align: 64)
!1461 = !DISubroutineType(types: !1462)
!1462 = !{!963, !1173, !1373}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1226, file: !4, line: 3577, baseType: !1464, size: 64, align: 64, offset: 1600)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64, align: 64)
!1465 = !DISubroutineType(types: !1466)
!1466 = !{!963, !1173, !1339}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1226, file: !4, line: 3584, baseType: !1468, size: 64, align: 64, offset: 1664)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DISubroutineType(types: !1470)
!1470 = !{!963, !1173, !1471}
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1226, file: !4, line: 3589, baseType: !1473, size: 64, align: 64, offset: 1728)
!1473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1474, size: 64, align: 64)
!1474 = !DISubroutineType(types: !1475)
!1475 = !{null, !1173}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1226, file: !4, line: 3594, baseType: !963, size: 32, align: 32, offset: 1792)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1226, file: !4, line: 3600, baseType: !1184, size: 64, align: 64, offset: 1856)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1226, file: !4, line: 3609, baseType: !1479, size: 64, align: 64, offset: 1920)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64, align: 64)
!1480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1481, size: 64, align: 64)
!1481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1482)
!1482 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1175, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1175, file: !4, line: 1581, baseType: !964, size: 32, align: 32, offset: 224)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1175, file: !4, line: 1583, baseType: !1109, size: 64, align: 64, offset: 256)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1175, file: !4, line: 1591, baseType: !1487, size: 64, align: 64, offset: 320)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64, align: 64)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1278, line: 129, size: 1664, align: 64, elements: !1489)
!1489 = !{!1490, !1491, !1492, !1493, !1494, !1512, !1513, !1519, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1488, file: !1278, line: 136, baseType: !963, size: 32, align: 32)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1488, file: !1278, line: 151, baseType: !963, size: 32, align: 32, offset: 32)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1488, file: !1278, line: 157, baseType: !963, size: 32, align: 32, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1488, file: !1278, line: 159, baseType: !1471, size: 64, align: 64, offset: 128)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1488, file: !1278, line: 161, baseType: !1495, size: 64, align: 64, offset: 192)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1278, line: 117, baseType: !1497)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1278, line: 100, size: 832, align: 64, elements: !1498)
!1498 = !{!1499, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1497, file: !1278, line: 105, baseType: !1500, size: 256, align: 64)
!1500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1501, size: 256, align: 64, elements: !1145)
!1501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1502, size: 64, align: 64)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1346, line: 238, baseType: !1503)
!1503 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1346, line: 238, flags: DIFlagFwdDecl)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1497, file: !1278, line: 110, baseType: !963, size: 32, align: 32, offset: 256)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1497, file: !1278, line: 111, baseType: !963, size: 32, align: 32, offset: 288)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1497, file: !1278, line: 111, baseType: !963, size: 32, align: 32, offset: 320)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1497, file: !1278, line: 112, baseType: !1324, size: 256, align: 32, offset: 352)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1497, file: !1278, line: 113, baseType: !1328, size: 128, align: 32, offset: 608)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1497, file: !1278, line: 114, baseType: !963, size: 32, align: 32, offset: 736)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1497, file: !1278, line: 115, baseType: !963, size: 32, align: 32, offset: 768)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1497, file: !1278, line: 116, baseType: !963, size: 32, align: 32, offset: 800)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1488, file: !1278, line: 163, baseType: !1109, size: 64, align: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1488, file: !1278, line: 165, baseType: !1514, size: 128, align: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1278, line: 122, baseType: !1515)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1278, line: 119, size: 128, align: 64, elements: !1516)
!1516 = !{!1517, !1518}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1515, file: !1278, line: 120, baseType: !1339, size: 64, align: 64)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1515, file: !1278, line: 121, baseType: !1471, size: 64, align: 64, offset: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1488, file: !1278, line: 166, baseType: !1520, size: 128, align: 64, offset: 448)
!1520 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1278, line: 127, baseType: !1521)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1278, line: 124, size: 128, align: 64, elements: !1522)
!1522 = !{!1523, !1596}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1521, file: !1278, line: 125, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1526, size: 64, align: 64)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !1527)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !1528)
!1528 = !{!1529, !1530, !1554, !1558, !1559, !1593, !1594, !1595}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1527, file: !4, line: 5751, baseType: !1178, size: 64, align: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1527, file: !4, line: 5756, baseType: !1531, size: 64, align: 64, offset: 64)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1533)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !1534)
!1534 = !{!1535, !1536, !1539, !1540, !1541, !1545, !1549, !1553}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1533, file: !4, line: 5797, baseType: !1184, size: 64, align: 64)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1533, file: !4, line: 5804, baseType: !1537, size: 64, align: 64, offset: 64)
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64, align: 64)
!1538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !49)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1533, file: !4, line: 5815, baseType: !1178, size: 64, align: 64, offset: 128)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1533, file: !4, line: 5825, baseType: !963, size: 32, align: 32, offset: 192)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1533, file: !4, line: 5826, baseType: !1542, size: 64, align: 64, offset: 256)
!1542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1543, size: 64, align: 64)
!1543 = !DISubroutineType(types: !1544)
!1544 = !{!963, !1525}
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1533, file: !4, line: 5827, baseType: !1546, size: 64, align: 64, offset: 320)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!963, !1525, !1339}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1533, file: !4, line: 5828, baseType: !1550, size: 64, align: 64, offset: 384)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{null, !1525}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1533, file: !4, line: 5829, baseType: !1550, size: 64, align: 64, offset: 448)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1527, file: !4, line: 5762, baseType: !1555, size: 64, align: 64, offset: 128)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !1557)
!1557 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1527, file: !4, line: 5768, baseType: !1109, size: 64, align: 64, offset: 192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1527, file: !4, line: 5775, baseType: !1560, size: 64, align: 64, offset: 256)
!1560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1561, size: 64, align: 64)
!1561 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !1562)
!1562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !1563)
!1563 = !{!1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592}
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1562, file: !4, line: 3940, baseType: !39, size: 32, align: 32)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1562, file: !4, line: 3944, baseType: !49, size: 32, align: 32, offset: 32)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1562, file: !4, line: 3948, baseType: !971, size: 32, align: 32, offset: 64)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1562, file: !4, line: 3958, baseType: !1293, size: 64, align: 64, offset: 128)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1562, file: !4, line: 3962, baseType: !963, size: 32, align: 32, offset: 192)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1562, file: !4, line: 3968, baseType: !963, size: 32, align: 32, offset: 224)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1562, file: !4, line: 3973, baseType: !960, size: 64, align: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1562, file: !4, line: 3986, baseType: !963, size: 32, align: 32, offset: 320)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1562, file: !4, line: 3999, baseType: !963, size: 32, align: 32, offset: 352)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1562, file: !4, line: 4004, baseType: !963, size: 32, align: 32, offset: 384)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1562, file: !4, line: 4005, baseType: !963, size: 32, align: 32, offset: 416)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1562, file: !4, line: 4010, baseType: !963, size: 32, align: 32, offset: 448)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1562, file: !4, line: 4011, baseType: !963, size: 32, align: 32, offset: 480)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1562, file: !4, line: 4020, baseType: !1069, size: 64, align: 32, offset: 512)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1562, file: !4, line: 4025, baseType: !3, size: 32, align: 32, offset: 576)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1562, file: !4, line: 4030, baseType: !795, size: 32, align: 32, offset: 608)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1562, file: !4, line: 4031, baseType: !801, size: 32, align: 32, offset: 640)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1562, file: !4, line: 4032, baseType: !819, size: 32, align: 32, offset: 672)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1562, file: !4, line: 4033, baseType: !843, size: 32, align: 32, offset: 704)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1562, file: !4, line: 4034, baseType: !862, size: 32, align: 32, offset: 736)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1562, file: !4, line: 4039, baseType: !963, size: 32, align: 32, offset: 768)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1562, file: !4, line: 4046, baseType: !1248, size: 64, align: 64, offset: 832)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1562, file: !4, line: 4050, baseType: !963, size: 32, align: 32, offset: 896)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1562, file: !4, line: 4054, baseType: !963, size: 32, align: 32, offset: 928)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1562, file: !4, line: 4061, baseType: !963, size: 32, align: 32, offset: 960)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1562, file: !4, line: 4065, baseType: !963, size: 32, align: 32, offset: 992)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1562, file: !4, line: 4073, baseType: !963, size: 32, align: 32, offset: 1024)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1562, file: !4, line: 4080, baseType: !963, size: 32, align: 32, offset: 1056)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1562, file: !4, line: 4084, baseType: !963, size: 32, align: 32, offset: 1088)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1527, file: !4, line: 5781, baseType: !1560, size: 64, align: 64, offset: 320)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1527, file: !4, line: 5787, baseType: !1069, size: 64, align: 32, offset: 384)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1527, file: !4, line: 5793, baseType: !1069, size: 64, align: 32, offset: 448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1521, file: !1278, line: 126, baseType: !963, size: 32, align: 32, offset: 64)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1488, file: !1278, line: 172, baseType: !1339, size: 64, align: 64, offset: 576)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1488, file: !1278, line: 177, baseType: !1293, size: 64, align: 64, offset: 640)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1488, file: !1278, line: 178, baseType: !964, size: 32, align: 32, offset: 704)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1488, file: !1278, line: 180, baseType: !1109, size: 64, align: 64, offset: 768)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1488, file: !1278, line: 185, baseType: !963, size: 32, align: 32, offset: 832)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1488, file: !1278, line: 190, baseType: !1109, size: 64, align: 64, offset: 896)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1488, file: !1278, line: 195, baseType: !963, size: 32, align: 32, offset: 960)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1488, file: !1278, line: 200, baseType: !1339, size: 64, align: 64, offset: 1024)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1488, file: !1278, line: 201, baseType: !963, size: 32, align: 32, offset: 1088)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1488, file: !1278, line: 202, baseType: !1471, size: 64, align: 64, offset: 1152)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1488, file: !1278, line: 203, baseType: !963, size: 32, align: 32, offset: 1216)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1488, file: !1278, line: 205, baseType: !963, size: 32, align: 32, offset: 1248)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1488, file: !1278, line: 206, baseType: !963, size: 32, align: 32, offset: 1280)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1488, file: !1278, line: 209, baseType: !1018, size: 64, align: 64, offset: 1344)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1488, file: !1278, line: 212, baseType: !1018, size: 64, align: 64, offset: 1408)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1488, file: !1278, line: 213, baseType: !1471, size: 64, align: 64, offset: 1472)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1488, file: !1278, line: 215, baseType: !963, size: 32, align: 32, offset: 1536)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1488, file: !1278, line: 217, baseType: !963, size: 32, align: 32, offset: 1568)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1488, file: !1278, line: 220, baseType: !963, size: 32, align: 32, offset: 1600)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1175, file: !4, line: 1598, baseType: !1109, size: 64, align: 64, offset: 384)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1175, file: !4, line: 1606, baseType: !960, size: 64, align: 64, offset: 448)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1175, file: !4, line: 1614, baseType: !963, size: 32, align: 32, offset: 512)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1175, file: !4, line: 1622, baseType: !963, size: 32, align: 32, offset: 544)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1175, file: !4, line: 1628, baseType: !963, size: 32, align: 32, offset: 576)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1175, file: !4, line: 1636, baseType: !963, size: 32, align: 32, offset: 608)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1175, file: !4, line: 1643, baseType: !963, size: 32, align: 32, offset: 640)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1175, file: !4, line: 1657, baseType: !1293, size: 64, align: 64, offset: 704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1175, file: !4, line: 1658, baseType: !963, size: 32, align: 32, offset: 768)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1175, file: !4, line: 1679, baseType: !1069, size: 64, align: 32, offset: 800)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1175, file: !4, line: 1688, baseType: !963, size: 32, align: 32, offset: 864)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1175, file: !4, line: 1712, baseType: !963, size: 32, align: 32, offset: 896)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1175, file: !4, line: 1729, baseType: !963, size: 32, align: 32, offset: 928)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1175, file: !4, line: 1729, baseType: !963, size: 32, align: 32, offset: 960)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1175, file: !4, line: 1744, baseType: !963, size: 32, align: 32, offset: 992)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1175, file: !4, line: 1744, baseType: !963, size: 32, align: 32, offset: 1024)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1175, file: !4, line: 1751, baseType: !963, size: 32, align: 32, offset: 1056)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1175, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1175, file: !4, line: 1791, baseType: !1635, size: 64, align: 64, offset: 1152)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64, align: 64)
!1636 = !DISubroutineType(types: !1637)
!1637 = !{null, !1638, !1373, !1453, !963, !963, !963}
!1638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1175, file: !4, line: 1808, baseType: !1640, size: 64, align: 64, offset: 1216)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!508, !1638, !1237}
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1175, file: !4, line: 1816, baseType: !963, size: 32, align: 32, offset: 1280)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1175, file: !4, line: 1825, baseType: !1645, size: 32, align: 32, offset: 1312)
!1645 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1175, file: !4, line: 1830, baseType: !963, size: 32, align: 32, offset: 1344)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1175, file: !4, line: 1838, baseType: !1645, size: 32, align: 32, offset: 1376)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1175, file: !4, line: 1846, baseType: !963, size: 32, align: 32, offset: 1408)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1175, file: !4, line: 1851, baseType: !963, size: 32, align: 32, offset: 1440)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1175, file: !4, line: 1861, baseType: !1645, size: 32, align: 32, offset: 1472)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1175, file: !4, line: 1868, baseType: !1645, size: 32, align: 32, offset: 1504)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1175, file: !4, line: 1875, baseType: !1645, size: 32, align: 32, offset: 1536)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1175, file: !4, line: 1882, baseType: !1645, size: 32, align: 32, offset: 1568)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1175, file: !4, line: 1889, baseType: !1645, size: 32, align: 32, offset: 1600)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1175, file: !4, line: 1896, baseType: !1645, size: 32, align: 32, offset: 1632)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1175, file: !4, line: 1903, baseType: !1645, size: 32, align: 32, offset: 1664)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1175, file: !4, line: 1910, baseType: !963, size: 32, align: 32, offset: 1696)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1175, file: !4, line: 1915, baseType: !963, size: 32, align: 32, offset: 1728)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1175, file: !4, line: 1926, baseType: !1453, size: 64, align: 64, offset: 1792)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1175, file: !4, line: 1935, baseType: !1069, size: 64, align: 32, offset: 1856)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1175, file: !4, line: 1942, baseType: !963, size: 32, align: 32, offset: 1920)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1175, file: !4, line: 1948, baseType: !963, size: 32, align: 32, offset: 1952)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1175, file: !4, line: 1954, baseType: !963, size: 32, align: 32, offset: 1984)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1175, file: !4, line: 1960, baseType: !963, size: 32, align: 32, offset: 2016)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1175, file: !4, line: 1984, baseType: !963, size: 32, align: 32, offset: 2048)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1175, file: !4, line: 1991, baseType: !963, size: 32, align: 32, offset: 2080)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1175, file: !4, line: 1996, baseType: !963, size: 32, align: 32, offset: 2112)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1175, file: !4, line: 2004, baseType: !963, size: 32, align: 32, offset: 2144)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1175, file: !4, line: 2011, baseType: !963, size: 32, align: 32, offset: 2176)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1175, file: !4, line: 2018, baseType: !963, size: 32, align: 32, offset: 2208)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1175, file: !4, line: 2027, baseType: !963, size: 32, align: 32, offset: 2240)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1175, file: !4, line: 2034, baseType: !963, size: 32, align: 32, offset: 2272)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1175, file: !4, line: 2044, baseType: !963, size: 32, align: 32, offset: 2304)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1175, file: !4, line: 2054, baseType: !1675, size: 64, align: 64, offset: 2368)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1175, file: !4, line: 2061, baseType: !1675, size: 64, align: 64, offset: 2432)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1175, file: !4, line: 2066, baseType: !963, size: 32, align: 32, offset: 2496)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1175, file: !4, line: 2070, baseType: !963, size: 32, align: 32, offset: 2528)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1175, file: !4, line: 2078, baseType: !963, size: 32, align: 32, offset: 2560)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1175, file: !4, line: 2085, baseType: !963, size: 32, align: 32, offset: 2592)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1175, file: !4, line: 2092, baseType: !963, size: 32, align: 32, offset: 2624)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1175, file: !4, line: 2099, baseType: !963, size: 32, align: 32, offset: 2656)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1175, file: !4, line: 2106, baseType: !963, size: 32, align: 32, offset: 2688)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1175, file: !4, line: 2113, baseType: !963, size: 32, align: 32, offset: 2720)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1175, file: !4, line: 2120, baseType: !963, size: 32, align: 32, offset: 2752)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1175, file: !4, line: 2125, baseType: !963, size: 32, align: 32, offset: 2784)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1175, file: !4, line: 2133, baseType: !963, size: 32, align: 32, offset: 2816)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1175, file: !4, line: 2140, baseType: !963, size: 32, align: 32, offset: 2848)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1175, file: !4, line: 2145, baseType: !963, size: 32, align: 32, offset: 2880)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1175, file: !4, line: 2153, baseType: !963, size: 32, align: 32, offset: 2912)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1175, file: !4, line: 2158, baseType: !963, size: 32, align: 32, offset: 2944)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1175, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1175, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1175, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1175, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1175, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1175, file: !4, line: 2203, baseType: !963, size: 32, align: 32, offset: 3136)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1175, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1175, file: !4, line: 2212, baseType: !963, size: 32, align: 32, offset: 3200)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1175, file: !4, line: 2213, baseType: !963, size: 32, align: 32, offset: 3232)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1175, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1175, file: !4, line: 2232, baseType: !963, size: 32, align: 32, offset: 3296)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1175, file: !4, line: 2243, baseType: !963, size: 32, align: 32, offset: 3328)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1175, file: !4, line: 2249, baseType: !963, size: 32, align: 32, offset: 3360)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1175, file: !4, line: 2256, baseType: !963, size: 32, align: 32, offset: 3392)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1175, file: !4, line: 2263, baseType: !1248, size: 64, align: 64, offset: 3456)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1175, file: !4, line: 2270, baseType: !1248, size: 64, align: 64, offset: 3520)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1175, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1175, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1175, file: !4, line: 2367, baseType: !1711, size: 64, align: 64, offset: 3648)
!1711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1712, size: 64, align: 64)
!1712 = !DISubroutineType(types: !1713)
!1713 = !{!963, !1638, !1471, !963}
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1175, file: !4, line: 2383, baseType: !963, size: 32, align: 32, offset: 3712)
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1175, file: !4, line: 2386, baseType: !1645, size: 32, align: 32, offset: 3744)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1175, file: !4, line: 2387, baseType: !1645, size: 32, align: 32, offset: 3776)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1175, file: !4, line: 2394, baseType: !963, size: 32, align: 32, offset: 3808)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1175, file: !4, line: 2401, baseType: !963, size: 32, align: 32, offset: 3840)
