; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aacenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aacenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVCodecDefault = type { i8*, i8* }

!963 = !DIEnumerator(name: "OC_TRIAL_FRAME", value: 2)
!964 = !DIEnumerator(name: "OC_GLOBAL_HDR", value: 3)
!965 = !DIEnumerator(name: "OC_LOCKED", value: 4)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AACCoder", file: !967, line: 35, size: 32, align: 32, elements: !968)
!967 = !DIFile(filename: "libavcodec/aacenc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!968 = !{!969, !970, !971, !972}
!969 = !DIEnumerator(name: "AAC_CODER_ANMR", value: 0)
!970 = !DIEnumerator(name: "AAC_CODER_TWOLOOP", value: 1)
!971 = !DIEnumerator(name: "AAC_CODER_FAST", value: 2)
!972 = !DIEnumerator(name: "AAC_CODER_NB", value: 3)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AudioObjectType", file: !974, line: 72, size: 32, align: 32, elements: !975)
!974 = !DIFile(filename: "libavcodec/mpeg4audio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!975 = !{!976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018}
!976 = !DIEnumerator(name: "AOT_NULL", value: 0)
!977 = !DIEnumerator(name: "AOT_AAC_MAIN", value: 1)
!978 = !DIEnumerator(name: "AOT_AAC_LC", value: 2)
!979 = !DIEnumerator(name: "AOT_AAC_SSR", value: 3)
!980 = !DIEnumerator(name: "AOT_AAC_LTP", value: 4)
!981 = !DIEnumerator(name: "AOT_SBR", value: 5)
!982 = !DIEnumerator(name: "AOT_AAC_SCALABLE", value: 6)
!983 = !DIEnumerator(name: "AOT_TWINVQ", value: 7)
!984 = !DIEnumerator(name: "AOT_CELP", value: 8)
!985 = !DIEnumerator(name: "AOT_HVXC", value: 9)
!986 = !DIEnumerator(name: "AOT_TTSI", value: 12)
!987 = !DIEnumerator(name: "AOT_MAINSYNTH", value: 13)
!988 = !DIEnumerator(name: "AOT_WAVESYNTH", value: 14)
!989 = !DIEnumerator(name: "AOT_MIDI", value: 15)
!990 = !DIEnumerator(name: "AOT_SAFX", value: 16)
!991 = !DIEnumerator(name: "AOT_ER_AAC_LC", value: 17)
!992 = !DIEnumerator(name: "AOT_ER_AAC_LTP", value: 19)
!993 = !DIEnumerator(name: "AOT_ER_AAC_SCALABLE", value: 20)
!994 = !DIEnumerator(name: "AOT_ER_TWINVQ", value: 21)
!995 = !DIEnumerator(name: "AOT_ER_BSAC", value: 22)
!996 = !DIEnumerator(name: "AOT_ER_AAC_LD", value: 23)
!997 = !DIEnumerator(name: "AOT_ER_CELP", value: 24)
!998 = !DIEnumerator(name: "AOT_ER_HVXC", value: 25)
!999 = !DIEnumerator(name: "AOT_ER_HILN", value: 26)
!1000 = !DIEnumerator(name: "AOT_ER_PARAM", value: 27)
!1001 = !DIEnumerator(name: "AOT_SSC", value: 28)
!1002 = !DIEnumerator(name: "AOT_PS", value: 29)
!1003 = !DIEnumerator(name: "AOT_SURROUND", value: 30)
!1004 = !DIEnumerator(name: "AOT_ESCAPE", value: 31)
!1005 = !DIEnumerator(name: "AOT_L1", value: 32)
!1006 = !DIEnumerator(name: "AOT_L2", value: 33)
!1007 = !DIEnumerator(name: "AOT_L3", value: 34)
!1008 = !DIEnumerator(name: "AOT_DST", value: 35)
!1009 = !DIEnumerator(name: "AOT_ALS", value: 36)
!1010 = !DIEnumerator(name: "AOT_SLS", value: 37)
!1011 = !DIEnumerator(name: "AOT_SLS_NON_CORE", value: 38)
!1012 = !DIEnumerator(name: "AOT_ER_AAC_ELD", value: 39)
!1013 = !DIEnumerator(name: "AOT_SMR_SIMPLE", value: 40)
!1014 = !DIEnumerator(name: "AOT_SMR_MAIN", value: 41)
!1015 = !DIEnumerator(name: "AOT_USAC_NOSBR", value: 42)
!1016 = !DIEnumerator(name: "AOT_SAOC", value: 43)
!1017 = !DIEnumerator(name: "AOT_LD_SURROUND", value: 44)
!1018 = !DIEnumerator(name: "AOT_USAC", value: 45)
!1019 = !{!1020, !1023, !1024, !1025, !1031, !1032}
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1021, line: 40, baseType: !1022)
!1021 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1022 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1023 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1024 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1027, line: 221, size: 32, align: 8, elements: !1028)
!1027 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1028 = !{!1029}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1026, file: !1027, line: 221, baseType: !1030, size: 32, align: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1021, line: 51, baseType: !1024)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1032 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1033 = !{!1034, !1793, !1798, !1799, !1805, !1809, !1814, !1834, !1837, !1841, !1843, !1846, !1854}
!1034 = distinct !DIGlobalVariable(name: "ff_aac_encoder", scope: !0, file: !1035, line: 1149, type: !1036, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aac_encoder)
!1035 = !DIFile(filename: "libavcodec/aacenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !107, line: 3610, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !107, line: 3468, size: 1984, align: 64, elements: !1038)
!1038 = !{!1039, !1043, !1044, !1045, !1046, !1047, !1056, !1059, !1062, !1065, !1070, !1073, !1146, !1154, !1155, !1156, !1158, !1708, !1714, !1722, !1726, !1727, !1764, !1768, !1772, !1773, !1777, !1781, !1782, !1786, !1787, !1788}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1037, file: !107, line: 3475, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1037, file: !107, line: 3480, baseType: !1040, size: 64, align: 64, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1037, file: !107, line: 3481, baseType: !96, size: 32, align: 32, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1037, file: !107, line: 3482, baseType: !106, size: 32, align: 32, offset: 160)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1037, file: !107, line: 3487, baseType: !1023, size: 32, align: 32, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1037, file: !107, line: 3488, baseType: !1048, size: 64, align: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1051, line: 61, baseType: !1052)
!1051 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1051, line: 58, size: 64, align: 32, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1052, file: !1051, line: 59, baseType: !1023, size: 32, align: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1052, file: !1051, line: 60, baseType: !1023, size: 32, align: 32, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1037, file: !107, line: 3489, baseType: !1057, size: 64, align: 64, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1037, file: !107, line: 3490, baseType: !1060, size: 64, align: 64, offset: 384)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1037, file: !107, line: 3491, baseType: !1063, size: 64, align: 64, offset: 448)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1037, file: !107, line: 3492, baseType: !1066, size: 64, align: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1021, line: 55, baseType: !1069)
!1069 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1037, file: !107, line: 3493, baseType: !1071, size: 8, align: 8, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1021, line: 48, baseType: !1072)
!1072 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1037, file: !107, line: 3494, baseType: !1074, size: 64, align: 64, offset: 640)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !1078)
!1078 = !{!1079, !1080, !1084, !1105, !1106, !1107, !1108, !1112, !1118, !1120, !1124}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1077, file: !26, line: 72, baseType: !1040, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1077, file: !26, line: 78, baseType: !1081, size: 64, align: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1082 = !DISubroutineType(types: !1083)
!1083 = !{!1040, !1031}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1077, file: !26, line: 85, baseType: !1085, size: 64, align: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1101, !1102, !1103, !1104}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1087, file: !4, line: 247, baseType: !1040, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1087, file: !4, line: 253, baseType: !1040, size: 64, align: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1087, file: !4, line: 259, baseType: !1023, size: 32, align: 32, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1087, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1087, file: !4, line: 271, baseType: !1094, size: 64, align: 64, offset: 192)
!1094 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1087, file: !4, line: 265, size: 64, align: 64, elements: !1095)
!1095 = !{!1096, !1097, !1099, !1100}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1094, file: !4, line: 266, baseType: !1020, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1094, file: !4, line: 267, baseType: !1098, size: 64, align: 64)
!1098 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1094, file: !4, line: 268, baseType: !1040, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1094, file: !4, line: 270, baseType: !1050, size: 64, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1087, file: !4, line: 272, baseType: !1098, size: 64, align: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1087, file: !4, line: 273, baseType: !1098, size: 64, align: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1087, file: !4, line: 275, baseType: !1023, size: 32, align: 32, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1087, file: !4, line: 300, baseType: !1040, size: 64, align: 64, offset: 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1077, file: !26, line: 93, baseType: !1023, size: 32, align: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1077, file: !26, line: 99, baseType: !1023, size: 32, align: 32, offset: 224)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1077, file: !26, line: 108, baseType: !1023, size: 32, align: 32, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1077, file: !26, line: 113, baseType: !1109, size: 64, align: 64, offset: 320)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!1031, !1031, !1031}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1077, file: !26, line: 123, baseType: !1113, size: 64, align: 64, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!1116, !1116}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1077)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1077, file: !26, line: 130, baseType: !1119, size: 32, align: 32, offset: 448)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1077, file: !26, line: 136, baseType: !1121, size: 64, align: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64, align: 64)
!1122 = !DISubroutineType(types: !1123)
!1123 = !{!1119, !1031}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1077, file: !26, line: 142, baseType: !1125, size: 64, align: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64, align: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!1023, !1128, !1031, !1040, !1023}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64, align: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1131)
!1131 = !{!1132, !1144, !1145}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1130, file: !4, line: 360, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64, align: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1136, file: !4, line: 307, baseType: !1040, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1136, file: !4, line: 313, baseType: !1098, size: 64, align: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1136, file: !4, line: 313, baseType: !1098, size: 64, align: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1136, file: !4, line: 318, baseType: !1098, size: 64, align: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1136, file: !4, line: 318, baseType: !1098, size: 64, align: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1136, file: !4, line: 323, baseType: !1023, size: 32, align: 32, offset: 320)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1130, file: !4, line: 364, baseType: !1023, size: 32, align: 32, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1130, file: !4, line: 368, baseType: !1023, size: 32, align: 32, offset: 96)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1037, file: !107, line: 3495, baseType: !1147, size: 64, align: 64, offset: 704)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !107, line: 3404, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !107, line: 3401, size: 128, align: 64, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1150, file: !107, line: 3402, baseType: !1023, size: 32, align: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1150, file: !107, line: 3403, baseType: !1040, size: 64, align: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1037, file: !107, line: 3507, baseType: !1040, size: 64, align: 64, offset: 768)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1037, file: !107, line: 3516, baseType: !1023, size: 32, align: 32, offset: 832)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !107, line: 3517, baseType: !1157, size: 64, align: 64, offset: 896)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1037, file: !107, line: 3527, baseType: !1159, size: 64, align: 64, offset: 960)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{!1023, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !107, line: 3360, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !107, line: 1556, size: 8448, align: 64, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1172, !1173, !1174, !1175, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1455, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1646, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1164, file: !107, line: 1561, baseType: !1074, size: 64, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1164, file: !107, line: 1562, baseType: !1023, size: 32, align: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1164, file: !107, line: 1564, baseType: !96, size: 32, align: 32, offset: 96)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1164, file: !107, line: 1565, baseType: !1170, size: 64, align: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1164, file: !107, line: 1566, baseType: !106, size: 32, align: 32, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1164, file: !107, line: 1581, baseType: !1024, size: 32, align: 32, offset: 224)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1164, file: !107, line: 1583, baseType: !1031, size: 64, align: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1164, file: !107, line: 1591, baseType: !1176, size: 64, align: 64, offset: 320)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64, align: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1178, line: 129, size: 1664, align: 64, elements: !1179)
!1178 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1179 = !{!1180, !1181, !1182, !1183, !1281, !1302, !1303, !1332, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1177, file: !1178, line: 136, baseType: !1023, size: 32, align: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1177, file: !1178, line: 151, baseType: !1023, size: 32, align: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1177, file: !1178, line: 157, baseType: !1023, size: 32, align: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1177, file: !1178, line: 159, baseType: !1184, size: 64, align: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !830, line: 646, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !830, line: 268, size: 4288, align: 64, elements: !1187)
!1187 = !{!1188, !1193, !1195, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1233, !1235, !1236, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1269, !1270, !1271, !1272, !1273, !1274, !1277, !1278, !1279, !1280}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !830, line: 282, baseType: !1189, size: 512, align: 64)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1190, size: 512, align: 64, elements: !1191)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1191 = !{!1192}
!1192 = !DISubrange(count: 8)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1186, file: !830, line: 299, baseType: !1194, size: 256, align: 32, offset: 512)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1023, size: 256, align: 32, elements: !1191)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1186, file: !830, line: 315, baseType: !1196, size: 64, align: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1186, file: !830, line: 326, baseType: !1023, size: 32, align: 32, offset: 832)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1186, file: !830, line: 326, baseType: !1023, size: 32, align: 32, offset: 864)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1186, file: !830, line: 334, baseType: !1023, size: 32, align: 32, offset: 896)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1186, file: !830, line: 341, baseType: !1023, size: 32, align: 32, offset: 928)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1186, file: !830, line: 346, baseType: !1023, size: 32, align: 32, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1186, file: !830, line: 351, baseType: !819, size: 32, align: 32, offset: 992)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1186, file: !830, line: 356, baseType: !1050, size: 64, align: 32, offset: 1024)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1186, file: !830, line: 361, baseType: !1020, size: 64, align: 64, offset: 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1186, file: !830, line: 369, baseType: !1020, size: 64, align: 64, offset: 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1186, file: !830, line: 377, baseType: !1020, size: 64, align: 64, offset: 1216)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1186, file: !830, line: 382, baseType: !1023, size: 32, align: 32, offset: 1280)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1186, file: !830, line: 386, baseType: !1023, size: 32, align: 32, offset: 1312)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1186, file: !830, line: 391, baseType: !1023, size: 32, align: 32, offset: 1344)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1186, file: !830, line: 396, baseType: !1031, size: 64, align: 64, offset: 1408)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1186, file: !830, line: 403, baseType: !1212, size: 512, align: 64, offset: 1472)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1068, size: 512, align: 64, elements: !1191)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1186, file: !830, line: 410, baseType: !1023, size: 32, align: 32, offset: 1984)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1186, file: !830, line: 415, baseType: !1023, size: 32, align: 32, offset: 2016)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1186, file: !830, line: 420, baseType: !1023, size: 32, align: 32, offset: 2048)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1186, file: !830, line: 425, baseType: !1023, size: 32, align: 32, offset: 2080)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1186, file: !830, line: 435, baseType: !1020, size: 64, align: 64, offset: 2112)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1186, file: !830, line: 440, baseType: !1023, size: 32, align: 32, offset: 2176)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1186, file: !830, line: 445, baseType: !1068, size: 64, align: 64, offset: 2240)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1186, file: !830, line: 459, baseType: !1221, size: 512, align: 64, offset: 2304)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 512, align: 64, elements: !1191)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1224, line: 94, baseType: !1225)
!1224 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1224, line: 81, size: 192, align: 64, elements: !1226)
!1226 = !{!1227, !1231, !1232}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1225, file: !1224, line: 82, baseType: !1228, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1224, line: 73, baseType: !1230)
!1230 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1224, line: 73, flags: DIFlagFwdDecl)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1225, file: !1224, line: 89, baseType: !1190, size: 64, align: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1225, file: !1224, line: 93, baseType: !1023, size: 32, align: 32, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1186, file: !830, line: 473, baseType: !1234, size: 64, align: 64, offset: 2816)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1186, file: !830, line: 477, baseType: !1023, size: 32, align: 32, offset: 2880)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1186, file: !830, line: 479, baseType: !1237, size: 64, align: 64, offset: 2944)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !830, line: 207, baseType: !1240)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !830, line: 201, size: 320, align: 64, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1250}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1240, file: !830, line: 202, baseType: !829, size: 32, align: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1240, file: !830, line: 203, baseType: !1190, size: 64, align: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1240, file: !830, line: 204, baseType: !1023, size: 32, align: 32, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1240, file: !830, line: 205, baseType: !1246, size: 64, align: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1248, line: 86, baseType: !1249)
!1248 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1248, line: 86, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1240, file: !830, line: 206, baseType: !1222, size: 64, align: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1186, file: !830, line: 480, baseType: !1023, size: 32, align: 32, offset: 3008)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1186, file: !830, line: 505, baseType: !1023, size: 32, align: 32, offset: 3040)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1186, file: !830, line: 512, baseType: !853, size: 32, align: 32, offset: 3072)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1186, file: !830, line: 514, baseType: !859, size: 32, align: 32, offset: 3104)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1186, file: !830, line: 516, baseType: !877, size: 32, align: 32, offset: 3136)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1186, file: !830, line: 523, baseType: !901, size: 32, align: 32, offset: 3168)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1186, file: !830, line: 525, baseType: !920, size: 32, align: 32, offset: 3200)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1186, file: !830, line: 532, baseType: !1020, size: 64, align: 64, offset: 3264)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1186, file: !830, line: 539, baseType: !1020, size: 64, align: 64, offset: 3328)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1186, file: !830, line: 547, baseType: !1020, size: 64, align: 64, offset: 3392)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1186, file: !830, line: 554, baseType: !1246, size: 64, align: 64, offset: 3456)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1186, file: !830, line: 563, baseType: !1023, size: 32, align: 32, offset: 3520)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1186, file: !830, line: 572, baseType: !1023, size: 32, align: 32, offset: 3552)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1186, file: !830, line: 581, baseType: !1023, size: 32, align: 32, offset: 3584)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1186, file: !830, line: 588, baseType: !1266, size: 64, align: 64, offset: 3648)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1021, line: 36, baseType: !1268)
!1268 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1186, file: !830, line: 593, baseType: !1023, size: 32, align: 32, offset: 3712)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1186, file: !830, line: 596, baseType: !1023, size: 32, align: 32, offset: 3744)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1186, file: !830, line: 599, baseType: !1222, size: 64, align: 64, offset: 3776)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1186, file: !830, line: 605, baseType: !1222, size: 64, align: 64, offset: 3840)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1186, file: !830, line: 616, baseType: !1222, size: 64, align: 64, offset: 3904)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1186, file: !830, line: 626, baseType: !1275, size: 64, align: 64, offset: 3968)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1276, line: 216, baseType: !1069)
!1276 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1186, file: !830, line: 627, baseType: !1275, size: 64, align: 64, offset: 4032)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1186, file: !830, line: 628, baseType: !1275, size: 64, align: 64, offset: 4096)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1186, file: !830, line: 629, baseType: !1275, size: 64, align: 64, offset: 4160)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1186, file: !830, line: 645, baseType: !1222, size: 64, align: 64, offset: 4224)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1177, file: !1178, line: 161, baseType: !1282, size: 64, align: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64, align: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1178, line: 117, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1178, line: 100, size: 832, align: 64, elements: !1285)
!1285 = !{!1286, !1293, !1294, !1295, !1296, !1297, !1299, !1300, !1301}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1284, file: !1178, line: 105, baseType: !1287, size: 256, align: 64)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1288, size: 256, align: 64, elements: !1291)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1224, line: 238, baseType: !1290)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1224, line: 238, flags: DIFlagFwdDecl)
!1291 = !{!1292}
!1292 = !DISubrange(count: 4)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1284, file: !1178, line: 110, baseType: !1023, size: 32, align: 32, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1284, file: !1178, line: 111, baseType: !1023, size: 32, align: 32, offset: 288)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1284, file: !1178, line: 111, baseType: !1023, size: 32, align: 32, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1284, file: !1178, line: 112, baseType: !1194, size: 256, align: 32, offset: 352)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1284, file: !1178, line: 113, baseType: !1298, size: 128, align: 32, offset: 608)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1023, size: 128, align: 32, elements: !1291)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1284, file: !1178, line: 114, baseType: !1023, size: 32, align: 32, offset: 736)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1284, file: !1178, line: 115, baseType: !1023, size: 32, align: 32, offset: 768)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1284, file: !1178, line: 116, baseType: !1023, size: 32, align: 32, offset: 800)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1177, file: !1178, line: 163, baseType: !1031, size: 64, align: 64, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1177, file: !1178, line: 165, baseType: !1304, size: 128, align: 64, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1178, line: 122, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1178, line: 119, size: 128, align: 64, elements: !1306)
!1306 = !{!1307, !1331}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1305, file: !1178, line: 120, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !107, line: 1499, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !107, line: 1445, size: 704, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1327, !1328, !1329, !1330}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1310, file: !107, line: 1451, baseType: !1222, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1310, file: !107, line: 1461, baseType: !1020, size: 64, align: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1310, file: !107, line: 1467, baseType: !1020, size: 64, align: 64, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1310, file: !107, line: 1468, baseType: !1190, size: 64, align: 64, offset: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1310, file: !107, line: 1469, baseType: !1023, size: 32, align: 32, offset: 256)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1310, file: !107, line: 1470, baseType: !1023, size: 32, align: 32, offset: 288)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1310, file: !107, line: 1474, baseType: !1023, size: 32, align: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1310, file: !107, line: 1479, baseType: !1320, size: 64, align: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !107, line: 1415, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !107, line: 1411, size: 128, align: 64, elements: !1323)
!1323 = !{!1324, !1325, !1326}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1322, file: !107, line: 1412, baseType: !1190, size: 64, align: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1322, file: !107, line: 1413, baseType: !1023, size: 32, align: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1322, file: !107, line: 1414, baseType: !789, size: 32, align: 32, offset: 96)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1310, file: !107, line: 1480, baseType: !1023, size: 32, align: 32, offset: 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1310, file: !107, line: 1486, baseType: !1020, size: 64, align: 64, offset: 512)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1310, file: !107, line: 1488, baseType: !1020, size: 64, align: 64, offset: 576)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1310, file: !107, line: 1497, baseType: !1020, size: 64, align: 64, offset: 640)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1305, file: !1178, line: 121, baseType: !1184, size: 64, align: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1177, file: !1178, line: 166, baseType: !1333, size: 128, align: 64, offset: 448)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1178, line: 127, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1178, line: 124, size: 128, align: 64, elements: !1335)
!1335 = !{!1336, !1409}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1334, file: !1178, line: 125, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64, align: 64)
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !107, line: 5794, baseType: !1340)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !107, line: 5747, size: 512, align: 64, elements: !1341)
!1341 = !{!1342, !1343, !1367, !1371, !1372, !1406, !1407, !1408}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1340, file: !107, line: 5751, baseType: !1074, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1340, file: !107, line: 5756, baseType: !1344, size: 64, align: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1346)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !107, line: 5796, size: 512, align: 64, elements: !1347)
!1347 = !{!1348, !1349, !1352, !1353, !1354, !1358, !1362, !1366}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1346, file: !107, line: 5797, baseType: !1040, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1346, file: !107, line: 5804, baseType: !1350, size: 64, align: 64, offset: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64, align: 64)
!1351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1346, file: !107, line: 5815, baseType: !1074, size: 64, align: 64, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1346, file: !107, line: 5825, baseType: !1023, size: 32, align: 32, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1346, file: !107, line: 5826, baseType: !1355, size: 64, align: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{!1023, !1338}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1346, file: !107, line: 5827, baseType: !1359, size: 64, align: 64, offset: 320)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64, align: 64)
!1360 = !DISubroutineType(types: !1361)
!1361 = !{!1023, !1338, !1308}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1346, file: !107, line: 5828, baseType: !1363, size: 64, align: 64, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{null, !1338}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1346, file: !107, line: 5829, baseType: !1363, size: 64, align: 64, offset: 448)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1340, file: !107, line: 5762, baseType: !1368, size: 64, align: 64, offset: 128)
!1368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1369, size: 64, align: 64)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !107, line: 5735, baseType: !1370)
!1370 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !107, line: 5735, flags: DIFlagFwdDecl)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1340, file: !107, line: 5768, baseType: !1031, size: 64, align: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1340, file: !107, line: 5775, baseType: !1373, size: 64, align: 64, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !107, line: 4085, baseType: !1375)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !107, line: 3936, size: 1152, align: 64, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1375, file: !107, line: 3940, baseType: !96, size: 32, align: 32)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1375, file: !107, line: 3944, baseType: !106, size: 32, align: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1375, file: !107, line: 3948, baseType: !1030, size: 32, align: 32, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1375, file: !107, line: 3958, baseType: !1190, size: 64, align: 64, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1375, file: !107, line: 3962, baseType: !1023, size: 32, align: 32, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1375, file: !107, line: 3968, baseType: !1023, size: 32, align: 32, offset: 224)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1375, file: !107, line: 3973, baseType: !1020, size: 64, align: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1375, file: !107, line: 3986, baseType: !1023, size: 32, align: 32, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1375, file: !107, line: 3999, baseType: !1023, size: 32, align: 32, offset: 352)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1375, file: !107, line: 4004, baseType: !1023, size: 32, align: 32, offset: 384)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1375, file: !107, line: 4005, baseType: !1023, size: 32, align: 32, offset: 416)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1375, file: !107, line: 4010, baseType: !1023, size: 32, align: 32, offset: 448)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1375, file: !107, line: 4011, baseType: !1023, size: 32, align: 32, offset: 480)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1375, file: !107, line: 4020, baseType: !1050, size: 64, align: 32, offset: 512)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1375, file: !107, line: 4025, baseType: !930, size: 32, align: 32, offset: 576)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1375, file: !107, line: 4030, baseType: !853, size: 32, align: 32, offset: 608)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1375, file: !107, line: 4031, baseType: !859, size: 32, align: 32, offset: 640)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1375, file: !107, line: 4032, baseType: !877, size: 32, align: 32, offset: 672)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1375, file: !107, line: 4033, baseType: !901, size: 32, align: 32, offset: 704)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1375, file: !107, line: 4034, baseType: !920, size: 32, align: 32, offset: 736)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1375, file: !107, line: 4039, baseType: !1023, size: 32, align: 32, offset: 768)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1375, file: !107, line: 4046, baseType: !1068, size: 64, align: 64, offset: 832)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1375, file: !107, line: 4050, baseType: !1023, size: 32, align: 32, offset: 896)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1375, file: !107, line: 4054, baseType: !1023, size: 32, align: 32, offset: 928)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1375, file: !107, line: 4061, baseType: !1023, size: 32, align: 32, offset: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1375, file: !107, line: 4065, baseType: !1023, size: 32, align: 32, offset: 992)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1375, file: !107, line: 4073, baseType: !1023, size: 32, align: 32, offset: 1024)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1375, file: !107, line: 4080, baseType: !1023, size: 32, align: 32, offset: 1056)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1375, file: !107, line: 4084, baseType: !1023, size: 32, align: 32, offset: 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1340, file: !107, line: 5781, baseType: !1373, size: 64, align: 64, offset: 320)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1340, file: !107, line: 5787, baseType: !1050, size: 64, align: 32, offset: 384)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1340, file: !107, line: 5793, baseType: !1050, size: 64, align: 32, offset: 448)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1334, file: !1178, line: 126, baseType: !1023, size: 32, align: 32, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1177, file: !1178, line: 172, baseType: !1308, size: 64, align: 64, offset: 576)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1177, file: !1178, line: 177, baseType: !1190, size: 64, align: 64, offset: 640)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1177, file: !1178, line: 178, baseType: !1024, size: 32, align: 32, offset: 704)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1177, file: !1178, line: 180, baseType: !1031, size: 64, align: 64, offset: 768)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1177, file: !1178, line: 185, baseType: !1023, size: 32, align: 32, offset: 832)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1177, file: !1178, line: 190, baseType: !1031, size: 64, align: 64, offset: 896)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1177, file: !1178, line: 195, baseType: !1023, size: 32, align: 32, offset: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1177, file: !1178, line: 200, baseType: !1308, size: 64, align: 64, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1177, file: !1178, line: 201, baseType: !1023, size: 32, align: 32, offset: 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1177, file: !1178, line: 202, baseType: !1184, size: 64, align: 64, offset: 1152)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1177, file: !1178, line: 203, baseType: !1023, size: 32, align: 32, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1177, file: !1178, line: 205, baseType: !1023, size: 32, align: 32, offset: 1248)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1177, file: !1178, line: 206, baseType: !1023, size: 32, align: 32, offset: 1280)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1177, file: !1178, line: 209, baseType: !1275, size: 64, align: 64, offset: 1344)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1177, file: !1178, line: 212, baseType: !1275, size: 64, align: 64, offset: 1408)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1177, file: !1178, line: 213, baseType: !1184, size: 64, align: 64, offset: 1472)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1177, file: !1178, line: 215, baseType: !1023, size: 32, align: 32, offset: 1536)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1177, file: !1178, line: 217, baseType: !1023, size: 32, align: 32, offset: 1568)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1177, file: !1178, line: 220, baseType: !1023, size: 32, align: 32, offset: 1600)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1164, file: !107, line: 1598, baseType: !1031, size: 64, align: 64, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1164, file: !107, line: 1606, baseType: !1020, size: 64, align: 64, offset: 448)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1164, file: !107, line: 1614, baseType: !1023, size: 32, align: 32, offset: 512)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1164, file: !107, line: 1622, baseType: !1023, size: 32, align: 32, offset: 544)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1164, file: !107, line: 1628, baseType: !1023, size: 32, align: 32, offset: 576)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1164, file: !107, line: 1636, baseType: !1023, size: 32, align: 32, offset: 608)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1164, file: !107, line: 1643, baseType: !1023, size: 32, align: 32, offset: 640)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1164, file: !107, line: 1657, baseType: !1190, size: 64, align: 64, offset: 704)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1164, file: !107, line: 1658, baseType: !1023, size: 32, align: 32, offset: 768)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1164, file: !107, line: 1679, baseType: !1050, size: 64, align: 32, offset: 800)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1164, file: !107, line: 1688, baseType: !1023, size: 32, align: 32, offset: 864)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1164, file: !107, line: 1712, baseType: !1023, size: 32, align: 32, offset: 896)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1164, file: !107, line: 1729, baseType: !1023, size: 32, align: 32, offset: 928)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1164, file: !107, line: 1729, baseType: !1023, size: 32, align: 32, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1164, file: !107, line: 1744, baseType: !1023, size: 32, align: 32, offset: 992)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1164, file: !107, line: 1744, baseType: !1023, size: 32, align: 32, offset: 1024)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1164, file: !107, line: 1751, baseType: !1023, size: 32, align: 32, offset: 1056)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1164, file: !107, line: 1766, baseType: !566, size: 32, align: 32, offset: 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1164, file: !107, line: 1791, baseType: !1448, size: 64, align: 64, offset: 1152)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{null, !1451, !1452, !1454, !1023, !1023, !1023}
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1185)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1164, file: !107, line: 1808, baseType: !1456, size: 64, align: 64, offset: 1216)
!1456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64, align: 64)
!1457 = !DISubroutineType(types: !1458)
!1458 = !{!566, !1451, !1057}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1164, file: !107, line: 1816, baseType: !1023, size: 32, align: 32, offset: 1280)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1164, file: !107, line: 1825, baseType: !1032, size: 32, align: 32, offset: 1312)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1164, file: !107, line: 1830, baseType: !1023, size: 32, align: 32, offset: 1344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1164, file: !107, line: 1838, baseType: !1032, size: 32, align: 32, offset: 1376)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1164, file: !107, line: 1846, baseType: !1023, size: 32, align: 32, offset: 1408)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1164, file: !107, line: 1851, baseType: !1023, size: 32, align: 32, offset: 1440)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1164, file: !107, line: 1861, baseType: !1032, size: 32, align: 32, offset: 1472)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1164, file: !107, line: 1868, baseType: !1032, size: 32, align: 32, offset: 1504)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1164, file: !107, line: 1875, baseType: !1032, size: 32, align: 32, offset: 1536)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1164, file: !107, line: 1882, baseType: !1032, size: 32, align: 32, offset: 1568)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1164, file: !107, line: 1889, baseType: !1032, size: 32, align: 32, offset: 1600)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1164, file: !107, line: 1896, baseType: !1032, size: 32, align: 32, offset: 1632)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1164, file: !107, line: 1903, baseType: !1032, size: 32, align: 32, offset: 1664)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1164, file: !107, line: 1910, baseType: !1023, size: 32, align: 32, offset: 1696)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1164, file: !107, line: 1915, baseType: !1023, size: 32, align: 32, offset: 1728)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1164, file: !107, line: 1926, baseType: !1454, size: 64, align: 64, offset: 1792)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1164, file: !107, line: 1935, baseType: !1050, size: 64, align: 32, offset: 1856)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1164, file: !107, line: 1942, baseType: !1023, size: 32, align: 32, offset: 1920)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1164, file: !107, line: 1948, baseType: !1023, size: 32, align: 32, offset: 1952)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1164, file: !107, line: 1954, baseType: !1023, size: 32, align: 32, offset: 1984)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1164, file: !107, line: 1960, baseType: !1023, size: 32, align: 32, offset: 2016)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1164, file: !107, line: 1984, baseType: !1023, size: 32, align: 32, offset: 2048)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1164, file: !107, line: 1991, baseType: !1023, size: 32, align: 32, offset: 2080)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1164, file: !107, line: 1996, baseType: !1023, size: 32, align: 32, offset: 2112)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1164, file: !107, line: 2004, baseType: !1023, size: 32, align: 32, offset: 2144)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1164, file: !107, line: 2011, baseType: !1023, size: 32, align: 32, offset: 2176)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1164, file: !107, line: 2018, baseType: !1023, size: 32, align: 32, offset: 2208)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1164, file: !107, line: 2027, baseType: !1023, size: 32, align: 32, offset: 2240)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1164, file: !107, line: 2034, baseType: !1023, size: 32, align: 32, offset: 2272)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1164, file: !107, line: 2044, baseType: !1023, size: 32, align: 32, offset: 2304)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1164, file: !107, line: 2054, baseType: !1490, size: 64, align: 64, offset: 2368)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1021, line: 49, baseType: !1492)
!1492 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1164, file: !107, line: 2061, baseType: !1490, size: 64, align: 64, offset: 2432)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1164, file: !107, line: 2066, baseType: !1023, size: 32, align: 32, offset: 2496)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1164, file: !107, line: 2070, baseType: !1023, size: 32, align: 32, offset: 2528)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1164, file: !107, line: 2078, baseType: !1023, size: 32, align: 32, offset: 2560)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1164, file: !107, line: 2085, baseType: !1023, size: 32, align: 32, offset: 2592)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1164, file: !107, line: 2092, baseType: !1023, size: 32, align: 32, offset: 2624)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1164, file: !107, line: 2099, baseType: !1023, size: 32, align: 32, offset: 2656)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1164, file: !107, line: 2106, baseType: !1023, size: 32, align: 32, offset: 2688)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1164, file: !107, line: 2113, baseType: !1023, size: 32, align: 32, offset: 2720)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1164, file: !107, line: 2120, baseType: !1023, size: 32, align: 32, offset: 2752)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1164, file: !107, line: 2125, baseType: !1023, size: 32, align: 32, offset: 2784)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1164, file: !107, line: 2133, baseType: !1023, size: 32, align: 32, offset: 2816)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1164, file: !107, line: 2140, baseType: !1023, size: 32, align: 32, offset: 2848)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1164, file: !107, line: 2145, baseType: !1023, size: 32, align: 32, offset: 2880)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1164, file: !107, line: 2153, baseType: !1023, size: 32, align: 32, offset: 2912)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1164, file: !107, line: 2158, baseType: !1023, size: 32, align: 32, offset: 2944)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1164, file: !107, line: 2166, baseType: !859, size: 32, align: 32, offset: 2976)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1164, file: !107, line: 2173, baseType: !877, size: 32, align: 32, offset: 3008)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1164, file: !107, line: 2180, baseType: !901, size: 32, align: 32, offset: 3040)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1164, file: !107, line: 2187, baseType: !853, size: 32, align: 32, offset: 3072)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1164, file: !107, line: 2194, baseType: !920, size: 32, align: 32, offset: 3104)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1164, file: !107, line: 2203, baseType: !1023, size: 32, align: 32, offset: 3136)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1164, file: !107, line: 2209, baseType: !930, size: 32, align: 32, offset: 3168)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1164, file: !107, line: 2212, baseType: !1023, size: 32, align: 32, offset: 3200)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1164, file: !107, line: 2213, baseType: !1023, size: 32, align: 32, offset: 3232)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1164, file: !107, line: 2220, baseType: !766, size: 32, align: 32, offset: 3264)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1164, file: !107, line: 2232, baseType: !1023, size: 32, align: 32, offset: 3296)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1164, file: !107, line: 2243, baseType: !1023, size: 32, align: 32, offset: 3328)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1164, file: !107, line: 2249, baseType: !1023, size: 32, align: 32, offset: 3360)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1164, file: !107, line: 2256, baseType: !1023, size: 32, align: 32, offset: 3392)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1164, file: !107, line: 2263, baseType: !1068, size: 64, align: 64, offset: 3456)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1164, file: !107, line: 2270, baseType: !1068, size: 64, align: 64, offset: 3520)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1164, file: !107, line: 2277, baseType: !938, size: 32, align: 32, offset: 3584)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1164, file: !107, line: 2285, baseType: !766, size: 32, align: 32, offset: 3616)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1164, file: !107, line: 2367, baseType: !1528, size: 64, align: 64, offset: 3648)
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64, align: 64)
!1529 = !DISubroutineType(types: !1530)
!1530 = !{!1023, !1451, !1184, !1023}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1164, file: !107, line: 2383, baseType: !1023, size: 32, align: 32, offset: 3712)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1164, file: !107, line: 2386, baseType: !1032, size: 32, align: 32, offset: 3744)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1164, file: !107, line: 2387, baseType: !1032, size: 32, align: 32, offset: 3776)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1164, file: !107, line: 2394, baseType: !1023, size: 32, align: 32, offset: 3808)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1164, file: !107, line: 2401, baseType: !1023, size: 32, align: 32, offset: 3840)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1164, file: !107, line: 2408, baseType: !1023, size: 32, align: 32, offset: 3872)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1164, file: !107, line: 2415, baseType: !1023, size: 32, align: 32, offset: 3904)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1164, file: !107, line: 2422, baseType: !1023, size: 32, align: 32, offset: 3936)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1164, file: !107, line: 2423, baseType: !1540, size: 64, align: 64, offset: 3968)
!1540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1541, size: 64, align: 64)
!1541 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !107, line: 831, baseType: !1542)
!1542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !107, line: 826, size: 128, align: 32, elements: !1543)
!1543 = !{!1544, !1545, !1546, !1547}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1542, file: !107, line: 827, baseType: !1023, size: 32, align: 32)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1542, file: !107, line: 828, baseType: !1023, size: 32, align: 32, offset: 32)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1542, file: !107, line: 829, baseType: !1023, size: 32, align: 32, offset: 64)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1542, file: !107, line: 830, baseType: !1032, size: 32, align: 32, offset: 96)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1164, file: !107, line: 2430, baseType: !1020, size: 64, align: 64, offset: 4032)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1164, file: !107, line: 2437, baseType: !1020, size: 64, align: 64, offset: 4096)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1164, file: !107, line: 2444, baseType: !1032, size: 32, align: 32, offset: 4160)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1164, file: !107, line: 2451, baseType: !1032, size: 32, align: 32, offset: 4192)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1164, file: !107, line: 2458, baseType: !1023, size: 32, align: 32, offset: 4224)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1164, file: !107, line: 2469, baseType: !1023, size: 32, align: 32, offset: 4256)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1164, file: !107, line: 2475, baseType: !1023, size: 32, align: 32, offset: 4288)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1164, file: !107, line: 2481, baseType: !1023, size: 32, align: 32, offset: 4320)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1164, file: !107, line: 2485, baseType: !1023, size: 32, align: 32, offset: 4352)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1164, file: !107, line: 2489, baseType: !1023, size: 32, align: 32, offset: 4384)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1164, file: !107, line: 2493, baseType: !1023, size: 32, align: 32, offset: 4416)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1164, file: !107, line: 2501, baseType: !1023, size: 32, align: 32, offset: 4448)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1164, file: !107, line: 2506, baseType: !1023, size: 32, align: 32, offset: 4480)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1164, file: !107, line: 2510, baseType: !1023, size: 32, align: 32, offset: 4512)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1164, file: !107, line: 2514, baseType: !1020, size: 64, align: 64, offset: 4544)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1164, file: !107, line: 2528, baseType: !1564, size: 64, align: 64, offset: 4608)
!1564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1565, size: 64, align: 64)
!1565 = !DISubroutineType(types: !1566)
!1566 = !{null, !1451, !1031, !1023, !1023}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1164, file: !107, line: 2534, baseType: !1023, size: 32, align: 32, offset: 4672)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1164, file: !107, line: 2545, baseType: !1023, size: 32, align: 32, offset: 4704)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1164, file: !107, line: 2547, baseType: !1023, size: 32, align: 32, offset: 4736)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1164, file: !107, line: 2549, baseType: !1023, size: 32, align: 32, offset: 4768)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1164, file: !107, line: 2551, baseType: !1023, size: 32, align: 32, offset: 4800)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1164, file: !107, line: 2553, baseType: !1023, size: 32, align: 32, offset: 4832)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1164, file: !107, line: 2555, baseType: !1023, size: 32, align: 32, offset: 4864)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1164, file: !107, line: 2557, baseType: !1023, size: 32, align: 32, offset: 4896)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1164, file: !107, line: 2559, baseType: !1023, size: 32, align: 32, offset: 4928)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1164, file: !107, line: 2563, baseType: !1023, size: 32, align: 32, offset: 4960)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1164, file: !107, line: 2571, baseType: !1578, size: 64, align: 64, offset: 4992)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1164, file: !107, line: 2579, baseType: !1578, size: 64, align: 64, offset: 5056)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1164, file: !107, line: 2586, baseType: !1023, size: 32, align: 32, offset: 5120)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1164, file: !107, line: 2615, baseType: !1023, size: 32, align: 32, offset: 5152)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1164, file: !107, line: 2627, baseType: !1023, size: 32, align: 32, offset: 5184)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1164, file: !107, line: 2637, baseType: !1023, size: 32, align: 32, offset: 5216)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1164, file: !107, line: 2681, baseType: !1023, size: 32, align: 32, offset: 5248)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1164, file: !107, line: 2709, baseType: !1020, size: 64, align: 64, offset: 5312)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1164, file: !107, line: 2716, baseType: !1587, size: 64, align: 64, offset: 5376)
!1587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1588, size: 64, align: 64)
!1588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1589)
!1589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !107, line: 3636, size: 896, align: 64, elements: !1590)
!1590 = !{!1591, !1592, !1593, !1594, !1595, !1596, !1600, !1606, !1610, !1611, !1612, !1613, !1619, !1620, !1621, !1622, !1623}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1589, file: !107, line: 3642, baseType: !1040, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1589, file: !107, line: 3649, baseType: !96, size: 32, align: 32, offset: 64)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1589, file: !107, line: 3656, baseType: !106, size: 32, align: 32, offset: 96)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1589, file: !107, line: 3663, baseType: !566, size: 32, align: 32, offset: 128)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1589, file: !107, line: 3669, baseType: !1023, size: 32, align: 32, offset: 160)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1589, file: !107, line: 3682, baseType: !1597, size: 64, align: 64, offset: 192)
!1597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1598, size: 64, align: 64)
!1598 = !DISubroutineType(types: !1599)
!1599 = !{!1023, !1162, !1184}
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1589, file: !107, line: 3698, baseType: !1601, size: 64, align: 64, offset: 256)
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1602, size: 64, align: 64)
!1602 = !DISubroutineType(types: !1603)
!1603 = !{!1023, !1162, !1604, !1030}
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1589, file: !107, line: 3712, baseType: !1607, size: 64, align: 64, offset: 320)
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DISubroutineType(types: !1609)
!1609 = !{!1023, !1162, !1023, !1604, !1030}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1589, file: !107, line: 3726, baseType: !1601, size: 64, align: 64, offset: 384)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1589, file: !107, line: 3737, baseType: !1159, size: 64, align: 64, offset: 448)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1589, file: !107, line: 3746, baseType: !1023, size: 32, align: 32, offset: 512)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1589, file: !107, line: 3757, baseType: !1614, size: 64, align: 64, offset: 576)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64, align: 64)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{null, !1617}
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !107, line: 3617, flags: DIFlagFwdDecl)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1589, file: !107, line: 3766, baseType: !1159, size: 64, align: 64, offset: 640)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1589, file: !107, line: 3774, baseType: !1159, size: 64, align: 64, offset: 704)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1589, file: !107, line: 3780, baseType: !1023, size: 32, align: 32, offset: 768)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1589, file: !107, line: 3785, baseType: !1023, size: 32, align: 32, offset: 800)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1589, file: !107, line: 3795, baseType: !1624, size: 64, align: 64, offset: 832)
!1624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1625, size: 64, align: 64)
!1625 = !DISubroutineType(types: !1626)
!1626 = !{!1023, !1162, !1222}
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1164, file: !107, line: 2728, baseType: !1031, size: 64, align: 64, offset: 5440)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1164, file: !107, line: 2735, baseType: !1212, size: 512, align: 64, offset: 5504)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1164, file: !107, line: 2742, baseType: !1023, size: 32, align: 32, offset: 6016)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1164, file: !107, line: 2755, baseType: !1023, size: 32, align: 32, offset: 6048)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1164, file: !107, line: 2776, baseType: !1023, size: 32, align: 32, offset: 6080)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1164, file: !107, line: 2783, baseType: !1023, size: 32, align: 32, offset: 6112)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1164, file: !107, line: 2791, baseType: !1023, size: 32, align: 32, offset: 6144)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1164, file: !107, line: 2802, baseType: !1184, size: 64, align: 64, offset: 6208)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1164, file: !107, line: 2811, baseType: !1023, size: 32, align: 32, offset: 6272)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1164, file: !107, line: 2821, baseType: !1023, size: 32, align: 32, offset: 6304)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1164, file: !107, line: 2830, baseType: !1023, size: 32, align: 32, offset: 6336)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1164, file: !107, line: 2840, baseType: !1023, size: 32, align: 32, offset: 6368)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1164, file: !107, line: 2851, baseType: !1640, size: 64, align: 64, offset: 6400)
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1641, size: 64, align: 64)
!1641 = !DISubroutineType(types: !1642)
!1642 = !{!1023, !1451, !1643, !1031, !1454, !1023, !1023}
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!1023, !1451, !1031}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1164, file: !107, line: 2871, baseType: !1647, size: 64, align: 64, offset: 6464)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64, align: 64)
!1648 = !DISubroutineType(types: !1649)
!1649 = !{!1023, !1451, !1650, !1031, !1454, !1023}
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!1023, !1451, !1031, !1023, !1023}
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1164, file: !107, line: 2878, baseType: !1023, size: 32, align: 32, offset: 6528)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1164, file: !107, line: 2885, baseType: !1023, size: 32, align: 32, offset: 6560)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1164, file: !107, line: 3005, baseType: !1023, size: 32, align: 32, offset: 6592)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1164, file: !107, line: 3013, baseType: !950, size: 32, align: 32, offset: 6624)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1164, file: !107, line: 3020, baseType: !950, size: 32, align: 32, offset: 6656)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1164, file: !107, line: 3027, baseType: !950, size: 32, align: 32, offset: 6688)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1164, file: !107, line: 3037, baseType: !1190, size: 64, align: 64, offset: 6720)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1164, file: !107, line: 3038, baseType: !1023, size: 32, align: 32, offset: 6784)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1164, file: !107, line: 3050, baseType: !1068, size: 64, align: 64, offset: 6848)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1164, file: !107, line: 3065, baseType: !1023, size: 32, align: 32, offset: 6912)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1164, file: !107, line: 3083, baseType: !1023, size: 32, align: 32, offset: 6944)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1164, file: !107, line: 3092, baseType: !1050, size: 64, align: 32, offset: 6976)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1164, file: !107, line: 3099, baseType: !566, size: 32, align: 32, offset: 7040)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1164, file: !107, line: 3106, baseType: !1050, size: 64, align: 32, offset: 7072)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1164, file: !107, line: 3113, baseType: !1668, size: 64, align: 64, offset: 7168)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1670)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !107, line: 740, baseType: !1671)
!1671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !107, line: 712, size: 384, align: 64, elements: !1672)
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678, !1681}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1671, file: !107, line: 713, baseType: !106, size: 32, align: 32)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1671, file: !107, line: 714, baseType: !96, size: 32, align: 32, offset: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1671, file: !107, line: 720, baseType: !1040, size: 64, align: 64, offset: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1671, file: !107, line: 724, baseType: !1040, size: 64, align: 64, offset: 128)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1671, file: !107, line: 728, baseType: !1023, size: 32, align: 32, offset: 192)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1671, file: !107, line: 734, baseType: !1679, size: 64, align: 64, offset: 256)
!1679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1680, size: 64, align: 64)
!1680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1671, file: !107, line: 739, baseType: !1682, size: 64, align: 64, offset: 320)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1164, file: !107, line: 3129, baseType: !1020, size: 64, align: 64, offset: 7232)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1164, file: !107, line: 3130, baseType: !1020, size: 64, align: 64, offset: 7296)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1164, file: !107, line: 3131, baseType: !1020, size: 64, align: 64, offset: 7360)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1164, file: !107, line: 3132, baseType: !1020, size: 64, align: 64, offset: 7424)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1164, file: !107, line: 3139, baseType: !1578, size: 64, align: 64, offset: 7488)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1164, file: !107, line: 3147, baseType: !1023, size: 32, align: 32, offset: 7552)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1164, file: !107, line: 3165, baseType: !1023, size: 32, align: 32, offset: 7584)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1164, file: !107, line: 3172, baseType: !1023, size: 32, align: 32, offset: 7616)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1164, file: !107, line: 3180, baseType: !1023, size: 32, align: 32, offset: 7648)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1164, file: !107, line: 3191, baseType: !1490, size: 64, align: 64, offset: 7680)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1164, file: !107, line: 3199, baseType: !1190, size: 64, align: 64, offset: 7744)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1164, file: !107, line: 3207, baseType: !1578, size: 64, align: 64, offset: 7808)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1164, file: !107, line: 3214, baseType: !1024, size: 32, align: 32, offset: 7872)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1164, file: !107, line: 3224, baseType: !1320, size: 64, align: 64, offset: 7936)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1164, file: !107, line: 3225, baseType: !1023, size: 32, align: 32, offset: 8000)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1164, file: !107, line: 3249, baseType: !1222, size: 64, align: 64, offset: 8064)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1164, file: !107, line: 3256, baseType: !1023, size: 32, align: 32, offset: 8128)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1164, file: !107, line: 3271, baseType: !1023, size: 32, align: 32, offset: 8160)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1164, file: !107, line: 3279, baseType: !1020, size: 64, align: 64, offset: 8192)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1164, file: !107, line: 3301, baseType: !1222, size: 64, align: 64, offset: 8256)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1164, file: !107, line: 3310, baseType: !1023, size: 32, align: 32, offset: 8320)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1164, file: !107, line: 3337, baseType: !1023, size: 32, align: 32, offset: 8352)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1164, file: !107, line: 3351, baseType: !1023, size: 32, align: 32, offset: 8384)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1164, file: !107, line: 3359, baseType: !1023, size: 32, align: 32, offset: 8416)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1037, file: !107, line: 3535, baseType: !1709, size: 64, align: 64, offset: 1024)
!1709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1710, size: 64, align: 64)
!1710 = !DISubroutineType(types: !1711)
!1711 = !{!1023, !1162, !1712}
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1037, file: !107, line: 3541, baseType: !1715, size: 64, align: 64, offset: 1088)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1717)
!1717 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !107, line: 3461, baseType: !1718)
!1718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1178, line: 223, size: 128, align: 64, elements: !1719)
!1719 = !{!1720, !1721}
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1718, file: !1178, line: 224, baseType: !1604, size: 64, align: 64)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1718, file: !1178, line: 225, baseType: !1604, size: 64, align: 64, offset: 64)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1037, file: !107, line: 3549, baseType: !1723, size: 64, align: 64, offset: 1152)
!1723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1724, size: 64, align: 64)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{null, !1157}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1037, file: !107, line: 3551, baseType: !1159, size: 64, align: 64, offset: 1216)
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1037, file: !107, line: 3552, baseType: !1728, size: 64, align: 64, offset: 1280)
!1728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1729, size: 64, align: 64)
!1729 = !DISubroutineType(types: !1730)
!1730 = !{!1023, !1162, !1190, !1023, !1731}
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1733)
!1733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !107, line: 3920, size: 256, align: 64, elements: !1734)
!1734 = !{!1735, !1736, !1737, !1738, !1739, !1763}
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1733, file: !107, line: 3921, baseType: !1491, size: 16, align: 16)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1733, file: !107, line: 3922, baseType: !1030, size: 32, align: 32, offset: 32)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1733, file: !107, line: 3923, baseType: !1030, size: 32, align: 32, offset: 64)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1733, file: !107, line: 3924, baseType: !1024, size: 32, align: 32, offset: 96)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1733, file: !107, line: 3925, baseType: !1740, size: 64, align: 64, offset: 128)
!1740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1741, size: 64, align: 64)
!1741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1742, size: 64, align: 64)
!1742 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !107, line: 3918, baseType: !1743)
!1743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !107, line: 3885, size: 1600, align: 64, elements: !1744)
!1744 = !{!1745, !1746, !1747, !1748, !1749, !1750, !1756, !1758, !1759, !1760, !1761, !1762}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1743, file: !107, line: 3886, baseType: !1023, size: 32, align: 32)
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1743, file: !107, line: 3887, baseType: !1023, size: 32, align: 32, offset: 32)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1743, file: !107, line: 3888, baseType: !1023, size: 32, align: 32, offset: 64)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1743, file: !107, line: 3889, baseType: !1023, size: 32, align: 32, offset: 96)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1743, file: !107, line: 3890, baseType: !1023, size: 32, align: 32, offset: 128)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1743, file: !107, line: 3897, baseType: !1751, size: 768, align: 64, offset: 192)
!1751 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !107, line: 3858, baseType: !1752)
!1752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !107, line: 3853, size: 768, align: 64, elements: !1753)
!1753 = !{!1754, !1755}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1752, file: !107, line: 3855, baseType: !1189, size: 512, align: 64)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1752, file: !107, line: 3857, baseType: !1194, size: 256, align: 32, offset: 512)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1743, file: !107, line: 3903, baseType: !1757, size: 256, align: 64, offset: 960)
!1757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1190, size: 256, align: 64, elements: !1291)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1743, file: !107, line: 3904, baseType: !1298, size: 128, align: 32, offset: 1216)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1743, file: !107, line: 3906, baseType: !783, size: 32, align: 32, offset: 1344)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1743, file: !107, line: 3908, baseType: !1578, size: 64, align: 64, offset: 1408)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1743, file: !107, line: 3915, baseType: !1578, size: 64, align: 64, offset: 1472)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1743, file: !107, line: 3917, baseType: !1023, size: 32, align: 32, offset: 1536)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1733, file: !107, line: 3926, baseType: !1020, size: 64, align: 64, offset: 192)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1037, file: !107, line: 3564, baseType: !1765, size: 64, align: 64, offset: 1344)
