; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--diracdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--diracdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodec = type { i8*, i8*, i32, i32, i32, %struct.AVRational*, i32*, i32*, i32*, i64*, i8, %struct.AVClass*, %struct.AVProfile*, i8*, i32, %struct.AVCodec*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVCodecContext*)*, %struct.AVCodecDefault*, void (%struct.AVCodec*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, i8*, i32, %struct.AVSubtitle*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*, %struct.AVFrame*, i32*)*, i32 (%struct.AVCodecContext*, i8*, i32*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, i32 (%struct.AVCodecContext*, %struct.AVPacket*)*, i32 (%struct.AVCodecContext*, %struct.AVFrame*)*, void (%struct.AVCodecContext*)*, i32, i8*, %struct.AVCodecHWConfigInternal** }
%struct.AVRational = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }

!912 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!913 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!914 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!915 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!916 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!917 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!918 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!922 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!923 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!924 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!925 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DiracParseCodes", file: !926, line: 57, size: 32, align: 32, elements: !927)
!926 = !DIFile(filename: "libavcodec/dirac.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943}
!928 = !DIEnumerator(name: "DIRAC_PCODE_SEQ_HEADER", value: 0)
!929 = !DIEnumerator(name: "DIRAC_PCODE_END_SEQ", value: 16)
!930 = !DIEnumerator(name: "DIRAC_PCODE_AUX", value: 32)
!931 = !DIEnumerator(name: "DIRAC_PCODE_PAD", value: 48)
!932 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_CODED", value: 8)
!933 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_RAW", value: 72)
!934 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_LOW_DEL", value: 200)
!935 = !DIEnumerator(name: "DIRAC_PCODE_PICTURE_HQ", value: 232)
!936 = !DIEnumerator(name: "DIRAC_PCODE_INTER_NOREF_CO1", value: 10)
!937 = !DIEnumerator(name: "DIRAC_PCODE_INTER_NOREF_CO2", value: 9)
!938 = !DIEnumerator(name: "DIRAC_PCODE_INTER_REF_CO1", value: 13)
!939 = !DIEnumerator(name: "DIRAC_PCODE_INTER_REF_CO2", value: 14)
!940 = !DIEnumerator(name: "DIRAC_PCODE_INTRA_REF_CO", value: 12)
!941 = !DIEnumerator(name: "DIRAC_PCODE_INTRA_REF_RAW", value: 76)
!942 = !DIEnumerator(name: "DIRAC_PCODE_INTRA_REF_PICT", value: 204)
!943 = !DIEnumerator(name: "DIRAC_PCODE_MAGIC", value: 1111638852)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dirac_arith_contexts", file: !945, line: 35, size: 32, align: 32, elements: !946)
!945 = !DIFile(filename: "libavcodec/dirac_arith.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!947 = !DIEnumerator(name: "CTX_ZPZN_F1", value: 0)
!948 = !DIEnumerator(name: "CTX_ZPNN_F1", value: 1)
!949 = !DIEnumerator(name: "CTX_NPZN_F1", value: 2)
!950 = !DIEnumerator(name: "CTX_NPNN_F1", value: 3)
!951 = !DIEnumerator(name: "CTX_ZP_F2", value: 4)
!952 = !DIEnumerator(name: "CTX_ZP_F3", value: 5)
!953 = !DIEnumerator(name: "CTX_ZP_F4", value: 6)
!954 = !DIEnumerator(name: "CTX_ZP_F5", value: 7)
!955 = !DIEnumerator(name: "CTX_ZP_F6", value: 8)
!956 = !DIEnumerator(name: "CTX_NP_F2", value: 9)
!957 = !DIEnumerator(name: "CTX_NP_F3", value: 10)
!958 = !DIEnumerator(name: "CTX_NP_F4", value: 11)
!959 = !DIEnumerator(name: "CTX_NP_F5", value: 12)
!960 = !DIEnumerator(name: "CTX_NP_F6", value: 13)
!961 = !DIEnumerator(name: "CTX_COEFF_DATA", value: 14)
!962 = !DIEnumerator(name: "CTX_SIGN_NEG", value: 15)
!963 = !DIEnumerator(name: "CTX_SIGN_ZERO", value: 16)
!964 = !DIEnumerator(name: "CTX_SIGN_POS", value: 17)
!965 = !DIEnumerator(name: "CTX_ZERO_BLOCK", value: 18)
!966 = !DIEnumerator(name: "CTX_DELTA_Q_F", value: 19)
!967 = !DIEnumerator(name: "CTX_DELTA_Q_DATA", value: 20)
!968 = !DIEnumerator(name: "CTX_DELTA_Q_SIGN", value: 21)
!969 = !DIEnumerator(name: "DIRAC_CTX_COUNT", value: 22)
!970 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dirac_subband", file: !971, line: 242, size: 32, align: 32, elements: !972)
!971 = !DIFile(filename: "libavcodec/diracdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!972 = !{!973, !974, !975, !976, !977}
!973 = !DIEnumerator(name: "subband_ll", value: 0)
!974 = !DIEnumerator(name: "subband_hl", value: 1)
!975 = !DIEnumerator(name: "subband_lh", value: 2)
!976 = !DIEnumerator(name: "subband_hh", value: 3)
!977 = !DIEnumerator(name: "subband_nb", value: 4)
!978 = !{!979, !980, !981, !1092, !1011, !1019, !988, !1098, !1022, !1099, !1106, !1109, !1128, !1130, !1131, !1132}
!979 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!980 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !984)
!984 = !{!985, !993, !995, !997, !998, !999, !1000, !1001, !1002, !1003, !1010, !1013, !1014, !1015, !1016, !1017, !1018, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1044, !1046, !1047, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1080, !1081, !1082, !1083, !1084, !1085, !1088, !1089, !1090, !1091}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !983, file: !744, line: 282, baseType: !986, size: 512, align: 64)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 512, align: 64, elements: !991)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64, align: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !989, line: 48, baseType: !990)
!989 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!990 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!991 = !{!992}
!992 = !DISubrange(count: 8)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !983, file: !744, line: 299, baseType: !994, size: 256, align: 32, offset: 512)
!994 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 256, align: 32, elements: !991)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !983, file: !744, line: 315, baseType: !996, size: 64, align: 64, offset: 768)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !983, file: !744, line: 326, baseType: !979, size: 32, align: 32, offset: 832)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !983, file: !744, line: 326, baseType: !979, size: 32, align: 32, offset: 864)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !983, file: !744, line: 334, baseType: !979, size: 32, align: 32, offset: 896)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !983, file: !744, line: 341, baseType: !979, size: 32, align: 32, offset: 928)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !983, file: !744, line: 346, baseType: !979, size: 32, align: 32, offset: 960)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !983, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !983, file: !744, line: 356, baseType: !1004, size: 64, align: 32, offset: 1024)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1005, line: 61, baseType: !1006)
!1005 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1005, line: 58, size: 64, align: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1006, file: !1005, line: 59, baseType: !979, size: 32, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1006, file: !1005, line: 60, baseType: !979, size: 32, align: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !983, file: !744, line: 361, baseType: !1011, size: 64, align: 64, offset: 1088)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !989, line: 40, baseType: !1012)
!1012 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !983, file: !744, line: 369, baseType: !1011, size: 64, align: 64, offset: 1152)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !983, file: !744, line: 377, baseType: !1011, size: 64, align: 64, offset: 1216)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !983, file: !744, line: 382, baseType: !979, size: 32, align: 32, offset: 1280)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !983, file: !744, line: 386, baseType: !979, size: 32, align: 32, offset: 1312)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !983, file: !744, line: 391, baseType: !979, size: 32, align: 32, offset: 1344)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !983, file: !744, line: 396, baseType: !1019, size: 64, align: 64, offset: 1408)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !983, file: !744, line: 403, baseType: !1021, size: 512, align: 64, offset: 1472)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 512, align: 64, elements: !991)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !989, line: 55, baseType: !1023)
!1023 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !983, file: !744, line: 410, baseType: !979, size: 32, align: 32, offset: 1984)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !983, file: !744, line: 415, baseType: !979, size: 32, align: 32, offset: 2016)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !983, file: !744, line: 420, baseType: !979, size: 32, align: 32, offset: 2048)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !983, file: !744, line: 425, baseType: !979, size: 32, align: 32, offset: 2080)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !983, file: !744, line: 435, baseType: !1011, size: 64, align: 64, offset: 2112)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !983, file: !744, line: 440, baseType: !979, size: 32, align: 32, offset: 2176)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !983, file: !744, line: 445, baseType: !1022, size: 64, align: 64, offset: 2240)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !983, file: !744, line: 459, baseType: !1032, size: 512, align: 64, offset: 2304)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 512, align: 64, elements: !991)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1035, line: 94, baseType: !1036)
!1035 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1035, line: 81, size: 192, align: 64, elements: !1037)
!1037 = !{!1038, !1042, !1043}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1036, file: !1035, line: 82, baseType: !1039, size: 64, align: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1035, line: 73, baseType: !1041)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1035, line: 73, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1036, file: !1035, line: 89, baseType: !987, size: 64, align: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1036, file: !1035, line: 93, baseType: !979, size: 32, align: 32, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !983, file: !744, line: 473, baseType: !1045, size: 64, align: 64, offset: 2816)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !983, file: !744, line: 477, baseType: !979, size: 32, align: 32, offset: 2880)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !983, file: !744, line: 479, baseType: !1048, size: 64, align: 64, offset: 2944)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1061}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1051, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1051, file: !744, line: 203, baseType: !987, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1051, file: !744, line: 204, baseType: !979, size: 32, align: 32, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1051, file: !744, line: 205, baseType: !1057, size: 64, align: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1059, line: 86, baseType: !1060)
!1059 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1060 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1059, line: 86, flags: DIFlagFwdDecl)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1051, file: !744, line: 206, baseType: !1033, size: 64, align: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !983, file: !744, line: 480, baseType: !979, size: 32, align: 32, offset: 3008)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !983, file: !744, line: 505, baseType: !979, size: 32, align: 32, offset: 3040)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !983, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !983, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !983, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !983, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !983, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !983, file: !744, line: 532, baseType: !1011, size: 64, align: 64, offset: 3264)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !983, file: !744, line: 539, baseType: !1011, size: 64, align: 64, offset: 3328)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !983, file: !744, line: 547, baseType: !1011, size: 64, align: 64, offset: 3392)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !983, file: !744, line: 554, baseType: !1057, size: 64, align: 64, offset: 3456)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !983, file: !744, line: 563, baseType: !979, size: 32, align: 32, offset: 3520)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !983, file: !744, line: 572, baseType: !979, size: 32, align: 32, offset: 3552)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !983, file: !744, line: 581, baseType: !979, size: 32, align: 32, offset: 3584)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !983, file: !744, line: 588, baseType: !1077, size: 64, align: 64, offset: 3648)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !989, line: 36, baseType: !1079)
!1079 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !983, file: !744, line: 593, baseType: !979, size: 32, align: 32, offset: 3712)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !983, file: !744, line: 596, baseType: !979, size: 32, align: 32, offset: 3744)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !983, file: !744, line: 599, baseType: !1033, size: 64, align: 64, offset: 3776)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !983, file: !744, line: 605, baseType: !1033, size: 64, align: 64, offset: 3840)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !983, file: !744, line: 616, baseType: !1033, size: 64, align: 64, offset: 3904)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !983, file: !744, line: 626, baseType: !1086, size: 64, align: 64, offset: 3968)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1087, line: 216, baseType: !1023)
!1087 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !983, file: !744, line: 627, baseType: !1086, size: 64, align: 64, offset: 4032)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !983, file: !744, line: 628, baseType: !1086, size: 64, align: 64, offset: 4096)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !983, file: !744, line: 629, baseType: !1086, size: 64, align: 64, offset: 4160)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !983, file: !744, line: 645, baseType: !1033, size: 64, align: 64, offset: 4224)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64, align: 64)
!1093 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1094)
!1094 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1095, line: 221, size: 32, align: 8, elements: !1096)
!1095 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1094, file: !1095, line: 221, baseType: !1098, size: 32, align: 32)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !989, line: 51, baseType: !980)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_16", file: !1095, line: 222, size: 16, align: 8, elements: !1102)
!1102 = !{!1103}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1101, file: !1095, line: 222, baseType: !1104, size: 16, align: 16)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !989, line: 49, baseType: !1105)
!1105 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !989, line: 37, baseType: !1108)
!1108 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64, align: 64)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "DiracSlice", file: !971, line: 132, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DiracSlice", file: !971, line: 127, size: 384, align: 64, elements: !1112)
!1112 = !{!1113, !1125, !1126, !1127}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gb", scope: !1111, file: !971, line: 128, baseType: !1114, size: 256, align: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1115, line: 70, baseType: !1116)
!1115 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1115, line: 61, size: 256, align: 64, elements: !1117)
!1117 = !{!1118, !1121, !1122, !1123, !1124}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1116, file: !1115, line: 62, baseType: !1119, size: 64, align: 64)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1116, file: !1115, line: 62, baseType: !1119, size: 64, align: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1116, file: !1115, line: 67, baseType: !979, size: 32, align: 32, offset: 128)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1116, file: !1115, line: 68, baseType: !979, size: 32, align: 32, offset: 160)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1116, file: !1115, line: 69, baseType: !979, size: 32, align: 32, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "slice_x", scope: !1111, file: !971, line: 129, baseType: !979, size: 32, align: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "slice_y", scope: !1111, file: !971, line: 130, baseType: !979, size: 32, align: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !1111, file: !971, line: 131, baseType: !979, size: 32, align: 32, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !989, line: 38, baseType: !979)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1133 = !{!1134, !2663, !2666, !2932, !2939}
!1134 = distinct !DIGlobalVariable(name: "ff_dirac_decoder", scope: !0, file: !971, line: 2351, type: !1135, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_dirac_decoder)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1137)
!1137 = !{!1138, !1142, !1143, !1144, !1145, !1146, !1149, !1152, !1155, !1158, !1161, !1162, !1235, !1243, !1244, !1245, !1247, !2578, !2584, !2592, !2596, !2597, !2634, !2638, !2642, !2643, !2647, !2651, !2652, !2656, !2657, !2658}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1136, file: !14, line: 3475, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64, align: 64)
!1140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1141)
!1141 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1136, file: !14, line: 3480, baseType: !1139, size: 64, align: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1136, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1136, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1136, file: !14, line: 3487, baseType: !979, size: 32, align: 32, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1136, file: !14, line: 3488, baseType: !1147, size: 64, align: 64, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1136, file: !14, line: 3489, baseType: !1150, size: 64, align: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1136, file: !14, line: 3490, baseType: !1153, size: 64, align: 64, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !979)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1136, file: !14, line: 3491, baseType: !1156, size: 64, align: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1136, file: !14, line: 3492, baseType: !1159, size: 64, align: 64, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64, align: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1136, file: !14, line: 3493, baseType: !988, size: 8, align: 8, offset: 576)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1136, file: !14, line: 3494, baseType: !1163, size: 64, align: 64, offset: 640)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64, align: 64)
!1164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1165)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1167)
!1167 = !{!1168, !1169, !1173, !1194, !1195, !1196, !1197, !1201, !1207, !1209, !1213}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1166, file: !713, line: 72, baseType: !1139, size: 64, align: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1166, file: !713, line: 78, baseType: !1170, size: 64, align: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DISubroutineType(types: !1172)
!1172 = !{!1139, !1019}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1166, file: !713, line: 85, baseType: !1174, size: 64, align: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182, !1190, !1191, !1192, !1193}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1176, file: !691, line: 247, baseType: !1139, size: 64, align: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1176, file: !691, line: 253, baseType: !1139, size: 64, align: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1176, file: !691, line: 259, baseType: !979, size: 32, align: 32, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1176, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1176, file: !691, line: 271, baseType: !1183, size: 64, align: 64, offset: 192)
!1183 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1176, file: !691, line: 265, size: 64, align: 64, elements: !1184)
!1184 = !{!1185, !1186, !1188, !1189}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1183, file: !691, line: 266, baseType: !1011, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1183, file: !691, line: 267, baseType: !1187, size: 64, align: 64)
!1187 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1183, file: !691, line: 268, baseType: !1139, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1183, file: !691, line: 270, baseType: !1004, size: 64, align: 32)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1176, file: !691, line: 272, baseType: !1187, size: 64, align: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1176, file: !691, line: 273, baseType: !1187, size: 64, align: 64, offset: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1176, file: !691, line: 275, baseType: !979, size: 32, align: 32, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1176, file: !691, line: 300, baseType: !1139, size: 64, align: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1166, file: !713, line: 93, baseType: !979, size: 32, align: 32, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1166, file: !713, line: 99, baseType: !979, size: 32, align: 32, offset: 224)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1166, file: !713, line: 108, baseType: !979, size: 32, align: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1166, file: !713, line: 113, baseType: !1198, size: 64, align: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64, align: 64)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!1019, !1019, !1019}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1166, file: !713, line: 123, baseType: !1202, size: 64, align: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!1205, !1205}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1166)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1166, file: !713, line: 130, baseType: !1208, size: 32, align: 32, offset: 448)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1166, file: !713, line: 136, baseType: !1210, size: 64, align: 64, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64, align: 64)
!1211 = !DISubroutineType(types: !1212)
!1212 = !{!1208, !1019}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1166, file: !713, line: 142, baseType: !1214, size: 64, align: 64, offset: 576)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DISubroutineType(types: !1216)
!1216 = !{!979, !1217, !1019, !1139, !979}
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64, align: 64)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1220)
!1220 = !{!1221, !1233, !1234}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1219, file: !691, line: 360, baseType: !1222, size: 64, align: 64)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64, align: 64)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229, !1230, !1231, !1232}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1225, file: !691, line: 307, baseType: !1139, size: 64, align: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1225, file: !691, line: 313, baseType: !1187, size: 64, align: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1225, file: !691, line: 313, baseType: !1187, size: 64, align: 64, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1225, file: !691, line: 318, baseType: !1187, size: 64, align: 64, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1225, file: !691, line: 318, baseType: !1187, size: 64, align: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1225, file: !691, line: 323, baseType: !979, size: 32, align: 32, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1219, file: !691, line: 364, baseType: !979, size: 32, align: 32, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1219, file: !691, line: 368, baseType: !979, size: 32, align: 32, offset: 96)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1136, file: !14, line: 3495, baseType: !1236, size: 64, align: 64, offset: 704)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1239, file: !14, line: 3402, baseType: !979, size: 32, align: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1239, file: !14, line: 3403, baseType: !1139, size: 64, align: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1136, file: !14, line: 3507, baseType: !1139, size: 64, align: 64, offset: 768)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1136, file: !14, line: 3516, baseType: !979, size: 32, align: 32, offset: 832)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1136, file: !14, line: 3517, baseType: !1246, size: 64, align: 64, offset: 896)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1136, file: !14, line: 3527, baseType: !1248, size: 64, align: 64, offset: 960)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64, align: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!979, !1251}
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1253)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1254)
!1254 = !{!1255, !1256, !1257, !1258, !1261, !1262, !1263, !1264, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1447, !1451, !1452, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2516, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2554, !2555, !2556, !2557, !2558, !2559, !2560, !2561, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1253, file: !14, line: 1561, baseType: !1163, size: 64, align: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1253, file: !14, line: 1562, baseType: !979, size: 32, align: 32, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1253, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1253, file: !14, line: 1565, baseType: !1259, size: 64, align: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1136)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1253, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1253, file: !14, line: 1581, baseType: !980, size: 32, align: 32, offset: 224)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1253, file: !14, line: 1583, baseType: !1019, size: 64, align: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1253, file: !14, line: 1591, baseType: !1265, size: 64, align: 64, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1267, line: 129, size: 1664, align: 64, elements: !1268)
!1267 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1268 = !{!1269, !1270, !1271, !1272, !1273, !1294, !1295, !1324, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1266, file: !1267, line: 136, baseType: !979, size: 32, align: 32)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1266, file: !1267, line: 151, baseType: !979, size: 32, align: 32, offset: 32)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1266, file: !1267, line: 157, baseType: !979, size: 32, align: 32, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1266, file: !1267, line: 159, baseType: !981, size: 64, align: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1266, file: !1267, line: 161, baseType: !1274, size: 64, align: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64, align: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1267, line: 117, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1267, line: 100, size: 832, align: 64, elements: !1277)
!1277 = !{!1278, !1285, !1286, !1287, !1288, !1289, !1291, !1292, !1293}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1276, file: !1267, line: 105, baseType: !1279, size: 256, align: 64)
!1279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1280, size: 256, align: 64, elements: !1283)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64, align: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1035, line: 238, baseType: !1282)
!1282 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1035, line: 238, flags: DIFlagFwdDecl)
!1283 = !{!1284}
!1284 = !DISubrange(count: 4)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1276, file: !1267, line: 110, baseType: !979, size: 32, align: 32, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1276, file: !1267, line: 111, baseType: !979, size: 32, align: 32, offset: 288)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1276, file: !1267, line: 111, baseType: !979, size: 32, align: 32, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1276, file: !1267, line: 112, baseType: !994, size: 256, align: 32, offset: 352)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1276, file: !1267, line: 113, baseType: !1290, size: 128, align: 32, offset: 608)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 128, align: 32, elements: !1283)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1276, file: !1267, line: 114, baseType: !979, size: 32, align: 32, offset: 736)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1276, file: !1267, line: 115, baseType: !979, size: 32, align: 32, offset: 768)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1276, file: !1267, line: 116, baseType: !979, size: 32, align: 32, offset: 800)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1266, file: !1267, line: 163, baseType: !1019, size: 64, align: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1266, file: !1267, line: 165, baseType: !1296, size: 128, align: 64, offset: 320)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1267, line: 122, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1267, line: 119, size: 128, align: 64, elements: !1298)
!1298 = !{!1299, !1323}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1297, file: !1267, line: 120, baseType: !1300, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1319, !1320, !1321, !1322}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1302, file: !14, line: 1451, baseType: !1033, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1302, file: !14, line: 1461, baseType: !1011, size: 64, align: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1302, file: !14, line: 1467, baseType: !1011, size: 64, align: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1302, file: !14, line: 1468, baseType: !987, size: 64, align: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1302, file: !14, line: 1469, baseType: !979, size: 32, align: 32, offset: 256)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1302, file: !14, line: 1470, baseType: !979, size: 32, align: 32, offset: 288)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1302, file: !14, line: 1474, baseType: !979, size: 32, align: 32, offset: 320)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1302, file: !14, line: 1479, baseType: !1312, size: 64, align: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1314)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1315)
!1315 = !{!1316, !1317, !1318}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1314, file: !14, line: 1412, baseType: !987, size: 64, align: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1314, file: !14, line: 1413, baseType: !979, size: 32, align: 32, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1314, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1302, file: !14, line: 1480, baseType: !979, size: 32, align: 32, offset: 448)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1302, file: !14, line: 1486, baseType: !1011, size: 64, align: 64, offset: 512)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1302, file: !14, line: 1488, baseType: !1011, size: 64, align: 64, offset: 576)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1302, file: !14, line: 1497, baseType: !1011, size: 64, align: 64, offset: 640)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1297, file: !1267, line: 121, baseType: !981, size: 64, align: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1266, file: !1267, line: 166, baseType: !1325, size: 128, align: 64, offset: 448)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1267, line: 127, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1267, line: 124, size: 128, align: 64, elements: !1327)
!1327 = !{!1328, !1401}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1326, file: !1267, line: 125, baseType: !1329, size: 64, align: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64, align: 64)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64, align: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1333)
!1333 = !{!1334, !1335, !1359, !1363, !1364, !1398, !1399, !1400}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1332, file: !14, line: 5751, baseType: !1163, size: 64, align: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1332, file: !14, line: 5756, baseType: !1336, size: 64, align: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64, align: 64)
!1337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1338)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1339)
!1339 = !{!1340, !1341, !1344, !1345, !1346, !1350, !1354, !1358}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1338, file: !14, line: 5797, baseType: !1139, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1338, file: !14, line: 5804, baseType: !1342, size: 64, align: 64, offset: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1338, file: !14, line: 5815, baseType: !1163, size: 64, align: 64, offset: 128)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1338, file: !14, line: 5825, baseType: !979, size: 32, align: 32, offset: 192)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1338, file: !14, line: 5826, baseType: !1347, size: 64, align: 64, offset: 256)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!979, !1330}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1338, file: !14, line: 5827, baseType: !1351, size: 64, align: 64, offset: 320)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64, align: 64)
!1352 = !DISubroutineType(types: !1353)
!1353 = !{!979, !1330, !1300}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1338, file: !14, line: 5828, baseType: !1355, size: 64, align: 64, offset: 384)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64, align: 64)
!1356 = !DISubroutineType(types: !1357)
!1357 = !{null, !1330}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1338, file: !14, line: 5829, baseType: !1355, size: 64, align: 64, offset: 448)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1332, file: !14, line: 5762, baseType: !1360, size: 64, align: 64, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64, align: 64)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1362)
!1362 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1332, file: !14, line: 5768, baseType: !1019, size: 64, align: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1332, file: !14, line: 5775, baseType: !1365, size: 64, align: 64, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64, align: 64)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1367, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1367, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1367, file: !14, line: 3948, baseType: !1098, size: 32, align: 32, offset: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1367, file: !14, line: 3958, baseType: !987, size: 64, align: 64, offset: 128)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1367, file: !14, line: 3962, baseType: !979, size: 32, align: 32, offset: 192)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1367, file: !14, line: 3968, baseType: !979, size: 32, align: 32, offset: 224)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1367, file: !14, line: 3973, baseType: !1011, size: 64, align: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1367, file: !14, line: 3986, baseType: !979, size: 32, align: 32, offset: 320)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1367, file: !14, line: 3999, baseType: !979, size: 32, align: 32, offset: 352)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1367, file: !14, line: 4004, baseType: !979, size: 32, align: 32, offset: 384)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1367, file: !14, line: 4005, baseType: !979, size: 32, align: 32, offset: 416)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1367, file: !14, line: 4010, baseType: !979, size: 32, align: 32, offset: 448)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1367, file: !14, line: 4011, baseType: !979, size: 32, align: 32, offset: 480)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1367, file: !14, line: 4020, baseType: !1004, size: 64, align: 32, offset: 512)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1367, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1367, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1367, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1367, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1367, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1367, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1367, file: !14, line: 4039, baseType: !979, size: 32, align: 32, offset: 768)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1367, file: !14, line: 4046, baseType: !1022, size: 64, align: 64, offset: 832)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1367, file: !14, line: 4050, baseType: !979, size: 32, align: 32, offset: 896)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1367, file: !14, line: 4054, baseType: !979, size: 32, align: 32, offset: 928)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1367, file: !14, line: 4061, baseType: !979, size: 32, align: 32, offset: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1367, file: !14, line: 4065, baseType: !979, size: 32, align: 32, offset: 992)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1367, file: !14, line: 4073, baseType: !979, size: 32, align: 32, offset: 1024)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1367, file: !14, line: 4080, baseType: !979, size: 32, align: 32, offset: 1056)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1367, file: !14, line: 4084, baseType: !979, size: 32, align: 32, offset: 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1332, file: !14, line: 5781, baseType: !1365, size: 64, align: 64, offset: 320)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1332, file: !14, line: 5787, baseType: !1004, size: 64, align: 32, offset: 384)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1332, file: !14, line: 5793, baseType: !1004, size: 64, align: 32, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1326, file: !1267, line: 126, baseType: !979, size: 32, align: 32, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1266, file: !1267, line: 172, baseType: !1300, size: 64, align: 64, offset: 576)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1266, file: !1267, line: 177, baseType: !987, size: 64, align: 64, offset: 640)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1266, file: !1267, line: 178, baseType: !980, size: 32, align: 32, offset: 704)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1266, file: !1267, line: 180, baseType: !1019, size: 64, align: 64, offset: 768)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1266, file: !1267, line: 185, baseType: !979, size: 32, align: 32, offset: 832)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1266, file: !1267, line: 190, baseType: !1019, size: 64, align: 64, offset: 896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1266, file: !1267, line: 195, baseType: !979, size: 32, align: 32, offset: 960)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1266, file: !1267, line: 200, baseType: !1300, size: 64, align: 64, offset: 1024)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1266, file: !1267, line: 201, baseType: !979, size: 32, align: 32, offset: 1088)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1266, file: !1267, line: 202, baseType: !981, size: 64, align: 64, offset: 1152)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1266, file: !1267, line: 203, baseType: !979, size: 32, align: 32, offset: 1216)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1266, file: !1267, line: 205, baseType: !979, size: 32, align: 32, offset: 1248)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1266, file: !1267, line: 206, baseType: !979, size: 32, align: 32, offset: 1280)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1266, file: !1267, line: 209, baseType: !1086, size: 64, align: 64, offset: 1344)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1266, file: !1267, line: 212, baseType: !1086, size: 64, align: 64, offset: 1408)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1266, file: !1267, line: 213, baseType: !981, size: 64, align: 64, offset: 1472)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1266, file: !1267, line: 215, baseType: !979, size: 32, align: 32, offset: 1536)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1266, file: !1267, line: 217, baseType: !979, size: 32, align: 32, offset: 1568)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1266, file: !1267, line: 220, baseType: !979, size: 32, align: 32, offset: 1600)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1253, file: !14, line: 1598, baseType: !1019, size: 64, align: 64, offset: 384)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1253, file: !14, line: 1606, baseType: !1011, size: 64, align: 64, offset: 448)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1253, file: !14, line: 1614, baseType: !979, size: 32, align: 32, offset: 512)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1253, file: !14, line: 1622, baseType: !979, size: 32, align: 32, offset: 544)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1253, file: !14, line: 1628, baseType: !979, size: 32, align: 32, offset: 576)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1253, file: !14, line: 1636, baseType: !979, size: 32, align: 32, offset: 608)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1253, file: !14, line: 1643, baseType: !979, size: 32, align: 32, offset: 640)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1253, file: !14, line: 1657, baseType: !987, size: 64, align: 64, offset: 704)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1253, file: !14, line: 1658, baseType: !979, size: 32, align: 32, offset: 768)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1253, file: !14, line: 1679, baseType: !1004, size: 64, align: 32, offset: 800)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1253, file: !14, line: 1688, baseType: !979, size: 32, align: 32, offset: 864)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1253, file: !14, line: 1712, baseType: !979, size: 32, align: 32, offset: 896)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1253, file: !14, line: 1729, baseType: !979, size: 32, align: 32, offset: 928)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1253, file: !14, line: 1729, baseType: !979, size: 32, align: 32, offset: 960)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1253, file: !14, line: 1744, baseType: !979, size: 32, align: 32, offset: 992)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1253, file: !14, line: 1744, baseType: !979, size: 32, align: 32, offset: 1024)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1253, file: !14, line: 1751, baseType: !979, size: 32, align: 32, offset: 1056)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1253, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1253, file: !14, line: 1791, baseType: !1440, size: 64, align: 64, offset: 1152)
!1440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1441, size: 64, align: 64)
!1441 = !DISubroutineType(types: !1442)
!1442 = !{null, !1443, !1444, !1446, !979, !979, !979}
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64, align: 64)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1253, file: !14, line: 1808, baseType: !1448, size: 64, align: 64, offset: 1216)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!473, !1443, !1150}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1253, file: !14, line: 1816, baseType: !979, size: 32, align: 32, offset: 1280)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1253, file: !14, line: 1825, baseType: !1453, size: 32, align: 32, offset: 1312)
!1453 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1253, file: !14, line: 1830, baseType: !979, size: 32, align: 32, offset: 1344)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1253, file: !14, line: 1838, baseType: !1453, size: 32, align: 32, offset: 1376)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1253, file: !14, line: 1846, baseType: !979, size: 32, align: 32, offset: 1408)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1253, file: !14, line: 1851, baseType: !979, size: 32, align: 32, offset: 1440)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1253, file: !14, line: 1861, baseType: !1453, size: 32, align: 32, offset: 1472)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1253, file: !14, line: 1868, baseType: !1453, size: 32, align: 32, offset: 1504)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1253, file: !14, line: 1875, baseType: !1453, size: 32, align: 32, offset: 1536)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1253, file: !14, line: 1882, baseType: !1453, size: 32, align: 32, offset: 1568)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1253, file: !14, line: 1889, baseType: !1453, size: 32, align: 32, offset: 1600)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1253, file: !14, line: 1896, baseType: !1453, size: 32, align: 32, offset: 1632)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1253, file: !14, line: 1903, baseType: !1453, size: 32, align: 32, offset: 1664)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1253, file: !14, line: 1910, baseType: !979, size: 32, align: 32, offset: 1696)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1253, file: !14, line: 1915, baseType: !979, size: 32, align: 32, offset: 1728)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1253, file: !14, line: 1926, baseType: !1446, size: 64, align: 64, offset: 1792)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1253, file: !14, line: 1935, baseType: !1004, size: 64, align: 32, offset: 1856)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1253, file: !14, line: 1942, baseType: !979, size: 32, align: 32, offset: 1920)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1253, file: !14, line: 1948, baseType: !979, size: 32, align: 32, offset: 1952)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1253, file: !14, line: 1954, baseType: !979, size: 32, align: 32, offset: 1984)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1253, file: !14, line: 1960, baseType: !979, size: 32, align: 32, offset: 2016)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1253, file: !14, line: 1984, baseType: !979, size: 32, align: 32, offset: 2048)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1253, file: !14, line: 1991, baseType: !979, size: 32, align: 32, offset: 2080)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1253, file: !14, line: 1996, baseType: !979, size: 32, align: 32, offset: 2112)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1253, file: !14, line: 2004, baseType: !979, size: 32, align: 32, offset: 2144)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1253, file: !14, line: 2011, baseType: !979, size: 32, align: 32, offset: 2176)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1253, file: !14, line: 2018, baseType: !979, size: 32, align: 32, offset: 2208)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1253, file: !14, line: 2027, baseType: !979, size: 32, align: 32, offset: 2240)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1253, file: !14, line: 2034, baseType: !979, size: 32, align: 32, offset: 2272)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1253, file: !14, line: 2044, baseType: !979, size: 32, align: 32, offset: 2304)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1253, file: !14, line: 2054, baseType: !1483, size: 64, align: 64, offset: 2368)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1253, file: !14, line: 2061, baseType: !1483, size: 64, align: 64, offset: 2432)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1253, file: !14, line: 2066, baseType: !979, size: 32, align: 32, offset: 2496)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1253, file: !14, line: 2070, baseType: !979, size: 32, align: 32, offset: 2528)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1253, file: !14, line: 2078, baseType: !979, size: 32, align: 32, offset: 2560)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1253, file: !14, line: 2085, baseType: !979, size: 32, align: 32, offset: 2592)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1253, file: !14, line: 2092, baseType: !979, size: 32, align: 32, offset: 2624)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1253, file: !14, line: 2099, baseType: !979, size: 32, align: 32, offset: 2656)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1253, file: !14, line: 2106, baseType: !979, size: 32, align: 32, offset: 2688)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1253, file: !14, line: 2113, baseType: !979, size: 32, align: 32, offset: 2720)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1253, file: !14, line: 2120, baseType: !979, size: 32, align: 32, offset: 2752)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1253, file: !14, line: 2125, baseType: !979, size: 32, align: 32, offset: 2784)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1253, file: !14, line: 2133, baseType: !979, size: 32, align: 32, offset: 2816)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1253, file: !14, line: 2140, baseType: !979, size: 32, align: 32, offset: 2848)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1253, file: !14, line: 2145, baseType: !979, size: 32, align: 32, offset: 2880)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1253, file: !14, line: 2153, baseType: !979, size: 32, align: 32, offset: 2912)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1253, file: !14, line: 2158, baseType: !979, size: 32, align: 32, offset: 2944)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1253, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1253, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1253, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1253, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1253, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1253, file: !14, line: 2203, baseType: !979, size: 32, align: 32, offset: 3136)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1253, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1253, file: !14, line: 2212, baseType: !979, size: 32, align: 32, offset: 3200)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1253, file: !14, line: 2213, baseType: !979, size: 32, align: 32, offset: 3232)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1253, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1253, file: !14, line: 2232, baseType: !979, size: 32, align: 32, offset: 3296)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1253, file: !14, line: 2243, baseType: !979, size: 32, align: 32, offset: 3328)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1253, file: !14, line: 2249, baseType: !979, size: 32, align: 32, offset: 3360)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1253, file: !14, line: 2256, baseType: !979, size: 32, align: 32, offset: 3392)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1253, file: !14, line: 2263, baseType: !1022, size: 64, align: 64, offset: 3456)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1253, file: !14, line: 2270, baseType: !1022, size: 64, align: 64, offset: 3520)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1253, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1253, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1253, file: !14, line: 2367, baseType: !1519, size: 64, align: 64, offset: 3648)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64, align: 64)
!1520 = !DISubroutineType(types: !1521)
!1521 = !{!979, !1443, !981, !979}
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1253, file: !14, line: 2383, baseType: !979, size: 32, align: 32, offset: 3712)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1253, file: !14, line: 2386, baseType: !1453, size: 32, align: 32, offset: 3744)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1253, file: !14, line: 2387, baseType: !1453, size: 32, align: 32, offset: 3776)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1253, file: !14, line: 2394, baseType: !979, size: 32, align: 32, offset: 3808)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1253, file: !14, line: 2401, baseType: !979, size: 32, align: 32, offset: 3840)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1253, file: !14, line: 2408, baseType: !979, size: 32, align: 32, offset: 3872)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1253, file: !14, line: 2415, baseType: !979, size: 32, align: 32, offset: 3904)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1253, file: !14, line: 2422, baseType: !979, size: 32, align: 32, offset: 3936)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1253, file: !14, line: 2423, baseType: !1531, size: 64, align: 64, offset: 3968)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1533)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1534)
!1534 = !{!1535, !1536, !1537, !1538}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1533, file: !14, line: 827, baseType: !979, size: 32, align: 32)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1533, file: !14, line: 828, baseType: !979, size: 32, align: 32, offset: 32)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1533, file: !14, line: 829, baseType: !979, size: 32, align: 32, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1533, file: !14, line: 830, baseType: !1453, size: 32, align: 32, offset: 96)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1253, file: !14, line: 2430, baseType: !1011, size: 64, align: 64, offset: 4032)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1253, file: !14, line: 2437, baseType: !1011, size: 64, align: 64, offset: 4096)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1253, file: !14, line: 2444, baseType: !1453, size: 32, align: 32, offset: 4160)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1253, file: !14, line: 2451, baseType: !1453, size: 32, align: 32, offset: 4192)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1253, file: !14, line: 2458, baseType: !979, size: 32, align: 32, offset: 4224)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1253, file: !14, line: 2469, baseType: !979, size: 32, align: 32, offset: 4256)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1253, file: !14, line: 2475, baseType: !979, size: 32, align: 32, offset: 4288)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1253, file: !14, line: 2481, baseType: !979, size: 32, align: 32, offset: 4320)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1253, file: !14, line: 2485, baseType: !979, size: 32, align: 32, offset: 4352)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1253, file: !14, line: 2489, baseType: !979, size: 32, align: 32, offset: 4384)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1253, file: !14, line: 2493, baseType: !979, size: 32, align: 32, offset: 4416)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1253, file: !14, line: 2501, baseType: !979, size: 32, align: 32, offset: 4448)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1253, file: !14, line: 2506, baseType: !979, size: 32, align: 32, offset: 4480)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1253, file: !14, line: 2510, baseType: !979, size: 32, align: 32, offset: 4512)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1253, file: !14, line: 2514, baseType: !1011, size: 64, align: 64, offset: 4544)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1253, file: !14, line: 2528, baseType: !1555, size: 64, align: 64, offset: 4608)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{null, !1443, !1019, !979, !979}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1253, file: !14, line: 2534, baseType: !979, size: 32, align: 32, offset: 4672)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1253, file: !14, line: 2545, baseType: !979, size: 32, align: 32, offset: 4704)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1253, file: !14, line: 2547, baseType: !979, size: 32, align: 32, offset: 4736)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1253, file: !14, line: 2549, baseType: !979, size: 32, align: 32, offset: 4768)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1253, file: !14, line: 2551, baseType: !979, size: 32, align: 32, offset: 4800)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1253, file: !14, line: 2553, baseType: !979, size: 32, align: 32, offset: 4832)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1253, file: !14, line: 2555, baseType: !979, size: 32, align: 32, offset: 4864)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1253, file: !14, line: 2557, baseType: !979, size: 32, align: 32, offset: 4896)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1253, file: !14, line: 2559, baseType: !979, size: 32, align: 32, offset: 4928)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1253, file: !14, line: 2563, baseType: !979, size: 32, align: 32, offset: 4960)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1253, file: !14, line: 2571, baseType: !1569, size: 64, align: 64, offset: 4992)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1253, file: !14, line: 2579, baseType: !1569, size: 64, align: 64, offset: 5056)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1253, file: !14, line: 2586, baseType: !979, size: 32, align: 32, offset: 5120)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1253, file: !14, line: 2615, baseType: !979, size: 32, align: 32, offset: 5152)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1253, file: !14, line: 2627, baseType: !979, size: 32, align: 32, offset: 5184)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1253, file: !14, line: 2637, baseType: !979, size: 32, align: 32, offset: 5216)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1253, file: !14, line: 2681, baseType: !979, size: 32, align: 32, offset: 5248)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1253, file: !14, line: 2709, baseType: !1011, size: 64, align: 64, offset: 5312)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1253, file: !14, line: 2716, baseType: !1578, size: 64, align: 64, offset: 5376)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585, !1586, !1587, !1591, !1595, !1599, !1600, !1601, !1602, !2489, !2490, !2491, !2492, !2493}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1580, file: !14, line: 3642, baseType: !1139, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1580, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1580, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1580, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1580, file: !14, line: 3669, baseType: !979, size: 32, align: 32, offset: 160)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1580, file: !14, line: 3682, baseType: !1588, size: 64, align: 64, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64, align: 64)
!1589 = !DISubroutineType(types: !1590)
!1590 = !{!979, !1251, !981}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1580, file: !14, line: 3698, baseType: !1592, size: 64, align: 64, offset: 256)
!1592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1593, size: 64, align: 64)
!1593 = !DISubroutineType(types: !1594)
!1594 = !{!979, !1251, !1119, !1098}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1580, file: !14, line: 3712, baseType: !1596, size: 64, align: 64, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1597, size: 64, align: 64)
!1597 = !DISubroutineType(types: !1598)
!1598 = !{!979, !1251, !979, !1119, !1098}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1580, file: !14, line: 3726, baseType: !1592, size: 64, align: 64, offset: 384)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1580, file: !14, line: 3737, baseType: !1248, size: 64, align: 64, offset: 448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1580, file: !14, line: 3746, baseType: !979, size: 32, align: 32, offset: 512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1580, file: !14, line: 3757, baseType: !1603, size: 64, align: 64, offset: 576)
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DISubroutineType(types: !1605)
!1605 = !{null, !1606}
!1606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1607, size: 64, align: 64)
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !1608, line: 81, size: 86208, align: 64, elements: !1609)
!1608 = !DIFile(filename: "./libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1609 = !{!1610, !1612, !1613, !1614, !1615, !1619, !1620, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1667, !1668, !1720, !1722, !1723, !1724, !1725, !1726, !1737, !1738, !1739, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1755, !1756, !1758, !1759, !1760, !1761, !1762, !1763, !1768, !1770, !1771, !1772, !1773, !1774, !1775, !1783, !1784, !1785, !1786, !1787, !1788, !1789, !1790, !1791, !1792, !1793, !1794, !1795, !1796, !1797, !1798, !1802, !1803, !1804, !1805, !1821, !1828, !1840, !1856, !1878, !1918, !1931, !1958, !1973, !1987, !2000, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2021, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2034, !2036, !2037, !2038, !2039, !2040, !2041, !2044, !2046, !2048, !2049, !2052, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2119, !2120, !2122, !2123, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2145, !2146, !2147, !2150, !2151, !2152, !2153, !2155, !2157, !2158, !2159, !2160, !2161, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294, !2295, !2296, !2297, !2298, !2299, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2365, !2366, !2367, !2368, !2372, !2373, !2377, !2381, !2384, !2385, !2390, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2405, !2406, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2424, !2425, !2426, !2476, !2477, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488}
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1607, file: !1608, line: 82, baseType: !1611, size: 64, align: 64)
!1611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !1607, file: !1608, line: 84, baseType: !979, size: 32, align: 32, offset: 64)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !1607, file: !1608, line: 84, baseType: !979, size: 32, align: 32, offset: 96)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !1607, file: !1608, line: 85, baseType: !979, size: 32, align: 32, offset: 128)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !1607, file: !1608, line: 86, baseType: !1616, size: 384, align: 32, offset: 160)
!1616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 384, align: 32, elements: !1617)
!1617 = !{!1618}
!1618 = !DISubrange(count: 12)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !1607, file: !1608, line: 87, baseType: !979, size: 32, align: 32, offset: 544)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !1607, file: !1608, line: 90, baseType: !1621, size: 1088, align: 64, offset: 576)
!1621 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !902, line: 35, baseType: !1622)
!1622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !902, line: 31, size: 1088, align: 64, elements: !1623)
!1623 = !{!1624, !1625, !1629}
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1622, file: !902, line: 32, baseType: !1119, size: 64, align: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1622, file: !902, line: 33, baseType: !1626, size: 512, align: 8, offset: 64)
!1626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 512, align: 8, elements: !1627)
!1627 = !{!1628}
!1628 = !DISubrange(count: 64)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1622, file: !902, line: 34, baseType: !1626, size: 512, align: 8, offset: 576)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !1607, file: !1608, line: 91, baseType: !1621, size: 1088, align: 64, offset: 1664)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !1607, file: !1608, line: 92, baseType: !1621, size: 1088, align: 64, offset: 2752)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !1607, file: !1608, line: 93, baseType: !1621, size: 1088, align: 64, offset: 3840)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !1607, file: !1608, line: 98, baseType: !1443, size: 64, align: 64, offset: 4928)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1607, file: !1608, line: 100, baseType: !979, size: 32, align: 32, offset: 4992)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1607, file: !1608, line: 100, baseType: !979, size: 32, align: 32, offset: 5024)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1607, file: !1608, line: 101, baseType: !979, size: 32, align: 32, offset: 5056)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "intra_only", scope: !1607, file: !1608, line: 102, baseType: !979, size: 32, align: 32, offset: 5088)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1607, file: !1608, line: 103, baseType: !1011, size: 64, align: 64, offset: 5120)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "out_format", scope: !1607, file: !1608, line: 104, baseType: !894, size: 32, align: 32, offset: 5184)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "h263_pred", scope: !1607, file: !1608, line: 105, baseType: !979, size: 32, align: 32, offset: 5216)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "pb_frame", scope: !1607, file: !1608, line: 106, baseType: !979, size: 32, align: 32, offset: 5248)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "h263_plus", scope: !1607, file: !1608, line: 109, baseType: !979, size: 32, align: 32, offset: 5280)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "h263_flv", scope: !1607, file: !1608, line: 110, baseType: !979, size: 32, align: 32, offset: 5312)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1607, file: !1608, line: 112, baseType: !13, size: 32, align: 32, offset: 5344)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_qscale", scope: !1607, file: !1608, line: 113, baseType: !979, size: 32, align: 32, offset: 5376)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !1607, file: !1608, line: 114, baseType: !979, size: 32, align: 32, offset: 5408)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1607, file: !1608, line: 115, baseType: !979, size: 32, align: 32, offset: 5440)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "luma_elim_threshold", scope: !1607, file: !1608, line: 116, baseType: !979, size: 32, align: 32, offset: 5472)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_elim_threshold", scope: !1607, file: !1608, line: 117, baseType: !979, size: 32, align: 32, offset: 5504)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1607, file: !1608, line: 118, baseType: !979, size: 32, align: 32, offset: 5536)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1607, file: !1608, line: 119, baseType: !979, size: 32, align: 32, offset: 5568)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1607, file: !1608, line: 120, baseType: !979, size: 32, align: 32, offset: 5600)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "context_initialized", scope: !1607, file: !1608, line: 124, baseType: !979, size: 32, align: 32, offset: 5632)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "input_picture_number", scope: !1607, file: !1608, line: 125, baseType: !979, size: 32, align: 32, offset: 5664)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1607, file: !1608, line: 126, baseType: !979, size: 32, align: 32, offset: 5696)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "picture_number", scope: !1607, file: !1608, line: 127, baseType: !979, size: 32, align: 32, offset: 5728)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "picture_in_gop_number", scope: !1607, file: !1608, line: 128, baseType: !979, size: 32, align: 32, offset: 5760)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "mb_width", scope: !1607, file: !1608, line: 129, baseType: !979, size: 32, align: 32, offset: 5792)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "mb_height", scope: !1607, file: !1608, line: 129, baseType: !979, size: 32, align: 32, offset: 5824)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "mb_stride", scope: !1607, file: !1608, line: 130, baseType: !979, size: 32, align: 32, offset: 5856)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "b8_stride", scope: !1607, file: !1608, line: 131, baseType: !979, size: 32, align: 32, offset: 5888)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "h_edge_pos", scope: !1607, file: !1608, line: 132, baseType: !979, size: 32, align: 32, offset: 5920)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "v_edge_pos", scope: !1607, file: !1608, line: 132, baseType: !979, size: 32, align: 32, offset: 5952)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "mb_num", scope: !1607, file: !1608, line: 133, baseType: !979, size: 32, align: 32, offset: 5984)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1607, file: !1608, line: 134, baseType: !1666, size: 64, align: 64, offset: 6016)
!1666 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !1087, line: 149, baseType: !1012)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "uvlinesize", scope: !1607, file: !1608, line: 135, baseType: !1666, size: 64, align: 64, offset: 6080)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "picture", scope: !1607, file: !1608, line: 136, baseType: !1669, size: 64, align: 64, offset: 6144)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "Picture", file: !1671, line: 91, baseType: !1672)
!1671 = !DIFile(filename: "./libavcodec/mpegpicture.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Picture", file: !1671, line: 45, size: 2624, align: 64, elements: !1673)
!1673 = !{!1674, !1676, !1687, !1688, !1689, !1691, !1695, !1696, !1697, !1698, !1699, !1700, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1672, file: !1671, line: 46, baseType: !1675, size: 64, align: 64)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "tf", scope: !1672, file: !1671, line: 47, baseType: !1677, size: 256, align: 64, offset: 64)
!1677 = !DIDerivedType(tag: DW_TAG_typedef, name: "ThreadFrame", file: !1678, line: 40, baseType: !1679)
!1678 = !DIFile(filename: "./libavcodec/thread.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadFrame", file: !1678, line: 34, size: 256, align: 64, elements: !1680)
!1680 = !{!1681, !1682, !1686}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1679, file: !1678, line: 35, baseType: !981, size: 64, align: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !1679, file: !1678, line: 36, baseType: !1683, size: 128, align: 64, offset: 64)
!1683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1251, size: 128, align: 64, elements: !1684)
!1684 = !{!1685}
!1685 = !DISubrange(count: 2)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "progress", scope: !1679, file: !1678, line: 39, baseType: !1033, size: 64, align: 64, offset: 192)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table_buf", scope: !1672, file: !1671, line: 49, baseType: !1033, size: 64, align: 64, offset: 320)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1672, file: !1671, line: 50, baseType: !1077, size: 64, align: 64, offset: 384)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val_buf", scope: !1672, file: !1671, line: 52, baseType: !1690, size: 128, align: 64, offset: 448)
!1690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 128, align: 64, elements: !1684)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "motion_val", scope: !1672, file: !1671, line: 53, baseType: !1692, size: 128, align: 64, offset: 576)
!1692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1693, size: 128, align: 64, elements: !1684)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64, align: 64)
!1694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 32, align: 16, elements: !1684)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "mb_type_buf", scope: !1672, file: !1671, line: 55, baseType: !1033, size: 64, align: 64, offset: 704)
