; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dpx_parser.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dpx_parser.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVCodecParserContext = type { i8*, %struct.AVCodecParser*, i64, i64, i64, i32, i32, i64, i64, i64, i64, i32, i32, [4 x i64], [4 x i64], [4 x i64], i32, i64, [4 x i64], i32, i64, i32, i32, i32, [4 x i64], i64, i64, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!822 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!823 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!824 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!825 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!826 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!827 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!828 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!829 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!830 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!831 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!832 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!833 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!834 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!835 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!836 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!837 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!838 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!839 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!840 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!841 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!842 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !509, line: 493, size: 32, align: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861}
!845 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!846 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!847 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!848 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!849 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!850 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!851 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!852 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!853 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!854 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!855 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!856 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!857 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!858 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!859 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!860 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!861 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!862 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !509, line: 538, size: 32, align: 32, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871}
!864 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!867 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!868 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!869 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!870 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!871 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !873)
!873 = !{!874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!874 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!875 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!876 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!887 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!888 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!889 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!890 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!891 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!892 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!893 = !{!894}
!894 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!895 = !{!896}
!896 = distinct !DIGlobalVariable(name: "ff_dpx_parser", scope: !0, file: !897, line: 111, type: !898, isLocal: false, isDefinition: true, variable: { [5 x i32], i32, i32 (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecParserContext*, %struct.AVCodecContext*, i8**, i32*, i8*, i32)*, void (%struct.AVCodecParserContext*)*, i32 (%struct.AVCodecContext*, i8*, i32)*, %struct.AVCodecParser* }* @ff_dpx_parser)
!897 = !DIFile(filename: "libavcodec/dpx_parser.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParser", file: !4, line: 5272, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParser", file: !4, line: 5259, size: 512, align: 64, elements: !900)
!900 = !{!901, !906, !907, !959, !1557, !1561, !1565}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !899, file: !4, line: 5260, baseType: !902, size: 160, align: 32)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 160, align: 32, elements: !904)
!903 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!904 = !{!905}
!905 = !DISubrange(count: 5)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !899, file: !4, line: 5261, baseType: !903, size: 32, align: 32, offset: 160)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "parser_init", scope: !899, file: !4, line: 5262, baseType: !908, size: 64, align: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64, align: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{!903, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParserContext", file: !4, line: 5257, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParserContext", file: !4, line: 5092, size: 2816, align: 64, elements: !914)
!914 = !{!915, !917, !919, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !913, file: !4, line: 5093, baseType: !916, size: 64, align: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !913, file: !4, line: 5094, baseType: !918, size: 64, align: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64, align: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "frame_offset", scope: !913, file: !4, line: 5095, baseType: !920, size: 64, align: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !921, line: 40, baseType: !922)
!921 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!922 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cur_offset", scope: !913, file: !4, line: 5096, baseType: !920, size: 64, align: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame_offset", scope: !913, file: !4, line: 5098, baseType: !920, size: 64, align: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !913, file: !4, line: 5100, baseType: !903, size: 32, align: 32, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !913, file: !4, line: 5110, baseType: !903, size: 32, align: 32, offset: 352)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !913, file: !4, line: 5111, baseType: !920, size: 64, align: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !913, file: !4, line: 5112, baseType: !920, size: 64, align: 64, offset: 448)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "last_pts", scope: !913, file: !4, line: 5115, baseType: !920, size: 64, align: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "last_dts", scope: !913, file: !4, line: 5116, baseType: !920, size: 64, align: 64, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fetch_timestamp", scope: !913, file: !4, line: 5117, baseType: !903, size: 32, align: 32, offset: 640)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_start_index", scope: !913, file: !4, line: 5120, baseType: !903, size: 32, align: 32, offset: 672)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_offset", scope: !913, file: !4, line: 5121, baseType: !934, size: 256, align: 64, offset: 704)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !920, size: 256, align: 64, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 4)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pts", scope: !913, file: !4, line: 5122, baseType: !934, size: 256, align: 64, offset: 960)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_dts", scope: !913, file: !4, line: 5123, baseType: !934, size: 256, align: 64, offset: 1216)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !913, file: !4, line: 5125, baseType: !903, size: 32, align: 32, offset: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !913, file: !4, line: 5132, baseType: !920, size: 64, align: 64, offset: 1536)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_end", scope: !913, file: !4, line: 5133, baseType: !934, size: 256, align: 64, offset: 1600)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !913, file: !4, line: 5141, baseType: !903, size: 32, align: 32, offset: 1856)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !913, file: !4, line: 5148, baseType: !920, size: 64, align: 64, offset: 1920)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dts_sync_point", scope: !913, file: !4, line: 5161, baseType: !903, size: 32, align: 32, offset: 1984)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "dts_ref_dts_delta", scope: !913, file: !4, line: 5176, baseType: !903, size: 32, align: 32, offset: 2016)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "pts_dts_delta", scope: !913, file: !4, line: 5190, baseType: !903, size: 32, align: 32, offset: 2048)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "cur_frame_pos", scope: !913, file: !4, line: 5197, baseType: !934, size: 256, align: 64, offset: 2112)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !913, file: !4, line: 5202, baseType: !920, size: 64, align: 64, offset: 2368)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "last_pos", scope: !913, file: !4, line: 5207, baseType: !920, size: 64, align: 64, offset: 2432)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !913, file: !4, line: 5214, baseType: !903, size: 32, align: 32, offset: 2496)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !913, file: !4, line: 5216, baseType: !3, size: 32, align: 32, offset: 2528)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "picture_structure", scope: !913, file: !4, line: 5226, baseType: !12, size: 32, align: 32, offset: 2560)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "output_picture_number", scope: !913, file: !4, line: 5234, baseType: !903, size: 32, align: 32, offset: 2592)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !913, file: !4, line: 5239, baseType: !903, size: 32, align: 32, offset: 2624)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !913, file: !4, line: 5240, baseType: !903, size: 32, align: 32, offset: 2656)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !913, file: !4, line: 5245, baseType: !903, size: 32, align: 32, offset: 2688)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !913, file: !4, line: 5246, baseType: !903, size: 32, align: 32, offset: 2720)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !913, file: !4, line: 5256, baseType: !903, size: 32, align: 32, offset: 2752)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "parser_parse", scope: !899, file: !4, line: 5265, baseType: !960, size: 64, align: 64, offset: 256)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!903, !911, !963, !1556, !1249, !1452, !903}
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !965)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !966)
!966 = !{!967, !1011, !1012, !1013, !1279, !1280, !1281, !1282, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1308, !1312, !1313, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1494, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !965, file: !4, line: 1561, baseType: !968, size: 64, align: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !19, line: 143, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !19, line: 67, size: 640, align: 64, elements: !972)
!972 = !{!973, !977, !981, !985, !986, !987, !988, !992, !998, !1000, !1004}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !971, file: !19, line: 72, baseType: !974, size: 64, align: 64)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64, align: 64)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !971, file: !19, line: 78, baseType: !978, size: 64, align: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!974, !916}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !971, file: !19, line: 85, baseType: !982, size: 64, align: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !19, line: 85, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !971, file: !19, line: 93, baseType: !903, size: 32, align: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !971, file: !19, line: 99, baseType: !903, size: 32, align: 32, offset: 224)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !971, file: !19, line: 108, baseType: !903, size: 32, align: 32, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !971, file: !19, line: 113, baseType: !989, size: 64, align: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{!916, !916, !916}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !971, file: !19, line: 123, baseType: !993, size: 64, align: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64, align: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!996, !996}
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64, align: 64)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !971, file: !19, line: 130, baseType: !999, size: 32, align: 32, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !19, line: 48, baseType: !18)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !971, file: !19, line: 136, baseType: !1001, size: 64, align: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!999, !916}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !971, file: !19, line: 142, baseType: !1005, size: 64, align: 64, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 64, align: 64)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!903, !1008, !916, !974, !903}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64, align: 64)
!1010 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !19, line: 60, flags: DIFlagFwdDecl)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !965, file: !4, line: 1562, baseType: !903, size: 32, align: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !965, file: !4, line: 1564, baseType: !39, size: 32, align: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !965, file: !4, line: 1565, baseType: !1014, size: 64, align: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1032, !1035, !1038, !1041, !1046, !1049, !1050, !1058, !1059, !1060, !1062, !1066, !1072, !1077, !1081, !1082, !1129, !1250, !1254, !1255, !1259, !1263, !1268, !1272, !1273, !1274}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !4, line: 3475, baseType: !974, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1016, file: !4, line: 3480, baseType: !974, size: 64, align: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1016, file: !4, line: 3481, baseType: !39, size: 32, align: 32, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1016, file: !4, line: 3482, baseType: !49, size: 32, align: 32, offset: 160)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1016, file: !4, line: 3487, baseType: !903, size: 32, align: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1016, file: !4, line: 3488, baseType: !1024, size: 64, align: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1027, line: 61, baseType: !1028)
!1027 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1027, line: 58, size: 64, align: 32, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1028, file: !1027, line: 59, baseType: !903, size: 32, align: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1028, file: !1027, line: 60, baseType: !903, size: 32, align: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1016, file: !4, line: 3489, baseType: !1033, size: 64, align: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1016, file: !4, line: 3490, baseType: !1036, size: 64, align: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1016, file: !4, line: 3491, baseType: !1039, size: 64, align: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1016, file: !4, line: 3492, baseType: !1042, size: 64, align: 64, offset: 512)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64, align: 64)
!1043 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !921, line: 55, baseType: !1045)
!1045 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1016, file: !4, line: 3493, baseType: !1047, size: 8, align: 8, offset: 576)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !921, line: 48, baseType: !1048)
!1048 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1016, file: !4, line: 3494, baseType: !968, size: 64, align: 64, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1016, file: !4, line: 3495, baseType: !1051, size: 64, align: 64, offset: 704)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1054, file: !4, line: 3402, baseType: !903, size: 32, align: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1054, file: !4, line: 3403, baseType: !974, size: 64, align: 64, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1016, file: !4, line: 3507, baseType: !974, size: 64, align: 64, offset: 768)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1016, file: !4, line: 3516, baseType: !903, size: 32, align: 32, offset: 832)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !4, line: 3517, baseType: !1061, size: 64, align: 64, offset: 896)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1016, file: !4, line: 3527, baseType: !1063, size: 64, align: 64, offset: 960)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!903, !963}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1016, file: !4, line: 3535, baseType: !1067, size: 64, align: 64, offset: 1024)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!903, !963, !1070}
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1016, file: !4, line: 3541, baseType: !1073, size: 64, align: 64, offset: 1088)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1076)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1016, file: !4, line: 3549, baseType: !1078, size: 64, align: 64, offset: 1152)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64, align: 64)
!1079 = !DISubroutineType(types: !1080)
!1080 = !{null, !1061}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1016, file: !4, line: 3551, baseType: !1063, size: 64, align: 64, offset: 1216)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1016, file: !4, line: 3552, baseType: !1083, size: 64, align: 64, offset: 1280)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!903, !963, !1086, !903, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1089)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1090)
!1090 = !{!1091, !1094, !1096, !1097, !1098, !1128}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1089, file: !4, line: 3921, baseType: !1092, size: 16, align: 16)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !921, line: 49, baseType: !1093)
!1093 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1089, file: !4, line: 3922, baseType: !1095, size: 32, align: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !921, line: 51, baseType: !894)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1089, file: !4, line: 3923, baseType: !1095, size: 32, align: 32, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1089, file: !4, line: 3924, baseType: !894, size: 32, align: 32, offset: 96)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1089, file: !4, line: 3925, baseType: !1099, size: 64, align: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1119, !1121, !1123, !1124, !1126, !1127}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1102, file: !4, line: 3886, baseType: !903, size: 32, align: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1102, file: !4, line: 3887, baseType: !903, size: 32, align: 32, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1102, file: !4, line: 3888, baseType: !903, size: 32, align: 32, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1102, file: !4, line: 3889, baseType: !903, size: 32, align: 32, offset: 96)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1102, file: !4, line: 3890, baseType: !903, size: 32, align: 32, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1102, file: !4, line: 3897, baseType: !1110, size: 768, align: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1112)
!1112 = !{!1113, !1117}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1111, file: !4, line: 3855, baseType: !1114, size: 512, align: 64)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 512, align: 64, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 8)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1111, file: !4, line: 3857, baseType: !1118, size: 256, align: 32, offset: 512)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 256, align: 32, elements: !1115)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1102, file: !4, line: 3903, baseType: !1120, size: 256, align: 64, offset: 960)
!1120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1086, size: 256, align: 64, elements: !935)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1102, file: !4, line: 3904, baseType: !1122, size: 128, align: 32, offset: 1216)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 128, align: 32, elements: !935)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1102, file: !4, line: 3906, baseType: !725, size: 32, align: 32, offset: 1344)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1102, file: !4, line: 3908, baseType: !1125, size: 64, align: 64, offset: 1408)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1102, file: !4, line: 3915, baseType: !1125, size: 64, align: 64, offset: 1472)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1102, file: !4, line: 3917, baseType: !903, size: 32, align: 32, offset: 1536)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1089, file: !4, line: 3926, baseType: !920, size: 64, align: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1016, file: !4, line: 3564, baseType: !1130, size: 64, align: 64, offset: 1344)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64, align: 64)
!1131 = !DISubroutineType(types: !1132)
!1132 = !{!903, !963, !1133, !1167, !1249}
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1135)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1136)
!1136 = !{!1137, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1163, !1164, !1165, !1166}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1135, file: !4, line: 1451, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1140, line: 94, baseType: !1141)
!1140 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1140, line: 81, size: 192, align: 64, elements: !1142)
!1142 = !{!1143, !1147, !1148}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1141, file: !1140, line: 82, baseType: !1144, size: 64, align: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1140, line: 73, baseType: !1146)
!1146 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1140, line: 73, flags: DIFlagFwdDecl)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1141, file: !1140, line: 89, baseType: !1086, size: 64, align: 64, offset: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1141, file: !1140, line: 93, baseType: !903, size: 32, align: 32, offset: 128)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1135, file: !4, line: 1461, baseType: !920, size: 64, align: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1135, file: !4, line: 1467, baseType: !920, size: 64, align: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1135, file: !4, line: 1468, baseType: !1086, size: 64, align: 64, offset: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !4, line: 1469, baseType: !903, size: 32, align: 32, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1135, file: !4, line: 1470, baseType: !903, size: 32, align: 32, offset: 288)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !4, line: 1474, baseType: !903, size: 32, align: 32, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1135, file: !4, line: 1479, baseType: !1156, size: 64, align: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1158, file: !4, line: 1412, baseType: !1086, size: 64, align: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1158, file: !4, line: 1413, baseType: !903, size: 32, align: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1158, file: !4, line: 1414, baseType: !731, size: 32, align: 32, offset: 96)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1135, file: !4, line: 1480, baseType: !903, size: 32, align: 32, offset: 448)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1135, file: !4, line: 1486, baseType: !920, size: 64, align: 64, offset: 512)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1135, file: !4, line: 1488, baseType: !920, size: 64, align: 64, offset: 576)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1135, file: !4, line: 1497, baseType: !920, size: 64, align: 64, offset: 640)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !772, line: 646, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !772, line: 268, size: 4288, align: 64, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1201, !1203, !1204, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1237, !1238, !1239, !1240, !1241, !1242, !1245, !1246, !1247, !1248}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1170, file: !772, line: 282, baseType: !1114, size: 512, align: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1170, file: !772, line: 299, baseType: !1118, size: 256, align: 32, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1170, file: !772, line: 315, baseType: !1175, size: 64, align: 64, offset: 768)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1170, file: !772, line: 326, baseType: !903, size: 32, align: 32, offset: 832)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1170, file: !772, line: 326, baseType: !903, size: 32, align: 32, offset: 864)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1170, file: !772, line: 334, baseType: !903, size: 32, align: 32, offset: 896)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1170, file: !772, line: 341, baseType: !903, size: 32, align: 32, offset: 928)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1170, file: !772, line: 346, baseType: !903, size: 32, align: 32, offset: 960)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1170, file: !772, line: 351, baseType: !761, size: 32, align: 32, offset: 992)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1170, file: !772, line: 356, baseType: !1026, size: 64, align: 32, offset: 1024)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1170, file: !772, line: 361, baseType: !920, size: 64, align: 64, offset: 1088)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1170, file: !772, line: 369, baseType: !920, size: 64, align: 64, offset: 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1170, file: !772, line: 377, baseType: !920, size: 64, align: 64, offset: 1216)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1170, file: !772, line: 382, baseType: !903, size: 32, align: 32, offset: 1280)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1170, file: !772, line: 386, baseType: !903, size: 32, align: 32, offset: 1312)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1170, file: !772, line: 391, baseType: !903, size: 32, align: 32, offset: 1344)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1170, file: !772, line: 396, baseType: !916, size: 64, align: 64, offset: 1408)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1170, file: !772, line: 403, baseType: !1191, size: 512, align: 64, offset: 1472)
!1191 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1044, size: 512, align: 64, elements: !1115)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1170, file: !772, line: 410, baseType: !903, size: 32, align: 32, offset: 1984)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1170, file: !772, line: 415, baseType: !903, size: 32, align: 32, offset: 2016)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1170, file: !772, line: 420, baseType: !903, size: 32, align: 32, offset: 2048)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1170, file: !772, line: 425, baseType: !903, size: 32, align: 32, offset: 2080)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1170, file: !772, line: 435, baseType: !920, size: 64, align: 64, offset: 2112)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1170, file: !772, line: 440, baseType: !903, size: 32, align: 32, offset: 2176)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1170, file: !772, line: 445, baseType: !1044, size: 64, align: 64, offset: 2240)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1170, file: !772, line: 459, baseType: !1200, size: 512, align: 64, offset: 2304)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1138, size: 512, align: 64, elements: !1115)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1170, file: !772, line: 473, baseType: !1202, size: 64, align: 64, offset: 2816)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1170, file: !772, line: 477, baseType: !903, size: 32, align: 32, offset: 2880)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1170, file: !772, line: 479, baseType: !1205, size: 64, align: 64, offset: 2944)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64, align: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64, align: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !772, line: 207, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !772, line: 201, size: 320, align: 64, elements: !1209)
!1209 = !{!1210, !1211, !1212, !1213, !1218}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1208, file: !772, line: 202, baseType: !771, size: 32, align: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1208, file: !772, line: 203, baseType: !1086, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !772, line: 204, baseType: !903, size: 32, align: 32, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1208, file: !772, line: 205, baseType: !1214, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64, align: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1216, line: 86, baseType: !1217)
!1216 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1216, line: 86, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1208, file: !772, line: 206, baseType: !1138, size: 64, align: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1170, file: !772, line: 480, baseType: !903, size: 32, align: 32, offset: 3008)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1170, file: !772, line: 505, baseType: !903, size: 32, align: 32, offset: 3040)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1170, file: !772, line: 512, baseType: !795, size: 32, align: 32, offset: 3072)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1170, file: !772, line: 514, baseType: !801, size: 32, align: 32, offset: 3104)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1170, file: !772, line: 516, baseType: !819, size: 32, align: 32, offset: 3136)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1170, file: !772, line: 523, baseType: !843, size: 32, align: 32, offset: 3168)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1170, file: !772, line: 525, baseType: !862, size: 32, align: 32, offset: 3200)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1170, file: !772, line: 532, baseType: !920, size: 64, align: 64, offset: 3264)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1170, file: !772, line: 539, baseType: !920, size: 64, align: 64, offset: 3328)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1170, file: !772, line: 547, baseType: !920, size: 64, align: 64, offset: 3392)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1170, file: !772, line: 554, baseType: !1214, size: 64, align: 64, offset: 3456)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1170, file: !772, line: 563, baseType: !903, size: 32, align: 32, offset: 3520)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1170, file: !772, line: 572, baseType: !903, size: 32, align: 32, offset: 3552)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1170, file: !772, line: 581, baseType: !903, size: 32, align: 32, offset: 3584)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1170, file: !772, line: 588, baseType: !1234, size: 64, align: 64, offset: 3648)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !921, line: 36, baseType: !1236)
!1236 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1170, file: !772, line: 593, baseType: !903, size: 32, align: 32, offset: 3712)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1170, file: !772, line: 596, baseType: !903, size: 32, align: 32, offset: 3744)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1170, file: !772, line: 599, baseType: !1138, size: 64, align: 64, offset: 3776)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1170, file: !772, line: 605, baseType: !1138, size: 64, align: 64, offset: 3840)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1170, file: !772, line: 616, baseType: !1138, size: 64, align: 64, offset: 3904)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1170, file: !772, line: 626, baseType: !1243, size: 64, align: 64, offset: 3968)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1244, line: 216, baseType: !1045)
!1244 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1170, file: !772, line: 627, baseType: !1243, size: 64, align: 64, offset: 4032)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1170, file: !772, line: 628, baseType: !1243, size: 64, align: 64, offset: 4096)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1170, file: !772, line: 629, baseType: !1243, size: 64, align: 64, offset: 4160)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1170, file: !772, line: 645, baseType: !1138, size: 64, align: 64, offset: 4224)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1016, file: !4, line: 3566, baseType: !1251, size: 64, align: 64, offset: 1408)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!903, !963, !916, !1249, !1133}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1016, file: !4, line: 3567, baseType: !1063, size: 64, align: 64, offset: 1472)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1016, file: !4, line: 3576, baseType: !1256, size: 64, align: 64, offset: 1536)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!903, !963, !1167}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1016, file: !4, line: 3577, baseType: !1260, size: 64, align: 64, offset: 1600)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64, align: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!903, !963, !1133}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1016, file: !4, line: 3584, baseType: !1264, size: 64, align: 64, offset: 1664)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64, align: 64)
!1265 = !DISubroutineType(types: !1266)
!1266 = !{!903, !963, !1267}
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64, align: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1016, file: !4, line: 3589, baseType: !1269, size: 64, align: 64, offset: 1728)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DISubroutineType(types: !1271)
!1271 = !{null, !963}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1016, file: !4, line: 3594, baseType: !903, size: 32, align: 32, offset: 1792)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1016, file: !4, line: 3600, baseType: !974, size: 64, align: 64, offset: 1856)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1016, file: !4, line: 3609, baseType: !1275, size: 64, align: 64, offset: 1920)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1278)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !965, file: !4, line: 1566, baseType: !49, size: 32, align: 32, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !965, file: !4, line: 1581, baseType: !894, size: 32, align: 32, offset: 224)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !965, file: !4, line: 1583, baseType: !916, size: 64, align: 64, offset: 256)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !965, file: !4, line: 1591, baseType: !1283, size: 64, align: 64, offset: 320)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64, align: 64)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !965, file: !4, line: 1598, baseType: !916, size: 64, align: 64, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !965, file: !4, line: 1606, baseType: !920, size: 64, align: 64, offset: 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !965, file: !4, line: 1614, baseType: !903, size: 32, align: 32, offset: 512)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !965, file: !4, line: 1622, baseType: !903, size: 32, align: 32, offset: 544)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !965, file: !4, line: 1628, baseType: !903, size: 32, align: 32, offset: 576)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !965, file: !4, line: 1636, baseType: !903, size: 32, align: 32, offset: 608)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !965, file: !4, line: 1643, baseType: !903, size: 32, align: 32, offset: 640)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !965, file: !4, line: 1657, baseType: !1086, size: 64, align: 64, offset: 704)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !965, file: !4, line: 1658, baseType: !903, size: 32, align: 32, offset: 768)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !965, file: !4, line: 1679, baseType: !1026, size: 64, align: 32, offset: 800)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !965, file: !4, line: 1688, baseType: !903, size: 32, align: 32, offset: 864)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !965, file: !4, line: 1712, baseType: !903, size: 32, align: 32, offset: 896)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !965, file: !4, line: 1729, baseType: !903, size: 32, align: 32, offset: 928)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !965, file: !4, line: 1729, baseType: !903, size: 32, align: 32, offset: 960)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !965, file: !4, line: 1744, baseType: !903, size: 32, align: 32, offset: 992)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !965, file: !4, line: 1744, baseType: !903, size: 32, align: 32, offset: 1024)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !965, file: !4, line: 1751, baseType: !903, size: 32, align: 32, offset: 1056)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !965, file: !4, line: 1766, baseType: !508, size: 32, align: 32, offset: 1088)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !965, file: !4, line: 1791, baseType: !1304, size: 64, align: 64, offset: 1152)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{null, !1307, !1167, !1249, !903, !903, !903}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !965, file: !4, line: 1808, baseType: !1309, size: 64, align: 64, offset: 1216)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64, align: 64)
!1310 = !DISubroutineType(types: !1311)
!1311 = !{!508, !1307, !1033}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !965, file: !4, line: 1816, baseType: !903, size: 32, align: 32, offset: 1280)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !965, file: !4, line: 1825, baseType: !1314, size: 32, align: 32, offset: 1312)
!1314 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !965, file: !4, line: 1830, baseType: !903, size: 32, align: 32, offset: 1344)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !965, file: !4, line: 1838, baseType: !1314, size: 32, align: 32, offset: 1376)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !965, file: !4, line: 1846, baseType: !903, size: 32, align: 32, offset: 1408)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !965, file: !4, line: 1851, baseType: !903, size: 32, align: 32, offset: 1440)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !965, file: !4, line: 1861, baseType: !1314, size: 32, align: 32, offset: 1472)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !965, file: !4, line: 1868, baseType: !1314, size: 32, align: 32, offset: 1504)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !965, file: !4, line: 1875, baseType: !1314, size: 32, align: 32, offset: 1536)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !965, file: !4, line: 1882, baseType: !1314, size: 32, align: 32, offset: 1568)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !965, file: !4, line: 1889, baseType: !1314, size: 32, align: 32, offset: 1600)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !965, file: !4, line: 1896, baseType: !1314, size: 32, align: 32, offset: 1632)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !965, file: !4, line: 1903, baseType: !1314, size: 32, align: 32, offset: 1664)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !965, file: !4, line: 1910, baseType: !903, size: 32, align: 32, offset: 1696)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !965, file: !4, line: 1915, baseType: !903, size: 32, align: 32, offset: 1728)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !965, file: !4, line: 1926, baseType: !1249, size: 64, align: 64, offset: 1792)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !965, file: !4, line: 1935, baseType: !1026, size: 64, align: 32, offset: 1856)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !965, file: !4, line: 1942, baseType: !903, size: 32, align: 32, offset: 1920)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !965, file: !4, line: 1948, baseType: !903, size: 32, align: 32, offset: 1952)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !965, file: !4, line: 1954, baseType: !903, size: 32, align: 32, offset: 1984)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !965, file: !4, line: 1960, baseType: !903, size: 32, align: 32, offset: 2016)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !965, file: !4, line: 1984, baseType: !903, size: 32, align: 32, offset: 2048)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !965, file: !4, line: 1991, baseType: !903, size: 32, align: 32, offset: 2080)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !965, file: !4, line: 1996, baseType: !903, size: 32, align: 32, offset: 2112)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !965, file: !4, line: 2004, baseType: !903, size: 32, align: 32, offset: 2144)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !965, file: !4, line: 2011, baseType: !903, size: 32, align: 32, offset: 2176)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !965, file: !4, line: 2018, baseType: !903, size: 32, align: 32, offset: 2208)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !965, file: !4, line: 2027, baseType: !903, size: 32, align: 32, offset: 2240)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !965, file: !4, line: 2034, baseType: !903, size: 32, align: 32, offset: 2272)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !965, file: !4, line: 2044, baseType: !903, size: 32, align: 32, offset: 2304)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !965, file: !4, line: 2054, baseType: !1344, size: 64, align: 64, offset: 2368)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !965, file: !4, line: 2061, baseType: !1344, size: 64, align: 64, offset: 2432)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !965, file: !4, line: 2066, baseType: !903, size: 32, align: 32, offset: 2496)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !965, file: !4, line: 2070, baseType: !903, size: 32, align: 32, offset: 2528)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !965, file: !4, line: 2078, baseType: !903, size: 32, align: 32, offset: 2560)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !965, file: !4, line: 2085, baseType: !903, size: 32, align: 32, offset: 2592)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !965, file: !4, line: 2092, baseType: !903, size: 32, align: 32, offset: 2624)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !965, file: !4, line: 2099, baseType: !903, size: 32, align: 32, offset: 2656)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !965, file: !4, line: 2106, baseType: !903, size: 32, align: 32, offset: 2688)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !965, file: !4, line: 2113, baseType: !903, size: 32, align: 32, offset: 2720)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !965, file: !4, line: 2120, baseType: !903, size: 32, align: 32, offset: 2752)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !965, file: !4, line: 2125, baseType: !903, size: 32, align: 32, offset: 2784)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !965, file: !4, line: 2133, baseType: !903, size: 32, align: 32, offset: 2816)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !965, file: !4, line: 2140, baseType: !903, size: 32, align: 32, offset: 2848)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !965, file: !4, line: 2145, baseType: !903, size: 32, align: 32, offset: 2880)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !965, file: !4, line: 2153, baseType: !903, size: 32, align: 32, offset: 2912)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !965, file: !4, line: 2158, baseType: !903, size: 32, align: 32, offset: 2944)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !965, file: !4, line: 2166, baseType: !801, size: 32, align: 32, offset: 2976)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !965, file: !4, line: 2173, baseType: !819, size: 32, align: 32, offset: 3008)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !965, file: !4, line: 2180, baseType: !843, size: 32, align: 32, offset: 3040)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !965, file: !4, line: 2187, baseType: !795, size: 32, align: 32, offset: 3072)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !965, file: !4, line: 2194, baseType: !862, size: 32, align: 32, offset: 3104)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !965, file: !4, line: 2203, baseType: !903, size: 32, align: 32, offset: 3136)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !965, file: !4, line: 2209, baseType: !3, size: 32, align: 32, offset: 3168)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !965, file: !4, line: 2212, baseType: !903, size: 32, align: 32, offset: 3200)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !965, file: !4, line: 2213, baseType: !903, size: 32, align: 32, offset: 3232)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !965, file: !4, line: 2220, baseType: !708, size: 32, align: 32, offset: 3264)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !965, file: !4, line: 2232, baseType: !903, size: 32, align: 32, offset: 3296)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !965, file: !4, line: 2243, baseType: !903, size: 32, align: 32, offset: 3328)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !965, file: !4, line: 2249, baseType: !903, size: 32, align: 32, offset: 3360)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !965, file: !4, line: 2256, baseType: !903, size: 32, align: 32, offset: 3392)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !965, file: !4, line: 2263, baseType: !1044, size: 64, align: 64, offset: 3456)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !965, file: !4, line: 2270, baseType: !1044, size: 64, align: 64, offset: 3520)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !965, file: !4, line: 2277, baseType: !872, size: 32, align: 32, offset: 3584)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !965, file: !4, line: 2285, baseType: !708, size: 32, align: 32, offset: 3616)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !965, file: !4, line: 2367, baseType: !1380, size: 64, align: 64, offset: 3648)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64, align: 64)
!1381 = !DISubroutineType(types: !1382)
!1382 = !{!903, !1307, !1267, !903}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !965, file: !4, line: 2383, baseType: !903, size: 32, align: 32, offset: 3712)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !965, file: !4, line: 2386, baseType: !1314, size: 32, align: 32, offset: 3744)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !965, file: !4, line: 2387, baseType: !1314, size: 32, align: 32, offset: 3776)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !965, file: !4, line: 2394, baseType: !903, size: 32, align: 32, offset: 3808)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !965, file: !4, line: 2401, baseType: !903, size: 32, align: 32, offset: 3840)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !965, file: !4, line: 2408, baseType: !903, size: 32, align: 32, offset: 3872)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !965, file: !4, line: 2415, baseType: !903, size: 32, align: 32, offset: 3904)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !965, file: !4, line: 2422, baseType: !903, size: 32, align: 32, offset: 3936)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !965, file: !4, line: 2423, baseType: !1392, size: 64, align: 64, offset: 3968)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1395)
!1395 = !{!1396, !1397, !1398, !1399}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1394, file: !4, line: 827, baseType: !903, size: 32, align: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1394, file: !4, line: 828, baseType: !903, size: 32, align: 32, offset: 32)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1394, file: !4, line: 829, baseType: !903, size: 32, align: 32, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1394, file: !4, line: 830, baseType: !1314, size: 32, align: 32, offset: 96)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !965, file: !4, line: 2430, baseType: !920, size: 64, align: 64, offset: 4032)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !965, file: !4, line: 2437, baseType: !920, size: 64, align: 64, offset: 4096)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !965, file: !4, line: 2444, baseType: !1314, size: 32, align: 32, offset: 4160)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !965, file: !4, line: 2451, baseType: !1314, size: 32, align: 32, offset: 4192)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !965, file: !4, line: 2458, baseType: !903, size: 32, align: 32, offset: 4224)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !965, file: !4, line: 2469, baseType: !903, size: 32, align: 32, offset: 4256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !965, file: !4, line: 2475, baseType: !903, size: 32, align: 32, offset: 4288)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !965, file: !4, line: 2481, baseType: !903, size: 32, align: 32, offset: 4320)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !965, file: !4, line: 2485, baseType: !903, size: 32, align: 32, offset: 4352)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !965, file: !4, line: 2489, baseType: !903, size: 32, align: 32, offset: 4384)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !965, file: !4, line: 2493, baseType: !903, size: 32, align: 32, offset: 4416)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !965, file: !4, line: 2501, baseType: !903, size: 32, align: 32, offset: 4448)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !965, file: !4, line: 2506, baseType: !903, size: 32, align: 32, offset: 4480)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !965, file: !4, line: 2510, baseType: !903, size: 32, align: 32, offset: 4512)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !965, file: !4, line: 2514, baseType: !920, size: 64, align: 64, offset: 4544)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !965, file: !4, line: 2528, baseType: !1416, size: 64, align: 64, offset: 4608)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DISubroutineType(types: !1418)
!1418 = !{null, !1307, !916, !903, !903}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !965, file: !4, line: 2534, baseType: !903, size: 32, align: 32, offset: 4672)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !965, file: !4, line: 2545, baseType: !903, size: 32, align: 32, offset: 4704)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !965, file: !4, line: 2547, baseType: !903, size: 32, align: 32, offset: 4736)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !965, file: !4, line: 2549, baseType: !903, size: 32, align: 32, offset: 4768)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !965, file: !4, line: 2551, baseType: !903, size: 32, align: 32, offset: 4800)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !965, file: !4, line: 2553, baseType: !903, size: 32, align: 32, offset: 4832)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !965, file: !4, line: 2555, baseType: !903, size: 32, align: 32, offset: 4864)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !965, file: !4, line: 2557, baseType: !903, size: 32, align: 32, offset: 4896)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !965, file: !4, line: 2559, baseType: !903, size: 32, align: 32, offset: 4928)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !965, file: !4, line: 2563, baseType: !903, size: 32, align: 32, offset: 4960)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !965, file: !4, line: 2571, baseType: !1125, size: 64, align: 64, offset: 4992)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !965, file: !4, line: 2579, baseType: !1125, size: 64, align: 64, offset: 5056)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !965, file: !4, line: 2586, baseType: !903, size: 32, align: 32, offset: 5120)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !965, file: !4, line: 2615, baseType: !903, size: 32, align: 32, offset: 5152)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !965, file: !4, line: 2627, baseType: !903, size: 32, align: 32, offset: 5184)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !965, file: !4, line: 2637, baseType: !903, size: 32, align: 32, offset: 5216)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !965, file: !4, line: 2681, baseType: !903, size: 32, align: 32, offset: 5248)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !965, file: !4, line: 2709, baseType: !920, size: 64, align: 64, offset: 5312)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !965, file: !4, line: 2716, baseType: !1438, size: 64, align: 64, offset: 5376)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64, align: 64)
!1439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1440)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446, !1447, !1448, !1454, !1458, !1459, !1460, !1461, !1467, !1468, !1469, !1470, !1471}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1440, file: !4, line: 3642, baseType: !974, size: 64, align: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1440, file: !4, line: 3649, baseType: !39, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1440, file: !4, line: 3656, baseType: !49, size: 32, align: 32, offset: 96)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1440, file: !4, line: 3663, baseType: !508, size: 32, align: 32, offset: 128)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1440, file: !4, line: 3669, baseType: !903, size: 32, align: 32, offset: 160)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1440, file: !4, line: 3682, baseType: !1264, size: 64, align: 64, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1440, file: !4, line: 3698, baseType: !1449, size: 64, align: 64, offset: 256)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!903, !963, !1452, !1095}
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64, align: 64)
!1453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1440, file: !4, line: 3712, baseType: !1455, size: 64, align: 64, offset: 320)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{!903, !963, !903, !1452, !1095}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1440, file: !4, line: 3726, baseType: !1449, size: 64, align: 64, offset: 384)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1440, file: !4, line: 3737, baseType: !1063, size: 64, align: 64, offset: 448)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1440, file: !4, line: 3746, baseType: !903, size: 32, align: 32, offset: 512)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1440, file: !4, line: 3757, baseType: !1462, size: 64, align: 64, offset: 576)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64, align: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !1465}
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1440, file: !4, line: 3766, baseType: !1063, size: 64, align: 64, offset: 640)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1440, file: !4, line: 3774, baseType: !1063, size: 64, align: 64, offset: 704)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1440, file: !4, line: 3780, baseType: !903, size: 32, align: 32, offset: 768)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1440, file: !4, line: 3785, baseType: !903, size: 32, align: 32, offset: 800)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1440, file: !4, line: 3795, baseType: !1472, size: 64, align: 64, offset: 832)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64, align: 64)
!1473 = !DISubroutineType(types: !1474)
!1474 = !{!903, !963, !1138}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !965, file: !4, line: 2728, baseType: !916, size: 64, align: 64, offset: 5440)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !965, file: !4, line: 2735, baseType: !1191, size: 512, align: 64, offset: 5504)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !965, file: !4, line: 2742, baseType: !903, size: 32, align: 32, offset: 6016)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !965, file: !4, line: 2755, baseType: !903, size: 32, align: 32, offset: 6048)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !965, file: !4, line: 2776, baseType: !903, size: 32, align: 32, offset: 6080)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !965, file: !4, line: 2783, baseType: !903, size: 32, align: 32, offset: 6112)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !965, file: !4, line: 2791, baseType: !903, size: 32, align: 32, offset: 6144)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !965, file: !4, line: 2802, baseType: !1267, size: 64, align: 64, offset: 6208)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !965, file: !4, line: 2811, baseType: !903, size: 32, align: 32, offset: 6272)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !965, file: !4, line: 2821, baseType: !903, size: 32, align: 32, offset: 6304)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !965, file: !4, line: 2830, baseType: !903, size: 32, align: 32, offset: 6336)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !965, file: !4, line: 2840, baseType: !903, size: 32, align: 32, offset: 6368)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !965, file: !4, line: 2851, baseType: !1488, size: 64, align: 64, offset: 6400)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!903, !1307, !1491, !916, !1249, !903, !903}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!903, !1307, !916}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !965, file: !4, line: 2871, baseType: !1495, size: 64, align: 64, offset: 6464)
!1495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64, align: 64)
!1496 = !DISubroutineType(types: !1497)
!1497 = !{!903, !1307, !1498, !916, !1249, !903}
!1498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1499, size: 64, align: 64)
!1499 = !DISubroutineType(types: !1500)
!1500 = !{!903, !1307, !916, !903, !903}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !965, file: !4, line: 2878, baseType: !903, size: 32, align: 32, offset: 6528)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !965, file: !4, line: 2885, baseType: !903, size: 32, align: 32, offset: 6560)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !965, file: !4, line: 3005, baseType: !903, size: 32, align: 32, offset: 6592)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !965, file: !4, line: 3013, baseType: !884, size: 32, align: 32, offset: 6624)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !965, file: !4, line: 3020, baseType: !884, size: 32, align: 32, offset: 6656)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !965, file: !4, line: 3027, baseType: !884, size: 32, align: 32, offset: 6688)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !965, file: !4, line: 3037, baseType: !1086, size: 64, align: 64, offset: 6720)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !965, file: !4, line: 3038, baseType: !903, size: 32, align: 32, offset: 6784)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !965, file: !4, line: 3050, baseType: !1044, size: 64, align: 64, offset: 6848)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !965, file: !4, line: 3065, baseType: !903, size: 32, align: 32, offset: 6912)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !965, file: !4, line: 3083, baseType: !903, size: 32, align: 32, offset: 6944)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !965, file: !4, line: 3092, baseType: !1026, size: 64, align: 32, offset: 6976)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !965, file: !4, line: 3099, baseType: !508, size: 32, align: 32, offset: 7040)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !965, file: !4, line: 3106, baseType: !1026, size: 64, align: 32, offset: 7072)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !965, file: !4, line: 3113, baseType: !1516, size: 64, align: 64, offset: 7168)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64, align: 64)
!1517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1518)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1519)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1520)
!1520 = !{!1521, !1522, !1523, !1524, !1525, !1526, !1529}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1519, file: !4, line: 713, baseType: !49, size: 32, align: 32)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1519, file: !4, line: 714, baseType: !39, size: 32, align: 32, offset: 32)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1519, file: !4, line: 720, baseType: !974, size: 64, align: 64, offset: 64)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1519, file: !4, line: 724, baseType: !974, size: 64, align: 64, offset: 128)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1519, file: !4, line: 728, baseType: !903, size: 32, align: 32, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1519, file: !4, line: 734, baseType: !1527, size: 64, align: 64, offset: 256)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64, align: 64)
!1528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1519, file: !4, line: 739, baseType: !1530, size: 64, align: 64, offset: 320)
!1530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1531, size: 64, align: 64)
!1531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !965, file: !4, line: 3129, baseType: !920, size: 64, align: 64, offset: 7232)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !965, file: !4, line: 3130, baseType: !920, size: 64, align: 64, offset: 7296)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !965, file: !4, line: 3131, baseType: !920, size: 64, align: 64, offset: 7360)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !965, file: !4, line: 3132, baseType: !920, size: 64, align: 64, offset: 7424)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !965, file: !4, line: 3139, baseType: !1125, size: 64, align: 64, offset: 7488)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !965, file: !4, line: 3147, baseType: !903, size: 32, align: 32, offset: 7552)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !965, file: !4, line: 3165, baseType: !903, size: 32, align: 32, offset: 7584)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !965, file: !4, line: 3172, baseType: !903, size: 32, align: 32, offset: 7616)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !965, file: !4, line: 3180, baseType: !903, size: 32, align: 32, offset: 7648)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !965, file: !4, line: 3191, baseType: !1344, size: 64, align: 64, offset: 7680)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !965, file: !4, line: 3199, baseType: !1086, size: 64, align: 64, offset: 7744)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !965, file: !4, line: 3207, baseType: !1125, size: 64, align: 64, offset: 7808)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !965, file: !4, line: 3214, baseType: !894, size: 32, align: 32, offset: 7872)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !965, file: !4, line: 3224, baseType: !1156, size: 64, align: 64, offset: 7936)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !965, file: !4, line: 3225, baseType: !903, size: 32, align: 32, offset: 8000)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !965, file: !4, line: 3249, baseType: !1138, size: 64, align: 64, offset: 8064)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !965, file: !4, line: 3256, baseType: !903, size: 32, align: 32, offset: 8128)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !965, file: !4, line: 3271, baseType: !903, size: 32, align: 32, offset: 8160)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !965, file: !4, line: 3279, baseType: !920, size: 64, align: 64, offset: 8192)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !965, file: !4, line: 3301, baseType: !1138, size: 64, align: 64, offset: 8256)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !965, file: !4, line: 3310, baseType: !903, size: 32, align: 32, offset: 8320)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !965, file: !4, line: 3337, baseType: !903, size: 32, align: 32, offset: 8352)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !965, file: !4, line: 3351, baseType: !903, size: 32, align: 32, offset: 8384)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !965, file: !4, line: 3359, baseType: !903, size: 32, align: 32, offset: 8416)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "parser_close", scope: !899, file: !4, line: 5269, baseType: !1558, size: 64, align: 64, offset: 320)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64, align: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{null, !911}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "split", scope: !899, file: !4, line: 5270, baseType: !1562, size: 64, align: 64, offset: 384)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DISubroutineType(types: !1564)
!1564 = !{!903, !963, !1452, !903}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !899, file: !4, line: 5271, baseType: !918, size: 64, align: 64, offset: 448)
!1566 = !{i32 2, !"Dwarf Version", i32 4}
!1567 = !{i32 2, !"Debug Info Version", i32 3}
!1568 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1569 = distinct !DISubprogram(name: "dpx_parse", scope: !897, file: !897, line: 40, type: !961, isLocal: true, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1570)
!1570 = !{}
!1571 = !DILocalVariable(name: "x", arg: 1, scope: !1572, file: !1573, line: 66, type: !1095)
!1572 = distinct !DISubprogram(name: "av_bswap32", scope: !1573, file: !1573, line: 66, type: !1574, isLocal: true, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1570)
!1573 = !DIFile(filename: "./libavutil/bswap.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1574 = !DISubroutineType(types: !1575)
!1575 = !{!1095, !1095}
!1576 = !DIExpression()
!1577 = !DILocation(line: 66, column: 98, scope: !1572, inlinedAt: !1578)
!1578 = distinct !DILocation(line: 80, column: 49, scope: !1579)
!1579 = !DILexicalBlockFile(scope: !1580, file: !897, discriminator: 2)
!1580 = distinct !DILexicalBlock(scope: !1581, file: !897, line: 79, column: 29)
!1581 = distinct !DILexicalBlock(scope: !1582, file: !897, line: 79, column: 13)
!1582 = distinct !DILexicalBlock(scope: !1583, file: !897, line: 76, column: 58)
!1583 = distinct !DILexicalBlock(scope: !1584, file: !897, line: 76, column: 5)
!1584 = distinct !DILexicalBlock(scope: !1569, file: !897, line: 76, column: 5)
!1585 = !DILocalVariable(name: "s", arg: 1, scope: !1569, file: !897, line: 40, type: !911)
!1586 = !DILocation(line: 40, column: 44, scope: !1569)
!1587 = !DILocalVariable(name: "avctx", arg: 2, scope: !1569, file: !897, line: 40, type: !963)
!1588 = !DILocation(line: 40, column: 63, scope: !1569)
!1589 = !DILocalVariable(name: "poutbuf", arg: 3, scope: !1569, file: !897, line: 41, type: !1556)
!1590 = !DILocation(line: 41, column: 38, scope: !1569)
!1591 = !DILocalVariable(name: "poutbuf_size", arg: 4, scope: !1569, file: !897, line: 41, type: !1249)
!1592 = !DILocation(line: 41, column: 52, scope: !1569)
!1593 = !DILocalVariable(name: "buf", arg: 5, scope: !1569, file: !897, line: 42, type: !1452)
!1594 = !DILocation(line: 42, column: 37, scope: !1569)
!1595 = !DILocalVariable(name: "buf_size", arg: 6, scope: !1569, file: !897, line: 42, type: !903)
!1596 = !DILocation(line: 42, column: 46, scope: !1569)
!1597 = !DILocalVariable(name: "d", scope: !1569, file: !897, line: 44, type: !1598)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "DPXParseContext", file: !897, line: 38, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DPXParseContext", file: !897, line: 32, size: 512, align: 64, elements: !1601)
!1601 = !{!1602, !1616, !1617, !1618, !1619}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "pc", scope: !1600, file: !897, line: 33, baseType: !1603, size: 384, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "ParseContext", file: !1604, line: 38, baseType: !1605)
!1604 = !DIFile(filename: "libavcodec/parser.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParseContext", file: !1604, line: 28, size: 384, align: 64, elements: !1606)
!1606 = !{!1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615}
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1605, file: !1604, line: 29, baseType: !1086, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1605, file: !1604, line: 30, baseType: !903, size: 32, align: 32, offset: 64)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "last_index", scope: !1605, file: !1604, line: 31, baseType: !903, size: 32, align: 32, offset: 96)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1605, file: !1604, line: 32, baseType: !894, size: 32, align: 32, offset: 128)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1605, file: !1604, line: 33, baseType: !1095, size: 32, align: 32, offset: 160)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "frame_start_found", scope: !1605, file: !1604, line: 34, baseType: !903, size: 32, align: 32, offset: 192)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "overread", scope: !1605, file: !1604, line: 35, baseType: !903, size: 32, align: 32, offset: 224)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "overread_index", scope: !1605, file: !1604, line: 36, baseType: !903, size: 32, align: 32, offset: 256)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "state64", scope: !1605, file: !1604, line: 37, baseType: !1044, size: 64, align: 64, offset: 320)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1600, file: !897, line: 34, baseType: !1095, size: 32, align: 32, offset: 384)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "fsize", scope: !1600, file: !897, line: 35, baseType: !1095, size: 32, align: 32, offset: 416)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "remaining_size", scope: !1600, file: !897, line: 36, baseType: !1095, size: 32, align: 32, offset: 448)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "is_be", scope: !1600, file: !897, line: 37, baseType: !903, size: 32, align: 32, offset: 480)
!1620 = !DILocation(line: 44, column: 22, scope: !1569)
!1621 = !DILocation(line: 44, column: 26, scope: !1569)
!1622 = !DILocation(line: 44, column: 29, scope: !1569)
!1623 = !DILocalVariable(name: "state", scope: !1569, file: !897, line: 45, type: !1095)
!1624 = !DILocation(line: 45, column: 14, scope: !1569)
!1625 = !DILocation(line: 45, column: 22, scope: !1569)
!1626 = !DILocation(line: 45, column: 25, scope: !1569)
!1627 = !DILocation(line: 45, column: 28, scope: !1569)
!1628 = !DILocalVariable(name: "next", scope: !1569, file: !897, line: 46, type: !903)
!1629 = !DILocation(line: 46, column: 9, scope: !1569)
!1630 = !DILocalVariable(name: "i", scope: !1569, file: !897, line: 47, type: !903)
!1631 = !DILocation(line: 47, column: 9, scope: !1569)
!1632 = !DILocation(line: 49, column: 5, scope: !1569)
!1633 = !DILocation(line: 49, column: 8, scope: !1569)
!1634 = !DILocation(line: 49, column: 18, scope: !1569)
!1635 = !DILocation(line: 51, column: 6, scope: !1569)
!1636 = !DILocation(line: 51, column: 19, scope: !1569)
!1637 = !DILocation(line: 52, column: 9, scope: !1638)
!1638 = distinct !DILexicalBlock(scope: !1569, file: !897, line: 52, column: 9)
!1639 = !DILocation(line: 52, column: 18, scope: !1638)
!1640 = !DILocation(line: 52, column: 9, scope: !1569)
!1641 = !DILocation(line: 53, column: 14, scope: !1638)
!1642 = !DILocation(line: 53, column: 9, scope: !1638)
!1643 = !DILocation(line: 55, column: 10, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1569, file: !897, line: 55, column: 9)
!1645 = !DILocation(line: 55, column: 13, scope: !1644)
!1646 = !DILocation(line: 55, column: 16, scope: !1644)
!1647 = !DILocation(line: 55, column: 9, scope: !1569)
!1648 = !DILocation(line: 56, column: 9, scope: !1649)
!1649 = distinct !DILexicalBlock(scope: !1644, file: !897, line: 55, column: 35)
!1650 = !DILocation(line: 56, column: 16, scope: !1651)
!1651 = !DILexicalBlockFile(scope: !1652, file: !897, discriminator: 1)
!1652 = distinct !DILexicalBlock(scope: !1653, file: !897, line: 56, column: 9)
!1653 = distinct !DILexicalBlock(scope: !1649, file: !897, line: 56, column: 9)
!1654 = !DILocation(line: 56, column: 20, scope: !1651)
!1655 = !DILocation(line: 56, column: 18, scope: !1651)
!1656 = !DILocation(line: 56, column: 9, scope: !1651)
!1657 = !DILocation(line: 57, column: 22, scope: !1658)
!1658 = distinct !DILexicalBlock(scope: !1652, file: !897, line: 56, column: 35)
!1659 = !DILocation(line: 57, column: 28, scope: !1658)
!1660 = !DILocation(line: 57, column: 40, scope: !1658)
!1661 = !DILocation(line: 57, column: 36, scope: !1658)
!1662 = !DILocation(line: 57, column: 34, scope: !1658)
!1663 = !DILocation(line: 57, column: 19, scope: !1658)
!1664 = !DILocation(line: 58, column: 17, scope: !1665)
!1665 = distinct !DILexicalBlock(scope: !1658, file: !897, line: 58, column: 17)
!1666 = !DILocation(line: 58, column: 23, scope: !1665)
!1667 = !DILocation(line: 58, column: 91, scope: !1665)
!1668 = !DILocation(line: 59, column: 17, scope: !1665)
!1669 = !DILocation(line: 59, column: 23, scope: !1665)
!1670 = !DILocation(line: 58, column: 17, scope: !1671)
!1671 = !DILexicalBlockFile(scope: !1658, file: !897, discriminator: 1)
!1672 = !DILocation(line: 60, column: 17, scope: !1673)
!1673 = distinct !DILexicalBlock(scope: !1665, file: !897, line: 59, column: 92)
!1674 = !DILocation(line: 60, column: 20, scope: !1673)
!1675 = !DILocation(line: 60, column: 23, scope: !1673)
!1676 = !DILocation(line: 60, column: 41, scope: !1673)
!1677 = !DILocation(line: 61, column: 28, scope: !1673)
!1678 = !DILocation(line: 61, column: 34, scope: !1673)
!1679 = !DILocation(line: 61, column: 17, scope: !1673)
!1680 = !DILocation(line: 61, column: 20, scope: !1673)
!1681 = !DILocation(line: 61, column: 26, scope: !1673)
!1682 = !DILocation(line: 62, column: 17, scope: !1673)
