; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sipr16k.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--sipr16k.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.SiprContext = type { %struct.AVCodecContext*, i32, float, [16 x float], [452 x float], [256 x float], [10 x float], float, [4 x float], [2 x float], [153 x float], float, float, [153 x float], [250 x float], i32, [17 x float], [2 x [17 x float]], [2 x float*], [16 x float], [16 x float], [16 x double], {}*, [8 x i8] }

!914 = distinct !DIGlobalVariable(name: "lsf_cb3_16k", scope: !0, file: !897, line: 263, type: !906, isLocal: true, isDefinition: true, variable: [128 x [3 x float]]* @lsf_cb3_16k)
!915 = distinct !DIGlobalVariable(name: "lsf_cb4_16k", scope: !0, file: !897, line: 330, type: !906, isLocal: true, isDefinition: true, variable: [128 x [3 x float]]* @lsf_cb4_16k)
!916 = distinct !DIGlobalVariable(name: "lsf_cb5_16k", scope: !0, file: !897, line: 397, type: !917, isLocal: true, isDefinition: true, variable: [128 x [4 x float]]* @lsf_cb5_16k)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 16384, align: 32, elements: !918)
!918 = !{!908, !919}
!919 = !DISubrange(count: 4)
!920 = distinct !DIGlobalVariable(name: "qu", scope: !0, file: !897, line: 28, type: !921, isLocal: true, isDefinition: true, variable: [2 x float]* @qu)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 64, align: 32, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 2)
!924 = distinct !DIGlobalVariable(name: "mean_lsf_16k", scope: !0, file: !897, line: 47, type: !925, isLocal: true, isDefinition: true, variable: [16 x float]* @mean_lsf_16k)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 512, align: 32, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 16)
!928 = distinct !DIGlobalVariable(name: "gain_pitch_cb_16k", scope: !0, file: !897, line: 41, type: !925, isLocal: true, isDefinition: true, variable: [16 x float]* @gain_pitch_cb_16k)
!929 = distinct !DIGlobalVariable(name: "sinc_win", scope: !0, file: !897, line: 57, type: !930, isLocal: true, isDefinition: true, variable: [40 x float]* @sinc_win)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 1280, align: 32, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 40)
!933 = distinct !DIGlobalVariable(name: "gain_cb_16k", scope: !0, file: !897, line: 30, type: !934, isLocal: true, isDefinition: true, variable: [32 x float]* @gain_cb_16k)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !901, size: 1024, align: 32, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 32)
!937 = distinct !DIGlobalVariable(name: "pred_16k", scope: !0, file: !897, line: 27, type: !921, isLocal: true, isDefinition: true, variable: [2 x float]* @pred_16k)
!938 = !{i32 2, !"Dwarf Version", i32 4}
!939 = !{i32 2, !"Debug Info Version", i32 3}
!940 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!941 = distinct !DISubprogram(name: "ff_sipr_decode_frame_16k", scope: !942, file: !942, line: 176, type: !943, isLocal: false, isDefinition: true, scopeLine: 178, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1617)
!942 = !DIFile(filename: "libavcodec/sipr16k.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DISubroutineType(types: !944)
!944 = !{null, !945, !1602, !1591}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "SiprContext", file: !888, line: 100, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SiprContext", file: !888, line: 65, size: 45696, align: 128, elements: !948)
!948 = !{!949, !1549, !1551, !1552, !1554, !1558, !1561, !1565, !1566, !1568, !1570, !1574, !1575, !1576, !1577, !1581, !1582, !1586, !1589, !1592, !1593, !1594, !1597}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !947, file: !888, line: 66, baseType: !950, size: 64, align: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !35, line: 3360, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !35, line: 1556, size: 8448, align: 64, elements: !953)
!953 = !{!954, !1000, !1001, !1002, !1273, !1274, !1275, !1276, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1302, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1487, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !952, file: !35, line: 1561, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !959)
!959 = !{!960, !964, !969, !973, !975, !976, !977, !981, !987, !989, !993}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !958, file: !4, line: 72, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64, align: 64)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !963)
!963 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !958, file: !4, line: 78, baseType: !965, size: 64, align: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64, align: 64)
!966 = !DISubroutineType(types: !967)
!967 = !{!961, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !958, file: !4, line: 85, baseType: !970, size: 64, align: 64, offset: 128)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64, align: 64)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !958, file: !4, line: 93, baseType: !974, size: 32, align: 32, offset: 192)
!974 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !958, file: !4, line: 99, baseType: !974, size: 32, align: 32, offset: 224)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !958, file: !4, line: 108, baseType: !974, size: 32, align: 32, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !958, file: !4, line: 113, baseType: !978, size: 64, align: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64, align: 64)
!979 = !DISubroutineType(types: !980)
!980 = !{!968, !968, !968}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !958, file: !4, line: 123, baseType: !982, size: 64, align: 64, offset: 384)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64, align: 64)
!983 = !DISubroutineType(types: !984)
!984 = !{!985, !985}
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !958, file: !4, line: 130, baseType: !988, size: 32, align: 32, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !958, file: !4, line: 136, baseType: !990, size: 64, align: 64, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64, align: 64)
!991 = !DISubroutineType(types: !992)
!992 = !{!988, !968}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !958, file: !4, line: 142, baseType: !994, size: 64, align: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!974, !997, !968, !961, !974}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64, align: 64)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !952, file: !35, line: 1562, baseType: !974, size: 32, align: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !952, file: !35, line: 1564, baseType: !24, size: 32, align: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !952, file: !35, line: 1565, baseType: !1003, size: 64, align: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !35, line: 3468, size: 1984, align: 64, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1021, !1024, !1027, !1030, !1036, !1039, !1040, !1048, !1049, !1050, !1052, !1056, !1062, !1067, !1071, !1072, !1123, !1244, !1248, !1249, !1253, !1257, !1262, !1266, !1267, !1268}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1005, file: !35, line: 3475, baseType: !961, size: 64, align: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1005, file: !35, line: 3480, baseType: !961, size: 64, align: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1005, file: !35, line: 3481, baseType: !24, size: 32, align: 32, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1005, file: !35, line: 3482, baseType: !34, size: 32, align: 32, offset: 160)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1005, file: !35, line: 3487, baseType: !974, size: 32, align: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1005, file: !35, line: 3488, baseType: !1013, size: 64, align: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1016, line: 61, baseType: !1017)
!1016 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1016, line: 58, size: 64, align: 32, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1017, file: !1016, line: 59, baseType: !974, size: 32, align: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1017, file: !1016, line: 60, baseType: !974, size: 32, align: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1005, file: !35, line: 3489, baseType: !1022, size: 64, align: 64, offset: 320)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1005, file: !35, line: 3490, baseType: !1025, size: 64, align: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64, align: 64)
!1026 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1005, file: !35, line: 3491, baseType: !1028, size: 64, align: 64, offset: 448)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1005, file: !35, line: 3492, baseType: !1031, size: 64, align: 64, offset: 512)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1034, line: 55, baseType: !1035)
!1034 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1035 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1005, file: !35, line: 3493, baseType: !1037, size: 8, align: 8, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1034, line: 48, baseType: !1038)
!1038 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1005, file: !35, line: 3494, baseType: !955, size: 64, align: 64, offset: 640)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1005, file: !35, line: 3495, baseType: !1041, size: 64, align: 64, offset: 704)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !35, line: 3404, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !35, line: 3401, size: 128, align: 64, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1044, file: !35, line: 3402, baseType: !974, size: 32, align: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1044, file: !35, line: 3403, baseType: !961, size: 64, align: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1005, file: !35, line: 3507, baseType: !961, size: 64, align: 64, offset: 768)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1005, file: !35, line: 3516, baseType: !974, size: 32, align: 32, offset: 832)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1005, file: !35, line: 3517, baseType: !1051, size: 64, align: 64, offset: 896)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64, align: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1005, file: !35, line: 3527, baseType: !1053, size: 64, align: 64, offset: 960)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64, align: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!974, !950}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1005, file: !35, line: 3535, baseType: !1057, size: 64, align: 64, offset: 1024)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{!974, !950, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1005, file: !35, line: 3541, baseType: !1063, size: 64, align: 64, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !35, line: 3461, baseType: !1066)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !35, line: 3461, flags: DIFlagFwdDecl)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1005, file: !35, line: 3549, baseType: !1068, size: 64, align: 64, offset: 1152)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64, align: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{null, !1051}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1005, file: !35, line: 3551, baseType: !1053, size: 64, align: 64, offset: 1216)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1005, file: !35, line: 3552, baseType: !1073, size: 64, align: 64, offset: 1280)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64, align: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!974, !950, !1076, !974, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !35, line: 3920, size: 256, align: 64, elements: !1080)
!1080 = !{!1081, !1084, !1087, !1088, !1089, !1120}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1079, file: !35, line: 3921, baseType: !1082, size: 16, align: 16)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1034, line: 49, baseType: !1083)
!1083 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1079, file: !35, line: 3922, baseType: !1085, size: 32, align: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1034, line: 51, baseType: !1086)
!1086 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1079, file: !35, line: 3923, baseType: !1085, size: 32, align: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1079, file: !35, line: 3924, baseType: !1086, size: 32, align: 32, offset: 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1079, file: !35, line: 3925, baseType: !1090, size: 64, align: 64, offset: 128)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !35, line: 3918, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !35, line: 3885, size: 1600, align: 64, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1110, !1113, !1115, !1116, !1118, !1119}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1093, file: !35, line: 3886, baseType: !974, size: 32, align: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1093, file: !35, line: 3887, baseType: !974, size: 32, align: 32, offset: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1093, file: !35, line: 3888, baseType: !974, size: 32, align: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1093, file: !35, line: 3889, baseType: !974, size: 32, align: 32, offset: 96)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1093, file: !35, line: 3890, baseType: !974, size: 32, align: 32, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1093, file: !35, line: 3897, baseType: !1101, size: 768, align: 64, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !35, line: 3858, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !35, line: 3853, size: 768, align: 64, elements: !1103)
!1103 = !{!1104, !1108}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1102, file: !35, line: 3855, baseType: !1105, size: 512, align: 64)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 512, align: 64, elements: !1106)
!1106 = !{!1107}
!1107 = !DISubrange(count: 8)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1102, file: !35, line: 3857, baseType: !1109, size: 256, align: 32, offset: 512)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 256, align: 32, elements: !1106)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1093, file: !35, line: 3903, baseType: !1111, size: 256, align: 64, offset: 960)
!1111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1076, size: 256, align: 64, elements: !1112)
!1112 = !{!919}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1093, file: !35, line: 3904, baseType: !1114, size: 128, align: 32, offset: 1216)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 128, align: 32, elements: !1112)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1093, file: !35, line: 3906, baseType: !711, size: 32, align: 32, offset: 1344)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1093, file: !35, line: 3908, baseType: !1117, size: 64, align: 64, offset: 1408)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1093, file: !35, line: 3915, baseType: !1117, size: 64, align: 64, offset: 1472)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1093, file: !35, line: 3917, baseType: !974, size: 32, align: 32, offset: 1536)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1079, file: !35, line: 3926, baseType: !1121, size: 64, align: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1034, line: 40, baseType: !1122)
!1122 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1005, file: !35, line: 3564, baseType: !1124, size: 64, align: 64, offset: 1344)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64, align: 64)
!1125 = !DISubroutineType(types: !1126)
!1126 = !{!974, !950, !1127, !1161, !1243}
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64, align: 64)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !35, line: 1499, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !35, line: 1445, size: 704, align: 64, elements: !1130)
!1130 = !{!1131, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1157, !1158, !1159, !1160}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1129, file: !35, line: 1451, baseType: !1132, size: 64, align: 64)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64, align: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1134, line: 94, baseType: !1135)
!1134 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1134, line: 81, size: 192, align: 64, elements: !1136)
!1136 = !{!1137, !1141, !1142}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1135, file: !1134, line: 82, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64, align: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1134, line: 73, baseType: !1140)
!1140 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1134, line: 73, flags: DIFlagFwdDecl)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1135, file: !1134, line: 89, baseType: !1076, size: 64, align: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !1134, line: 93, baseType: !974, size: 32, align: 32, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1129, file: !35, line: 1461, baseType: !1121, size: 64, align: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1129, file: !35, line: 1467, baseType: !1121, size: 64, align: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1129, file: !35, line: 1468, baseType: !1076, size: 64, align: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1129, file: !35, line: 1469, baseType: !974, size: 32, align: 32, offset: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1129, file: !35, line: 1470, baseType: !974, size: 32, align: 32, offset: 288)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1129, file: !35, line: 1474, baseType: !974, size: 32, align: 32, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1129, file: !35, line: 1479, baseType: !1150, size: 64, align: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !35, line: 1415, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !35, line: 1411, size: 128, align: 64, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1152, file: !35, line: 1412, baseType: !1076, size: 64, align: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1152, file: !35, line: 1413, baseType: !974, size: 32, align: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1152, file: !35, line: 1414, baseType: !717, size: 32, align: 32, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1129, file: !35, line: 1480, baseType: !974, size: 32, align: 32, offset: 448)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1129, file: !35, line: 1486, baseType: !1121, size: 64, align: 64, offset: 512)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1129, file: !35, line: 1488, baseType: !1121, size: 64, align: 64, offset: 576)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1129, file: !35, line: 1497, baseType: !1121, size: 64, align: 64, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !758, line: 646, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !758, line: 268, size: 4288, align: 64, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1195, !1197, !1198, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1231, !1232, !1233, !1234, !1235, !1236, !1239, !1240, !1241, !1242}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1164, file: !758, line: 282, baseType: !1105, size: 512, align: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1164, file: !758, line: 299, baseType: !1109, size: 256, align: 32, offset: 512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1164, file: !758, line: 315, baseType: !1169, size: 64, align: 64, offset: 768)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64, align: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1164, file: !758, line: 326, baseType: !974, size: 32, align: 32, offset: 832)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1164, file: !758, line: 326, baseType: !974, size: 32, align: 32, offset: 864)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1164, file: !758, line: 334, baseType: !974, size: 32, align: 32, offset: 896)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1164, file: !758, line: 341, baseType: !974, size: 32, align: 32, offset: 928)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1164, file: !758, line: 346, baseType: !974, size: 32, align: 32, offset: 960)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1164, file: !758, line: 351, baseType: !747, size: 32, align: 32, offset: 992)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1164, file: !758, line: 356, baseType: !1015, size: 64, align: 32, offset: 1024)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1164, file: !758, line: 361, baseType: !1121, size: 64, align: 64, offset: 1088)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1164, file: !758, line: 369, baseType: !1121, size: 64, align: 64, offset: 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1164, file: !758, line: 377, baseType: !1121, size: 64, align: 64, offset: 1216)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1164, file: !758, line: 382, baseType: !974, size: 32, align: 32, offset: 1280)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1164, file: !758, line: 386, baseType: !974, size: 32, align: 32, offset: 1312)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1164, file: !758, line: 391, baseType: !974, size: 32, align: 32, offset: 1344)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1164, file: !758, line: 396, baseType: !968, size: 64, align: 64, offset: 1408)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1164, file: !758, line: 403, baseType: !1185, size: 512, align: 64, offset: 1472)
!1185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 512, align: 64, elements: !1106)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1164, file: !758, line: 410, baseType: !974, size: 32, align: 32, offset: 1984)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1164, file: !758, line: 415, baseType: !974, size: 32, align: 32, offset: 2016)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1164, file: !758, line: 420, baseType: !974, size: 32, align: 32, offset: 2048)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1164, file: !758, line: 425, baseType: !974, size: 32, align: 32, offset: 2080)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1164, file: !758, line: 435, baseType: !1121, size: 64, align: 64, offset: 2112)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1164, file: !758, line: 440, baseType: !974, size: 32, align: 32, offset: 2176)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1164, file: !758, line: 445, baseType: !1033, size: 64, align: 64, offset: 2240)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1164, file: !758, line: 459, baseType: !1194, size: 512, align: 64, offset: 2304)
!1194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1132, size: 512, align: 64, elements: !1106)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1164, file: !758, line: 473, baseType: !1196, size: 64, align: 64, offset: 2816)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1164, file: !758, line: 477, baseType: !974, size: 32, align: 32, offset: 2880)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1164, file: !758, line: 479, baseType: !1199, size: 64, align: 64, offset: 2944)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !758, line: 207, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !758, line: 201, size: 320, align: 64, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1212}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1202, file: !758, line: 202, baseType: !757, size: 32, align: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1202, file: !758, line: 203, baseType: !1076, size: 64, align: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1202, file: !758, line: 204, baseType: !974, size: 32, align: 32, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1202, file: !758, line: 205, baseType: !1208, size: 64, align: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64, align: 64)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1210, line: 86, baseType: !1211)
!1210 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1210, line: 86, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1202, file: !758, line: 206, baseType: !1132, size: 64, align: 64, offset: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1164, file: !758, line: 480, baseType: !974, size: 32, align: 32, offset: 3008)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1164, file: !758, line: 505, baseType: !974, size: 32, align: 32, offset: 3040)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1164, file: !758, line: 512, baseType: !781, size: 32, align: 32, offset: 3072)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1164, file: !758, line: 514, baseType: !787, size: 32, align: 32, offset: 3104)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1164, file: !758, line: 516, baseType: !805, size: 32, align: 32, offset: 3136)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1164, file: !758, line: 523, baseType: !829, size: 32, align: 32, offset: 3168)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1164, file: !758, line: 525, baseType: !848, size: 32, align: 32, offset: 3200)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1164, file: !758, line: 532, baseType: !1121, size: 64, align: 64, offset: 3264)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1164, file: !758, line: 539, baseType: !1121, size: 64, align: 64, offset: 3328)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1164, file: !758, line: 547, baseType: !1121, size: 64, align: 64, offset: 3392)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1164, file: !758, line: 554, baseType: !1208, size: 64, align: 64, offset: 3456)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1164, file: !758, line: 563, baseType: !974, size: 32, align: 32, offset: 3520)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1164, file: !758, line: 572, baseType: !974, size: 32, align: 32, offset: 3552)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1164, file: !758, line: 581, baseType: !974, size: 32, align: 32, offset: 3584)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1164, file: !758, line: 588, baseType: !1228, size: 64, align: 64, offset: 3648)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1034, line: 36, baseType: !1230)
!1230 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1164, file: !758, line: 593, baseType: !974, size: 32, align: 32, offset: 3712)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1164, file: !758, line: 596, baseType: !974, size: 32, align: 32, offset: 3744)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1164, file: !758, line: 599, baseType: !1132, size: 64, align: 64, offset: 3776)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1164, file: !758, line: 605, baseType: !1132, size: 64, align: 64, offset: 3840)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1164, file: !758, line: 616, baseType: !1132, size: 64, align: 64, offset: 3904)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1164, file: !758, line: 626, baseType: !1237, size: 64, align: 64, offset: 3968)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1238, line: 216, baseType: !1035)
!1238 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1164, file: !758, line: 627, baseType: !1237, size: 64, align: 64, offset: 4032)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1164, file: !758, line: 628, baseType: !1237, size: 64, align: 64, offset: 4096)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1164, file: !758, line: 629, baseType: !1237, size: 64, align: 64, offset: 4160)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1164, file: !758, line: 645, baseType: !1132, size: 64, align: 64, offset: 4224)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1005, file: !35, line: 3566, baseType: !1245, size: 64, align: 64, offset: 1408)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64, align: 64)
!1246 = !DISubroutineType(types: !1247)
!1247 = !{!974, !950, !968, !1243, !1127}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1005, file: !35, line: 3567, baseType: !1053, size: 64, align: 64, offset: 1472)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1005, file: !35, line: 3576, baseType: !1250, size: 64, align: 64, offset: 1536)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64, align: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!974, !950, !1161}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1005, file: !35, line: 3577, baseType: !1254, size: 64, align: 64, offset: 1600)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64, align: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!974, !950, !1127}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1005, file: !35, line: 3584, baseType: !1258, size: 64, align: 64, offset: 1664)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64, align: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!974, !950, !1261}
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64, align: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1005, file: !35, line: 3589, baseType: !1263, size: 64, align: 64, offset: 1728)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !950}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1005, file: !35, line: 3594, baseType: !974, size: 32, align: 32, offset: 1792)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1005, file: !35, line: 3600, baseType: !961, size: 64, align: 64, offset: 1856)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1005, file: !35, line: 3609, baseType: !1269, size: 64, align: 64, offset: 1920)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64, align: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1272)
!1272 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !35, line: 3609, flags: DIFlagFwdDecl)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !952, file: !35, line: 1566, baseType: !34, size: 32, align: 32, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !952, file: !35, line: 1581, baseType: !1086, size: 32, align: 32, offset: 224)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !952, file: !35, line: 1583, baseType: !968, size: 64, align: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !952, file: !35, line: 1591, baseType: !1277, size: 64, align: 64, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1278, size: 64, align: 64)
!1278 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !35, line: 1532, flags: DIFlagFwdDecl)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !952, file: !35, line: 1598, baseType: !968, size: 64, align: 64, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !952, file: !35, line: 1606, baseType: !1121, size: 64, align: 64, offset: 448)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !952, file: !35, line: 1614, baseType: !974, size: 32, align: 32, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !952, file: !35, line: 1622, baseType: !974, size: 32, align: 32, offset: 544)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !952, file: !35, line: 1628, baseType: !974, size: 32, align: 32, offset: 576)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !952, file: !35, line: 1636, baseType: !974, size: 32, align: 32, offset: 608)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !952, file: !35, line: 1643, baseType: !974, size: 32, align: 32, offset: 640)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !952, file: !35, line: 1657, baseType: !1076, size: 64, align: 64, offset: 704)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !952, file: !35, line: 1658, baseType: !974, size: 32, align: 32, offset: 768)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !952, file: !35, line: 1679, baseType: !1015, size: 64, align: 32, offset: 800)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !952, file: !35, line: 1688, baseType: !974, size: 32, align: 32, offset: 864)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !952, file: !35, line: 1712, baseType: !974, size: 32, align: 32, offset: 896)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !952, file: !35, line: 1729, baseType: !974, size: 32, align: 32, offset: 928)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !952, file: !35, line: 1729, baseType: !974, size: 32, align: 32, offset: 960)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !952, file: !35, line: 1744, baseType: !974, size: 32, align: 32, offset: 992)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !952, file: !35, line: 1744, baseType: !974, size: 32, align: 32, offset: 1024)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !952, file: !35, line: 1751, baseType: !974, size: 32, align: 32, offset: 1056)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !952, file: !35, line: 1766, baseType: !494, size: 32, align: 32, offset: 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !952, file: !35, line: 1791, baseType: !1298, size: 64, align: 64, offset: 1152)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64, align: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !1301, !1161, !1243, !974, !974, !974}
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !952, file: !35, line: 1808, baseType: !1303, size: 64, align: 64, offset: 1216)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64, align: 64)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!494, !1301, !1022}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !952, file: !35, line: 1816, baseType: !974, size: 32, align: 32, offset: 1280)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !952, file: !35, line: 1825, baseType: !902, size: 32, align: 32, offset: 1312)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !952, file: !35, line: 1830, baseType: !974, size: 32, align: 32, offset: 1344)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !952, file: !35, line: 1838, baseType: !902, size: 32, align: 32, offset: 1376)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !952, file: !35, line: 1846, baseType: !974, size: 32, align: 32, offset: 1408)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !952, file: !35, line: 1851, baseType: !974, size: 32, align: 32, offset: 1440)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !952, file: !35, line: 1861, baseType: !902, size: 32, align: 32, offset: 1472)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !952, file: !35, line: 1868, baseType: !902, size: 32, align: 32, offset: 1504)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !952, file: !35, line: 1875, baseType: !902, size: 32, align: 32, offset: 1536)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !952, file: !35, line: 1882, baseType: !902, size: 32, align: 32, offset: 1568)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !952, file: !35, line: 1889, baseType: !902, size: 32, align: 32, offset: 1600)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !952, file: !35, line: 1896, baseType: !902, size: 32, align: 32, offset: 1632)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !952, file: !35, line: 1903, baseType: !902, size: 32, align: 32, offset: 1664)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !952, file: !35, line: 1910, baseType: !974, size: 32, align: 32, offset: 1696)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !952, file: !35, line: 1915, baseType: !974, size: 32, align: 32, offset: 1728)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !952, file: !35, line: 1926, baseType: !1243, size: 64, align: 64, offset: 1792)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !952, file: !35, line: 1935, baseType: !1015, size: 64, align: 32, offset: 1856)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !952, file: !35, line: 1942, baseType: !974, size: 32, align: 32, offset: 1920)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !952, file: !35, line: 1948, baseType: !974, size: 32, align: 32, offset: 1952)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !952, file: !35, line: 1954, baseType: !974, size: 32, align: 32, offset: 1984)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !952, file: !35, line: 1960, baseType: !974, size: 32, align: 32, offset: 2016)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !952, file: !35, line: 1984, baseType: !974, size: 32, align: 32, offset: 2048)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !952, file: !35, line: 1991, baseType: !974, size: 32, align: 32, offset: 2080)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !952, file: !35, line: 1996, baseType: !974, size: 32, align: 32, offset: 2112)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !952, file: !35, line: 2004, baseType: !974, size: 32, align: 32, offset: 2144)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !952, file: !35, line: 2011, baseType: !974, size: 32, align: 32, offset: 2176)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !952, file: !35, line: 2018, baseType: !974, size: 32, align: 32, offset: 2208)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !952, file: !35, line: 2027, baseType: !974, size: 32, align: 32, offset: 2240)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !952, file: !35, line: 2034, baseType: !974, size: 32, align: 32, offset: 2272)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !952, file: !35, line: 2044, baseType: !974, size: 32, align: 32, offset: 2304)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !952, file: !35, line: 2054, baseType: !1337, size: 64, align: 64, offset: 2368)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64, align: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !952, file: !35, line: 2061, baseType: !1337, size: 64, align: 64, offset: 2432)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !952, file: !35, line: 2066, baseType: !974, size: 32, align: 32, offset: 2496)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !952, file: !35, line: 2070, baseType: !974, size: 32, align: 32, offset: 2528)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !952, file: !35, line: 2078, baseType: !974, size: 32, align: 32, offset: 2560)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !952, file: !35, line: 2085, baseType: !974, size: 32, align: 32, offset: 2592)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !952, file: !35, line: 2092, baseType: !974, size: 32, align: 32, offset: 2624)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !952, file: !35, line: 2099, baseType: !974, size: 32, align: 32, offset: 2656)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !952, file: !35, line: 2106, baseType: !974, size: 32, align: 32, offset: 2688)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !952, file: !35, line: 2113, baseType: !974, size: 32, align: 32, offset: 2720)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !952, file: !35, line: 2120, baseType: !974, size: 32, align: 32, offset: 2752)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !952, file: !35, line: 2125, baseType: !974, size: 32, align: 32, offset: 2784)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !952, file: !35, line: 2133, baseType: !974, size: 32, align: 32, offset: 2816)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !952, file: !35, line: 2140, baseType: !974, size: 32, align: 32, offset: 2848)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !952, file: !35, line: 2145, baseType: !974, size: 32, align: 32, offset: 2880)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !952, file: !35, line: 2153, baseType: !974, size: 32, align: 32, offset: 2912)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !952, file: !35, line: 2158, baseType: !974, size: 32, align: 32, offset: 2944)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !952, file: !35, line: 2166, baseType: !787, size: 32, align: 32, offset: 2976)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !952, file: !35, line: 2173, baseType: !805, size: 32, align: 32, offset: 3008)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !952, file: !35, line: 2180, baseType: !829, size: 32, align: 32, offset: 3040)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !952, file: !35, line: 2187, baseType: !781, size: 32, align: 32, offset: 3072)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !952, file: !35, line: 2194, baseType: !848, size: 32, align: 32, offset: 3104)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !952, file: !35, line: 2203, baseType: !974, size: 32, align: 32, offset: 3136)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !952, file: !35, line: 2209, baseType: !858, size: 32, align: 32, offset: 3168)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !952, file: !35, line: 2212, baseType: !974, size: 32, align: 32, offset: 3200)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !952, file: !35, line: 2213, baseType: !974, size: 32, align: 32, offset: 3232)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !952, file: !35, line: 2220, baseType: !694, size: 32, align: 32, offset: 3264)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !952, file: !35, line: 2232, baseType: !974, size: 32, align: 32, offset: 3296)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !952, file: !35, line: 2243, baseType: !974, size: 32, align: 32, offset: 3328)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !952, file: !35, line: 2249, baseType: !974, size: 32, align: 32, offset: 3360)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !952, file: !35, line: 2256, baseType: !974, size: 32, align: 32, offset: 3392)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !952, file: !35, line: 2263, baseType: !1033, size: 64, align: 64, offset: 3456)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !952, file: !35, line: 2270, baseType: !1033, size: 64, align: 64, offset: 3520)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !952, file: !35, line: 2277, baseType: !866, size: 32, align: 32, offset: 3584)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !952, file: !35, line: 2285, baseType: !694, size: 32, align: 32, offset: 3616)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !952, file: !35, line: 2367, baseType: !1373, size: 64, align: 64, offset: 3648)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!974, !1301, !1261, !974}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !952, file: !35, line: 2383, baseType: !974, size: 32, align: 32, offset: 3712)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !952, file: !35, line: 2386, baseType: !902, size: 32, align: 32, offset: 3744)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !952, file: !35, line: 2387, baseType: !902, size: 32, align: 32, offset: 3776)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !952, file: !35, line: 2394, baseType: !974, size: 32, align: 32, offset: 3808)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !952, file: !35, line: 2401, baseType: !974, size: 32, align: 32, offset: 3840)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !952, file: !35, line: 2408, baseType: !974, size: 32, align: 32, offset: 3872)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !952, file: !35, line: 2415, baseType: !974, size: 32, align: 32, offset: 3904)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !952, file: !35, line: 2422, baseType: !974, size: 32, align: 32, offset: 3936)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !952, file: !35, line: 2423, baseType: !1385, size: 64, align: 64, offset: 3968)
!1385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1386, size: 64, align: 64)
!1386 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !35, line: 831, baseType: !1387)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !35, line: 826, size: 128, align: 32, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1387, file: !35, line: 827, baseType: !974, size: 32, align: 32)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1387, file: !35, line: 828, baseType: !974, size: 32, align: 32, offset: 32)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1387, file: !35, line: 829, baseType: !974, size: 32, align: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1387, file: !35, line: 830, baseType: !902, size: 32, align: 32, offset: 96)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !952, file: !35, line: 2430, baseType: !1121, size: 64, align: 64, offset: 4032)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !952, file: !35, line: 2437, baseType: !1121, size: 64, align: 64, offset: 4096)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !952, file: !35, line: 2444, baseType: !902, size: 32, align: 32, offset: 4160)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !952, file: !35, line: 2451, baseType: !902, size: 32, align: 32, offset: 4192)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !952, file: !35, line: 2458, baseType: !974, size: 32, align: 32, offset: 4224)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !952, file: !35, line: 2469, baseType: !974, size: 32, align: 32, offset: 4256)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !952, file: !35, line: 2475, baseType: !974, size: 32, align: 32, offset: 4288)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !952, file: !35, line: 2481, baseType: !974, size: 32, align: 32, offset: 4320)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !952, file: !35, line: 2485, baseType: !974, size: 32, align: 32, offset: 4352)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !952, file: !35, line: 2489, baseType: !974, size: 32, align: 32, offset: 4384)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !952, file: !35, line: 2493, baseType: !974, size: 32, align: 32, offset: 4416)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !952, file: !35, line: 2501, baseType: !974, size: 32, align: 32, offset: 4448)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !952, file: !35, line: 2506, baseType: !974, size: 32, align: 32, offset: 4480)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !952, file: !35, line: 2510, baseType: !974, size: 32, align: 32, offset: 4512)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !952, file: !35, line: 2514, baseType: !1121, size: 64, align: 64, offset: 4544)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !952, file: !35, line: 2528, baseType: !1409, size: 64, align: 64, offset: 4608)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{null, !1301, !968, !974, !974}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !952, file: !35, line: 2534, baseType: !974, size: 32, align: 32, offset: 4672)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !952, file: !35, line: 2545, baseType: !974, size: 32, align: 32, offset: 4704)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !952, file: !35, line: 2547, baseType: !974, size: 32, align: 32, offset: 4736)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !952, file: !35, line: 2549, baseType: !974, size: 32, align: 32, offset: 4768)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !952, file: !35, line: 2551, baseType: !974, size: 32, align: 32, offset: 4800)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !952, file: !35, line: 2553, baseType: !974, size: 32, align: 32, offset: 4832)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !952, file: !35, line: 2555, baseType: !974, size: 32, align: 32, offset: 4864)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !952, file: !35, line: 2557, baseType: !974, size: 32, align: 32, offset: 4896)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !952, file: !35, line: 2559, baseType: !974, size: 32, align: 32, offset: 4928)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !952, file: !35, line: 2563, baseType: !974, size: 32, align: 32, offset: 4960)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !952, file: !35, line: 2571, baseType: !1117, size: 64, align: 64, offset: 4992)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !952, file: !35, line: 2579, baseType: !1117, size: 64, align: 64, offset: 5056)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !952, file: !35, line: 2586, baseType: !974, size: 32, align: 32, offset: 5120)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !952, file: !35, line: 2615, baseType: !974, size: 32, align: 32, offset: 5152)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !952, file: !35, line: 2627, baseType: !974, size: 32, align: 32, offset: 5184)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !952, file: !35, line: 2637, baseType: !974, size: 32, align: 32, offset: 5216)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !952, file: !35, line: 2681, baseType: !974, size: 32, align: 32, offset: 5248)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !952, file: !35, line: 2709, baseType: !1121, size: 64, align: 64, offset: 5312)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !952, file: !35, line: 2716, baseType: !1431, size: 64, align: 64, offset: 5376)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1433)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !35, line: 3636, size: 896, align: 64, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1438, !1439, !1440, !1441, !1447, !1451, !1452, !1453, !1454, !1460, !1461, !1462, !1463, !1464}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1433, file: !35, line: 3642, baseType: !961, size: 64, align: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1433, file: !35, line: 3649, baseType: !24, size: 32, align: 32, offset: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1433, file: !35, line: 3656, baseType: !34, size: 32, align: 32, offset: 96)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1433, file: !35, line: 3663, baseType: !494, size: 32, align: 32, offset: 128)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1433, file: !35, line: 3669, baseType: !974, size: 32, align: 32, offset: 160)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1433, file: !35, line: 3682, baseType: !1258, size: 64, align: 64, offset: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1433, file: !35, line: 3698, baseType: !1442, size: 64, align: 64, offset: 256)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64, align: 64)
!1443 = !DISubroutineType(types: !1444)
!1444 = !{!974, !950, !1445, !1085}
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64, align: 64)
!1446 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1433, file: !35, line: 3712, baseType: !1448, size: 64, align: 64, offset: 320)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64, align: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!974, !950, !974, !1445, !1085}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1433, file: !35, line: 3726, baseType: !1442, size: 64, align: 64, offset: 384)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1433, file: !35, line: 3737, baseType: !1053, size: 64, align: 64, offset: 448)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1433, file: !35, line: 3746, baseType: !974, size: 32, align: 32, offset: 512)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1433, file: !35, line: 3757, baseType: !1455, size: 64, align: 64, offset: 576)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DISubroutineType(types: !1457)
!1457 = !{null, !1458}
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64, align: 64)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !35, line: 3617, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1433, file: !35, line: 3766, baseType: !1053, size: 64, align: 64, offset: 640)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1433, file: !35, line: 3774, baseType: !1053, size: 64, align: 64, offset: 704)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1433, file: !35, line: 3780, baseType: !974, size: 32, align: 32, offset: 768)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1433, file: !35, line: 3785, baseType: !974, size: 32, align: 32, offset: 800)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1433, file: !35, line: 3795, baseType: !1465, size: 64, align: 64, offset: 832)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!974, !950, !1132}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !952, file: !35, line: 2728, baseType: !968, size: 64, align: 64, offset: 5440)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !952, file: !35, line: 2735, baseType: !1185, size: 512, align: 64, offset: 5504)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !952, file: !35, line: 2742, baseType: !974, size: 32, align: 32, offset: 6016)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !952, file: !35, line: 2755, baseType: !974, size: 32, align: 32, offset: 6048)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !952, file: !35, line: 2776, baseType: !974, size: 32, align: 32, offset: 6080)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !952, file: !35, line: 2783, baseType: !974, size: 32, align: 32, offset: 6112)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !952, file: !35, line: 2791, baseType: !974, size: 32, align: 32, offset: 6144)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !952, file: !35, line: 2802, baseType: !1261, size: 64, align: 64, offset: 6208)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !952, file: !35, line: 2811, baseType: !974, size: 32, align: 32, offset: 6272)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !952, file: !35, line: 2821, baseType: !974, size: 32, align: 32, offset: 6304)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !952, file: !35, line: 2830, baseType: !974, size: 32, align: 32, offset: 6336)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !952, file: !35, line: 2840, baseType: !974, size: 32, align: 32, offset: 6368)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !952, file: !35, line: 2851, baseType: !1481, size: 64, align: 64, offset: 6400)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!974, !1301, !1484, !968, !1243, !974, !974}
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DISubroutineType(types: !1486)
!1486 = !{!974, !1301, !968}
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !952, file: !35, line: 2871, baseType: !1488, size: 64, align: 64, offset: 6464)
!1488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1489, size: 64, align: 64)
!1489 = !DISubroutineType(types: !1490)
!1490 = !{!974, !1301, !1491, !968, !1243, !974}
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64, align: 64)
!1492 = !DISubroutineType(types: !1493)
!1493 = !{!974, !1301, !968, !974, !974}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !952, file: !35, line: 2878, baseType: !974, size: 32, align: 32, offset: 6528)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !952, file: !35, line: 2885, baseType: !974, size: 32, align: 32, offset: 6560)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !952, file: !35, line: 3005, baseType: !974, size: 32, align: 32, offset: 6592)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !952, file: !35, line: 3013, baseType: !878, size: 32, align: 32, offset: 6624)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !952, file: !35, line: 3020, baseType: !878, size: 32, align: 32, offset: 6656)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !952, file: !35, line: 3027, baseType: !878, size: 32, align: 32, offset: 6688)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !952, file: !35, line: 3037, baseType: !1076, size: 64, align: 64, offset: 6720)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !952, file: !35, line: 3038, baseType: !974, size: 32, align: 32, offset: 6784)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !952, file: !35, line: 3050, baseType: !1033, size: 64, align: 64, offset: 6848)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !952, file: !35, line: 3065, baseType: !974, size: 32, align: 32, offset: 6912)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !952, file: !35, line: 3083, baseType: !974, size: 32, align: 32, offset: 6944)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !952, file: !35, line: 3092, baseType: !1015, size: 64, align: 32, offset: 6976)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !952, file: !35, line: 3099, baseType: !494, size: 32, align: 32, offset: 7040)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !952, file: !35, line: 3106, baseType: !1015, size: 64, align: 32, offset: 7072)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !952, file: !35, line: 3113, baseType: !1509, size: 64, align: 64, offset: 7168)
!1509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64, align: 64)
!1510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1511)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !35, line: 740, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !35, line: 712, size: 384, align: 64, elements: !1513)
!1513 = !{!1514, !1515, !1516, !1517, !1518, !1519, !1522}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1512, file: !35, line: 713, baseType: !34, size: 32, align: 32)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1512, file: !35, line: 714, baseType: !24, size: 32, align: 32, offset: 32)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1512, file: !35, line: 720, baseType: !961, size: 64, align: 64, offset: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1512, file: !35, line: 724, baseType: !961, size: 64, align: 64, offset: 128)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1512, file: !35, line: 728, baseType: !974, size: 32, align: 32, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1512, file: !35, line: 734, baseType: !1520, size: 64, align: 64, offset: 256)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1512, file: !35, line: 739, baseType: !1523, size: 64, align: 64, offset: 320)
!1523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1524, size: 64, align: 64)
!1524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1044)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !952, file: !35, line: 3129, baseType: !1121, size: 64, align: 64, offset: 7232)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !952, file: !35, line: 3130, baseType: !1121, size: 64, align: 64, offset: 7296)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !952, file: !35, line: 3131, baseType: !1121, size: 64, align: 64, offset: 7360)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !952, file: !35, line: 3132, baseType: !1121, size: 64, align: 64, offset: 7424)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !952, file: !35, line: 3139, baseType: !1117, size: 64, align: 64, offset: 7488)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !952, file: !35, line: 3147, baseType: !974, size: 32, align: 32, offset: 7552)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !952, file: !35, line: 3165, baseType: !974, size: 32, align: 32, offset: 7584)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !952, file: !35, line: 3172, baseType: !974, size: 32, align: 32, offset: 7616)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !952, file: !35, line: 3180, baseType: !974, size: 32, align: 32, offset: 7648)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !952, file: !35, line: 3191, baseType: !1337, size: 64, align: 64, offset: 7680)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !952, file: !35, line: 3199, baseType: !1076, size: 64, align: 64, offset: 7744)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !952, file: !35, line: 3207, baseType: !1117, size: 64, align: 64, offset: 7808)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !952, file: !35, line: 3214, baseType: !1086, size: 32, align: 32, offset: 7872)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !952, file: !35, line: 3224, baseType: !1150, size: 64, align: 64, offset: 7936)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !952, file: !35, line: 3225, baseType: !974, size: 32, align: 32, offset: 8000)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !952, file: !35, line: 3249, baseType: !1132, size: 64, align: 64, offset: 8064)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !952, file: !35, line: 3256, baseType: !974, size: 32, align: 32, offset: 8128)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !952, file: !35, line: 3271, baseType: !974, size: 32, align: 32, offset: 8160)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !952, file: !35, line: 3279, baseType: !1121, size: 64, align: 64, offset: 8192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !952, file: !35, line: 3301, baseType: !1132, size: 64, align: 64, offset: 8256)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !952, file: !35, line: 3310, baseType: !974, size: 32, align: 32, offset: 8320)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !952, file: !35, line: 3337, baseType: !974, size: 32, align: 32, offset: 8352)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !952, file: !35, line: 3351, baseType: !974, size: 32, align: 32, offset: 8384)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !952, file: !35, line: 3359, baseType: !974, size: 32, align: 32, offset: 8416)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !947, file: !888, line: 68, baseType: !1550, size: 32, align: 32, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "SiprMode", file: !888, line: 54, baseType: !887)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "past_pitch_gain", scope: !947, file: !888, line: 70, baseType: !902, size: 32, align: 32, offset: 96)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "lsf_history", scope: !947, file: !888, line: 71, baseType: !1553, size: 512, align: 32, offset: 128)
!1553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 512, align: 32, elements: !926)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "excitation", scope: !947, file: !888, line: 73, baseType: !1555, size: 14464, align: 32, offset: 640)
!1555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 14464, align: 32, elements: !1556)
!1556 = !{!1557}
!1557 = !DISubrange(count: 452)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "synth_buf", scope: !947, file: !888, line: 75, baseType: !1559, size: 8192, align: 32, offset: 15104)
!1559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 8192, align: 32, elements: !1560)
!1560 = !{!913}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "lsp_history", scope: !947, file: !888, line: 77, baseType: !1562, size: 320, align: 32, offset: 23296)
!1562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 320, align: 32, elements: !1563)
!1563 = !{!1564}
!1564 = !DISubrange(count: 10)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "gain_mem", scope: !947, file: !888, line: 78, baseType: !902, size: 32, align: 32, offset: 23616)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "energy_history", scope: !947, file: !888, line: 79, baseType: !1567, size: 128, align: 32, offset: 23648)
!1567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, align: 32, elements: !1112)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "highpass_filt_mem", scope: !947, file: !888, line: 80, baseType: !1569, size: 64, align: 32, offset: 23776)
!1569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 64, align: 32, elements: !922)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "postfilter_mem", scope: !947, file: !888, line: 81, baseType: !1571, size: 4896, align: 32, offset: 23840)
!1571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 4896, align: 32, elements: !1572)
!1572 = !{!1573}
!1573 = !DISubrange(count: 153)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "tilt_mem", scope: !947, file: !888, line: 84, baseType: !902, size: 32, align: 32, offset: 28736)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "postfilter_agc", scope: !947, file: !888, line: 85, baseType: !902, size: 32, align: 32, offset: 28768)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "postfilter_mem5k0", scope: !947, file: !888, line: 86, baseType: !1571, size: 4896, align: 32, offset: 28800)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "postfilter_syn5k0", scope: !947, file: !888, line: 87, baseType: !1578, size: 8000, align: 32, offset: 33696)
!1578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 8000, align: 32, elements: !1579)
!1579 = !{!1580}
!1580 = !DISubrange(count: 250)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "pitch_lag_prev", scope: !947, file: !888, line: 90, baseType: !974, size: 32, align: 32, offset: 41696)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "iir_mem", scope: !947, file: !888, line: 91, baseType: !1583, size: 544, align: 32, offset: 41728)
!1583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 544, align: 32, elements: !1584)
!1584 = !{!1585}
!1585 = !DISubrange(count: 17)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "filt_buf", scope: !947, file: !888, line: 92, baseType: !1587, size: 1088, align: 32, offset: 42272)
!1587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 1088, align: 32, elements: !1588)
!1588 = !{!923, !1585}
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "filt_mem", scope: !947, file: !888, line: 93, baseType: !1590, size: 128, align: 64, offset: 43392)
!1590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1591, size: 128, align: 64, elements: !922)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64, align: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mem_preemph", scope: !947, file: !888, line: 94, baseType: !1553, size: 512, align: 32, offset: 43520)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "synth", scope: !947, file: !888, line: 95, baseType: !1553, size: 512, align: 32, offset: 44032)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "lsp_history_16k", scope: !947, file: !888, line: 96, baseType: !1595, size: 1024, align: 64, offset: 44544)
!1595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1596, size: 1024, align: 64, elements: !926)
!1596 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "decode_frame", scope: !947, file: !888, line: 98, baseType: !1598, size: 64, align: 64, offset: 45568)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64, align: 64)
!1599 = !DISubroutineType(types: !1600)
!1600 = !{null, !1601, !1602, !1591}
!1601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64, align: 64)
!1602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1603, size: 64, align: 64)
!1603 = !DIDerivedType(tag: DW_TAG_typedef, name: "SiprParameters", file: !888, line: 63, baseType: !1604)
!1604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SiprParameters", file: !888, line: 56, size: 1472, align: 32, elements: !1605)
!1605 = !{!1606, !1607, !1609, !1610, !1611, !1616}
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "ma_pred_switch", scope: !1604, file: !888, line: 57, baseType: !974, size: 32, align: 32)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "vq_indexes", scope: !1604, file: !888, line: 58, baseType: !1608, size: 160, align: 32, offset: 32)
!1608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 160, align: 32, elements: !903)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "pitch_delay", scope: !1604, file: !888, line: 59, baseType: !1608, size: 160, align: 32, offset: 192)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "gp_index", scope: !1604, file: !888, line: 60, baseType: !1608, size: 160, align: 32, offset: 352)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "fc_indexes", scope: !1604, file: !888, line: 61, baseType: !1612, size: 800, align: 16, offset: 512)
!1612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1613, size: 800, align: 16, elements: !1615)
!1613 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !1034, line: 37, baseType: !1614)
!1614 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1615 = !{!904, !1564}
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "gc_index", scope: !1604, file: !888, line: 62, baseType: !1608, size: 160, align: 32, offset: 1312)
!1617 = !{}
!1618 = !DILocalVariable(name: "ctx", arg: 1, scope: !941, file: !942, line: 176, type: !945)
!1619 = !DIExpression()
!1620 = !DILocation(line: 176, column: 44, scope: !941)
!1621 = !DILocalVariable(name: "params", arg: 2, scope: !941, file: !942, line: 176, type: !1602)
!1622 = !DILocation(line: 176, column: 65, scope: !941)
!1623 = !DILocalVariable(name: "out_data", arg: 3, scope: !941, file: !942, line: 177, type: !1591)
!1624 = !DILocation(line: 177, column: 38, scope: !941)
!1625 = !DILocalVariable(name: "frame_size", scope: !941, file: !942, line: 179, type: !974)
!1626 = !DILocation(line: 179, column: 9, scope: !941)
!1627 = !DILocalVariable(name: "synth", scope: !941, file: !942, line: 180, type: !1591)
!1628 = !DILocation(line: 180, column: 12, scope: !941)
!1629 = !DILocation(line: 180, column: 20, scope: !941)
!1630 = !DILocation(line: 180, column: 25, scope: !941)
!1631 = !DILocation(line: 180, column: 35, scope: !941)
!1632 = !DILocalVariable(name: "lsf_new", scope: !941, file: !942, line: 181, type: !1553)
!1633 = !DILocation(line: 181, column: 11, scope: !941)
!1634 = !DILocalVariable(name: "lsp_new", scope: !941, file: !942, line: 182, type: !1595)
!1635 = !DILocation(line: 182, column: 12, scope: !941)
!1636 = !DILocalVariable(name: "Az", scope: !941, file: !942, line: 183, type: !1637)
!1637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 1024, align: 32, elements: !1638)
!1638 = !{!923, !927}
!1639 = !DILocation(line: 183, column: 11, scope: !941)
!1640 = !DILocalVariable(name: "fixed_vector", scope: !941, file: !942, line: 184, type: !1641)
!1641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 2560, align: 32, elements: !1642)
!1642 = !{!1643}
!1643 = !DISubrange(count: 80)
!1644 = !DILocation(line: 184, column: 11, scope: !941)
!1645 = !DILocalVariable(name: "pitch_fac", scope: !941, file: !942, line: 185, type: !902)
!1646 = !DILocation(line: 185, column: 11, scope: !941)
!1647 = !DILocalVariable(name: "gain_code", scope: !941, file: !942, line: 185, type: !902)
!1648 = !DILocation(line: 185, column: 22, scope: !941)
!1649 = !DILocalVariable(name: "i", scope: !941, file: !942, line: 187, type: !974)
!1650 = !DILocation(line: 187, column: 9, scope: !941)
!1651 = !DILocalVariable(name: "pitch_delay_3x", scope: !941, file: !942, line: 188, type: !974)
!1652 = !DILocation(line: 188, column: 9, scope: !941)
!1653 = !DILocalVariable(name: "excitation", scope: !941, file: !942, line: 190, type: !1591)
!1654 = !DILocation(line: 190, column: 12, scope: !941)
!1655 = !DILocation(line: 190, column: 25, scope: !941)
!1656 = !DILocation(line: 190, column: 30, scope: !941)
!1657 = !DILocation(line: 190, column: 41, scope: !941)
!1658 = !DILocation(line: 192, column: 23, scope: !941)
!1659 = !DILocation(line: 192, column: 28, scope: !941)
!1660 = !DILocation(line: 192, column: 41, scope: !941)
!1661 = !DILocation(line: 192, column: 50, scope: !941)
!1662 = !DILocation(line: 192, column: 58, scope: !941)
!1663 = !DILocation(line: 193, column: 23, scope: !941)
!1664 = !DILocation(line: 193, column: 31, scope: !941)
!1665 = !DILocation(line: 192, column: 5, scope: !941)
!1666 = !DILocation(line: 195, column: 25, scope: !941)
!1667 = !DILocation(line: 195, column: 5, scope: !941)
!1668 = !DILocation(line: 197, column: 13, scope: !941)
!1669 = !DILocation(line: 197, column: 22, scope: !941)
!1670 = !DILocation(line: 197, column: 5, scope: !941)
!1671 = !DILocation(line: 199, column: 22, scope: !941)
!1672 = !DILocation(line: 199, column: 29, scope: !941)
!1673 = !DILocation(line: 199, column: 36, scope: !941)
!1674 = !DILocation(line: 199, column: 45, scope: !941)
!1675 = !DILocation(line: 199, column: 50, scope: !941)
!1676 = !DILocation(line: 199, column: 5, scope: !941)
!1677 = !DILocation(line: 201, column: 12, scope: !941)
!1678 = !DILocation(line: 201, column: 17, scope: !941)
!1679 = !DILocation(line: 201, column: 5, scope: !941)
!1680 = !DILocation(line: 203, column: 12, scope: !941)
!1681 = !DILocation(line: 203, column: 18, scope: !941)
!1682 = !DILocation(line: 203, column: 5, scope: !941)
!1683 = !DILocation(line: 203, column: 24, scope: !941)
!1684 = !DILocation(line: 203, column: 29, scope: !941)
!1685 = !DILocation(line: 206, column: 12, scope: !1686)
!1686 = distinct !DILexicalBlock(scope: !941, file: !942, line: 206, column: 5)
!1687 = !DILocation(line: 206, column: 10, scope: !1686)
!1688 = !DILocation(line: 206, column: 17, scope: !1689)
!1689 = !DILexicalBlockFile(scope: !1690, file: !942, discriminator: 1)
!1690 = distinct !DILexicalBlock(scope: !1686, file: !942, line: 206, column: 5)
!1691 = !DILocation(line: 206, column: 19, scope: !1689)
!1692 = !DILocation(line: 206, column: 5, scope: !1689)
!1693 = !DILocalVariable(name: "i_subfr", scope: !1694, file: !942, line: 207, type: !974)
!1694 = distinct !DILexicalBlock(scope: !1690, file: !942, line: 206, column: 29)
!1695 = !DILocation(line: 207, column: 13, scope: !1694)
!1696 = !DILocation(line: 207, column: 23, scope: !1694)
!1697 = !DILocation(line: 207, column: 25, scope: !1694)
!1698 = !DILocalVariable(name: "f", scope: !1694, file: !942, line: 208, type: !1699)
!1699 = !DIDerivedType(tag: DW_TAG_typedef, name: "AMRFixed", file: !1700, line: 60, baseType: !1701)
!1700 = !DIFile(filename: "libavcodec/acelp_vectors.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AMRFixed", file: !1700, line: 53, size: 768, align: 32, elements: !1702)
!1702 = !{!1703, !1704, !1706, !1707, !1708, !1709}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1701, file: !1700, line: 54, baseType: !974, size: 32, align: 32)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1701, file: !1700, line: 55, baseType: !1705, size: 320, align: 32, offset: 32)
!1705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !974, size: 320, align: 32, elements: !1563)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1701, file: !1700, line: 56, baseType: !1562, size: 320, align: 32, offset: 352)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "no_repeat_mask", scope: !1701, file: !1700, line: 57, baseType: !974, size: 32, align: 32, offset: 672)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "pitch_lag", scope: !1701, file: !1700, line: 58, baseType: !974, size: 32, align: 32, offset: 704)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "pitch_fac", scope: !1701, file: !1700, line: 59, baseType: !902, size: 32, align: 32, offset: 736)
!1710 = !DILocation(line: 208, column: 18, scope: !1694)
!1711 = !DILocalVariable(name: "gain_corr_factor", scope: !1694, file: !942, line: 209, type: !902)
!1712 = !DILocation(line: 209, column: 15, scope: !1694)
!1713 = !DILocalVariable(name: "pitch_delay_int", scope: !1694, file: !942, line: 210, type: !974)
!1714 = !DILocation(line: 210, column: 13, scope: !1694)
!1715 = !DILocalVariable(name: "pitch_delay_frac", scope: !1694, file: !942, line: 211, type: !974)
!1716 = !DILocation(line: 211, column: 13, scope: !1694)
!1717 = !DILocation(line: 213, column: 14, scope: !1718)
!1718 = distinct !DILexicalBlock(scope: !1694, file: !942, line: 213, column: 13)
!1719 = !DILocation(line: 213, column: 13, scope: !1694)
!1720 = !DILocation(line: 214, column: 65, scope: !1721)
!1721 = distinct !DILexicalBlock(scope: !1718, file: !942, line: 213, column: 17)
!1722 = !DILocation(line: 214, column: 45, scope: !1721)
!1723 = !DILocation(line: 214, column: 53, scope: !1721)
!1724 = !DILocation(line: 214, column: 30, scope: !1721)
!1725 = !DILocation(line: 214, column: 28, scope: !1721)
!1726 = !DILocation(line: 215, column: 9, scope: !1721)
!1727 = !DILocation(line: 216, column: 65, scope: !1718)
!1728 = !DILocation(line: 216, column: 45, scope: !1718)
!1729 = !DILocation(line: 216, column: 53, scope: !1718)
!1730 = !DILocation(line: 218, column: 45, scope: !1718)
!1731 = !DILocation(line: 218, column: 50, scope: !1718)
!1732 = !DILocation(line: 216, column: 30, scope: !1718)
!1733 = !DILocation(line: 216, column: 28, scope: !1718)
!1734 = !DILocation(line: 220, column: 56, scope: !1694)
!1735 = !DILocation(line: 220, column: 39, scope: !1694)
!1736 = !DILocation(line: 220, column: 47, scope: !1694)
!1737 = !DILocation(line: 220, column: 21, scope: !1694)
!1738 = !DILocation(line: 220, column: 19, scope: !1694)
!1739 = !DILocation(line: 221, column: 25, scope: !1694)
!1740 = !DILocation(line: 221, column: 24, scope: !1694)
!1741 = !DILocation(line: 221, column: 36, scope: !1694)
!1742 = !DILocation(line: 221, column: 24, scope: !1743)
!1743 = !DILexicalBlockFile(scope: !1694, file: !942, discriminator: 1)
!1744 = !DILocation(line: 221, column: 55, scope: !1745)
!1745 = !DILexicalBlockFile(scope: !1694, file: !942, discriminator: 2)
!1746 = !DILocation(line: 221, column: 54, scope: !1745)
!1747 = !DILocation(line: 221, column: 24, scope: !1745)
!1748 = !DILocation(line: 221, column: 24, scope: !1749)
!1749 = !DILexicalBlockFile(scope: !1694, file: !942, discriminator: 3)
!1750 = !DILocation(line: 221, column: 23, scope: !1749)
!1751 = !DILocation(line: 221, column: 11, scope: !1749)
!1752 = !DILocation(line: 221, column: 21, scope: !1749)
!1753 = !DILocation(line: 222, column: 25, scope: !1694)
!1754 = !DILocation(line: 222, column: 39, scope: !1694)
!1755 = !DILocation(line: 222, column: 43, scope: !1694)
!1756 = !DILocation(line: 222, column: 51, scope: !1694)
!1757 = !DILocation(line: 222, column: 11, scope: !1694)
!1758 = !DILocation(line: 222, column: 21, scope: !1694)
!1759 = !DILocation(line: 223, column: 33, scope: !1694)
!1760 = !DILocation(line: 223, column: 9, scope: !1694)
!1761 = !DILocation(line: 223, column: 14, scope: !1694)
!1762 = !DILocation(line: 223, column: 29, scope: !1694)
!1763 = !DILocation(line: 225, column: 29, scope: !1694)
!1764 = !DILocation(line: 225, column: 44, scope: !1694)
!1765 = !DILocation(line: 225, column: 49, scope: !1694)
!1766 = !DILocation(line: 225, column: 57, scope: !1694)
!1767 = !DILocation(line: 225, column: 25, scope: !1694)
!1768 = !DILocation(line: 226, column: 28, scope: !1694)
!1769 = !DILocation(line: 226, column: 43, scope: !1694)
!1770 = !DILocation(line: 226, column: 51, scope: !1694)
!1771 = !DILocation(line: 226, column: 50, scope: !1694)
!1772 = !DILocation(line: 226, column: 47, scope: !1694)
!1773 = !DILocation(line: 226, column: 26, scope: !1694)
