; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ituh263enc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ituh263enc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVRational = type { i32, i32 }
%struct.RLTable = type { i32, i32, [2 x i16]*, i8*, i8*, [2 x i8*], [2 x i8*], [2 x i8*], [32 x %struct.RL_VLC_ELEM*] }
%struct.RL_VLC_ELEM = type { i16, i8, i8 }

!920 = !DIEnumerator(name: "FF_IDCT_PERM_LIBMPEG2", value: 1)
!921 = !DIEnumerator(name: "FF_IDCT_PERM_SIMPLE", value: 2)
!922 = !DIEnumerator(name: "FF_IDCT_PERM_TRANSPOSE", value: 3)
!923 = !DIEnumerator(name: "FF_IDCT_PERM_PARTTRANS", value: 4)
!924 = !DIEnumerator(name: "FF_IDCT_PERM_SSE2", value: 5)
!925 = !{!926, !929, !930, !937, !938, !936}
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !927, line: 40, baseType: !928)
!927 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!928 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!929 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !932, line: 221, size: 32, align: 8, elements: !933)
!932 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !931, file: !932, line: 221, baseType: !935, size: 32, align: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !927, line: 51, baseType: !936)
!936 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!938 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!939 = !{!940, !2599, !2602, !2606, !2607, !2611, !2612, !2614}
!940 = distinct !DIGlobalVariable(name: "done", scope: !941, file: !942, line: 763, type: !929, isLocal: true, isDefinition: true, variable: i32* @ff_h263_encode_init.done)
!941 = distinct !DISubprogram(name: "ff_h263_encode_init", scope: !942, file: !942, line: 761, type: !943, isLocal: false, isDefinition: true, scopeLine: 762, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !2598)
!942 = !DIFile(filename: "libavcodec/ituh263enc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!943 = !DISubroutineType(types: !944)
!944 = !{null, !945}
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "MpegEncContext", file: !947, line: 582, baseType: !948)
!947 = !DIFile(filename: "libavcodec/mpegvideo.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !947, line: 81, size: 86208, align: 64, elements: !949)
!949 = !{!950, !1031, !1032, !1033, !1034, !1038, !1039, !1053, !1054, !1055, !1056, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1763, !1764, !1818, !1820, !1821, !1822, !1823, !1824, !1835, !1836, !1837, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1853, !1855, !1857, !1858, !1859, !1860, !1861, !1862, !1867, !1869, !1870, !1871, !1872, !1873, !1874, !1882, !1883, !1884, !1885, !1886, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1901, !1902, !1903, !1904, !1920, !1927, !1939, !1955, !1977, !2017, !2030, !2057, !2072, !2086, !2099, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2120, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2133, !2135, !2136, !2137, !2138, !2139, !2140, !2143, !2145, !2147, !2148, !2151, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2218, !2219, !2221, !2222, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2244, !2245, !2246, !2249, !2250, !2251, !2252, !2254, !2256, !2257, !2258, !2259, !2260, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2342, !2343, !2344, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2430, !2431, !2432, !2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2473, !2474, !2475, !2476, !2480, !2481, !2485, !2489, !2493, !2494, !2499, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2514, !2515, !2519, !2520, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2533, !2534, !2535, !2585, !2586, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !948, file: !947, line: 82, baseType: !951, size: 64, align: 64)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !26, line: 143, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !26, line: 67, size: 640, align: 64, elements: !954)
!954 = !{!955, !959, !963, !990, !991, !992, !993, !997, !1003, !1005, !1009}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !953, file: !26, line: 72, baseType: !956, size: 64, align: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !953, file: !26, line: 78, baseType: !960, size: 64, align: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!956, !937}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !953, file: !26, line: 85, baseType: !964, size: 64, align: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64, align: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 246, size: 512, align: 64, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !986, !987, !988, !989}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !966, file: !4, line: 247, baseType: !956, size: 64, align: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !966, file: !4, line: 253, baseType: !956, size: 64, align: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !966, file: !4, line: 259, baseType: !929, size: 32, align: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !966, file: !4, line: 260, baseType: !3, size: 32, align: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !966, file: !4, line: 271, baseType: !973, size: 64, align: 64, offset: 192)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !966, file: !4, line: 265, size: 64, align: 64, elements: !974)
!974 = !{!975, !976, !978, !979}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !973, file: !4, line: 266, baseType: !926, size: 64, align: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !973, file: !4, line: 267, baseType: !977, size: 64, align: 64)
!977 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !973, file: !4, line: 268, baseType: !956, size: 64, align: 64)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !973, file: !4, line: 270, baseType: !980, size: 64, align: 32)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !981, line: 61, baseType: !982)
!981 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !981, line: 58, size: 64, align: 32, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !982, file: !981, line: 59, baseType: !929, size: 32, align: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !982, file: !981, line: 60, baseType: !929, size: 32, align: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !966, file: !4, line: 272, baseType: !977, size: 64, align: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !966, file: !4, line: 273, baseType: !977, size: 64, align: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !4, line: 275, baseType: !929, size: 32, align: 32, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !966, file: !4, line: 300, baseType: !956, size: 64, align: 64, offset: 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !953, file: !26, line: 93, baseType: !929, size: 32, align: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !953, file: !26, line: 99, baseType: !929, size: 32, align: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !953, file: !26, line: 108, baseType: !929, size: 32, align: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !953, file: !26, line: 113, baseType: !994, size: 64, align: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64, align: 64)
!995 = !DISubroutineType(types: !996)
!996 = !{!937, !937, !937}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !953, file: !26, line: 123, baseType: !998, size: 64, align: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!1001, !1001}
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !953, file: !26, line: 130, baseType: !1004, size: 32, align: 32, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !26, line: 48, baseType: !25)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !953, file: !26, line: 136, baseType: !1006, size: 64, align: 64, offset: 512)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64, align: 64)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!1004, !937}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !953, file: !26, line: 142, baseType: !1010, size: 64, align: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!929, !1013, !937, !956, !929}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64, align: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 329, size: 128, align: 64, elements: !1016)
!1016 = !{!1017, !1029, !1030}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1015, file: !4, line: 360, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64, align: 64)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64, align: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !4, line: 324, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !4, line: 306, size: 384, align: 64, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1021, file: !4, line: 307, baseType: !956, size: 64, align: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1021, file: !4, line: 313, baseType: !977, size: 64, align: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1021, file: !4, line: 313, baseType: !977, size: 64, align: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1021, file: !4, line: 318, baseType: !977, size: 64, align: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1021, file: !4, line: 318, baseType: !977, size: 64, align: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1021, file: !4, line: 323, baseType: !929, size: 32, align: 32, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1015, file: !4, line: 364, baseType: !929, size: 32, align: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1015, file: !4, line: 368, baseType: !929, size: 32, align: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "y_dc_scale", scope: !948, file: !947, line: 84, baseType: !929, size: 32, align: 32, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "c_dc_scale", scope: !948, file: !947, line: 84, baseType: !929, size: 32, align: 32, offset: 96)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ac_pred", scope: !948, file: !947, line: 85, baseType: !929, size: 32, align: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "block_last_index", scope: !948, file: !947, line: 86, baseType: !1035, size: 384, align: 32, offset: 160)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 384, align: 32, elements: !1036)
!1036 = !{!1037}
!1037 = !DISubrange(count: 12)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "h263_aic", scope: !948, file: !947, line: 87, baseType: !929, size: 32, align: 32, offset: 544)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "inter_scantable", scope: !948, file: !947, line: 90, baseType: !1040, size: 1088, align: 64, offset: 576)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "ScanTable", file: !917, line: 35, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScanTable", file: !917, line: 31, size: 1088, align: 64, elements: !1042)
!1042 = !{!1043, !1048, !1052}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "scantable", scope: !1041, file: !917, line: 32, baseType: !1044, size: 64, align: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64, align: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !927, line: 48, baseType: !1047)
!1047 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "permutated", scope: !1041, file: !917, line: 33, baseType: !1049, size: 512, align: 8, offset: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1046, size: 512, align: 8, elements: !1050)
!1050 = !{!1051}
!1051 = !DISubrange(count: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "raster_end", scope: !1041, file: !917, line: 34, baseType: !1049, size: 512, align: 8, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "intra_scantable", scope: !948, file: !947, line: 91, baseType: !1040, size: 1088, align: 64, offset: 1664)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "intra_h_scantable", scope: !948, file: !947, line: 92, baseType: !1040, size: 1088, align: 64, offset: 2752)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "intra_v_scantable", scope: !948, file: !947, line: 93, baseType: !1040, size: 1088, align: 64, offset: 3840)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "avctx", scope: !948, file: !947, line: 98, baseType: !1057, size: 64, align: 64, offset: 4928)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64, align: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !57, line: 1556, size: 8448, align: 64, elements: !1059)
!1059 = !{!1060, !1063, !1064, !1065, !1330, !1331, !1332, !1333, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1485, !1489, !1490, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1577, !1578, !1579, !1580, !1581, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1590, !1591, !1592, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1668, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1058, file: !57, line: 1561, baseType: !1061, size: 64, align: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64, align: 64)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1058, file: !57, line: 1562, baseType: !929, size: 32, align: 32, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1058, file: !57, line: 1564, baseType: !46, size: 32, align: 32, offset: 96)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1058, file: !57, line: 1565, baseType: !1066, size: 64, align: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64, align: 64)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !57, line: 3468, size: 1984, align: 64, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1078, !1081, !1084, !1087, !1092, !1093, !1094, !1102, !1103, !1104, !1106, !1112, !1118, !1127, !1131, !1132, !1180, !1301, !1305, !1306, !1310, !1314, !1319, !1323, !1324, !1325}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1068, file: !57, line: 3475, baseType: !956, size: 64, align: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1068, file: !57, line: 3480, baseType: !956, size: 64, align: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1068, file: !57, line: 3481, baseType: !46, size: 32, align: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1068, file: !57, line: 3482, baseType: !56, size: 32, align: 32, offset: 160)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1068, file: !57, line: 3487, baseType: !929, size: 32, align: 32, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1068, file: !57, line: 3488, baseType: !1076, size: 64, align: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1068, file: !57, line: 3489, baseType: !1079, size: 64, align: 64, offset: 320)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64, align: 64)
!1080 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1068, file: !57, line: 3490, baseType: !1082, size: 64, align: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64, align: 64)
!1083 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1068, file: !57, line: 3491, baseType: !1085, size: 64, align: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64, align: 64)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1068, file: !57, line: 3492, baseType: !1088, size: 64, align: 64, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1090)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !927, line: 55, baseType: !1091)
!1091 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1068, file: !57, line: 3493, baseType: !1046, size: 8, align: 8, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1068, file: !57, line: 3494, baseType: !1061, size: 64, align: 64, offset: 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1068, file: !57, line: 3495, baseType: !1095, size: 64, align: 64, offset: 704)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64, align: 64)
!1096 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1097)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !57, line: 3404, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !57, line: 3401, size: 128, align: 64, elements: !1099)
!1099 = !{!1100, !1101}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1098, file: !57, line: 3402, baseType: !929, size: 32, align: 32)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1098, file: !57, line: 3403, baseType: !956, size: 64, align: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1068, file: !57, line: 3507, baseType: !956, size: 64, align: 64, offset: 768)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1068, file: !57, line: 3516, baseType: !929, size: 32, align: 32, offset: 832)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1068, file: !57, line: 3517, baseType: !1105, size: 64, align: 64, offset: 896)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64, align: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1068, file: !57, line: 3527, baseType: !1107, size: 64, align: 64, offset: 960)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64, align: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!929, !1110}
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !57, line: 3360, baseType: !1058)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1068, file: !57, line: 3535, baseType: !1113, size: 64, align: 64, offset: 1024)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64, align: 64)
!1114 = !DISubroutineType(types: !1115)
!1115 = !{!929, !1110, !1116}
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64, align: 64)
!1117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1068, file: !57, line: 3541, baseType: !1119, size: 64, align: 64, offset: 1088)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64, align: 64)
!1120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1121)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !57, line: 3461, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1123, line: 223, size: 128, align: 64, elements: !1124)
!1123 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1122, file: !1123, line: 224, baseType: !1044, size: 64, align: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1122, file: !1123, line: 225, baseType: !1044, size: 64, align: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1068, file: !57, line: 3549, baseType: !1128, size: 64, align: 64, offset: 1152)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{null, !1105}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1068, file: !57, line: 3551, baseType: !1107, size: 64, align: 64, offset: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1068, file: !57, line: 3552, baseType: !1133, size: 64, align: 64, offset: 1280)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!929, !1110, !1136, !929, !1137}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64, align: 64)
!1138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1139)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !57, line: 3920, size: 256, align: 64, elements: !1140)
!1140 = !{!1141, !1144, !1145, !1146, !1147, !1179}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1139, file: !57, line: 3921, baseType: !1142, size: 16, align: 16)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !927, line: 49, baseType: !1143)
!1143 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1139, file: !57, line: 3922, baseType: !935, size: 32, align: 32, offset: 32)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1139, file: !57, line: 3923, baseType: !935, size: 32, align: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1139, file: !57, line: 3924, baseType: !936, size: 32, align: 32, offset: 96)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1139, file: !57, line: 3925, baseType: !1148, size: 64, align: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64, align: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !57, line: 3918, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !57, line: 3885, size: 1600, align: 64, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1156, !1157, !1158, !1168, !1172, !1174, !1175, !1177, !1178}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1151, file: !57, line: 3886, baseType: !929, size: 32, align: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1151, file: !57, line: 3887, baseType: !929, size: 32, align: 32, offset: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1151, file: !57, line: 3888, baseType: !929, size: 32, align: 32, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1151, file: !57, line: 3889, baseType: !929, size: 32, align: 32, offset: 96)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1151, file: !57, line: 3890, baseType: !929, size: 32, align: 32, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1151, file: !57, line: 3897, baseType: !1159, size: 768, align: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !57, line: 3858, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !57, line: 3853, size: 768, align: 64, elements: !1161)
!1161 = !{!1162, !1166}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1160, file: !57, line: 3855, baseType: !1163, size: 512, align: 64)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 512, align: 64, elements: !1164)
!1164 = !{!1165}
!1165 = !DISubrange(count: 8)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1160, file: !57, line: 3857, baseType: !1167, size: 256, align: 32, offset: 512)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 256, align: 32, elements: !1164)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !57, line: 3903, baseType: !1169, size: 256, align: 64, offset: 960)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 256, align: 64, elements: !1170)
!1170 = !{!1171}
!1171 = !DISubrange(count: 4)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1151, file: !57, line: 3904, baseType: !1173, size: 128, align: 32, offset: 1216)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 128, align: 32, elements: !1170)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1151, file: !57, line: 3906, baseType: !733, size: 32, align: 32, offset: 1344)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1151, file: !57, line: 3908, baseType: !1176, size: 64, align: 64, offset: 1408)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1151, file: !57, line: 3915, baseType: !1176, size: 64, align: 64, offset: 1472)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1151, file: !57, line: 3917, baseType: !929, size: 32, align: 32, offset: 1536)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1139, file: !57, line: 3926, baseType: !926, size: 64, align: 64, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1068, file: !57, line: 3564, baseType: !1181, size: 64, align: 64, offset: 1344)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!929, !1110, !1184, !1218, !1300}
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64, align: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !57, line: 1499, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !57, line: 1445, size: 704, align: 64, elements: !1187)
!1187 = !{!1188, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1214, !1215, !1216, !1217}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1186, file: !57, line: 1451, baseType: !1189, size: 64, align: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1191, line: 94, baseType: !1192)
!1191 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1191, line: 81, size: 192, align: 64, elements: !1193)
!1193 = !{!1194, !1198, !1199}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1192, file: !1191, line: 82, baseType: !1195, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1191, line: 73, baseType: !1197)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1191, line: 73, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1192, file: !1191, line: 89, baseType: !1136, size: 64, align: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1192, file: !1191, line: 93, baseType: !929, size: 32, align: 32, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1186, file: !57, line: 1461, baseType: !926, size: 64, align: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1186, file: !57, line: 1467, baseType: !926, size: 64, align: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1186, file: !57, line: 1468, baseType: !1136, size: 64, align: 64, offset: 192)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1186, file: !57, line: 1469, baseType: !929, size: 32, align: 32, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1186, file: !57, line: 1470, baseType: !929, size: 32, align: 32, offset: 288)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1186, file: !57, line: 1474, baseType: !929, size: 32, align: 32, offset: 320)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1186, file: !57, line: 1479, baseType: !1207, size: 64, align: 64, offset: 384)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64, align: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !57, line: 1415, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !57, line: 1411, size: 128, align: 64, elements: !1210)
!1210 = !{!1211, !1212, !1213}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1209, file: !57, line: 1412, baseType: !1136, size: 64, align: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1209, file: !57, line: 1413, baseType: !929, size: 32, align: 32, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1209, file: !57, line: 1414, baseType: !739, size: 32, align: 32, offset: 96)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1186, file: !57, line: 1480, baseType: !929, size: 32, align: 32, offset: 448)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1186, file: !57, line: 1486, baseType: !926, size: 64, align: 64, offset: 512)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1186, file: !57, line: 1488, baseType: !926, size: 64, align: 64, offset: 576)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1186, file: !57, line: 1497, baseType: !926, size: 64, align: 64, offset: 640)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !780, line: 646, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !780, line: 268, size: 4288, align: 64, elements: !1222)
!1222 = !{!1223, !1224, !1225, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1252, !1254, !1255, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1288, !1289, !1290, !1291, !1292, !1293, !1296, !1297, !1298, !1299}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1221, file: !780, line: 282, baseType: !1163, size: 512, align: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1221, file: !780, line: 299, baseType: !1167, size: 256, align: 32, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1221, file: !780, line: 315, baseType: !1226, size: 64, align: 64, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64, align: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1221, file: !780, line: 326, baseType: !929, size: 32, align: 32, offset: 832)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1221, file: !780, line: 326, baseType: !929, size: 32, align: 32, offset: 864)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1221, file: !780, line: 334, baseType: !929, size: 32, align: 32, offset: 896)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1221, file: !780, line: 341, baseType: !929, size: 32, align: 32, offset: 928)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1221, file: !780, line: 346, baseType: !929, size: 32, align: 32, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1221, file: !780, line: 351, baseType: !769, size: 32, align: 32, offset: 992)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1221, file: !780, line: 356, baseType: !980, size: 64, align: 32, offset: 1024)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1221, file: !780, line: 361, baseType: !926, size: 64, align: 64, offset: 1088)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1221, file: !780, line: 369, baseType: !926, size: 64, align: 64, offset: 1152)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1221, file: !780, line: 377, baseType: !926, size: 64, align: 64, offset: 1216)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1221, file: !780, line: 382, baseType: !929, size: 32, align: 32, offset: 1280)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1221, file: !780, line: 386, baseType: !929, size: 32, align: 32, offset: 1312)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1221, file: !780, line: 391, baseType: !929, size: 32, align: 32, offset: 1344)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1221, file: !780, line: 396, baseType: !937, size: 64, align: 64, offset: 1408)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1221, file: !780, line: 403, baseType: !1242, size: 512, align: 64, offset: 1472)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1090, size: 512, align: 64, elements: !1164)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1221, file: !780, line: 410, baseType: !929, size: 32, align: 32, offset: 1984)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1221, file: !780, line: 415, baseType: !929, size: 32, align: 32, offset: 2016)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1221, file: !780, line: 420, baseType: !929, size: 32, align: 32, offset: 2048)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1221, file: !780, line: 425, baseType: !929, size: 32, align: 32, offset: 2080)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1221, file: !780, line: 435, baseType: !926, size: 64, align: 64, offset: 2112)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1221, file: !780, line: 440, baseType: !929, size: 32, align: 32, offset: 2176)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1221, file: !780, line: 445, baseType: !1090, size: 64, align: 64, offset: 2240)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1221, file: !780, line: 459, baseType: !1251, size: 512, align: 64, offset: 2304)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1189, size: 512, align: 64, elements: !1164)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1221, file: !780, line: 473, baseType: !1253, size: 64, align: 64, offset: 2816)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64, align: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1221, file: !780, line: 477, baseType: !929, size: 32, align: 32, offset: 2880)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1221, file: !780, line: 479, baseType: !1256, size: 64, align: 64, offset: 2944)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !780, line: 207, baseType: !1259)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !780, line: 201, size: 320, align: 64, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1269}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1259, file: !780, line: 202, baseType: !779, size: 32, align: 32)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1259, file: !780, line: 203, baseType: !1136, size: 64, align: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1259, file: !780, line: 204, baseType: !929, size: 32, align: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1259, file: !780, line: 205, baseType: !1265, size: 64, align: 64, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64, align: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1267, line: 86, baseType: !1268)
!1267 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1267, line: 86, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1259, file: !780, line: 206, baseType: !1189, size: 64, align: 64, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1221, file: !780, line: 480, baseType: !929, size: 32, align: 32, offset: 3008)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1221, file: !780, line: 505, baseType: !929, size: 32, align: 32, offset: 3040)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1221, file: !780, line: 512, baseType: !803, size: 32, align: 32, offset: 3072)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1221, file: !780, line: 514, baseType: !809, size: 32, align: 32, offset: 3104)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1221, file: !780, line: 516, baseType: !827, size: 32, align: 32, offset: 3136)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1221, file: !780, line: 523, baseType: !851, size: 32, align: 32, offset: 3168)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1221, file: !780, line: 525, baseType: !870, size: 32, align: 32, offset: 3200)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1221, file: !780, line: 532, baseType: !926, size: 64, align: 64, offset: 3264)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1221, file: !780, line: 539, baseType: !926, size: 64, align: 64, offset: 3328)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1221, file: !780, line: 547, baseType: !926, size: 64, align: 64, offset: 3392)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1221, file: !780, line: 554, baseType: !1265, size: 64, align: 64, offset: 3456)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1221, file: !780, line: 563, baseType: !929, size: 32, align: 32, offset: 3520)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1221, file: !780, line: 572, baseType: !929, size: 32, align: 32, offset: 3552)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1221, file: !780, line: 581, baseType: !929, size: 32, align: 32, offset: 3584)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1221, file: !780, line: 588, baseType: !1285, size: 64, align: 64, offset: 3648)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !927, line: 36, baseType: !1287)
!1287 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1221, file: !780, line: 593, baseType: !929, size: 32, align: 32, offset: 3712)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1221, file: !780, line: 596, baseType: !929, size: 32, align: 32, offset: 3744)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1221, file: !780, line: 599, baseType: !1189, size: 64, align: 64, offset: 3776)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1221, file: !780, line: 605, baseType: !1189, size: 64, align: 64, offset: 3840)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1221, file: !780, line: 616, baseType: !1189, size: 64, align: 64, offset: 3904)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1221, file: !780, line: 626, baseType: !1294, size: 64, align: 64, offset: 3968)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1295, line: 216, baseType: !1091)
!1295 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1221, file: !780, line: 627, baseType: !1294, size: 64, align: 64, offset: 4032)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1221, file: !780, line: 628, baseType: !1294, size: 64, align: 64, offset: 4096)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1221, file: !780, line: 629, baseType: !1294, size: 64, align: 64, offset: 4160)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1221, file: !780, line: 645, baseType: !1189, size: 64, align: 64, offset: 4224)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64, align: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1068, file: !57, line: 3566, baseType: !1302, size: 64, align: 64, offset: 1408)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64, align: 64)
!1303 = !DISubroutineType(types: !1304)
!1304 = !{!929, !1110, !937, !1300, !1184}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1068, file: !57, line: 3567, baseType: !1107, size: 64, align: 64, offset: 1472)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1068, file: !57, line: 3576, baseType: !1307, size: 64, align: 64, offset: 1536)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!929, !1110, !1218}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1068, file: !57, line: 3577, baseType: !1311, size: 64, align: 64, offset: 1600)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!929, !1110, !1184}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1068, file: !57, line: 3584, baseType: !1315, size: 64, align: 64, offset: 1664)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64, align: 64)
!1316 = !DISubroutineType(types: !1317)
!1317 = !{!929, !1110, !1318}
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64, align: 64)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1068, file: !57, line: 3589, baseType: !1320, size: 64, align: 64, offset: 1728)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64, align: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{null, !1110}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1068, file: !57, line: 3594, baseType: !929, size: 32, align: 32, offset: 1792)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1068, file: !57, line: 3600, baseType: !956, size: 64, align: 64, offset: 1856)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1068, file: !57, line: 3609, baseType: !1326, size: 64, align: 64, offset: 1920)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1329)
!1329 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !57, line: 3609, flags: DIFlagFwdDecl)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1058, file: !57, line: 1566, baseType: !56, size: 32, align: 32, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1058, file: !57, line: 1581, baseType: !936, size: 32, align: 32, offset: 224)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1058, file: !57, line: 1583, baseType: !937, size: 64, align: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1058, file: !57, line: 1591, baseType: !1334, size: 64, align: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64, align: 64)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1123, line: 129, size: 1664, align: 64, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1340, !1341, !1359, !1360, !1366, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1335, file: !1123, line: 136, baseType: !929, size: 32, align: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1335, file: !1123, line: 151, baseType: !929, size: 32, align: 32, offset: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1335, file: !1123, line: 157, baseType: !929, size: 32, align: 32, offset: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1335, file: !1123, line: 159, baseType: !1318, size: 64, align: 64, offset: 128)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1335, file: !1123, line: 161, baseType: !1342, size: 64, align: 64, offset: 192)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1123, line: 117, baseType: !1344)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1123, line: 100, size: 832, align: 64, elements: !1345)
!1345 = !{!1346, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1344, file: !1123, line: 105, baseType: !1347, size: 256, align: 64)
!1347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1348, size: 256, align: 64, elements: !1170)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64, align: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1191, line: 238, baseType: !1350)
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1191, line: 238, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1344, file: !1123, line: 110, baseType: !929, size: 32, align: 32, offset: 256)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1344, file: !1123, line: 111, baseType: !929, size: 32, align: 32, offset: 288)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1344, file: !1123, line: 111, baseType: !929, size: 32, align: 32, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1344, file: !1123, line: 112, baseType: !1167, size: 256, align: 32, offset: 352)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1344, file: !1123, line: 113, baseType: !1173, size: 128, align: 32, offset: 608)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1344, file: !1123, line: 114, baseType: !929, size: 32, align: 32, offset: 736)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1344, file: !1123, line: 115, baseType: !929, size: 32, align: 32, offset: 768)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1344, file: !1123, line: 116, baseType: !929, size: 32, align: 32, offset: 800)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1335, file: !1123, line: 163, baseType: !937, size: 64, align: 64, offset: 256)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1335, file: !1123, line: 165, baseType: !1361, size: 128, align: 64, offset: 320)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1123, line: 122, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1123, line: 119, size: 128, align: 64, elements: !1363)
!1363 = !{!1364, !1365}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1362, file: !1123, line: 120, baseType: !1184, size: 64, align: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1362, file: !1123, line: 121, baseType: !1318, size: 64, align: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1335, file: !1123, line: 166, baseType: !1367, size: 128, align: 64, offset: 448)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1123, line: 127, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1123, line: 124, size: 128, align: 64, elements: !1369)
!1369 = !{!1370, !1443}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1368, file: !1123, line: 125, baseType: !1371, size: 64, align: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64, align: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !57, line: 5794, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !57, line: 5747, size: 512, align: 64, elements: !1375)
!1375 = !{!1376, !1377, !1401, !1405, !1406, !1440, !1441, !1442}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1374, file: !57, line: 5751, baseType: !1061, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1374, file: !57, line: 5756, baseType: !1378, size: 64, align: 64, offset: 64)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64, align: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1380)
!1380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !57, line: 5796, size: 512, align: 64, elements: !1381)
!1381 = !{!1382, !1383, !1386, !1387, !1388, !1392, !1396, !1400}
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1380, file: !57, line: 5797, baseType: !956, size: 64, align: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1380, file: !57, line: 5804, baseType: !1384, size: 64, align: 64, offset: 64)
!1384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1385, size: 64, align: 64)
!1385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1380, file: !57, line: 5815, baseType: !1061, size: 64, align: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1380, file: !57, line: 5825, baseType: !929, size: 32, align: 32, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1380, file: !57, line: 5826, baseType: !1389, size: 64, align: 64, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!929, !1372}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1380, file: !57, line: 5827, baseType: !1393, size: 64, align: 64, offset: 320)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64, align: 64)
!1394 = !DISubroutineType(types: !1395)
!1395 = !{!929, !1372, !1184}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1380, file: !57, line: 5828, baseType: !1397, size: 64, align: 64, offset: 384)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64, align: 64)
!1398 = !DISubroutineType(types: !1399)
!1399 = !{null, !1372}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1380, file: !57, line: 5829, baseType: !1397, size: 64, align: 64, offset: 448)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1374, file: !57, line: 5762, baseType: !1402, size: 64, align: 64, offset: 128)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64, align: 64)
!1403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !57, line: 5735, baseType: !1404)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !57, line: 5735, flags: DIFlagFwdDecl)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1374, file: !57, line: 5768, baseType: !937, size: 64, align: 64, offset: 192)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1374, file: !57, line: 5775, baseType: !1407, size: 64, align: 64, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !57, line: 4085, baseType: !1409)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !57, line: 3936, size: 1152, align: 64, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1409, file: !57, line: 3940, baseType: !46, size: 32, align: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1409, file: !57, line: 3944, baseType: !56, size: 32, align: 32, offset: 32)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1409, file: !57, line: 3948, baseType: !935, size: 32, align: 32, offset: 64)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1409, file: !57, line: 3958, baseType: !1136, size: 64, align: 64, offset: 128)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1409, file: !57, line: 3962, baseType: !929, size: 32, align: 32, offset: 192)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1409, file: !57, line: 3968, baseType: !929, size: 32, align: 32, offset: 224)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1409, file: !57, line: 3973, baseType: !926, size: 64, align: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1409, file: !57, line: 3986, baseType: !929, size: 32, align: 32, offset: 320)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1409, file: !57, line: 3999, baseType: !929, size: 32, align: 32, offset: 352)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1409, file: !57, line: 4004, baseType: !929, size: 32, align: 32, offset: 384)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1409, file: !57, line: 4005, baseType: !929, size: 32, align: 32, offset: 416)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1409, file: !57, line: 4010, baseType: !929, size: 32, align: 32, offset: 448)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1409, file: !57, line: 4011, baseType: !929, size: 32, align: 32, offset: 480)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1409, file: !57, line: 4020, baseType: !980, size: 64, align: 32, offset: 512)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1409, file: !57, line: 4025, baseType: !880, size: 32, align: 32, offset: 576)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1409, file: !57, line: 4030, baseType: !803, size: 32, align: 32, offset: 608)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1409, file: !57, line: 4031, baseType: !809, size: 32, align: 32, offset: 640)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1409, file: !57, line: 4032, baseType: !827, size: 32, align: 32, offset: 672)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1409, file: !57, line: 4033, baseType: !851, size: 32, align: 32, offset: 704)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1409, file: !57, line: 4034, baseType: !870, size: 32, align: 32, offset: 736)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1409, file: !57, line: 4039, baseType: !929, size: 32, align: 32, offset: 768)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1409, file: !57, line: 4046, baseType: !1090, size: 64, align: 64, offset: 832)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1409, file: !57, line: 4050, baseType: !929, size: 32, align: 32, offset: 896)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1409, file: !57, line: 4054, baseType: !929, size: 32, align: 32, offset: 928)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1409, file: !57, line: 4061, baseType: !929, size: 32, align: 32, offset: 960)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1409, file: !57, line: 4065, baseType: !929, size: 32, align: 32, offset: 992)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1409, file: !57, line: 4073, baseType: !929, size: 32, align: 32, offset: 1024)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1409, file: !57, line: 4080, baseType: !929, size: 32, align: 32, offset: 1056)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1409, file: !57, line: 4084, baseType: !929, size: 32, align: 32, offset: 1088)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1374, file: !57, line: 5781, baseType: !1407, size: 64, align: 64, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1374, file: !57, line: 5787, baseType: !980, size: 64, align: 32, offset: 384)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1374, file: !57, line: 5793, baseType: !980, size: 64, align: 32, offset: 448)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1368, file: !1123, line: 126, baseType: !929, size: 32, align: 32, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1335, file: !1123, line: 172, baseType: !1184, size: 64, align: 64, offset: 576)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1335, file: !1123, line: 177, baseType: !1136, size: 64, align: 64, offset: 640)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1335, file: !1123, line: 178, baseType: !936, size: 32, align: 32, offset: 704)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1335, file: !1123, line: 180, baseType: !937, size: 64, align: 64, offset: 768)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1335, file: !1123, line: 185, baseType: !929, size: 32, align: 32, offset: 832)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1335, file: !1123, line: 190, baseType: !937, size: 64, align: 64, offset: 896)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1335, file: !1123, line: 195, baseType: !929, size: 32, align: 32, offset: 960)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1335, file: !1123, line: 200, baseType: !1184, size: 64, align: 64, offset: 1024)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1335, file: !1123, line: 201, baseType: !929, size: 32, align: 32, offset: 1088)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1335, file: !1123, line: 202, baseType: !1318, size: 64, align: 64, offset: 1152)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1335, file: !1123, line: 203, baseType: !929, size: 32, align: 32, offset: 1216)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1335, file: !1123, line: 205, baseType: !929, size: 32, align: 32, offset: 1248)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1335, file: !1123, line: 206, baseType: !929, size: 32, align: 32, offset: 1280)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1335, file: !1123, line: 209, baseType: !1294, size: 64, align: 64, offset: 1344)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1335, file: !1123, line: 212, baseType: !1294, size: 64, align: 64, offset: 1408)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1335, file: !1123, line: 213, baseType: !1318, size: 64, align: 64, offset: 1472)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1335, file: !1123, line: 215, baseType: !929, size: 32, align: 32, offset: 1536)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1335, file: !1123, line: 217, baseType: !929, size: 32, align: 32, offset: 1568)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1335, file: !1123, line: 220, baseType: !929, size: 32, align: 32, offset: 1600)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1058, file: !57, line: 1598, baseType: !937, size: 64, align: 64, offset: 384)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1058, file: !57, line: 1606, baseType: !926, size: 64, align: 64, offset: 448)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1058, file: !57, line: 1614, baseType: !929, size: 32, align: 32, offset: 512)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1058, file: !57, line: 1622, baseType: !929, size: 32, align: 32, offset: 544)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1058, file: !57, line: 1628, baseType: !929, size: 32, align: 32, offset: 576)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1058, file: !57, line: 1636, baseType: !929, size: 32, align: 32, offset: 608)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1058, file: !57, line: 1643, baseType: !929, size: 32, align: 32, offset: 640)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1058, file: !57, line: 1657, baseType: !1136, size: 64, align: 64, offset: 704)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1058, file: !57, line: 1658, baseType: !929, size: 32, align: 32, offset: 768)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1058, file: !57, line: 1679, baseType: !980, size: 64, align: 32, offset: 800)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1058, file: !57, line: 1688, baseType: !929, size: 32, align: 32, offset: 864)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1058, file: !57, line: 1712, baseType: !929, size: 32, align: 32, offset: 896)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1058, file: !57, line: 1729, baseType: !929, size: 32, align: 32, offset: 928)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1058, file: !57, line: 1729, baseType: !929, size: 32, align: 32, offset: 960)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1058, file: !57, line: 1744, baseType: !929, size: 32, align: 32, offset: 992)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1058, file: !57, line: 1744, baseType: !929, size: 32, align: 32, offset: 1024)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1058, file: !57, line: 1751, baseType: !929, size: 32, align: 32, offset: 1056)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1058, file: !57, line: 1766, baseType: !516, size: 32, align: 32, offset: 1088)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1058, file: !57, line: 1791, baseType: !1482, size: 64, align: 64, offset: 1152)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64, align: 64)
!1483 = !DISubroutineType(types: !1484)
!1484 = !{null, !1057, !1218, !1300, !929, !929, !929}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1058, file: !57, line: 1808, baseType: !1486, size: 64, align: 64, offset: 1216)
!1486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1487, size: 64, align: 64)
!1487 = !DISubroutineType(types: !1488)
!1488 = !{!516, !1057, !1079}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1058, file: !57, line: 1816, baseType: !929, size: 32, align: 32, offset: 1280)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1058, file: !57, line: 1825, baseType: !1491, size: 32, align: 32, offset: 1312)
!1491 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1058, file: !57, line: 1830, baseType: !929, size: 32, align: 32, offset: 1344)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1058, file: !57, line: 1838, baseType: !1491, size: 32, align: 32, offset: 1376)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1058, file: !57, line: 1846, baseType: !929, size: 32, align: 32, offset: 1408)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1058, file: !57, line: 1851, baseType: !929, size: 32, align: 32, offset: 1440)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1058, file: !57, line: 1861, baseType: !1491, size: 32, align: 32, offset: 1472)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1058, file: !57, line: 1868, baseType: !1491, size: 32, align: 32, offset: 1504)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1058, file: !57, line: 1875, baseType: !1491, size: 32, align: 32, offset: 1536)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1058, file: !57, line: 1882, baseType: !1491, size: 32, align: 32, offset: 1568)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1058, file: !57, line: 1889, baseType: !1491, size: 32, align: 32, offset: 1600)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1058, file: !57, line: 1896, baseType: !1491, size: 32, align: 32, offset: 1632)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1058, file: !57, line: 1903, baseType: !1491, size: 32, align: 32, offset: 1664)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1058, file: !57, line: 1910, baseType: !929, size: 32, align: 32, offset: 1696)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1058, file: !57, line: 1915, baseType: !929, size: 32, align: 32, offset: 1728)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1058, file: !57, line: 1926, baseType: !1300, size: 64, align: 64, offset: 1792)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1058, file: !57, line: 1935, baseType: !980, size: 64, align: 32, offset: 1856)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1058, file: !57, line: 1942, baseType: !929, size: 32, align: 32, offset: 1920)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1058, file: !57, line: 1948, baseType: !929, size: 32, align: 32, offset: 1952)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1058, file: !57, line: 1954, baseType: !929, size: 32, align: 32, offset: 1984)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1058, file: !57, line: 1960, baseType: !929, size: 32, align: 32, offset: 2016)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1058, file: !57, line: 1984, baseType: !929, size: 32, align: 32, offset: 2048)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1058, file: !57, line: 1991, baseType: !929, size: 32, align: 32, offset: 2080)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1058, file: !57, line: 1996, baseType: !929, size: 32, align: 32, offset: 2112)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1058, file: !57, line: 2004, baseType: !929, size: 32, align: 32, offset: 2144)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1058, file: !57, line: 2011, baseType: !929, size: 32, align: 32, offset: 2176)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1058, file: !57, line: 2018, baseType: !929, size: 32, align: 32, offset: 2208)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1058, file: !57, line: 2027, baseType: !929, size: 32, align: 32, offset: 2240)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1058, file: !57, line: 2034, baseType: !929, size: 32, align: 32, offset: 2272)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1058, file: !57, line: 2044, baseType: !929, size: 32, align: 32, offset: 2304)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1058, file: !57, line: 2054, baseType: !1521, size: 64, align: 64, offset: 2368)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1058, file: !57, line: 2061, baseType: !1521, size: 64, align: 64, offset: 2432)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1058, file: !57, line: 2066, baseType: !929, size: 32, align: 32, offset: 2496)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1058, file: !57, line: 2070, baseType: !929, size: 32, align: 32, offset: 2528)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1058, file: !57, line: 2078, baseType: !929, size: 32, align: 32, offset: 2560)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1058, file: !57, line: 2085, baseType: !929, size: 32, align: 32, offset: 2592)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1058, file: !57, line: 2092, baseType: !929, size: 32, align: 32, offset: 2624)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1058, file: !57, line: 2099, baseType: !929, size: 32, align: 32, offset: 2656)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1058, file: !57, line: 2106, baseType: !929, size: 32, align: 32, offset: 2688)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1058, file: !57, line: 2113, baseType: !929, size: 32, align: 32, offset: 2720)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1058, file: !57, line: 2120, baseType: !929, size: 32, align: 32, offset: 2752)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1058, file: !57, line: 2125, baseType: !929, size: 32, align: 32, offset: 2784)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1058, file: !57, line: 2133, baseType: !929, size: 32, align: 32, offset: 2816)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1058, file: !57, line: 2140, baseType: !929, size: 32, align: 32, offset: 2848)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1058, file: !57, line: 2145, baseType: !929, size: 32, align: 32, offset: 2880)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1058, file: !57, line: 2153, baseType: !929, size: 32, align: 32, offset: 2912)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1058, file: !57, line: 2158, baseType: !929, size: 32, align: 32, offset: 2944)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1058, file: !57, line: 2166, baseType: !809, size: 32, align: 32, offset: 2976)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1058, file: !57, line: 2173, baseType: !827, size: 32, align: 32, offset: 3008)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1058, file: !57, line: 2180, baseType: !851, size: 32, align: 32, offset: 3040)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1058, file: !57, line: 2187, baseType: !803, size: 32, align: 32, offset: 3072)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1058, file: !57, line: 2194, baseType: !870, size: 32, align: 32, offset: 3104)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1058, file: !57, line: 2203, baseType: !929, size: 32, align: 32, offset: 3136)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1058, file: !57, line: 2209, baseType: !880, size: 32, align: 32, offset: 3168)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1058, file: !57, line: 2212, baseType: !929, size: 32, align: 32, offset: 3200)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1058, file: !57, line: 2213, baseType: !929, size: 32, align: 32, offset: 3232)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1058, file: !57, line: 2220, baseType: !716, size: 32, align: 32, offset: 3264)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1058, file: !57, line: 2232, baseType: !929, size: 32, align: 32, offset: 3296)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1058, file: !57, line: 2243, baseType: !929, size: 32, align: 32, offset: 3328)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1058, file: !57, line: 2249, baseType: !929, size: 32, align: 32, offset: 3360)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1058, file: !57, line: 2256, baseType: !929, size: 32, align: 32, offset: 3392)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1058, file: !57, line: 2263, baseType: !1090, size: 64, align: 64, offset: 3456)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1058, file: !57, line: 2270, baseType: !1090, size: 64, align: 64, offset: 3520)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1058, file: !57, line: 2277, baseType: !888, size: 32, align: 32, offset: 3584)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1058, file: !57, line: 2285, baseType: !716, size: 32, align: 32, offset: 3616)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1058, file: !57, line: 2367, baseType: !1557, size: 64, align: 64, offset: 3648)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64, align: 64)
!1558 = !DISubroutineType(types: !1559)
!1559 = !{!929, !1057, !1318, !929}
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1058, file: !57, line: 2383, baseType: !929, size: 32, align: 32, offset: 3712)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1058, file: !57, line: 2386, baseType: !1491, size: 32, align: 32, offset: 3744)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1058, file: !57, line: 2387, baseType: !1491, size: 32, align: 32, offset: 3776)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1058, file: !57, line: 2394, baseType: !929, size: 32, align: 32, offset: 3808)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1058, file: !57, line: 2401, baseType: !929, size: 32, align: 32, offset: 3840)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1058, file: !57, line: 2408, baseType: !929, size: 32, align: 32, offset: 3872)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1058, file: !57, line: 2415, baseType: !929, size: 32, align: 32, offset: 3904)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1058, file: !57, line: 2422, baseType: !929, size: 32, align: 32, offset: 3936)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1058, file: !57, line: 2423, baseType: !1569, size: 64, align: 64, offset: 3968)
!1569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1570, size: 64, align: 64)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !57, line: 831, baseType: !1571)
!1571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !57, line: 826, size: 128, align: 32, elements: !1572)
!1572 = !{!1573, !1574, !1575, !1576}
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1571, file: !57, line: 827, baseType: !929, size: 32, align: 32)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1571, file: !57, line: 828, baseType: !929, size: 32, align: 32, offset: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1571, file: !57, line: 829, baseType: !929, size: 32, align: 32, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1571, file: !57, line: 830, baseType: !1491, size: 32, align: 32, offset: 96)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1058, file: !57, line: 2430, baseType: !926, size: 64, align: 64, offset: 4032)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1058, file: !57, line: 2437, baseType: !926, size: 64, align: 64, offset: 4096)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1058, file: !57, line: 2444, baseType: !1491, size: 32, align: 32, offset: 4160)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1058, file: !57, line: 2451, baseType: !1491, size: 32, align: 32, offset: 4192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1058, file: !57, line: 2458, baseType: !929, size: 32, align: 32, offset: 4224)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1058, file: !57, line: 2469, baseType: !929, size: 32, align: 32, offset: 4256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1058, file: !57, line: 2475, baseType: !929, size: 32, align: 32, offset: 4288)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1058, file: !57, line: 2481, baseType: !929, size: 32, align: 32, offset: 4320)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1058, file: !57, line: 2485, baseType: !929, size: 32, align: 32, offset: 4352)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1058, file: !57, line: 2489, baseType: !929, size: 32, align: 32, offset: 4384)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1058, file: !57, line: 2493, baseType: !929, size: 32, align: 32, offset: 4416)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1058, file: !57, line: 2501, baseType: !929, size: 32, align: 32, offset: 4448)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1058, file: !57, line: 2506, baseType: !929, size: 32, align: 32, offset: 4480)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1058, file: !57, line: 2510, baseType: !929, size: 32, align: 32, offset: 4512)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1058, file: !57, line: 2514, baseType: !926, size: 64, align: 64, offset: 4544)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1058, file: !57, line: 2528, baseType: !1593, size: 64, align: 64, offset: 4608)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{null, !1057, !937, !929, !929}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1058, file: !57, line: 2534, baseType: !929, size: 32, align: 32, offset: 4672)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1058, file: !57, line: 2545, baseType: !929, size: 32, align: 32, offset: 4704)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1058, file: !57, line: 2547, baseType: !929, size: 32, align: 32, offset: 4736)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1058, file: !57, line: 2549, baseType: !929, size: 32, align: 32, offset: 4768)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1058, file: !57, line: 2551, baseType: !929, size: 32, align: 32, offset: 4800)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1058, file: !57, line: 2553, baseType: !929, size: 32, align: 32, offset: 4832)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1058, file: !57, line: 2555, baseType: !929, size: 32, align: 32, offset: 4864)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1058, file: !57, line: 2557, baseType: !929, size: 32, align: 32, offset: 4896)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1058, file: !57, line: 2559, baseType: !929, size: 32, align: 32, offset: 4928)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1058, file: !57, line: 2563, baseType: !929, size: 32, align: 32, offset: 4960)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1058, file: !57, line: 2571, baseType: !1176, size: 64, align: 64, offset: 4992)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1058, file: !57, line: 2579, baseType: !1176, size: 64, align: 64, offset: 5056)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1058, file: !57, line: 2586, baseType: !929, size: 32, align: 32, offset: 5120)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1058, file: !57, line: 2615, baseType: !929, size: 32, align: 32, offset: 5152)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1058, file: !57, line: 2627, baseType: !929, size: 32, align: 32, offset: 5184)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1058, file: !57, line: 2637, baseType: !929, size: 32, align: 32, offset: 5216)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1058, file: !57, line: 2681, baseType: !929, size: 32, align: 32, offset: 5248)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1058, file: !57, line: 2709, baseType: !926, size: 64, align: 64, offset: 5312)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1058, file: !57, line: 2716, baseType: !1615, size: 64, align: 64, offset: 5376)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64, align: 64)
!1616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !57, line: 3636, size: 896, align: 64, elements: !1618)
!1618 = !{!1619, !1620, !1621, !1622, !1623, !1624, !1625, !1629, !1633, !1634, !1635, !1636, !1641, !1642, !1643, !1644, !1645}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1617, file: !57, line: 3642, baseType: !956, size: 64, align: 64)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1617, file: !57, line: 3649, baseType: !46, size: 32, align: 32, offset: 64)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1617, file: !57, line: 3656, baseType: !56, size: 32, align: 32, offset: 96)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1617, file: !57, line: 3663, baseType: !516, size: 32, align: 32, offset: 128)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1617, file: !57, line: 3669, baseType: !929, size: 32, align: 32, offset: 160)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1617, file: !57, line: 3682, baseType: !1315, size: 64, align: 64, offset: 192)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1617, file: !57, line: 3698, baseType: !1626, size: 64, align: 64, offset: 256)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!929, !1110, !1044, !935}
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1617, file: !57, line: 3712, baseType: !1630, size: 64, align: 64, offset: 320)
!1630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1631, size: 64, align: 64)
!1631 = !DISubroutineType(types: !1632)
!1632 = !{!929, !1110, !929, !1044, !935}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1617, file: !57, line: 3726, baseType: !1626, size: 64, align: 64, offset: 384)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1617, file: !57, line: 3737, baseType: !1107, size: 64, align: 64, offset: 448)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1617, file: !57, line: 3746, baseType: !929, size: 32, align: 32, offset: 512)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1617, file: !57, line: 3757, baseType: !1637, size: 64, align: 64, offset: 576)
!1637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1638, size: 64, align: 64)
!1638 = !DISubroutineType(types: !1639)
!1639 = !{null, !1640}
!1640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64, align: 64)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1617, file: !57, line: 3766, baseType: !1107, size: 64, align: 64, offset: 640)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1617, file: !57, line: 3774, baseType: !1107, size: 64, align: 64, offset: 704)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1617, file: !57, line: 3780, baseType: !929, size: 32, align: 32, offset: 768)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1617, file: !57, line: 3785, baseType: !929, size: 32, align: 32, offset: 800)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1617, file: !57, line: 3795, baseType: !1646, size: 64, align: 64, offset: 832)
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!929, !1110, !1189}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1058, file: !57, line: 2728, baseType: !937, size: 64, align: 64, offset: 5440)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1058, file: !57, line: 2735, baseType: !1242, size: 512, align: 64, offset: 5504)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1058, file: !57, line: 2742, baseType: !929, size: 32, align: 32, offset: 6016)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1058, file: !57, line: 2755, baseType: !929, size: 32, align: 32, offset: 6048)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1058, file: !57, line: 2776, baseType: !929, size: 32, align: 32, offset: 6080)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1058, file: !57, line: 2783, baseType: !929, size: 32, align: 32, offset: 6112)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1058, file: !57, line: 2791, baseType: !929, size: 32, align: 32, offset: 6144)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1058, file: !57, line: 2802, baseType: !1318, size: 64, align: 64, offset: 6208)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1058, file: !57, line: 2811, baseType: !929, size: 32, align: 32, offset: 6272)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1058, file: !57, line: 2821, baseType: !929, size: 32, align: 32, offset: 6304)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1058, file: !57, line: 2830, baseType: !929, size: 32, align: 32, offset: 6336)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1058, file: !57, line: 2840, baseType: !929, size: 32, align: 32, offset: 6368)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1058, file: !57, line: 2851, baseType: !1662, size: 64, align: 64, offset: 6400)
!1662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1663, size: 64, align: 64)
!1663 = !DISubroutineType(types: !1664)
!1664 = !{!929, !1057, !1665, !937, !1300, !929, !929}
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DISubroutineType(types: !1667)
!1667 = !{!929, !1057, !937}
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1058, file: !57, line: 2871, baseType: !1669, size: 64, align: 64, offset: 6464)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64, align: 64)
!1670 = !DISubroutineType(types: !1671)
!1671 = !{!929, !1057, !1672, !937, !1300, !929}
!1672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1673, size: 64, align: 64)
!1673 = !DISubroutineType(types: !1674)
!1674 = !{!929, !1057, !937, !929, !929}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1058, file: !57, line: 2878, baseType: !929, size: 32, align: 32, offset: 6528)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1058, file: !57, line: 2885, baseType: !929, size: 32, align: 32, offset: 6560)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1058, file: !57, line: 3005, baseType: !929, size: 32, align: 32, offset: 6592)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1058, file: !57, line: 3013, baseType: !900, size: 32, align: 32, offset: 6624)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1058, file: !57, line: 3020, baseType: !900, size: 32, align: 32, offset: 6656)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1058, file: !57, line: 3027, baseType: !900, size: 32, align: 32, offset: 6688)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1058, file: !57, line: 3037, baseType: !1136, size: 64, align: 64, offset: 6720)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1058, file: !57, line: 3038, baseType: !929, size: 32, align: 32, offset: 6784)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1058, file: !57, line: 3050, baseType: !1090, size: 64, align: 64, offset: 6848)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1058, file: !57, line: 3065, baseType: !929, size: 32, align: 32, offset: 6912)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1058, file: !57, line: 3083, baseType: !929, size: 32, align: 32, offset: 6944)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1058, file: !57, line: 3092, baseType: !980, size: 64, align: 32, offset: 6976)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1058, file: !57, line: 3099, baseType: !516, size: 32, align: 32, offset: 7040)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1058, file: !57, line: 3106, baseType: !980, size: 64, align: 32, offset: 7072)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1058, file: !57, line: 3113, baseType: !1690, size: 64, align: 64, offset: 7168)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64, align: 64)
!1691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1692)
!1692 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !57, line: 740, baseType: !1693)
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !57, line: 712, size: 384, align: 64, elements: !1694)
!1694 = !{!1695, !1696, !1697, !1698, !1699, !1700, !1703}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1693, file: !57, line: 713, baseType: !56, size: 32, align: 32)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1693, file: !57, line: 714, baseType: !46, size: 32, align: 32, offset: 32)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1693, file: !57, line: 720, baseType: !956, size: 64, align: 64, offset: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1693, file: !57, line: 724, baseType: !956, size: 64, align: 64, offset: 128)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1693, file: !57, line: 728, baseType: !929, size: 32, align: 32, offset: 192)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1693, file: !57, line: 734, baseType: !1701, size: 64, align: 64, offset: 256)
!1701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1702, size: 64, align: 64)
!1702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
