; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aacdec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--aacdec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVProfile = type { i32, i8* }

!965 = !DIEnumerator(name: "AOT_SBR", value: 5)
!966 = !DIEnumerator(name: "AOT_AAC_SCALABLE", value: 6)
!967 = !DIEnumerator(name: "AOT_TWINVQ", value: 7)
!968 = !DIEnumerator(name: "AOT_CELP", value: 8)
!969 = !DIEnumerator(name: "AOT_HVXC", value: 9)
!970 = !DIEnumerator(name: "AOT_TTSI", value: 12)
!971 = !DIEnumerator(name: "AOT_MAINSYNTH", value: 13)
!972 = !DIEnumerator(name: "AOT_WAVESYNTH", value: 14)
!973 = !DIEnumerator(name: "AOT_MIDI", value: 15)
!974 = !DIEnumerator(name: "AOT_SAFX", value: 16)
!975 = !DIEnumerator(name: "AOT_ER_AAC_LC", value: 17)
!976 = !DIEnumerator(name: "AOT_ER_AAC_LTP", value: 19)
!977 = !DIEnumerator(name: "AOT_ER_AAC_SCALABLE", value: 20)
!978 = !DIEnumerator(name: "AOT_ER_TWINVQ", value: 21)
!979 = !DIEnumerator(name: "AOT_ER_BSAC", value: 22)
!980 = !DIEnumerator(name: "AOT_ER_AAC_LD", value: 23)
!981 = !DIEnumerator(name: "AOT_ER_CELP", value: 24)
!982 = !DIEnumerator(name: "AOT_ER_HVXC", value: 25)
!983 = !DIEnumerator(name: "AOT_ER_HILN", value: 26)
!984 = !DIEnumerator(name: "AOT_ER_PARAM", value: 27)
!985 = !DIEnumerator(name: "AOT_SSC", value: 28)
!986 = !DIEnumerator(name: "AOT_PS", value: 29)
!987 = !DIEnumerator(name: "AOT_SURROUND", value: 30)
!988 = !DIEnumerator(name: "AOT_ESCAPE", value: 31)
!989 = !DIEnumerator(name: "AOT_L1", value: 32)
!990 = !DIEnumerator(name: "AOT_L2", value: 33)
!991 = !DIEnumerator(name: "AOT_L3", value: 34)
!992 = !DIEnumerator(name: "AOT_DST", value: 35)
!993 = !DIEnumerator(name: "AOT_ALS", value: 36)
!994 = !DIEnumerator(name: "AOT_SLS", value: 37)
!995 = !DIEnumerator(name: "AOT_SLS_NON_CORE", value: 38)
!996 = !DIEnumerator(name: "AOT_ER_AAC_ELD", value: 39)
!997 = !DIEnumerator(name: "AOT_SMR_SIMPLE", value: 40)
!998 = !DIEnumerator(name: "AOT_SMR_MAIN", value: 41)
!999 = !DIEnumerator(name: "AOT_USAC_NOSBR", value: 42)
!1000 = !DIEnumerator(name: "AOT_SAOC", value: 43)
!1001 = !DIEnumerator(name: "AOT_LD_SURROUND", value: 44)
!1002 = !DIEnumerator(name: "AOT_USAC", value: 45)
!1003 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ChannelPosition", file: !910, line: 94, size: 32, align: 32, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009, !1010}
!1005 = !DIEnumerator(name: "AAC_CHANNEL_OFF", value: 0)
!1006 = !DIEnumerator(name: "AAC_CHANNEL_FRONT", value: 1)
!1007 = !DIEnumerator(name: "AAC_CHANNEL_SIDE", value: 2)
!1008 = !DIEnumerator(name: "AAC_CHANNEL_BACK", value: 3)
!1009 = !DIEnumerator(name: "AAC_CHANNEL_LFE", value: 4)
!1010 = !DIEnumerator(name: "AAC_CHANNEL_CC", value: 5)
!1011 = !{!1012, !1013, !1014, !1017, !1016, !1018, !1020, !1021, !1029, !1031, !1032, !1027, !1033, !1034, !1036}
!1012 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!1013 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINTFLOAT", file: !1015, line: 87, baseType: !1016)
!1015 = !DIFile(filename: "libavcodec/aac_defines.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1016 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "INTFLOAT", file: !1015, line: 86, baseType: !1016)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "LPC_TYPE_U", file: !1019, line: 127, baseType: !1016)
!1019 = !DIFile(filename: "libavcodec/lpc.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64, align: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !1024, line: 221, size: 32, align: 8, elements: !1025)
!1024 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !1023, file: !1024, line: 221, baseType: !1027, size: 32, align: 32)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1028, line: 51, baseType: !1013)
!1028 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1028, line: 48, baseType: !1030)
!1030 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64, align: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "AAC_SIGNE", file: !1015, line: 91, baseType: !1013)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1027)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64, align: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1039)
!1039 = !{!1040, !1045, !1047, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1062, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1095, !1097, !1098, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1131, !1132, !1133, !1134, !1135, !1136, !1139, !1140, !1141, !1142}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1038, file: !744, line: 282, baseType: !1041, size: 512, align: 64)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 512, align: 64, elements: !1043)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64, align: 64)
!1043 = !{!1044}
!1044 = !DISubrange(count: 8)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1038, file: !744, line: 299, baseType: !1046, size: 256, align: 32, offset: 512)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 256, align: 32, elements: !1043)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1038, file: !744, line: 315, baseType: !1048, size: 64, align: 64, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1038, file: !744, line: 326, baseType: !1012, size: 32, align: 32, offset: 832)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1038, file: !744, line: 326, baseType: !1012, size: 32, align: 32, offset: 864)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1038, file: !744, line: 334, baseType: !1012, size: 32, align: 32, offset: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1038, file: !744, line: 341, baseType: !1012, size: 32, align: 32, offset: 928)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1038, file: !744, line: 346, baseType: !1012, size: 32, align: 32, offset: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1038, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1038, file: !744, line: 356, baseType: !1056, size: 64, align: 32, offset: 1024)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1057, line: 61, baseType: !1058)
!1057 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1057, line: 58, size: 64, align: 32, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1058, file: !1057, line: 59, baseType: !1012, size: 32, align: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1058, file: !1057, line: 60, baseType: !1012, size: 32, align: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1038, file: !744, line: 361, baseType: !1063, size: 64, align: 64, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1028, line: 40, baseType: !1064)
!1064 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1038, file: !744, line: 369, baseType: !1063, size: 64, align: 64, offset: 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1038, file: !744, line: 377, baseType: !1063, size: 64, align: 64, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1038, file: !744, line: 382, baseType: !1012, size: 32, align: 32, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1038, file: !744, line: 386, baseType: !1012, size: 32, align: 32, offset: 1312)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1038, file: !744, line: 391, baseType: !1012, size: 32, align: 32, offset: 1344)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1038, file: !744, line: 396, baseType: !1020, size: 64, align: 64, offset: 1408)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1038, file: !744, line: 403, baseType: !1072, size: 512, align: 64, offset: 1472)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 512, align: 64, elements: !1043)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1028, line: 55, baseType: !1074)
!1074 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1038, file: !744, line: 410, baseType: !1012, size: 32, align: 32, offset: 1984)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1038, file: !744, line: 415, baseType: !1012, size: 32, align: 32, offset: 2016)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1038, file: !744, line: 420, baseType: !1012, size: 32, align: 32, offset: 2048)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1038, file: !744, line: 425, baseType: !1012, size: 32, align: 32, offset: 2080)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1038, file: !744, line: 435, baseType: !1063, size: 64, align: 64, offset: 2112)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1038, file: !744, line: 440, baseType: !1012, size: 32, align: 32, offset: 2176)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1038, file: !744, line: 445, baseType: !1073, size: 64, align: 64, offset: 2240)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1038, file: !744, line: 459, baseType: !1083, size: 512, align: 64, offset: 2304)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 512, align: 64, elements: !1043)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64, align: 64)
!1085 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1086, line: 94, baseType: !1087)
!1086 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1086, line: 81, size: 192, align: 64, elements: !1088)
!1088 = !{!1089, !1093, !1094}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1087, file: !1086, line: 82, baseType: !1090, size: 64, align: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64, align: 64)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1086, line: 73, baseType: !1092)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1086, line: 73, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1087, file: !1086, line: 89, baseType: !1042, size: 64, align: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1087, file: !1086, line: 93, baseType: !1012, size: 32, align: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1038, file: !744, line: 473, baseType: !1096, size: 64, align: 64, offset: 2816)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64, align: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1038, file: !744, line: 477, baseType: !1012, size: 32, align: 32, offset: 2880)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1038, file: !744, line: 479, baseType: !1099, size: 64, align: 64, offset: 2944)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107, !1112}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1102, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1102, file: !744, line: 203, baseType: !1042, size: 64, align: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1102, file: !744, line: 204, baseType: !1012, size: 32, align: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1102, file: !744, line: 205, baseType: !1108, size: 64, align: 64, offset: 192)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64, align: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1110, line: 86, baseType: !1111)
!1110 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1110, line: 86, flags: DIFlagFwdDecl)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1102, file: !744, line: 206, baseType: !1084, size: 64, align: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1038, file: !744, line: 480, baseType: !1012, size: 32, align: 32, offset: 3008)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1038, file: !744, line: 505, baseType: !1012, size: 32, align: 32, offset: 3040)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1038, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1038, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1038, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1038, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1038, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1038, file: !744, line: 532, baseType: !1063, size: 64, align: 64, offset: 3264)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1038, file: !744, line: 539, baseType: !1063, size: 64, align: 64, offset: 3328)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1038, file: !744, line: 547, baseType: !1063, size: 64, align: 64, offset: 3392)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1038, file: !744, line: 554, baseType: !1108, size: 64, align: 64, offset: 3456)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1038, file: !744, line: 563, baseType: !1012, size: 32, align: 32, offset: 3520)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1038, file: !744, line: 572, baseType: !1012, size: 32, align: 32, offset: 3552)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1038, file: !744, line: 581, baseType: !1012, size: 32, align: 32, offset: 3584)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1038, file: !744, line: 588, baseType: !1128, size: 64, align: 64, offset: 3648)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64, align: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1028, line: 36, baseType: !1130)
!1130 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1038, file: !744, line: 593, baseType: !1012, size: 32, align: 32, offset: 3712)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1038, file: !744, line: 596, baseType: !1012, size: 32, align: 32, offset: 3744)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1038, file: !744, line: 599, baseType: !1084, size: 64, align: 64, offset: 3776)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1038, file: !744, line: 605, baseType: !1084, size: 64, align: 64, offset: 3840)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1038, file: !744, line: 616, baseType: !1084, size: 64, align: 64, offset: 3904)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1038, file: !744, line: 626, baseType: !1137, size: 64, align: 64, offset: 3968)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1138, line: 216, baseType: !1074)
!1138 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1038, file: !744, line: 627, baseType: !1137, size: 64, align: 64, offset: 4032)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1038, file: !744, line: 628, baseType: !1137, size: 64, align: 64, offset: 4096)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1038, file: !744, line: 629, baseType: !1137, size: 64, align: 64, offset: 4160)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1038, file: !744, line: 645, baseType: !1084, size: 64, align: 64, offset: 4224)
!1143 = !{!1144, !1796, !1797, !1802, !1804, !1810, !1813, !1824, !1828, !1832, !1836, !1840, !1844, !1848, !1852, !1856, !1860, !1864, !1868, !1883, !1888, !1889, !1892, !1897, !1900, !1904, !1905, !1907, !1909, !1910, !2055}
!1144 = distinct !DIGlobalVariable(name: "ff_aac_decoder", scope: !0, file: !1145, line: 551, type: !1146, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_aac_decoder)
!1145 = !DIFile(filename: "libavcodec/aacdec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !1147)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !1148)
!1148 = !{!1149, !1153, !1154, !1155, !1156, !1157, !1160, !1163, !1166, !1169, !1172, !1173, !1246, !1254, !1255, !1256, !1258, !1711, !1717, !1725, !1729, !1730, !1767, !1771, !1775, !1776, !1780, !1784, !1785, !1789, !1790, !1791}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1147, file: !14, line: 3475, baseType: !1150, size: 64, align: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64, align: 64)
!1151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1152)
!1152 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1147, file: !14, line: 3480, baseType: !1150, size: 64, align: 64, offset: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1147, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1147, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1147, file: !14, line: 3487, baseType: !1012, size: 32, align: 32, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1147, file: !14, line: 3488, baseType: !1158, size: 64, align: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1056)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1147, file: !14, line: 3489, baseType: !1161, size: 64, align: 64, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64, align: 64)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1147, file: !14, line: 3490, baseType: !1164, size: 64, align: 64, offset: 384)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64, align: 64)
!1165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1147, file: !14, line: 3491, baseType: !1167, size: 64, align: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64, align: 64)
!1168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1147, file: !14, line: 3492, baseType: !1170, size: 64, align: 64, offset: 512)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64, align: 64)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1073)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1147, file: !14, line: 3493, baseType: !1029, size: 8, align: 8, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1147, file: !14, line: 3494, baseType: !1174, size: 64, align: 64, offset: 640)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1176)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1184, !1205, !1206, !1207, !1208, !1212, !1218, !1220, !1224}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !1177, file: !713, line: 72, baseType: !1150, size: 64, align: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !1177, file: !713, line: 78, baseType: !1181, size: 64, align: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64, align: 64)
!1182 = !DISubroutineType(types: !1183)
!1183 = !{!1150, !1020}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !1177, file: !713, line: 85, baseType: !1185, size: 64, align: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !1188)
!1188 = !{!1189, !1190, !1191, !1192, !1193, !1201, !1202, !1203, !1204}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1187, file: !691, line: 247, baseType: !1150, size: 64, align: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !1187, file: !691, line: 253, baseType: !1150, size: 64, align: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1187, file: !691, line: 259, baseType: !1012, size: 32, align: 32, offset: 128)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1187, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !1187, file: !691, line: 271, baseType: !1194, size: 64, align: 64, offset: 192)
!1194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1187, file: !691, line: 265, size: 64, align: 64, elements: !1195)
!1195 = !{!1196, !1197, !1199, !1200}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !1194, file: !691, line: 266, baseType: !1063, size: 64, align: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !1194, file: !691, line: 267, baseType: !1198, size: 64, align: 64)
!1198 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1194, file: !691, line: 268, baseType: !1150, size: 64, align: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1194, file: !691, line: 270, baseType: !1056, size: 64, align: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !1187, file: !691, line: 272, baseType: !1198, size: 64, align: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !1187, file: !691, line: 273, baseType: !1198, size: 64, align: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1187, file: !691, line: 275, baseType: !1012, size: 32, align: 32, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !1187, file: !691, line: 300, baseType: !1150, size: 64, align: 64, offset: 448)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1177, file: !713, line: 93, baseType: !1012, size: 32, align: 32, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !1177, file: !713, line: 99, baseType: !1012, size: 32, align: 32, offset: 224)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !1177, file: !713, line: 108, baseType: !1012, size: 32, align: 32, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !1177, file: !713, line: 113, baseType: !1209, size: 64, align: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!1020, !1020, !1020}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !1177, file: !713, line: 123, baseType: !1213, size: 64, align: 64, offset: 384)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64, align: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{!1216, !1216}
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64, align: 64)
!1217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1177)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !1177, file: !713, line: 130, baseType: !1219, size: 32, align: 32, offset: 448)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !1177, file: !713, line: 136, baseType: !1221, size: 64, align: 64, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64, align: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!1219, !1020}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !1177, file: !713, line: 142, baseType: !1225, size: 64, align: 64, offset: 576)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64, align: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!1012, !1228, !1020, !1150, !1012}
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64, align: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64, align: 64)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1231)
!1231 = !{!1232, !1244, !1245}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1230, file: !691, line: 360, baseType: !1233, size: 64, align: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64, align: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1236)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1243}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1236, file: !691, line: 307, baseType: !1150, size: 64, align: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1236, file: !691, line: 313, baseType: !1198, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1236, file: !691, line: 313, baseType: !1198, size: 64, align: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1236, file: !691, line: 318, baseType: !1198, size: 64, align: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1236, file: !691, line: 318, baseType: !1198, size: 64, align: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1236, file: !691, line: 323, baseType: !1012, size: 32, align: 32, offset: 320)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1230, file: !691, line: 364, baseType: !1012, size: 32, align: 32, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1230, file: !691, line: 368, baseType: !1012, size: 32, align: 32, offset: 96)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1147, file: !14, line: 3495, baseType: !1247, size: 64, align: 64, offset: 704)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64, align: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1249)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1250)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1251)
!1251 = !{!1252, !1253}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1250, file: !14, line: 3402, baseType: !1012, size: 32, align: 32)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1250, file: !14, line: 3403, baseType: !1150, size: 64, align: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1147, file: !14, line: 3507, baseType: !1150, size: 64, align: 64, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1147, file: !14, line: 3516, baseType: !1012, size: 32, align: 32, offset: 832)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1147, file: !14, line: 3517, baseType: !1257, size: 64, align: 64, offset: 896)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64, align: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1147, file: !14, line: 3527, baseType: !1259, size: 64, align: 64, offset: 960)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{!1012, !1262}
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64, align: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1272, !1273, !1274, !1275, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1458, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1582, !1583, !1584, !1585, !1586, !1587, !1588, !1589, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1649, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1264, file: !14, line: 1561, baseType: !1174, size: 64, align: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1264, file: !14, line: 1562, baseType: !1012, size: 32, align: 32, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1264, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1264, file: !14, line: 1565, baseType: !1270, size: 64, align: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64, align: 64)
!1271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1147)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1264, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1264, file: !14, line: 1581, baseType: !1013, size: 32, align: 32, offset: 224)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1264, file: !14, line: 1583, baseType: !1020, size: 64, align: 64, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1264, file: !14, line: 1591, baseType: !1276, size: 64, align: 64, offset: 320)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64, align: 64)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !1278, line: 129, size: 1664, align: 64, elements: !1279)
!1278 = !DIFile(filename: "libavcodec/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1279 = !{!1280, !1281, !1282, !1283, !1284, !1305, !1306, !1335, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "is_copy", scope: !1277, file: !1278, line: 136, baseType: !1012, size: 32, align: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_progress", scope: !1277, file: !1278, line: 151, baseType: !1012, size: 32, align: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "last_audio_frame", scope: !1277, file: !1278, line: 157, baseType: !1012, size: 32, align: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "to_free", scope: !1277, file: !1278, line: 159, baseType: !1036, size: 64, align: 64, offset: 128)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !1277, file: !1278, line: 161, baseType: !1285, size: 64, align: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64, align: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "FramePool", file: !1278, line: 117, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FramePool", file: !1278, line: 100, size: 832, align: 64, elements: !1288)
!1288 = !{!1289, !1296, !1297, !1298, !1299, !1300, !1302, !1303, !1304}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "pools", scope: !1287, file: !1278, line: 105, baseType: !1290, size: 256, align: 64)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1291, size: 256, align: 64, elements: !1294)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64, align: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !1086, line: 238, baseType: !1293)
!1293 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !1086, line: 238, flags: DIFlagFwdDecl)
!1294 = !{!1295}
!1295 = !DISubrange(count: 4)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1287, file: !1278, line: 110, baseType: !1012, size: 32, align: 32, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1287, file: !1278, line: 111, baseType: !1012, size: 32, align: 32, offset: 288)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1287, file: !1278, line: 111, baseType: !1012, size: 32, align: 32, offset: 320)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "stride_align", scope: !1287, file: !1278, line: 112, baseType: !1046, size: 256, align: 32, offset: 352)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1287, file: !1278, line: 113, baseType: !1301, size: 128, align: 32, offset: 608)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1012, size: 128, align: 32, elements: !1294)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "planes", scope: !1287, file: !1278, line: 114, baseType: !1012, size: 32, align: 32, offset: 736)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1287, file: !1278, line: 115, baseType: !1012, size: 32, align: 32, offset: 768)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "samples", scope: !1287, file: !1278, line: 116, baseType: !1012, size: 32, align: 32, offset: 800)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "thread_ctx", scope: !1277, file: !1278, line: 163, baseType: !1020, size: 64, align: 64, offset: 256)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "ds", scope: !1277, file: !1278, line: 165, baseType: !1307, size: 128, align: 64, offset: 320)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeSimpleContext", file: !1278, line: 122, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeSimpleContext", file: !1278, line: 119, size: 128, align: 64, elements: !1309)
!1309 = !{!1310, !1334}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "in_pkt", scope: !1308, file: !1278, line: 120, baseType: !1311, size: 64, align: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64, align: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1330, !1331, !1332, !1333}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1313, file: !14, line: 1451, baseType: !1084, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1313, file: !14, line: 1461, baseType: !1063, size: 64, align: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1313, file: !14, line: 1467, baseType: !1063, size: 64, align: 64, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1313, file: !14, line: 1468, baseType: !1042, size: 64, align: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1313, file: !14, line: 1469, baseType: !1012, size: 32, align: 32, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1313, file: !14, line: 1470, baseType: !1012, size: 32, align: 32, offset: 288)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1313, file: !14, line: 1474, baseType: !1012, size: 32, align: 32, offset: 320)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1313, file: !14, line: 1479, baseType: !1323, size: 64, align: 64, offset: 384)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64, align: 64)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1325)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1326)
!1326 = !{!1327, !1328, !1329}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1325, file: !14, line: 1412, baseType: !1042, size: 64, align: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1325, file: !14, line: 1413, baseType: !1012, size: 32, align: 32, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1325, file: !14, line: 1414, baseType: !844, size: 32, align: 32, offset: 96)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1313, file: !14, line: 1480, baseType: !1012, size: 32, align: 32, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1313, file: !14, line: 1486, baseType: !1063, size: 64, align: 64, offset: 512)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1313, file: !14, line: 1488, baseType: !1063, size: 64, align: 64, offset: 576)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1313, file: !14, line: 1497, baseType: !1063, size: 64, align: 64, offset: 640)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "out_frame", scope: !1308, file: !1278, line: 121, baseType: !1036, size: 64, align: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1277, file: !1278, line: 166, baseType: !1336, size: 128, align: 64, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "DecodeFilterContext", file: !1278, line: 127, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeFilterContext", file: !1278, line: 124, size: 128, align: 64, elements: !1338)
!1338 = !{!1339, !1412}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1337, file: !1278, line: 125, baseType: !1340, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64, align: 64)
!1341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1342, size: 64, align: 64)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !14, line: 5794, baseType: !1343)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !14, line: 5747, size: 512, align: 64, elements: !1344)
!1344 = !{!1345, !1346, !1370, !1374, !1375, !1409, !1410, !1411}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1343, file: !14, line: 5751, baseType: !1174, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1343, file: !14, line: 5756, baseType: !1347, size: 64, align: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64, align: 64)
!1348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !14, line: 5796, size: 512, align: 64, elements: !1350)
!1350 = !{!1351, !1352, !1355, !1356, !1357, !1361, !1365, !1369}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1349, file: !14, line: 5797, baseType: !1150, size: 64, align: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !1349, file: !14, line: 5804, baseType: !1353, size: 64, align: 64, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64, align: 64)
!1354 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1349, file: !14, line: 5815, baseType: !1174, size: 64, align: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1349, file: !14, line: 5825, baseType: !1012, size: 32, align: 32, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1349, file: !14, line: 5826, baseType: !1358, size: 64, align: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64, align: 64)
!1359 = !DISubroutineType(types: !1360)
!1360 = !{!1012, !1341}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1349, file: !14, line: 5827, baseType: !1362, size: 64, align: 64, offset: 320)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64, align: 64)
!1363 = !DISubroutineType(types: !1364)
!1364 = !{!1012, !1341, !1311}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1349, file: !14, line: 5828, baseType: !1366, size: 64, align: 64, offset: 384)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DISubroutineType(types: !1368)
!1368 = !{null, !1341}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1349, file: !14, line: 5829, baseType: !1366, size: 64, align: 64, offset: 448)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1343, file: !14, line: 5762, baseType: !1371, size: 64, align: 64, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64, align: 64)
!1372 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !14, line: 5735, baseType: !1373)
!1373 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !14, line: 5735, flags: DIFlagFwdDecl)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1343, file: !14, line: 5768, baseType: !1020, size: 64, align: 64, offset: 192)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !1343, file: !14, line: 5775, baseType: !1376, size: 64, align: 64, offset: 256)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64, align: 64)
!1377 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !14, line: 4085, baseType: !1378)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !14, line: 3936, size: 1152, align: 64, elements: !1379)
!1379 = !{!1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1378, file: !14, line: 3940, baseType: !3, size: 32, align: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1378, file: !14, line: 3944, baseType: !13, size: 32, align: 32, offset: 32)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1378, file: !14, line: 3948, baseType: !1027, size: 32, align: 32, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1378, file: !14, line: 3958, baseType: !1042, size: 64, align: 64, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1378, file: !14, line: 3962, baseType: !1012, size: 32, align: 32, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1378, file: !14, line: 3968, baseType: !1012, size: 32, align: 32, offset: 224)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1378, file: !14, line: 3973, baseType: !1063, size: 64, align: 64, offset: 256)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1378, file: !14, line: 3986, baseType: !1012, size: 32, align: 32, offset: 320)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1378, file: !14, line: 3999, baseType: !1012, size: 32, align: 32, offset: 352)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1378, file: !14, line: 4004, baseType: !1012, size: 32, align: 32, offset: 384)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1378, file: !14, line: 4005, baseType: !1012, size: 32, align: 32, offset: 416)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1378, file: !14, line: 4010, baseType: !1012, size: 32, align: 32, offset: 448)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1378, file: !14, line: 4011, baseType: !1012, size: 32, align: 32, offset: 480)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1378, file: !14, line: 4020, baseType: !1056, size: 64, align: 32, offset: 512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1378, file: !14, line: 4025, baseType: !874, size: 32, align: 32, offset: 576)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1378, file: !14, line: 4030, baseType: !767, size: 32, align: 32, offset: 608)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1378, file: !14, line: 4031, baseType: !773, size: 32, align: 32, offset: 640)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1378, file: !14, line: 4032, baseType: !791, size: 32, align: 32, offset: 672)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !1378, file: !14, line: 4033, baseType: !815, size: 32, align: 32, offset: 704)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1378, file: !14, line: 4034, baseType: !834, size: 32, align: 32, offset: 736)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !1378, file: !14, line: 4039, baseType: !1012, size: 32, align: 32, offset: 768)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1378, file: !14, line: 4046, baseType: !1073, size: 64, align: 64, offset: 832)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1378, file: !14, line: 4050, baseType: !1012, size: 32, align: 32, offset: 896)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1378, file: !14, line: 4054, baseType: !1012, size: 32, align: 32, offset: 928)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1378, file: !14, line: 4061, baseType: !1012, size: 32, align: 32, offset: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1378, file: !14, line: 4065, baseType: !1012, size: 32, align: 32, offset: 992)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1378, file: !14, line: 4073, baseType: !1012, size: 32, align: 32, offset: 1024)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1378, file: !14, line: 4080, baseType: !1012, size: 32, align: 32, offset: 1056)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1378, file: !14, line: 4084, baseType: !1012, size: 32, align: 32, offset: 1088)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !1343, file: !14, line: 5781, baseType: !1376, size: 64, align: 64, offset: 320)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !1343, file: !14, line: 5787, baseType: !1056, size: 64, align: 32, offset: 384)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !1343, file: !14, line: 5793, baseType: !1056, size: 64, align: 32, offset: 448)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "nb_bsfs", scope: !1337, file: !1278, line: 126, baseType: !1012, size: 32, align: 32, offset: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "last_pkt_props", scope: !1277, file: !1278, line: 172, baseType: !1311, size: 64, align: 64, offset: 576)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer", scope: !1277, file: !1278, line: 177, baseType: !1042, size: 64, align: 64, offset: 640)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "byte_buffer_size", scope: !1277, file: !1278, line: 178, baseType: !1013, size: 32, align: 32, offset: 704)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "frame_thread_encoder", scope: !1277, file: !1278, line: 180, baseType: !1020, size: 64, align: 64, offset: 768)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples", scope: !1277, file: !1278, line: 185, baseType: !1012, size: 32, align: 32, offset: 832)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_priv_data", scope: !1277, file: !1278, line: 190, baseType: !1020, size: 64, align: 64, offset: 896)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "draining", scope: !1277, file: !1278, line: 195, baseType: !1012, size: 32, align: 32, offset: 960)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt", scope: !1277, file: !1278, line: 200, baseType: !1311, size: 64, align: 64, offset: 1024)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_pkt_valid", scope: !1277, file: !1278, line: 201, baseType: !1012, size: 32, align: 32, offset: 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_frame", scope: !1277, file: !1278, line: 202, baseType: !1036, size: 64, align: 64, offset: 1152)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "draining_done", scope: !1277, file: !1278, line: 203, baseType: !1012, size: 32, align: 32, offset: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode", scope: !1277, file: !1278, line: 205, baseType: !1012, size: 32, align: 32, offset: 1248)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_warned", scope: !1277, file: !1278, line: 206, baseType: !1012, size: 32, align: 32, offset: 1280)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_consumed", scope: !1277, file: !1278, line: 209, baseType: !1137, size: 64, align: 64, offset: 1344)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_partial_size", scope: !1277, file: !1278, line: 212, baseType: !1137, size: 64, align: 64, offset: 1408)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "compat_decode_frame", scope: !1277, file: !1278, line: 213, baseType: !1036, size: 64, align: 64, offset: 1472)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "showed_multi_packet_warning", scope: !1277, file: !1278, line: 215, baseType: !1012, size: 32, align: 32, offset: 1536)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "skip_samples_multiplier", scope: !1277, file: !1278, line: 217, baseType: !1012, size: 32, align: 32, offset: 1568)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nb_draining_errors", scope: !1277, file: !1278, line: 220, baseType: !1012, size: 32, align: 32, offset: 1600)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1264, file: !14, line: 1598, baseType: !1020, size: 64, align: 64, offset: 384)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1264, file: !14, line: 1606, baseType: !1063, size: 64, align: 64, offset: 448)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1264, file: !14, line: 1614, baseType: !1012, size: 32, align: 32, offset: 512)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1264, file: !14, line: 1622, baseType: !1012, size: 32, align: 32, offset: 544)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1264, file: !14, line: 1628, baseType: !1012, size: 32, align: 32, offset: 576)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1264, file: !14, line: 1636, baseType: !1012, size: 32, align: 32, offset: 608)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1264, file: !14, line: 1643, baseType: !1012, size: 32, align: 32, offset: 640)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1264, file: !14, line: 1657, baseType: !1042, size: 64, align: 64, offset: 704)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1264, file: !14, line: 1658, baseType: !1012, size: 32, align: 32, offset: 768)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1264, file: !14, line: 1679, baseType: !1056, size: 64, align: 32, offset: 800)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1264, file: !14, line: 1688, baseType: !1012, size: 32, align: 32, offset: 864)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1264, file: !14, line: 1712, baseType: !1012, size: 32, align: 32, offset: 896)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1264, file: !14, line: 1729, baseType: !1012, size: 32, align: 32, offset: 928)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1264, file: !14, line: 1729, baseType: !1012, size: 32, align: 32, offset: 960)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1264, file: !14, line: 1744, baseType: !1012, size: 32, align: 32, offset: 992)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1264, file: !14, line: 1744, baseType: !1012, size: 32, align: 32, offset: 1024)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1264, file: !14, line: 1751, baseType: !1012, size: 32, align: 32, offset: 1056)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1264, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1264, file: !14, line: 1791, baseType: !1451, size: 64, align: 64, offset: 1152)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64, align: 64)
!1452 = !DISubroutineType(types: !1453)
!1453 = !{null, !1454, !1455, !1457, !1012, !1012, !1012}
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64, align: 64)
!1456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1037)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64, align: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1264, file: !14, line: 1808, baseType: !1459, size: 64, align: 64, offset: 1216)
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64, align: 64)
!1460 = !DISubroutineType(types: !1461)
!1461 = !{!473, !1454, !1161}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1264, file: !14, line: 1816, baseType: !1012, size: 32, align: 32, offset: 1280)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1264, file: !14, line: 1825, baseType: !1016, size: 32, align: 32, offset: 1312)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1264, file: !14, line: 1830, baseType: !1012, size: 32, align: 32, offset: 1344)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1264, file: !14, line: 1838, baseType: !1016, size: 32, align: 32, offset: 1376)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1264, file: !14, line: 1846, baseType: !1012, size: 32, align: 32, offset: 1408)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1264, file: !14, line: 1851, baseType: !1012, size: 32, align: 32, offset: 1440)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1264, file: !14, line: 1861, baseType: !1016, size: 32, align: 32, offset: 1472)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1264, file: !14, line: 1868, baseType: !1016, size: 32, align: 32, offset: 1504)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1264, file: !14, line: 1875, baseType: !1016, size: 32, align: 32, offset: 1536)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1264, file: !14, line: 1882, baseType: !1016, size: 32, align: 32, offset: 1568)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1264, file: !14, line: 1889, baseType: !1016, size: 32, align: 32, offset: 1600)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1264, file: !14, line: 1896, baseType: !1016, size: 32, align: 32, offset: 1632)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1264, file: !14, line: 1903, baseType: !1016, size: 32, align: 32, offset: 1664)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1264, file: !14, line: 1910, baseType: !1012, size: 32, align: 32, offset: 1696)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1264, file: !14, line: 1915, baseType: !1012, size: 32, align: 32, offset: 1728)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1264, file: !14, line: 1926, baseType: !1457, size: 64, align: 64, offset: 1792)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1264, file: !14, line: 1935, baseType: !1056, size: 64, align: 32, offset: 1856)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1264, file: !14, line: 1942, baseType: !1012, size: 32, align: 32, offset: 1920)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1264, file: !14, line: 1948, baseType: !1012, size: 32, align: 32, offset: 1952)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1264, file: !14, line: 1954, baseType: !1012, size: 32, align: 32, offset: 1984)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1264, file: !14, line: 1960, baseType: !1012, size: 32, align: 32, offset: 2016)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1264, file: !14, line: 1984, baseType: !1012, size: 32, align: 32, offset: 2048)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1264, file: !14, line: 1991, baseType: !1012, size: 32, align: 32, offset: 2080)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1264, file: !14, line: 1996, baseType: !1012, size: 32, align: 32, offset: 2112)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1264, file: !14, line: 2004, baseType: !1012, size: 32, align: 32, offset: 2144)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1264, file: !14, line: 2011, baseType: !1012, size: 32, align: 32, offset: 2176)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1264, file: !14, line: 2018, baseType: !1012, size: 32, align: 32, offset: 2208)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1264, file: !14, line: 2027, baseType: !1012, size: 32, align: 32, offset: 2240)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1264, file: !14, line: 2034, baseType: !1012, size: 32, align: 32, offset: 2272)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1264, file: !14, line: 2044, baseType: !1012, size: 32, align: 32, offset: 2304)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1264, file: !14, line: 2054, baseType: !1493, size: 64, align: 64, offset: 2368)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1028, line: 49, baseType: !1495)
!1495 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1264, file: !14, line: 2061, baseType: !1493, size: 64, align: 64, offset: 2432)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1264, file: !14, line: 2066, baseType: !1012, size: 32, align: 32, offset: 2496)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1264, file: !14, line: 2070, baseType: !1012, size: 32, align: 32, offset: 2528)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1264, file: !14, line: 2078, baseType: !1012, size: 32, align: 32, offset: 2560)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1264, file: !14, line: 2085, baseType: !1012, size: 32, align: 32, offset: 2592)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1264, file: !14, line: 2092, baseType: !1012, size: 32, align: 32, offset: 2624)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1264, file: !14, line: 2099, baseType: !1012, size: 32, align: 32, offset: 2656)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1264, file: !14, line: 2106, baseType: !1012, size: 32, align: 32, offset: 2688)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1264, file: !14, line: 2113, baseType: !1012, size: 32, align: 32, offset: 2720)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1264, file: !14, line: 2120, baseType: !1012, size: 32, align: 32, offset: 2752)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1264, file: !14, line: 2125, baseType: !1012, size: 32, align: 32, offset: 2784)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1264, file: !14, line: 2133, baseType: !1012, size: 32, align: 32, offset: 2816)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1264, file: !14, line: 2140, baseType: !1012, size: 32, align: 32, offset: 2848)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1264, file: !14, line: 2145, baseType: !1012, size: 32, align: 32, offset: 2880)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1264, file: !14, line: 2153, baseType: !1012, size: 32, align: 32, offset: 2912)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1264, file: !14, line: 2158, baseType: !1012, size: 32, align: 32, offset: 2944)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1264, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1264, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1264, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1264, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1264, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1264, file: !14, line: 2203, baseType: !1012, size: 32, align: 32, offset: 3136)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1264, file: !14, line: 2209, baseType: !874, size: 32, align: 32, offset: 3168)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1264, file: !14, line: 2212, baseType: !1012, size: 32, align: 32, offset: 3200)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1264, file: !14, line: 2213, baseType: !1012, size: 32, align: 32, offset: 3232)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1264, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1264, file: !14, line: 2232, baseType: !1012, size: 32, align: 32, offset: 3296)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1264, file: !14, line: 2243, baseType: !1012, size: 32, align: 32, offset: 3328)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1264, file: !14, line: 2249, baseType: !1012, size: 32, align: 32, offset: 3360)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1264, file: !14, line: 2256, baseType: !1012, size: 32, align: 32, offset: 3392)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1264, file: !14, line: 2263, baseType: !1073, size: 64, align: 64, offset: 3456)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1264, file: !14, line: 2270, baseType: !1073, size: 64, align: 64, offset: 3520)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1264, file: !14, line: 2277, baseType: !882, size: 32, align: 32, offset: 3584)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1264, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1264, file: !14, line: 2367, baseType: !1531, size: 64, align: 64, offset: 3648)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64, align: 64)
!1532 = !DISubroutineType(types: !1533)
!1533 = !{!1012, !1454, !1036, !1012}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1264, file: !14, line: 2383, baseType: !1012, size: 32, align: 32, offset: 3712)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1264, file: !14, line: 2386, baseType: !1016, size: 32, align: 32, offset: 3744)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1264, file: !14, line: 2387, baseType: !1016, size: 32, align: 32, offset: 3776)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1264, file: !14, line: 2394, baseType: !1012, size: 32, align: 32, offset: 3808)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1264, file: !14, line: 2401, baseType: !1012, size: 32, align: 32, offset: 3840)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1264, file: !14, line: 2408, baseType: !1012, size: 32, align: 32, offset: 3872)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1264, file: !14, line: 2415, baseType: !1012, size: 32, align: 32, offset: 3904)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1264, file: !14, line: 2422, baseType: !1012, size: 32, align: 32, offset: 3936)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1264, file: !14, line: 2423, baseType: !1543, size: 64, align: 64, offset: 3968)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64, align: 64)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1546)
!1546 = !{!1547, !1548, !1549, !1550}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1545, file: !14, line: 827, baseType: !1012, size: 32, align: 32)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1545, file: !14, line: 828, baseType: !1012, size: 32, align: 32, offset: 32)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1545, file: !14, line: 829, baseType: !1012, size: 32, align: 32, offset: 64)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1545, file: !14, line: 830, baseType: !1016, size: 32, align: 32, offset: 96)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1264, file: !14, line: 2430, baseType: !1063, size: 64, align: 64, offset: 4032)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1264, file: !14, line: 2437, baseType: !1063, size: 64, align: 64, offset: 4096)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1264, file: !14, line: 2444, baseType: !1016, size: 32, align: 32, offset: 4160)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1264, file: !14, line: 2451, baseType: !1016, size: 32, align: 32, offset: 4192)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1264, file: !14, line: 2458, baseType: !1012, size: 32, align: 32, offset: 4224)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1264, file: !14, line: 2469, baseType: !1012, size: 32, align: 32, offset: 4256)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1264, file: !14, line: 2475, baseType: !1012, size: 32, align: 32, offset: 4288)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1264, file: !14, line: 2481, baseType: !1012, size: 32, align: 32, offset: 4320)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1264, file: !14, line: 2485, baseType: !1012, size: 32, align: 32, offset: 4352)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1264, file: !14, line: 2489, baseType: !1012, size: 32, align: 32, offset: 4384)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1264, file: !14, line: 2493, baseType: !1012, size: 32, align: 32, offset: 4416)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1264, file: !14, line: 2501, baseType: !1012, size: 32, align: 32, offset: 4448)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1264, file: !14, line: 2506, baseType: !1012, size: 32, align: 32, offset: 4480)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1264, file: !14, line: 2510, baseType: !1012, size: 32, align: 32, offset: 4512)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1264, file: !14, line: 2514, baseType: !1063, size: 64, align: 64, offset: 4544)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1264, file: !14, line: 2528, baseType: !1567, size: 64, align: 64, offset: 4608)
!1567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1568, size: 64, align: 64)
!1568 = !DISubroutineType(types: !1569)
!1569 = !{null, !1454, !1020, !1012, !1012}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1264, file: !14, line: 2534, baseType: !1012, size: 32, align: 32, offset: 4672)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1264, file: !14, line: 2545, baseType: !1012, size: 32, align: 32, offset: 4704)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1264, file: !14, line: 2547, baseType: !1012, size: 32, align: 32, offset: 4736)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1264, file: !14, line: 2549, baseType: !1012, size: 32, align: 32, offset: 4768)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1264, file: !14, line: 2551, baseType: !1012, size: 32, align: 32, offset: 4800)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1264, file: !14, line: 2553, baseType: !1012, size: 32, align: 32, offset: 4832)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1264, file: !14, line: 2555, baseType: !1012, size: 32, align: 32, offset: 4864)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1264, file: !14, line: 2557, baseType: !1012, size: 32, align: 32, offset: 4896)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1264, file: !14, line: 2559, baseType: !1012, size: 32, align: 32, offset: 4928)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1264, file: !14, line: 2563, baseType: !1012, size: 32, align: 32, offset: 4960)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1264, file: !14, line: 2571, baseType: !1581, size: 64, align: 64, offset: 4992)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1264, file: !14, line: 2579, baseType: !1581, size: 64, align: 64, offset: 5056)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1264, file: !14, line: 2586, baseType: !1012, size: 32, align: 32, offset: 5120)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1264, file: !14, line: 2615, baseType: !1012, size: 32, align: 32, offset: 5152)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1264, file: !14, line: 2627, baseType: !1012, size: 32, align: 32, offset: 5184)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1264, file: !14, line: 2637, baseType: !1012, size: 32, align: 32, offset: 5216)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1264, file: !14, line: 2681, baseType: !1012, size: 32, align: 32, offset: 5248)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1264, file: !14, line: 2709, baseType: !1063, size: 64, align: 64, offset: 5312)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1264, file: !14, line: 2716, baseType: !1590, size: 64, align: 64, offset: 5376)
!1590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1591, size: 64, align: 64)
!1591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1592)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1593)
!1593 = !{!1594, !1595, !1596, !1597, !1598, !1599, !1603, !1609, !1613, !1614, !1615, !1616, !1622, !1623, !1624, !1625, !1626}
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1592, file: !14, line: 3642, baseType: !1150, size: 64, align: 64)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1592, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1592, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1592, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1592, file: !14, line: 3669, baseType: !1012, size: 32, align: 32, offset: 160)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1592, file: !14, line: 3682, baseType: !1600, size: 64, align: 64, offset: 192)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{!1012, !1262, !1036}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1592, file: !14, line: 3698, baseType: !1604, size: 64, align: 64, offset: 256)
!1604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1605, size: 64, align: 64)
!1605 = !DISubroutineType(types: !1606)
!1606 = !{!1012, !1262, !1607, !1027}
!1607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1608, size: 64, align: 64)
!1608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1592, file: !14, line: 3712, baseType: !1610, size: 64, align: 64, offset: 320)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!1012, !1262, !1012, !1607, !1027}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1592, file: !14, line: 3726, baseType: !1604, size: 64, align: 64, offset: 384)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1592, file: !14, line: 3737, baseType: !1259, size: 64, align: 64, offset: 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1592, file: !14, line: 3746, baseType: !1012, size: 32, align: 32, offset: 512)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1592, file: !14, line: 3757, baseType: !1617, size: 64, align: 64, offset: 576)
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64, align: 64)
!1618 = !DISubroutineType(types: !1619)
!1619 = !{null, !1620}
!1620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1621, size: 64, align: 64)
!1621 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1592, file: !14, line: 3766, baseType: !1259, size: 64, align: 64, offset: 640)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1592, file: !14, line: 3774, baseType: !1259, size: 64, align: 64, offset: 704)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1592, file: !14, line: 3780, baseType: !1012, size: 32, align: 32, offset: 768)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1592, file: !14, line: 3785, baseType: !1012, size: 32, align: 32, offset: 800)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1592, file: !14, line: 3795, baseType: !1627, size: 64, align: 64, offset: 832)
!1627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1628, size: 64, align: 64)
!1628 = !DISubroutineType(types: !1629)
!1629 = !{!1012, !1262, !1084}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1264, file: !14, line: 2728, baseType: !1020, size: 64, align: 64, offset: 5440)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1264, file: !14, line: 2735, baseType: !1072, size: 512, align: 64, offset: 5504)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1264, file: !14, line: 2742, baseType: !1012, size: 32, align: 32, offset: 6016)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1264, file: !14, line: 2755, baseType: !1012, size: 32, align: 32, offset: 6048)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1264, file: !14, line: 2776, baseType: !1012, size: 32, align: 32, offset: 6080)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1264, file: !14, line: 2783, baseType: !1012, size: 32, align: 32, offset: 6112)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1264, file: !14, line: 2791, baseType: !1012, size: 32, align: 32, offset: 6144)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1264, file: !14, line: 2802, baseType: !1036, size: 64, align: 64, offset: 6208)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1264, file: !14, line: 2811, baseType: !1012, size: 32, align: 32, offset: 6272)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1264, file: !14, line: 2821, baseType: !1012, size: 32, align: 32, offset: 6304)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1264, file: !14, line: 2830, baseType: !1012, size: 32, align: 32, offset: 6336)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1264, file: !14, line: 2840, baseType: !1012, size: 32, align: 32, offset: 6368)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1264, file: !14, line: 2851, baseType: !1643, size: 64, align: 64, offset: 6400)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64, align: 64)
!1644 = !DISubroutineType(types: !1645)
!1645 = !{!1012, !1454, !1646, !1020, !1457, !1012, !1012}
!1646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1647, size: 64, align: 64)
!1647 = !DISubroutineType(types: !1648)
!1648 = !{!1012, !1454, !1020}
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1264, file: !14, line: 2871, baseType: !1650, size: 64, align: 64, offset: 6464)
!1650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1651, size: 64, align: 64)
!1651 = !DISubroutineType(types: !1652)
!1652 = !{!1012, !1454, !1653, !1020, !1457, !1012}
!1653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1654, size: 64, align: 64)
!1654 = !DISubroutineType(types: !1655)
!1655 = !{!1012, !1454, !1020, !1012, !1012}
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1264, file: !14, line: 2878, baseType: !1012, size: 32, align: 32, offset: 6528)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1264, file: !14, line: 2885, baseType: !1012, size: 32, align: 32, offset: 6560)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1264, file: !14, line: 3005, baseType: !1012, size: 32, align: 32, offset: 6592)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1264, file: !14, line: 3013, baseType: !894, size: 32, align: 32, offset: 6624)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1264, file: !14, line: 3020, baseType: !894, size: 32, align: 32, offset: 6656)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1264, file: !14, line: 3027, baseType: !894, size: 32, align: 32, offset: 6688)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1264, file: !14, line: 3037, baseType: !1042, size: 64, align: 64, offset: 6720)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1264, file: !14, line: 3038, baseType: !1012, size: 32, align: 32, offset: 6784)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1264, file: !14, line: 3050, baseType: !1073, size: 64, align: 64, offset: 6848)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1264, file: !14, line: 3065, baseType: !1012, size: 32, align: 32, offset: 6912)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1264, file: !14, line: 3083, baseType: !1012, size: 32, align: 32, offset: 6944)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1264, file: !14, line: 3092, baseType: !1056, size: 64, align: 32, offset: 6976)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1264, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1264, file: !14, line: 3106, baseType: !1056, size: 64, align: 32, offset: 7072)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1264, file: !14, line: 3113, baseType: !1671, size: 64, align: 64, offset: 7168)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64, align: 64)
!1672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1673)
!1673 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1674)
!1674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1675)
!1675 = !{!1676, !1677, !1678, !1679, !1680, !1681, !1684}
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1674, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1674, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1674, file: !14, line: 720, baseType: !1150, size: 64, align: 64, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1674, file: !14, line: 724, baseType: !1150, size: 64, align: 64, offset: 128)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1674, file: !14, line: 728, baseType: !1012, size: 32, align: 32, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1674, file: !14, line: 734, baseType: !1682, size: 64, align: 64, offset: 256)
!1682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1683, size: 64, align: 64)
!1683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1150)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1674, file: !14, line: 739, baseType: !1685, size: 64, align: 64, offset: 320)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64, align: 64)
!1686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1250)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1264, file: !14, line: 3129, baseType: !1063, size: 64, align: 64, offset: 7232)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1264, file: !14, line: 3130, baseType: !1063, size: 64, align: 64, offset: 7296)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1264, file: !14, line: 3131, baseType: !1063, size: 64, align: 64, offset: 7360)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1264, file: !14, line: 3132, baseType: !1063, size: 64, align: 64, offset: 7424)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1264, file: !14, line: 3139, baseType: !1581, size: 64, align: 64, offset: 7488)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1264, file: !14, line: 3147, baseType: !1012, size: 32, align: 32, offset: 7552)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1264, file: !14, line: 3165, baseType: !1012, size: 32, align: 32, offset: 7584)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1264, file: !14, line: 3172, baseType: !1012, size: 32, align: 32, offset: 7616)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1264, file: !14, line: 3180, baseType: !1012, size: 32, align: 32, offset: 7648)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1264, file: !14, line: 3191, baseType: !1493, size: 64, align: 64, offset: 7680)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1264, file: !14, line: 3199, baseType: !1042, size: 64, align: 64, offset: 7744)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1264, file: !14, line: 3207, baseType: !1581, size: 64, align: 64, offset: 7808)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1264, file: !14, line: 3214, baseType: !1013, size: 32, align: 32, offset: 7872)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1264, file: !14, line: 3224, baseType: !1323, size: 64, align: 64, offset: 7936)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1264, file: !14, line: 3225, baseType: !1012, size: 32, align: 32, offset: 8000)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1264, file: !14, line: 3249, baseType: !1084, size: 64, align: 64, offset: 8064)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1264, file: !14, line: 3256, baseType: !1012, size: 32, align: 32, offset: 8128)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1264, file: !14, line: 3271, baseType: !1012, size: 32, align: 32, offset: 8160)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1264, file: !14, line: 3279, baseType: !1063, size: 64, align: 64, offset: 8192)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1264, file: !14, line: 3301, baseType: !1084, size: 64, align: 64, offset: 8256)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1264, file: !14, line: 3310, baseType: !1012, size: 32, align: 32, offset: 8320)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1264, file: !14, line: 3337, baseType: !1012, size: 32, align: 32, offset: 8352)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1264, file: !14, line: 3351, baseType: !1012, size: 32, align: 32, offset: 8384)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1264, file: !14, line: 3359, baseType: !1012, size: 32, align: 32, offset: 8416)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1147, file: !14, line: 3535, baseType: !1712, size: 64, align: 64, offset: 1024)
!1712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1713, size: 64, align: 64)
!1713 = !DISubroutineType(types: !1714)
!1714 = !{!1012, !1262, !1715}
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64, align: 64)
!1716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1263)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1147, file: !14, line: 3541, baseType: !1718, size: 64, align: 64, offset: 1088)
!1718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1719, size: 64, align: 64)
!1719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1720)
!1720 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1721)
!1721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !1278, line: 223, size: 128, align: 64, elements: !1722)
!1722 = !{!1723, !1724}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1721, file: !1278, line: 224, baseType: !1607, size: 64, align: 64)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1721, file: !1278, line: 225, baseType: !1607, size: 64, align: 64, offset: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1147, file: !14, line: 3549, baseType: !1726, size: 64, align: 64, offset: 1152)
!1726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1727, size: 64, align: 64)
!1727 = !DISubroutineType(types: !1728)
!1728 = !{null, !1257}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1147, file: !14, line: 3551, baseType: !1259, size: 64, align: 64, offset: 1216)
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1147, file: !14, line: 3552, baseType: !1731, size: 64, align: 64, offset: 1280)
!1731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1732, size: 64, align: 64)
!1732 = !DISubroutineType(types: !1733)
!1733 = !{!1012, !1262, !1042, !1012, !1734}
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64, align: 64)
!1735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1736)
!1736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1737)
!1737 = !{!1738, !1739, !1740, !1741, !1742, !1766}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1736, file: !14, line: 3921, baseType: !1494, size: 16, align: 16)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1736, file: !14, line: 3922, baseType: !1027, size: 32, align: 32, offset: 32)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1736, file: !14, line: 3923, baseType: !1027, size: 32, align: 32, offset: 64)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1736, file: !14, line: 3924, baseType: !1013, size: 32, align: 32, offset: 96)
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1736, file: !14, line: 3925, baseType: !1743, size: 64, align: 64, offset: 128)
!1743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1744, size: 64, align: 64)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64, align: 64)
!1745 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1746)
!1746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1747)
!1747 = !{!1748, !1749, !1750, !1751, !1752, !1753, !1759, !1761, !1762, !1763, !1764, !1765}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1746, file: !14, line: 3886, baseType: !1012, size: 32, align: 32)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1746, file: !14, line: 3887, baseType: !1012, size: 32, align: 32, offset: 32)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1746, file: !14, line: 3888, baseType: !1012, size: 32, align: 32, offset: 64)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1746, file: !14, line: 3889, baseType: !1012, size: 32, align: 32, offset: 96)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1746, file: !14, line: 3890, baseType: !1012, size: 32, align: 32, offset: 128)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1746, file: !14, line: 3897, baseType: !1754, size: 768, align: 64, offset: 192)
!1754 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1755)
!1755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1756)
!1756 = !{!1757, !1758}
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1755, file: !14, line: 3855, baseType: !1041, size: 512, align: 64)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1755, file: !14, line: 3857, baseType: !1046, size: 256, align: 32, offset: 512)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1746, file: !14, line: 3903, baseType: !1760, size: 256, align: 64, offset: 960)
!1760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 256, align: 64, elements: !1294)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1746, file: !14, line: 3904, baseType: !1301, size: 128, align: 32, offset: 1216)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1746, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1746, file: !14, line: 3908, baseType: !1581, size: 64, align: 64, offset: 1408)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1746, file: !14, line: 3915, baseType: !1581, size: 64, align: 64, offset: 1472)
!1765 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1746, file: !14, line: 3917, baseType: !1012, size: 32, align: 32, offset: 1536)
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1736, file: !14, line: 3926, baseType: !1063, size: 64, align: 64, offset: 192)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1147, file: !14, line: 3564, baseType: !1768, size: 64, align: 64, offset: 1344)
