; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--uncodedframecrcenc.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--uncodedframecrcenc.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVOutputFormat = type { i8*, i8*, i8*, i8*, i32, i32, i32, i32, %struct.AVCodecTag**, %struct.AVClass*, %struct.AVOutputFormat*, i32, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)*, i32 (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*, %struct.AVPacket*, i32)*, i32 (i32, i32)*, void (%struct.AVFormatContext*, i32, i64*, i64*)*, i32 (%struct.AVFormatContext*, i32, i8*, i64)*, i32 (%struct.AVFormatContext*, i32, %struct.AVFrame**, i32)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceInfoList*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32 (%struct.AVFormatContext*, %struct.AVDeviceCapabilitiesQuery*)*, i32, i32 (%struct.AVFormatContext*)*, void (%struct.AVFormatContext*)*, i32 (%struct.AVFormatContext*, %struct.AVPacket*)* }
%struct.AVCodecTag = type { i32, i32 }
%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type opaque
%struct.AVOptionRanges = type opaque

!855 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!856 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !534, line: 538, size: 32, align: 32, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866}
!859 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!860 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!861 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!862 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!863 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!864 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!865 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!866 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!867 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVFieldOrder", file: !4, line: 1534, size: 32, align: 32, elements: !868)
!868 = !{!869, !870, !871, !872, !873, !874}
!869 = !DIEnumerator(name: "AV_FIELD_UNKNOWN", value: 0)
!870 = !DIEnumerator(name: "AV_FIELD_PROGRESSIVE", value: 1)
!871 = !DIEnumerator(name: "AV_FIELD_TT", value: 2)
!872 = !DIEnumerator(name: "AV_FIELD_BB", value: 3)
!873 = !DIEnumerator(name: "AV_FIELD_TB", value: 4)
!874 = !DIEnumerator(name: "AV_FIELD_BT", value: 5)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVAudioServiceType", file: !4, line: 810, size: 32, align: 32, elements: !876)
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886}
!877 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_MAIN", value: 0)
!878 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EFFECTS", value: 1)
!879 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VISUALLY_IMPAIRED", value: 2)
!880 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_HEARING_IMPAIRED", value: 3)
!881 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_DIALOGUE", value: 4)
!882 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_COMMENTARY", value: 5)
!883 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_EMERGENCY", value: 6)
!884 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!885 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!886 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !4, line: 798, size: 32, align: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!890 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!891 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!892 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!893 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!894 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!895 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!896 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVStreamParseType", file: !897, line: 782, size: 32, align: 32, elements: !898)
!897 = !DIFile(filename: "libavformat/avformat.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!898 = !{!899, !900, !901, !902, !903, !904}
!899 = !DIEnumerator(name: "AVSTREAM_PARSE_NONE", value: 0)
!900 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL", value: 1)
!901 = !DIEnumerator(name: "AVSTREAM_PARSE_HEADERS", value: 2)
!902 = !DIEnumerator(name: "AVSTREAM_PARSE_TIMESTAMPS", value: 3)
!903 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_ONCE", value: 4)
!904 = !DIEnumerator(name: "AVSTREAM_PARSE_FULL_RAW", value: 5)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPictureStructure", file: !4, line: 5085, size: 32, align: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_UNKNOWN", value: 0)
!908 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_TOP_FIELD", value: 1)
!909 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_BOTTOM_FIELD", value: 2)
!910 = !DIEnumerator(name: "AV_PICTURE_STRUCTURE_FRAME", value: 3)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDurationEstimationMethod", file: !897, line: 1315, size: 32, align: 32, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIEnumerator(name: "AVFMT_DURATION_FROM_PTS", value: 0)
!914 = !DIEnumerator(name: "AVFMT_DURATION_FROM_STREAM", value: 1)
!915 = !DIEnumerator(name: "AVFMT_DURATION_FROM_BITRATE", value: 2)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVWriteUncodedFrameFlags", file: !917, line: 638, size: 32, align: 32, elements: !918)
!917 = !DIFile(filename: "libavformat/internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!918 = !{!919}
!919 = !DIEnumerator(name: "AV_WRITE_UNCODED_FRAME_QUERY", value: 1)
!920 = !{!921, !922}
!921 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!923 = !{!924}
!924 = distinct !DIGlobalVariable(name: "ff_uncodedframecrc_muxer", scope: !0, file: !925, line: 167, type: !926, isLocal: false, isDefinition: true, variable: %struct.AVOutputFormat* @ff_uncodedframecrc_muxer)
!925 = !DIFile(filename: "libavformat/uncodedframecrcenc.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOutputFormat", file: !897, line: 624, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOutputFormat", file: !897, line: 497, size: 1600, align: 64, elements: !928)
!928 = !{!929, !933, !934, !935, !936, !937, !938, !939, !941, !950, !991, !993, !994, !2105, !2106, !2107, !2111, !2115, !2119, !2120, !2125, !2126, !2127, !2128, !2129, !2130, !2134}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !927, file: !897, line: 498, baseType: !930, size: 64, align: 64)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64, align: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !927, file: !897, line: 504, baseType: !930, size: 64, align: 64, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !927, file: !897, line: 505, baseType: !930, size: 64, align: 64, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !927, file: !897, line: 506, baseType: !930, size: 64, align: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "audio_codec", scope: !927, file: !897, line: 508, baseType: !3, size: 32, align: 32, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "video_codec", scope: !927, file: !897, line: 509, baseType: !3, size: 32, align: 32, offset: 288)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_codec", scope: !927, file: !897, line: 510, baseType: !3, size: 32, align: 32, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !927, file: !897, line: 517, baseType: !940, size: 32, align: 32, offset: 352)
!940 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !927, file: !897, line: 523, baseType: !942, size: 64, align: 64, offset: 384)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64, align: 64)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64, align: 64)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecTag", file: !917, line: 44, size: 64, align: 32, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !946, file: !917, line: 45, baseType: !3, size: 32, align: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !946, file: !917, line: 46, baseType: !921, size: 32, align: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !927, file: !897, line: 526, baseType: !951, size: 64, align: 64, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64, align: 64)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !464, line: 143, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !464, line: 67, size: 640, align: 64, elements: !955)
!955 = !{!956, !957, !961, !965, !966, !967, !968, !972, !978, !980, !984}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !954, file: !464, line: 72, baseType: !930, size: 64, align: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !954, file: !464, line: 78, baseType: !958, size: 64, align: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64, align: 64)
!959 = !DISubroutineType(types: !960)
!960 = !{!930, !922}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !954, file: !464, line: 85, baseType: !962, size: 64, align: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64, align: 64)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 85, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !954, file: !464, line: 93, baseType: !940, size: 32, align: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !954, file: !464, line: 99, baseType: !940, size: 32, align: 32, offset: 224)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !954, file: !464, line: 108, baseType: !940, size: 32, align: 32, offset: 256)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !954, file: !464, line: 113, baseType: !969, size: 64, align: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64, align: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!922, !922, !922}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !954, file: !464, line: 123, baseType: !973, size: 64, align: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{!976, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64, align: 64)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !954, file: !464, line: 130, baseType: !979, size: 32, align: 32, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !464, line: 48, baseType: !463)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !954, file: !464, line: 136, baseType: !981, size: 64, align: 64, offset: 512)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64, align: 64)
!982 = !DISubroutineType(types: !983)
!983 = !{!979, !922}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !954, file: !464, line: 142, baseType: !985, size: 64, align: 64, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64, align: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!940, !988, !922, !930, !940}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64, align: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 60, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !927, file: !897, line: 535, baseType: !992, size: 64, align: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !927, file: !897, line: 539, baseType: !940, size: 32, align: 32, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "write_header", scope: !927, file: !897, line: 541, baseType: !995, size: 64, align: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64, align: 64)
!996 = !DISubroutineType(types: !997)
!997 = !{!940, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64, align: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFormatContext", file: !897, line: 1337, size: 11968, align: 64, elements: !1000)
!1000 = !{!1001, !1002, !1103, !1104, !1105, !1171, !1172, !1173, !1959, !1963, !1964, !1965, !1966, !1967, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1996, !1997, !1998, !1999, !2000, !2001, !2002, !2013, !2014, !2015, !2016, !2017, !2023, !2024, !2025, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2068, !2069, !2072, !2073, !2074, !2075, !2076, !2077, !2082, !2083, !2084, !2085, !2093, !2094, !2098, !2102, !2103, !2104}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !999, file: !897, line: 1342, baseType: !951, size: 64, align: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "iformat", scope: !999, file: !897, line: 1349, baseType: !1003, size: 64, align: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64, align: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVInputFormat", file: !897, line: 633, size: 1344, align: 64, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1030, !1031, !1074, !1075, !1079, !1084, !1085, !1086, !1090, !1096, !1102}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !897, line: 638, baseType: !930, size: 64, align: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1004, file: !897, line: 645, baseType: !930, size: 64, align: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1004, file: !897, line: 652, baseType: !940, size: 32, align: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "extensions", scope: !1004, file: !897, line: 659, baseType: !930, size: 64, align: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1004, file: !897, line: 661, baseType: !942, size: 64, align: 64, offset: 256)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1004, file: !897, line: 663, baseType: !951, size: 64, align: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1004, file: !897, line: 670, baseType: !930, size: 64, align: 64, offset: 384)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1004, file: !897, line: 679, baseType: !1003, size: 64, align: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "raw_codec_id", scope: !1004, file: !897, line: 684, baseType: !940, size: 32, align: 32, offset: 512)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1004, file: !897, line: 689, baseType: !940, size: 32, align: 32, offset: 544)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "read_probe", scope: !1004, file: !897, line: 696, baseType: !1017, size: 64, align: 64, offset: 576)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!940, !1020}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64, align: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProbeData", file: !897, line: 453, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProbeData", file: !897, line: 448, size: 256, align: 64, elements: !1023)
!1023 = !{!1024, !1025, !1028, !1029}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !1022, file: !897, line: 449, baseType: !930, size: 64, align: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1022, file: !897, line: 450, baseType: !1026, size: 64, align: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "buf_size", scope: !1022, file: !897, line: 451, baseType: !940, size: 32, align: 32, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "mime_type", scope: !1022, file: !897, line: 452, baseType: !930, size: 64, align: 64, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "read_header", scope: !1004, file: !897, line: 703, baseType: !995, size: 64, align: 64, offset: 640)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1004, file: !897, line: 714, baseType: !1032, size: 64, align: 64, offset: 704)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64, align: 64)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{!940, !998, !1035}
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !1038)
!1038 = !{!1039, !1054, !1057, !1058, !1059, !1060, !1061, !1062, !1070, !1071, !1072, !1073}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1037, file: !4, line: 1451, baseType: !1040, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1042, line: 94, baseType: !1043)
!1042 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1042, line: 81, size: 192, align: 64, elements: !1044)
!1044 = !{!1045, !1049, !1053}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1043, file: !1042, line: 82, baseType: !1046, size: 64, align: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64, align: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1042, line: 73, baseType: !1048)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1042, line: 73, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1043, file: !1042, line: 89, baseType: !1050, size: 64, align: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64, align: 64)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !1052, line: 48, baseType: !1027)
!1052 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1043, file: !1042, line: 93, baseType: !940, size: 32, align: 32, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1037, file: !4, line: 1461, baseType: !1055, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !1052, line: 40, baseType: !1056)
!1056 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1037, file: !4, line: 1467, baseType: !1055, size: 64, align: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1037, file: !4, line: 1468, baseType: !1050, size: 64, align: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1037, file: !4, line: 1469, baseType: !940, size: 32, align: 32, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1037, file: !4, line: 1470, baseType: !940, size: 32, align: 32, offset: 288)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1037, file: !4, line: 1474, baseType: !940, size: 32, align: 32, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1037, file: !4, line: 1479, baseType: !1063, size: 64, align: 64, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1065, file: !4, line: 1412, baseType: !1050, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1065, file: !4, line: 1413, baseType: !940, size: 32, align: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1065, file: !4, line: 1414, baseType: !484, size: 32, align: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1037, file: !4, line: 1480, baseType: !940, size: 32, align: 32, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1037, file: !4, line: 1486, baseType: !1055, size: 64, align: 64, offset: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1037, file: !4, line: 1488, baseType: !1055, size: 64, align: 64, offset: 576)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1037, file: !4, line: 1497, baseType: !1055, size: 64, align: 64, offset: 640)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "read_close", scope: !1004, file: !897, line: 720, baseType: !995, size: 64, align: 64, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1004, file: !897, line: 730, baseType: !1076, size: 64, align: 64, offset: 832)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64, align: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!940, !998, !940, !1055, !940}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "read_timestamp", scope: !1004, file: !897, line: 737, baseType: !1080, size: 64, align: 64, offset: 896)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64, align: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1055, !998, !940, !1083, !1055}
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64, align: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "read_play", scope: !1004, file: !897, line: 744, baseType: !995, size: 64, align: 64, offset: 960)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1004, file: !897, line: 750, baseType: !995, size: 64, align: 64, offset: 1024)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek2", scope: !1004, file: !897, line: 758, baseType: !1087, size: 64, align: 64, offset: 1088)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64, align: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!940, !998, !940, !1055, !1055, !1055, !940}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "get_device_list", scope: !1004, file: !897, line: 764, baseType: !1091, size: 64, align: 64, offset: 1152)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64, align: 64)
!1092 = !DISubroutineType(types: !1093)
!1093 = !{!940, !998, !1094}
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64, align: 64)
!1095 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceInfoList", file: !897, line: 328, flags: DIFlagFwdDecl)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "create_device_capabilities", scope: !1004, file: !897, line: 770, baseType: !1097, size: 64, align: 64, offset: 1216)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64, align: 64)
!1098 = !DISubroutineType(types: !1099)
!1099 = !{!940, !998, !1100}
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64, align: 64)
!1101 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDeviceCapabilitiesQuery", file: !897, line: 329, flags: DIFlagFwdDecl)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "free_device_capabilities", scope: !1004, file: !897, line: 776, baseType: !1097, size: 64, align: 64, offset: 1280)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "oformat", scope: !999, file: !897, line: 1356, baseType: !992, size: 64, align: 64, offset: 128)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !999, file: !897, line: 1365, baseType: !922, size: 64, align: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pb", scope: !999, file: !897, line: 1379, baseType: !1106, size: 64, align: 64, offset: 256)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64, align: 64)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOContext", file: !515, line: 352, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOContext", file: !515, line: 161, size: 2112, align: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114, !1115, !1116, !1120, !1121, !1125, !1126, !1127, !1128, !1129, !1131, !1132, !1138, !1139, !1143, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1161, !1162, !1163, !1164, !1168, !1169, !1170}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1108, file: !515, line: 174, baseType: !951, size: 64, align: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1108, file: !515, line: 226, baseType: !1026, size: 64, align: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !1108, file: !515, line: 227, baseType: !940, size: 32, align: 32, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1108, file: !515, line: 228, baseType: !1026, size: 64, align: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1108, file: !515, line: 229, baseType: !1026, size: 64, align: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1108, file: !515, line: 233, baseType: !922, size: 64, align: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "read_packet", scope: !1108, file: !515, line: 235, baseType: !1117, size: 64, align: 64, offset: 384)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64, align: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!940, !922, !1050, !940}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "write_packet", scope: !1108, file: !515, line: 236, baseType: !1117, size: 64, align: 64, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "seek", scope: !1108, file: !515, line: 237, baseType: !1122, size: 64, align: 64, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64, align: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{!1055, !922, !1055, !940}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1108, file: !515, line: 238, baseType: !1055, size: 64, align: 64, offset: 576)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "eof_reached", scope: !1108, file: !515, line: 239, baseType: !940, size: 32, align: 32, offset: 640)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "write_flag", scope: !1108, file: !515, line: 240, baseType: !940, size: 32, align: 32, offset: 672)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !1108, file: !515, line: 241, baseType: !940, size: 32, align: 32, offset: 704)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !1108, file: !515, line: 242, baseType: !1130, size: 64, align: 64, offset: 768)
!1130 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "checksum_ptr", scope: !1108, file: !515, line: 243, baseType: !1026, size: 64, align: 64, offset: 832)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "update_checksum", scope: !1108, file: !515, line: 244, baseType: !1133, size: 64, align: 64, offset: 896)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64, align: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!1130, !1130, !1136, !921}
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64, align: 64)
!1137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1108, file: !515, line: 245, baseType: !940, size: 32, align: 32, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "read_pause", scope: !1108, file: !515, line: 249, baseType: !1140, size: 64, align: 64, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!940, !922, !940}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "read_seek", scope: !1108, file: !515, line: 255, baseType: !1144, size: 64, align: 64, offset: 1088)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64, align: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!1055, !922, !940, !1055, !940}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "seekable", scope: !1108, file: !515, line: 260, baseType: !940, size: 32, align: 32, offset: 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "maxsize", scope: !1108, file: !515, line: 266, baseType: !1055, size: 64, align: 64, offset: 1216)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "direct", scope: !1108, file: !515, line: 273, baseType: !940, size: 32, align: 32, offset: 1280)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_read", scope: !1108, file: !515, line: 279, baseType: !1055, size: 64, align: 64, offset: 1344)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "seek_count", scope: !1108, file: !515, line: 285, baseType: !940, size: 32, align: 32, offset: 1408)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "writeout_count", scope: !1108, file: !515, line: 291, baseType: !940, size: 32, align: 32, offset: 1440)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "orig_buffer_size", scope: !1108, file: !515, line: 298, baseType: !940, size: 32, align: 32, offset: 1472)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_threshold", scope: !1108, file: !515, line: 304, baseType: !940, size: 32, align: 32, offset: 1504)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !1108, file: !515, line: 309, baseType: !930, size: 64, align: 64, offset: 1536)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !1108, file: !515, line: 314, baseType: !930, size: 64, align: 64, offset: 1600)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_type", scope: !1108, file: !515, line: 319, baseType: !1158, size: 64, align: 64, offset: 1664)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64, align: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{!940, !922, !1050, !940, !514, !1055}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ignore_boundary_point", scope: !1108, file: !515, line: 326, baseType: !940, size: 32, align: 32, offset: 1728)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "current_type", scope: !1108, file: !515, line: 331, baseType: !514, size: 32, align: 32, offset: 1760)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "last_time", scope: !1108, file: !515, line: 332, baseType: !1055, size: 64, align: 64, offset: 1792)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "short_seek_get", scope: !1108, file: !515, line: 338, baseType: !1165, size: 64, align: 64, offset: 1856)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DISubroutineType(types: !1167)
!1167 = !{!940, !922}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "written", scope: !1108, file: !515, line: 340, baseType: !1055, size: 64, align: 64, offset: 1920)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr_max", scope: !1108, file: !515, line: 346, baseType: !1026, size: 64, align: 64, offset: 1984)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !1108, file: !515, line: 351, baseType: !940, size: 32, align: 32, offset: 2048)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ctx_flags", scope: !999, file: !897, line: 1386, baseType: !940, size: 32, align: 32, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "nb_streams", scope: !999, file: !897, line: 1393, baseType: !921, size: 32, align: 32, offset: 352)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !999, file: !897, line: 1405, baseType: !1174, size: 64, align: 64, offset: 384)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64, align: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64, align: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVStream", file: !897, line: 1223, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVStream", file: !897, line: 865, size: 6144, align: 64, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1744, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1845, !1851, !1852, !1856, !1866, !1867, !1868, !1869, !1870, !1871, !1872, !1873, !1874, !1875, !1876, !1877, !1878, !1879, !1880, !1881, !1882, !1883, !1884, !1885, !1886, !1888, !1889, !1890, !1891, !1892, !1893}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1177, file: !897, line: 866, baseType: !940, size: 32, align: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1177, file: !897, line: 872, baseType: !940, size: 32, align: 32, offset: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1177, file: !897, line: 878, baseType: !1182, size: 64, align: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !4, line: 3360, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !4, line: 1556, size: 8448, align: 64, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1419, !1420, !1421, !1422, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1448, !1452, !1453, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1632, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1184, file: !4, line: 1561, baseType: !951, size: 64, align: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1184, file: !4, line: 1562, baseType: !940, size: 32, align: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1184, file: !4, line: 1564, baseType: !523, size: 32, align: 32, offset: 96)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1184, file: !4, line: 1565, baseType: !1190, size: 64, align: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64, align: 64)
!1191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1192)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !4, line: 3468, size: 1984, align: 64, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1199, !1208, !1211, !1214, !1217, !1221, !1222, !1223, !1231, !1232, !1233, !1235, !1239, !1245, !1250, !1254, !1255, !1303, !1390, !1394, !1395, !1399, !1403, !1408, !1412, !1413, !1414}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1192, file: !4, line: 3475, baseType: !930, size: 64, align: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1192, file: !4, line: 3480, baseType: !930, size: 64, align: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1192, file: !4, line: 3481, baseType: !523, size: 32, align: 32, offset: 128)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1192, file: !4, line: 3482, baseType: !3, size: 32, align: 32, offset: 160)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1192, file: !4, line: 3487, baseType: !940, size: 32, align: 32, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !1192, file: !4, line: 3488, baseType: !1200, size: 64, align: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !1203, line: 61, baseType: !1204)
!1203 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !1203, line: 58, size: 64, align: 32, elements: !1205)
!1205 = !{!1206, !1207}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1204, file: !1203, line: 59, baseType: !940, size: 32, align: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !1204, file: !1203, line: 60, baseType: !940, size: 32, align: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !1192, file: !4, line: 3489, baseType: !1209, size: 64, align: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64, align: 64)
!1210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !1192, file: !4, line: 3490, baseType: !1212, size: 64, align: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64, align: 64)
!1213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !1192, file: !4, line: 3491, baseType: !1215, size: 64, align: 64, offset: 448)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64, align: 64)
!1216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !1192, file: !4, line: 3492, baseType: !1218, size: 64, align: 64, offset: 512)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64, align: 64)
!1219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1220)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1052, line: 55, baseType: !1130)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !1192, file: !4, line: 3493, baseType: !1051, size: 8, align: 8, offset: 576)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !1192, file: !4, line: 3494, baseType: !951, size: 64, align: 64, offset: 640)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1192, file: !4, line: 3495, baseType: !1224, size: 64, align: 64, offset: 704)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64, align: 64)
!1225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !4, line: 3404, baseType: !1227)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !4, line: 3401, size: 128, align: 64, elements: !1228)
!1228 = !{!1229, !1230}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1227, file: !4, line: 3402, baseType: !940, size: 32, align: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1227, file: !4, line: 3403, baseType: !930, size: 64, align: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !1192, file: !4, line: 3507, baseType: !930, size: 64, align: 64, offset: 768)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1192, file: !4, line: 3516, baseType: !940, size: 32, align: 32, offset: 832)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1192, file: !4, line: 3517, baseType: !1234, size: 64, align: 64, offset: 896)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64, align: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !1192, file: !4, line: 3527, baseType: !1236, size: 64, align: 64, offset: 960)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64, align: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!940, !1182}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !1192, file: !4, line: 3535, baseType: !1240, size: 64, align: 64, offset: 1024)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64, align: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{!940, !1182, !1243}
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64, align: 64)
!1244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1183)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !1192, file: !4, line: 3541, baseType: !1246, size: 64, align: 64, offset: 1088)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64, align: 64)
!1247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !4, line: 3461, baseType: !1249)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !4, line: 3461, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !1192, file: !4, line: 3549, baseType: !1251, size: 64, align: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64, align: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{null, !1234}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1192, file: !4, line: 3551, baseType: !1236, size: 64, align: 64, offset: 1216)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !1192, file: !4, line: 3552, baseType: !1256, size: 64, align: 64, offset: 1280)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64, align: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!940, !1182, !1050, !940, !1259}
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64, align: 64)
!1260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !4, line: 3920, size: 256, align: 64, elements: !1262)
!1262 = !{!1263, !1266, !1268, !1269, !1270, !1302}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1261, file: !4, line: 3921, baseType: !1264, size: 16, align: 16)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1052, line: 49, baseType: !1265)
!1265 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1261, file: !4, line: 3922, baseType: !1267, size: 32, align: 32, offset: 32)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1052, line: 51, baseType: !921)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1261, file: !4, line: 3923, baseType: !1267, size: 32, align: 32, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1261, file: !4, line: 3924, baseType: !921, size: 32, align: 32, offset: 96)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1261, file: !4, line: 3925, baseType: !1271, size: 64, align: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64, align: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64, align: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !4, line: 3918, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !4, line: 3885, size: 1600, align: 64, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1280, !1281, !1291, !1295, !1297, !1298, !1300, !1301}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1274, file: !4, line: 3886, baseType: !940, size: 32, align: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1274, file: !4, line: 3887, baseType: !940, size: 32, align: 32, offset: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1274, file: !4, line: 3888, baseType: !940, size: 32, align: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1274, file: !4, line: 3889, baseType: !940, size: 32, align: 32, offset: 96)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1274, file: !4, line: 3890, baseType: !940, size: 32, align: 32, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1274, file: !4, line: 3897, baseType: !1282, size: 768, align: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !4, line: 3858, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !4, line: 3853, size: 768, align: 64, elements: !1284)
!1284 = !{!1285, !1289}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1283, file: !4, line: 3855, baseType: !1286, size: 512, align: 64)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 512, align: 64, elements: !1287)
!1287 = !{!1288}
!1288 = !DISubrange(count: 8)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1283, file: !4, line: 3857, baseType: !1290, size: 256, align: 32, offset: 512)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 256, align: 32, elements: !1287)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1274, file: !4, line: 3903, baseType: !1292, size: 256, align: 64, offset: 960)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1050, size: 256, align: 64, elements: !1293)
!1293 = !{!1294}
!1294 = !DISubrange(count: 4)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1274, file: !4, line: 3904, baseType: !1296, size: 128, align: 32, offset: 1216)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 128, align: 32, elements: !1293)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1274, file: !4, line: 3906, baseType: !750, size: 32, align: 32, offset: 1344)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1274, file: !4, line: 3908, baseType: !1299, size: 64, align: 64, offset: 1408)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64, align: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1274, file: !4, line: 3915, baseType: !1299, size: 64, align: 64, offset: 1472)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1274, file: !4, line: 3917, baseType: !940, size: 32, align: 32, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1261, file: !4, line: 3926, baseType: !1055, size: 64, align: 64, offset: 192)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !1192, file: !4, line: 3564, baseType: !1304, size: 64, align: 64, offset: 1344)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DISubroutineType(types: !1306)
!1306 = !{!940, !1182, !1035, !1307, !1389}
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64, align: 64)
!1308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1309)
!1309 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !767, line: 646, baseType: !1310)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !767, line: 268, size: 4288, align: 64, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1341, !1343, !1344, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1377, !1378, !1379, !1380, !1381, !1382, !1385, !1386, !1387, !1388}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1310, file: !767, line: 282, baseType: !1286, size: 512, align: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1310, file: !767, line: 299, baseType: !1290, size: 256, align: 32, offset: 512)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1310, file: !767, line: 315, baseType: !1315, size: 64, align: 64, offset: 768)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64, align: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1310, file: !767, line: 326, baseType: !940, size: 32, align: 32, offset: 832)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1310, file: !767, line: 326, baseType: !940, size: 32, align: 32, offset: 864)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1310, file: !767, line: 334, baseType: !940, size: 32, align: 32, offset: 896)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1310, file: !767, line: 341, baseType: !940, size: 32, align: 32, offset: 928)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1310, file: !767, line: 346, baseType: !940, size: 32, align: 32, offset: 960)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1310, file: !767, line: 351, baseType: !756, size: 32, align: 32, offset: 992)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1310, file: !767, line: 356, baseType: !1202, size: 64, align: 32, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1310, file: !767, line: 361, baseType: !1055, size: 64, align: 64, offset: 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1310, file: !767, line: 369, baseType: !1055, size: 64, align: 64, offset: 1152)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1310, file: !767, line: 377, baseType: !1055, size: 64, align: 64, offset: 1216)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1310, file: !767, line: 382, baseType: !940, size: 32, align: 32, offset: 1280)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1310, file: !767, line: 386, baseType: !940, size: 32, align: 32, offset: 1312)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1310, file: !767, line: 391, baseType: !940, size: 32, align: 32, offset: 1344)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1310, file: !767, line: 396, baseType: !922, size: 64, align: 64, offset: 1408)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1310, file: !767, line: 403, baseType: !1331, size: 512, align: 64, offset: 1472)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 512, align: 64, elements: !1287)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1310, file: !767, line: 410, baseType: !940, size: 32, align: 32, offset: 1984)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1310, file: !767, line: 415, baseType: !940, size: 32, align: 32, offset: 2016)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1310, file: !767, line: 420, baseType: !940, size: 32, align: 32, offset: 2048)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1310, file: !767, line: 425, baseType: !940, size: 32, align: 32, offset: 2080)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1310, file: !767, line: 435, baseType: !1055, size: 64, align: 64, offset: 2112)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1310, file: !767, line: 440, baseType: !940, size: 32, align: 32, offset: 2176)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1310, file: !767, line: 445, baseType: !1220, size: 64, align: 64, offset: 2240)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1310, file: !767, line: 459, baseType: !1340, size: 512, align: 64, offset: 2304)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 512, align: 64, elements: !1287)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1310, file: !767, line: 473, baseType: !1342, size: 64, align: 64, offset: 2816)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64, align: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1310, file: !767, line: 477, baseType: !940, size: 32, align: 32, offset: 2880)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1310, file: !767, line: 479, baseType: !1345, size: 64, align: 64, offset: 2944)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64, align: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !767, line: 207, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !767, line: 201, size: 320, align: 64, elements: !1349)
!1349 = !{!1350, !1351, !1352, !1353, !1358}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1348, file: !767, line: 202, baseType: !766, size: 32, align: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1348, file: !767, line: 203, baseType: !1050, size: 64, align: 64, offset: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1348, file: !767, line: 204, baseType: !940, size: 32, align: 32, offset: 128)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1348, file: !767, line: 205, baseType: !1354, size: 64, align: 64, offset: 192)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64, align: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1356, line: 86, baseType: !1357)
!1356 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1357 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1356, line: 86, flags: DIFlagFwdDecl)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1348, file: !767, line: 206, baseType: !1040, size: 64, align: 64, offset: 256)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1310, file: !767, line: 480, baseType: !940, size: 32, align: 32, offset: 3008)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1310, file: !767, line: 505, baseType: !940, size: 32, align: 32, offset: 3040)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1310, file: !767, line: 512, baseType: !790, size: 32, align: 32, offset: 3072)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1310, file: !767, line: 514, baseType: !796, size: 32, align: 32, offset: 3104)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1310, file: !767, line: 516, baseType: !814, size: 32, align: 32, offset: 3136)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1310, file: !767, line: 523, baseType: !838, size: 32, align: 32, offset: 3168)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1310, file: !767, line: 525, baseType: !857, size: 32, align: 32, offset: 3200)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1310, file: !767, line: 532, baseType: !1055, size: 64, align: 64, offset: 3264)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1310, file: !767, line: 539, baseType: !1055, size: 64, align: 64, offset: 3328)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1310, file: !767, line: 547, baseType: !1055, size: 64, align: 64, offset: 3392)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1310, file: !767, line: 554, baseType: !1354, size: 64, align: 64, offset: 3456)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1310, file: !767, line: 563, baseType: !940, size: 32, align: 32, offset: 3520)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1310, file: !767, line: 572, baseType: !940, size: 32, align: 32, offset: 3552)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1310, file: !767, line: 581, baseType: !940, size: 32, align: 32, offset: 3584)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1310, file: !767, line: 588, baseType: !1374, size: 64, align: 64, offset: 3648)
!1374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1375, size: 64, align: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !1052, line: 36, baseType: !1376)
!1376 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1310, file: !767, line: 593, baseType: !940, size: 32, align: 32, offset: 3712)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1310, file: !767, line: 596, baseType: !940, size: 32, align: 32, offset: 3744)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1310, file: !767, line: 599, baseType: !1040, size: 64, align: 64, offset: 3776)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1310, file: !767, line: 605, baseType: !1040, size: 64, align: 64, offset: 3840)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1310, file: !767, line: 616, baseType: !1040, size: 64, align: 64, offset: 3904)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1310, file: !767, line: 626, baseType: !1383, size: 64, align: 64, offset: 3968)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1384, line: 216, baseType: !1130)
!1384 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1310, file: !767, line: 627, baseType: !1383, size: 64, align: 64, offset: 4032)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1310, file: !767, line: 628, baseType: !1383, size: 64, align: 64, offset: 4096)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1310, file: !767, line: 629, baseType: !1383, size: 64, align: 64, offset: 4160)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1310, file: !767, line: 645, baseType: !1040, size: 64, align: 64, offset: 4224)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64, align: 64)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !1192, file: !4, line: 3566, baseType: !1391, size: 64, align: 64, offset: 1408)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64, align: 64)
!1392 = !DISubroutineType(types: !1393)
!1393 = !{!940, !1182, !922, !1389, !1035}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !1192, file: !4, line: 3567, baseType: !1236, size: 64, align: 64, offset: 1472)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !1192, file: !4, line: 3576, baseType: !1396, size: 64, align: 64, offset: 1536)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!940, !1182, !1307}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !1192, file: !4, line: 3577, baseType: !1400, size: 64, align: 64, offset: 1600)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64, align: 64)
!1401 = !DISubroutineType(types: !1402)
!1402 = !{!940, !1182, !1035}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !1192, file: !4, line: 3584, baseType: !1404, size: 64, align: 64, offset: 1664)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64, align: 64)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{!940, !1182, !1407}
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64, align: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !1192, file: !4, line: 3589, baseType: !1409, size: 64, align: 64, offset: 1728)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64, align: 64)
!1410 = !DISubroutineType(types: !1411)
!1411 = !{null, !1182}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1192, file: !4, line: 3594, baseType: !940, size: 32, align: 32, offset: 1792)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !1192, file: !4, line: 3600, baseType: !930, size: 64, align: 64, offset: 1856)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !1192, file: !4, line: 3609, baseType: !1415, size: 64, align: 64, offset: 1920)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64, align: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64, align: 64)
!1417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1418)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !4, line: 3609, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1184, file: !4, line: 1566, baseType: !3, size: 32, align: 32, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1184, file: !4, line: 1581, baseType: !921, size: 32, align: 32, offset: 224)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1184, file: !4, line: 1583, baseType: !922, size: 64, align: 64, offset: 256)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1184, file: !4, line: 1591, baseType: !1423, size: 64, align: 64, offset: 320)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64, align: 64)
!1424 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !4, line: 1532, flags: DIFlagFwdDecl)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1184, file: !4, line: 1598, baseType: !922, size: 64, align: 64, offset: 384)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1184, file: !4, line: 1606, baseType: !1055, size: 64, align: 64, offset: 448)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1184, file: !4, line: 1614, baseType: !940, size: 32, align: 32, offset: 512)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1184, file: !4, line: 1622, baseType: !940, size: 32, align: 32, offset: 544)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1184, file: !4, line: 1628, baseType: !940, size: 32, align: 32, offset: 576)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1184, file: !4, line: 1636, baseType: !940, size: 32, align: 32, offset: 608)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1184, file: !4, line: 1643, baseType: !940, size: 32, align: 32, offset: 640)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1184, file: !4, line: 1657, baseType: !1050, size: 64, align: 64, offset: 704)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1184, file: !4, line: 1658, baseType: !940, size: 32, align: 32, offset: 768)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1184, file: !4, line: 1679, baseType: !1202, size: 64, align: 32, offset: 800)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1184, file: !4, line: 1688, baseType: !940, size: 32, align: 32, offset: 864)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1184, file: !4, line: 1712, baseType: !940, size: 32, align: 32, offset: 896)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1184, file: !4, line: 1729, baseType: !940, size: 32, align: 32, offset: 928)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1184, file: !4, line: 1729, baseType: !940, size: 32, align: 32, offset: 960)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1184, file: !4, line: 1744, baseType: !940, size: 32, align: 32, offset: 992)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1184, file: !4, line: 1744, baseType: !940, size: 32, align: 32, offset: 1024)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1184, file: !4, line: 1751, baseType: !940, size: 32, align: 32, offset: 1056)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1184, file: !4, line: 1766, baseType: !533, size: 32, align: 32, offset: 1088)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1184, file: !4, line: 1791, baseType: !1444, size: 64, align: 64, offset: 1152)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64, align: 64)
!1445 = !DISubroutineType(types: !1446)
!1446 = !{null, !1447, !1307, !1389, !940, !940, !940}
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1184, file: !4, line: 1808, baseType: !1449, size: 64, align: 64, offset: 1216)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64, align: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!533, !1447, !1209}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1184, file: !4, line: 1816, baseType: !940, size: 32, align: 32, offset: 1280)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1184, file: !4, line: 1825, baseType: !1454, size: 32, align: 32, offset: 1312)
!1454 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1184, file: !4, line: 1830, baseType: !940, size: 32, align: 32, offset: 1344)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1184, file: !4, line: 1838, baseType: !1454, size: 32, align: 32, offset: 1376)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1184, file: !4, line: 1846, baseType: !940, size: 32, align: 32, offset: 1408)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1184, file: !4, line: 1851, baseType: !940, size: 32, align: 32, offset: 1440)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1184, file: !4, line: 1861, baseType: !1454, size: 32, align: 32, offset: 1472)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1184, file: !4, line: 1868, baseType: !1454, size: 32, align: 32, offset: 1504)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1184, file: !4, line: 1875, baseType: !1454, size: 32, align: 32, offset: 1536)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1184, file: !4, line: 1882, baseType: !1454, size: 32, align: 32, offset: 1568)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1184, file: !4, line: 1889, baseType: !1454, size: 32, align: 32, offset: 1600)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1184, file: !4, line: 1896, baseType: !1454, size: 32, align: 32, offset: 1632)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1184, file: !4, line: 1903, baseType: !1454, size: 32, align: 32, offset: 1664)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1184, file: !4, line: 1910, baseType: !940, size: 32, align: 32, offset: 1696)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1184, file: !4, line: 1915, baseType: !940, size: 32, align: 32, offset: 1728)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1184, file: !4, line: 1926, baseType: !1389, size: 64, align: 64, offset: 1792)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1184, file: !4, line: 1935, baseType: !1202, size: 64, align: 32, offset: 1856)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1184, file: !4, line: 1942, baseType: !940, size: 32, align: 32, offset: 1920)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1184, file: !4, line: 1948, baseType: !940, size: 32, align: 32, offset: 1952)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1184, file: !4, line: 1954, baseType: !940, size: 32, align: 32, offset: 1984)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1184, file: !4, line: 1960, baseType: !940, size: 32, align: 32, offset: 2016)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1184, file: !4, line: 1984, baseType: !940, size: 32, align: 32, offset: 2048)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1184, file: !4, line: 1991, baseType: !940, size: 32, align: 32, offset: 2080)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1184, file: !4, line: 1996, baseType: !940, size: 32, align: 32, offset: 2112)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1184, file: !4, line: 2004, baseType: !940, size: 32, align: 32, offset: 2144)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1184, file: !4, line: 2011, baseType: !940, size: 32, align: 32, offset: 2176)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1184, file: !4, line: 2018, baseType: !940, size: 32, align: 32, offset: 2208)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1184, file: !4, line: 2027, baseType: !940, size: 32, align: 32, offset: 2240)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1184, file: !4, line: 2034, baseType: !940, size: 32, align: 32, offset: 2272)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1184, file: !4, line: 2044, baseType: !940, size: 32, align: 32, offset: 2304)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1184, file: !4, line: 2054, baseType: !1484, size: 64, align: 64, offset: 2368)
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1184, file: !4, line: 2061, baseType: !1484, size: 64, align: 64, offset: 2432)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1184, file: !4, line: 2066, baseType: !940, size: 32, align: 32, offset: 2496)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1184, file: !4, line: 2070, baseType: !940, size: 32, align: 32, offset: 2528)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1184, file: !4, line: 2078, baseType: !940, size: 32, align: 32, offset: 2560)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1184, file: !4, line: 2085, baseType: !940, size: 32, align: 32, offset: 2592)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1184, file: !4, line: 2092, baseType: !940, size: 32, align: 32, offset: 2624)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1184, file: !4, line: 2099, baseType: !940, size: 32, align: 32, offset: 2656)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1184, file: !4, line: 2106, baseType: !940, size: 32, align: 32, offset: 2688)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1184, file: !4, line: 2113, baseType: !940, size: 32, align: 32, offset: 2720)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1184, file: !4, line: 2120, baseType: !940, size: 32, align: 32, offset: 2752)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1184, file: !4, line: 2125, baseType: !940, size: 32, align: 32, offset: 2784)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1184, file: !4, line: 2133, baseType: !940, size: 32, align: 32, offset: 2816)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1184, file: !4, line: 2140, baseType: !940, size: 32, align: 32, offset: 2848)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1184, file: !4, line: 2145, baseType: !940, size: 32, align: 32, offset: 2880)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1184, file: !4, line: 2153, baseType: !940, size: 32, align: 32, offset: 2912)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1184, file: !4, line: 2158, baseType: !940, size: 32, align: 32, offset: 2944)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1184, file: !4, line: 2166, baseType: !796, size: 32, align: 32, offset: 2976)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1184, file: !4, line: 2173, baseType: !814, size: 32, align: 32, offset: 3008)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1184, file: !4, line: 2180, baseType: !838, size: 32, align: 32, offset: 3040)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1184, file: !4, line: 2187, baseType: !790, size: 32, align: 32, offset: 3072)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1184, file: !4, line: 2194, baseType: !857, size: 32, align: 32, offset: 3104)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1184, file: !4, line: 2203, baseType: !940, size: 32, align: 32, offset: 3136)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1184, file: !4, line: 2209, baseType: !867, size: 32, align: 32, offset: 3168)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1184, file: !4, line: 2212, baseType: !940, size: 32, align: 32, offset: 3200)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1184, file: !4, line: 2213, baseType: !940, size: 32, align: 32, offset: 3232)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1184, file: !4, line: 2220, baseType: !733, size: 32, align: 32, offset: 3264)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1184, file: !4, line: 2232, baseType: !940, size: 32, align: 32, offset: 3296)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1184, file: !4, line: 2243, baseType: !940, size: 32, align: 32, offset: 3328)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1184, file: !4, line: 2249, baseType: !940, size: 32, align: 32, offset: 3360)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1184, file: !4, line: 2256, baseType: !940, size: 32, align: 32, offset: 3392)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1184, file: !4, line: 2263, baseType: !1220, size: 64, align: 64, offset: 3456)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1184, file: !4, line: 2270, baseType: !1220, size: 64, align: 64, offset: 3520)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1184, file: !4, line: 2277, baseType: !875, size: 32, align: 32, offset: 3584)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1184, file: !4, line: 2285, baseType: !733, size: 32, align: 32, offset: 3616)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1184, file: !4, line: 2367, baseType: !1520, size: 64, align: 64, offset: 3648)
!1520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1521, size: 64, align: 64)
!1521 = !DISubroutineType(types: !1522)
!1522 = !{!940, !1447, !1407, !940}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1184, file: !4, line: 2383, baseType: !940, size: 32, align: 32, offset: 3712)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1184, file: !4, line: 2386, baseType: !1454, size: 32, align: 32, offset: 3744)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1184, file: !4, line: 2387, baseType: !1454, size: 32, align: 32, offset: 3776)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1184, file: !4, line: 2394, baseType: !940, size: 32, align: 32, offset: 3808)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1184, file: !4, line: 2401, baseType: !940, size: 32, align: 32, offset: 3840)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1184, file: !4, line: 2408, baseType: !940, size: 32, align: 32, offset: 3872)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1184, file: !4, line: 2415, baseType: !940, size: 32, align: 32, offset: 3904)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1184, file: !4, line: 2422, baseType: !940, size: 32, align: 32, offset: 3936)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1184, file: !4, line: 2423, baseType: !1532, size: 64, align: 64, offset: 3968)
!1532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1533, size: 64, align: 64)
!1533 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !4, line: 831, baseType: !1534)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !4, line: 826, size: 128, align: 32, elements: !1535)
!1535 = !{!1536, !1537, !1538, !1539}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1534, file: !4, line: 827, baseType: !940, size: 32, align: 32)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1534, file: !4, line: 828, baseType: !940, size: 32, align: 32, offset: 32)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1534, file: !4, line: 829, baseType: !940, size: 32, align: 32, offset: 64)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1534, file: !4, line: 830, baseType: !1454, size: 32, align: 32, offset: 96)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1184, file: !4, line: 2430, baseType: !1055, size: 64, align: 64, offset: 4032)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1184, file: !4, line: 2437, baseType: !1055, size: 64, align: 64, offset: 4096)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1184, file: !4, line: 2444, baseType: !1454, size: 32, align: 32, offset: 4160)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1184, file: !4, line: 2451, baseType: !1454, size: 32, align: 32, offset: 4192)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1184, file: !4, line: 2458, baseType: !940, size: 32, align: 32, offset: 4224)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1184, file: !4, line: 2469, baseType: !940, size: 32, align: 32, offset: 4256)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1184, file: !4, line: 2475, baseType: !940, size: 32, align: 32, offset: 4288)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1184, file: !4, line: 2481, baseType: !940, size: 32, align: 32, offset: 4320)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1184, file: !4, line: 2485, baseType: !940, size: 32, align: 32, offset: 4352)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1184, file: !4, line: 2489, baseType: !940, size: 32, align: 32, offset: 4384)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1184, file: !4, line: 2493, baseType: !940, size: 32, align: 32, offset: 4416)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1184, file: !4, line: 2501, baseType: !940, size: 32, align: 32, offset: 4448)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1184, file: !4, line: 2506, baseType: !940, size: 32, align: 32, offset: 4480)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1184, file: !4, line: 2510, baseType: !940, size: 32, align: 32, offset: 4512)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1184, file: !4, line: 2514, baseType: !1055, size: 64, align: 64, offset: 4544)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1184, file: !4, line: 2528, baseType: !1556, size: 64, align: 64, offset: 4608)
!1556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1557, size: 64, align: 64)
!1557 = !DISubroutineType(types: !1558)
!1558 = !{null, !1447, !922, !940, !940}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1184, file: !4, line: 2534, baseType: !940, size: 32, align: 32, offset: 4672)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1184, file: !4, line: 2545, baseType: !940, size: 32, align: 32, offset: 4704)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1184, file: !4, line: 2547, baseType: !940, size: 32, align: 32, offset: 4736)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1184, file: !4, line: 2549, baseType: !940, size: 32, align: 32, offset: 4768)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1184, file: !4, line: 2551, baseType: !940, size: 32, align: 32, offset: 4800)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1184, file: !4, line: 2553, baseType: !940, size: 32, align: 32, offset: 4832)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1184, file: !4, line: 2555, baseType: !940, size: 32, align: 32, offset: 4864)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1184, file: !4, line: 2557, baseType: !940, size: 32, align: 32, offset: 4896)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1184, file: !4, line: 2559, baseType: !940, size: 32, align: 32, offset: 4928)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1184, file: !4, line: 2563, baseType: !940, size: 32, align: 32, offset: 4960)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1184, file: !4, line: 2571, baseType: !1299, size: 64, align: 64, offset: 4992)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1184, file: !4, line: 2579, baseType: !1299, size: 64, align: 64, offset: 5056)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1184, file: !4, line: 2586, baseType: !940, size: 32, align: 32, offset: 5120)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1184, file: !4, line: 2615, baseType: !940, size: 32, align: 32, offset: 5152)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1184, file: !4, line: 2627, baseType: !940, size: 32, align: 32, offset: 5184)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1184, file: !4, line: 2637, baseType: !940, size: 32, align: 32, offset: 5216)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1184, file: !4, line: 2681, baseType: !940, size: 32, align: 32, offset: 5248)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1184, file: !4, line: 2709, baseType: !1055, size: 64, align: 64, offset: 5312)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1184, file: !4, line: 2716, baseType: !1578, size: 64, align: 64, offset: 5376)
!1578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1579, size: 64, align: 64)
!1579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1580)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !4, line: 3636, size: 896, align: 64, elements: !1581)
!1581 = !{!1582, !1583, !1584, !1585, !1586, !1587, !1588, !1592, !1596, !1597, !1598, !1599, !1605, !1606, !1607, !1608, !1609}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1580, file: !4, line: 3642, baseType: !930, size: 64, align: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1580, file: !4, line: 3649, baseType: !523, size: 32, align: 32, offset: 64)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1580, file: !4, line: 3656, baseType: !3, size: 32, align: 32, offset: 96)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1580, file: !4, line: 3663, baseType: !533, size: 32, align: 32, offset: 128)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1580, file: !4, line: 3669, baseType: !940, size: 32, align: 32, offset: 160)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1580, file: !4, line: 3682, baseType: !1404, size: 64, align: 64, offset: 192)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1580, file: !4, line: 3698, baseType: !1589, size: 64, align: 64, offset: 256)
!1589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1590, size: 64, align: 64)
!1590 = !DISubroutineType(types: !1591)
!1591 = !{!940, !1182, !1136, !1267}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1580, file: !4, line: 3712, baseType: !1593, size: 64, align: 64, offset: 320)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64, align: 64)
!1594 = !DISubroutineType(types: !1595)
!1595 = !{!940, !1182, !940, !1136, !1267}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1580, file: !4, line: 3726, baseType: !1589, size: 64, align: 64, offset: 384)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1580, file: !4, line: 3737, baseType: !1236, size: 64, align: 64, offset: 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1580, file: !4, line: 3746, baseType: !940, size: 32, align: 32, offset: 512)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1580, file: !4, line: 3757, baseType: !1600, size: 64, align: 64, offset: 576)
!1600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1601, size: 64, align: 64)
!1601 = !DISubroutineType(types: !1602)
!1602 = !{null, !1603}
!1603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1604, size: 64, align: 64)
!1604 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !4, line: 3617, flags: DIFlagFwdDecl)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1580, file: !4, line: 3766, baseType: !1236, size: 64, align: 64, offset: 640)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1580, file: !4, line: 3774, baseType: !1236, size: 64, align: 64, offset: 704)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1580, file: !4, line: 3780, baseType: !940, size: 32, align: 32, offset: 768)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1580, file: !4, line: 3785, baseType: !940, size: 32, align: 32, offset: 800)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1580, file: !4, line: 3795, baseType: !1610, size: 64, align: 64, offset: 832)
!1610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1611, size: 64, align: 64)
!1611 = !DISubroutineType(types: !1612)
!1612 = !{!940, !1182, !1040}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1184, file: !4, line: 2728, baseType: !922, size: 64, align: 64, offset: 5440)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1184, file: !4, line: 2735, baseType: !1331, size: 512, align: 64, offset: 5504)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1184, file: !4, line: 2742, baseType: !940, size: 32, align: 32, offset: 6016)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1184, file: !4, line: 2755, baseType: !940, size: 32, align: 32, offset: 6048)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1184, file: !4, line: 2776, baseType: !940, size: 32, align: 32, offset: 6080)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1184, file: !4, line: 2783, baseType: !940, size: 32, align: 32, offset: 6112)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1184, file: !4, line: 2791, baseType: !940, size: 32, align: 32, offset: 6144)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1184, file: !4, line: 2802, baseType: !1407, size: 64, align: 64, offset: 6208)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1184, file: !4, line: 2811, baseType: !940, size: 32, align: 32, offset: 6272)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1184, file: !4, line: 2821, baseType: !940, size: 32, align: 32, offset: 6304)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1184, file: !4, line: 2830, baseType: !940, size: 32, align: 32, offset: 6336)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1184, file: !4, line: 2840, baseType: !940, size: 32, align: 32, offset: 6368)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1184, file: !4, line: 2851, baseType: !1626, size: 64, align: 64, offset: 6400)
!1626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1627, size: 64, align: 64)
!1627 = !DISubroutineType(types: !1628)
!1628 = !{!940, !1447, !1629, !922, !1389, !940, !940}
!1629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1630, size: 64, align: 64)
!1630 = !DISubroutineType(types: !1631)
!1631 = !{!940, !1447, !922}
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1184, file: !4, line: 2871, baseType: !1633, size: 64, align: 64, offset: 6464)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64, align: 64)
!1634 = !DISubroutineType(types: !1635)
!1635 = !{!940, !1447, !1636, !922, !1389, !940}
!1636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1637, size: 64, align: 64)
!1637 = !DISubroutineType(types: !1638)
!1638 = !{!940, !1447, !922, !940, !940}
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1184, file: !4, line: 2878, baseType: !940, size: 32, align: 32, offset: 6528)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1184, file: !4, line: 2885, baseType: !940, size: 32, align: 32, offset: 6560)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1184, file: !4, line: 3005, baseType: !940, size: 32, align: 32, offset: 6592)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1184, file: !4, line: 3013, baseType: !887, size: 32, align: 32, offset: 6624)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1184, file: !4, line: 3020, baseType: !887, size: 32, align: 32, offset: 6656)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1184, file: !4, line: 3027, baseType: !887, size: 32, align: 32, offset: 6688)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1184, file: !4, line: 3037, baseType: !1050, size: 64, align: 64, offset: 6720)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1184, file: !4, line: 3038, baseType: !940, size: 32, align: 32, offset: 6784)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1184, file: !4, line: 3050, baseType: !1220, size: 64, align: 64, offset: 6848)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1184, file: !4, line: 3065, baseType: !940, size: 32, align: 32, offset: 6912)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1184, file: !4, line: 3083, baseType: !940, size: 32, align: 32, offset: 6944)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1184, file: !4, line: 3092, baseType: !1202, size: 64, align: 32, offset: 6976)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1184, file: !4, line: 3099, baseType: !533, size: 32, align: 32, offset: 7040)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1184, file: !4, line: 3106, baseType: !1202, size: 64, align: 32, offset: 7072)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1184, file: !4, line: 3113, baseType: !1654, size: 64, align: 64, offset: 7168)
!1654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1655, size: 64, align: 64)
!1655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1656)
!1656 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !4, line: 740, baseType: !1657)
!1657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !4, line: 712, size: 384, align: 64, elements: !1658)
!1658 = !{!1659, !1660, !1661, !1662, !1663, !1664, !1667}
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1657, file: !4, line: 713, baseType: !3, size: 32, align: 32)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1657, file: !4, line: 714, baseType: !523, size: 32, align: 32, offset: 32)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1657, file: !4, line: 720, baseType: !930, size: 64, align: 64, offset: 64)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1657, file: !4, line: 724, baseType: !930, size: 64, align: 64, offset: 128)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1657, file: !4, line: 728, baseType: !940, size: 32, align: 32, offset: 192)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1657, file: !4, line: 734, baseType: !1665, size: 64, align: 64, offset: 256)
!1665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1666, size: 64, align: 64)
!1666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1657, file: !4, line: 739, baseType: !1668, size: 64, align: 64, offset: 320)
!1668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1669, size: 64, align: 64)
!1669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1227)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1184, file: !4, line: 3129, baseType: !1055, size: 64, align: 64, offset: 7232)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1184, file: !4, line: 3130, baseType: !1055, size: 64, align: 64, offset: 7296)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1184, file: !4, line: 3131, baseType: !1055, size: 64, align: 64, offset: 7360)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1184, file: !4, line: 3132, baseType: !1055, size: 64, align: 64, offset: 7424)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1184, file: !4, line: 3139, baseType: !1299, size: 64, align: 64, offset: 7488)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1184, file: !4, line: 3147, baseType: !940, size: 32, align: 32, offset: 7552)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1184, file: !4, line: 3165, baseType: !940, size: 32, align: 32, offset: 7584)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1184, file: !4, line: 3172, baseType: !940, size: 32, align: 32, offset: 7616)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1184, file: !4, line: 3180, baseType: !940, size: 32, align: 32, offset: 7648)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1184, file: !4, line: 3191, baseType: !1484, size: 64, align: 64, offset: 7680)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1184, file: !4, line: 3199, baseType: !1050, size: 64, align: 64, offset: 7744)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1184, file: !4, line: 3207, baseType: !1299, size: 64, align: 64, offset: 7808)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1184, file: !4, line: 3214, baseType: !921, size: 32, align: 32, offset: 7872)
