; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--data_uri.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--data_uri.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.URLContext = type { %struct.AVClass*, %struct.URLProtocol*, i8*, i8*, i32, i32, i32, i32, %struct.AVIOInterruptCB, i64, i8*, i8*, i32 }
%struct.URLProtocol = type { i8*, {}*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }
%struct.AVIOInterruptCB = type { i32 (i8*)*, i8* }
%struct.AVDictionary = type opaque

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !24, globals: !31)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavformat--data_uri.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 29, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "./libavutil/log.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23}
!6 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NA", value: 0)
!7 = !DIEnumerator(name: "AV_CLASS_CATEGORY_INPUT", value: 1)
!8 = !DIEnumerator(name: "AV_CLASS_CATEGORY_OUTPUT", value: 2)
!9 = !DIEnumerator(name: "AV_CLASS_CATEGORY_MUXER", value: 3)
!10 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEMUXER", value: 4)
!11 = !DIEnumerator(name: "AV_CLASS_CATEGORY_ENCODER", value: 5)
!12 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DECODER", value: 6)
!13 = !DIEnumerator(name: "AV_CLASS_CATEGORY_FILTER", value: 7)
!14 = !DIEnumerator(name: "AV_CLASS_CATEGORY_BITSTREAM_FILTER", value: 8)
!15 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWSCALER", value: 9)
!16 = !DIEnumerator(name: "AV_CLASS_CATEGORY_SWRESAMPLER", value: 10)
!17 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_OUTPUT", value: 40)
!18 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_VIDEO_INPUT", value: 41)
!19 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_OUTPUT", value: 42)
!20 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_AUDIO_INPUT", value: 43)
!21 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_OUTPUT", value: 44)
!22 = !DIEnumerator(name: "AV_CLASS_CATEGORY_DEVICE_INPUT", value: 45)
!23 = !DIEnumerator(name: "AV_CLASS_CATEGORY_NB", value: 46)
!24 = !{!25, !26, !27, !30}
!25 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !28, line: 119, baseType: !29)
!28 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!29 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!30 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!31 = !{!32}
!32 = distinct !DIGlobalVariable(name: "ff_data_protocol", scope: !0, file: !33, line: 112, type: !34, isLocal: false, isDefinition: true, variable: { i8*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32, %struct.AVDictionary**)*, i32 (%struct.URLContext*, %struct.URLContext**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i8*, i32)*, i32 (%struct.URLContext*, i8*, i32)*, i64 (%struct.URLContext*, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i64 (%struct.URLContext*, i32, i64, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32**, i32*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, i32)*, i32, %struct.AVClass*, i32, i32 (%struct.URLContext*, i32)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.AVIODirEntry**)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*)*, i32 (%struct.URLContext*, %struct.URLContext*)*, i8* }* @ff_data_protocol)
!33 = !DIFile(filename: "libavformat/data_uri.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!34 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !35)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLProtocol", file: !36, line: 100, baseType: !37)
!36 = !DIFile(filename: "libavformat/url.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLProtocol", file: !36, line: 54, size: 1600, align: 64, elements: !38)
!38 = !{!39, !43, !117, !126, !131, !135, !141, !147, !151, !152, !156, !160, !161, !167, !168, !169, !170, !171, !172, !173, !174, !193, !194, !195, !199}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !37, file: !36, line: 55, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64)
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !42)
!42 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "url_open", scope: !37, file: !36, line: 56, baseType: !44, size: 64, align: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64)
!45 = !DISubroutineType(types: !46)
!46 = !{!25, !47, !40, !25}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64, align: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "URLContext", file: !36, line: 52, baseType: !49)
!49 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "URLContext", file: !36, line: 38, size: 768, align: 64, elements: !50)
!50 = !{!51, !92, !95, !96, !98, !99, !100, !101, !102, !112, !114, !115, !116}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !49, file: !36, line: 39, baseType: !52, size: 64, align: 64)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !4, line: 143, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !4, line: 67, size: 640, align: 64, elements: !56)
!56 = !{!57, !58, !62, !66, !67, !68, !69, !73, !79, !81, !85}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !55, file: !4, line: 72, baseType: !40, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !55, file: !4, line: 78, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DISubroutineType(types: !61)
!61 = !{!40, !26}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !55, file: !4, line: 85, baseType: !63, size: 64, align: 64, offset: 128)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !4, line: 85, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !55, file: !4, line: 93, baseType: !25, size: 32, align: 32, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !55, file: !4, line: 99, baseType: !25, size: 32, align: 32, offset: 224)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !55, file: !4, line: 108, baseType: !25, size: 32, align: 32, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !55, file: !4, line: 113, baseType: !70, size: 64, align: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!26, !26, !26}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !55, file: !4, line: 123, baseType: !74, size: 64, align: 64, offset: 384)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64, align: 64)
!75 = !DISubroutineType(types: !76)
!76 = !{!77, !77}
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64, align: 64)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !55, file: !4, line: 130, baseType: !80, size: 32, align: 32, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !4, line: 48, baseType: !3)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !55, file: !4, line: 136, baseType: !82, size: 64, align: 64, offset: 512)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64, align: 64)
!83 = !DISubroutineType(types: !84)
!84 = !{!80, !26}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !55, file: !4, line: 142, baseType: !86, size: 64, align: 64, offset: 576)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64, align: 64)
!87 = !DISubroutineType(types: !88)
!88 = !{!25, !89, !26, !40, !25}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !4, line: 60, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "prot", scope: !49, file: !36, line: 40, baseType: !93, size: 64, align: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !49, file: !36, line: 41, baseType: !26, size: 64, align: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !49, file: !36, line: 42, baseType: !97, size: 64, align: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64, align: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !49, file: !36, line: 43, baseType: !25, size: 32, align: 32, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "max_packet_size", scope: !49, file: !36, line: 44, baseType: !25, size: 32, align: 32, offset: 288)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "is_streamed", scope: !49, file: !36, line: 45, baseType: !25, size: 32, align: 32, offset: 320)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "is_connected", scope: !49, file: !36, line: 46, baseType: !25, size: 32, align: 32, offset: 352)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_callback", scope: !49, file: !36, line: 47, baseType: !103, size: 128, align: 64, offset: 384)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIOInterruptCB", file: !104, line: 61, baseType: !105)
!104 = !DIFile(filename: "libavformat/avio.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIOInterruptCB", file: !104, line: 58, size: 128, align: 64, elements: !106)
!106 = !{!107, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !105, file: !104, line: 59, baseType: !108, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64, align: 64)
!109 = !DISubroutineType(types: !110)
!110 = !{!25, !26}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !105, file: !104, line: 60, baseType: !26, size: 64, align: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "rw_timeout", scope: !49, file: !36, line: 48, baseType: !113, size: 64, align: 64, offset: 512)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !28, line: 40, baseType: !29)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_whitelist", scope: !49, file: !36, line: 49, baseType: !40, size: 64, align: 64, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "protocol_blacklist", scope: !49, file: !36, line: 50, baseType: !40, size: 64, align: 64, offset: 640)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "min_packet_size", scope: !49, file: !36, line: 51, baseType: !25, size: 32, align: 32, offset: 704)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "url_open2", scope: !37, file: !36, line: 62, baseType: !118, size: 64, align: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64, align: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{!25, !47, !40, !25, !121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64, align: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !124, line: 86, baseType: !125)
!124 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !124, line: 86, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "url_accept", scope: !37, file: !36, line: 63, baseType: !127, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!128 = !DISubroutineType(types: !129)
!129 = !{!25, !47, !130}
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "url_handshake", scope: !37, file: !36, line: 64, baseType: !132, size: 64, align: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64, align: 64)
!133 = !DISubroutineType(types: !134)
!134 = !{!25, !47}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "url_read", scope: !37, file: !36, line: 78, baseType: !136, size: 64, align: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64, align: 64)
!137 = !DISubroutineType(types: !138)
!138 = !{!25, !47, !139, !25}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64, align: 64)
!140 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "url_write", scope: !37, file: !36, line: 79, baseType: !142, size: 64, align: 64, offset: 384)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64, align: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{!25, !47, !145, !25}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "url_seek", scope: !37, file: !36, line: 80, baseType: !148, size: 64, align: 64, offset: 448)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64, align: 64)
!149 = !DISubroutineType(types: !150)
!150 = !{!113, !47, !113, !25}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "url_close", scope: !37, file: !36, line: 81, baseType: !132, size: 64, align: 64, offset: 512)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_pause", scope: !37, file: !36, line: 82, baseType: !153, size: 64, align: 64, offset: 576)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!25, !47, !25}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_seek", scope: !37, file: !36, line: 83, baseType: !157, size: 64, align: 64, offset: 640)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64, align: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!113, !47, !25, !113, !25}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_file_handle", scope: !37, file: !36, line: 85, baseType: !132, size: 64, align: 64, offset: 704)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_multi_file_handle", scope: !37, file: !36, line: 86, baseType: !162, size: 64, align: 64, offset: 768)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64, align: 64)
!163 = !DISubroutineType(types: !164)
!164 = !{!25, !47, !165, !166}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "url_get_short_seek", scope: !37, file: !36, line: 88, baseType: !132, size: 64, align: 64, offset: 832)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "url_shutdown", scope: !37, file: !36, line: 89, baseType: !153, size: 64, align: 64, offset: 896)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !37, file: !36, line: 90, baseType: !25, size: 32, align: 32, offset: 960)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_class", scope: !37, file: !36, line: 91, baseType: !52, size: 64, align: 64, offset: 1024)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !37, file: !36, line: 92, baseType: !25, size: 32, align: 32, offset: 1088)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "url_check", scope: !37, file: !36, line: 93, baseType: !153, size: 64, align: 64, offset: 1152)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "url_open_dir", scope: !37, file: !36, line: 94, baseType: !132, size: 64, align: 64, offset: 1216)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "url_read_dir", scope: !37, file: !36, line: 95, baseType: !175, size: 64, align: 64, offset: 1280)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64, align: 64)
!176 = !DISubroutineType(types: !177)
!177 = !{!25, !47, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVIODirEntry", file: !104, line: 101, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVIODirEntry", file: !104, line: 86, size: 576, align: 64, elements: !182)
!182 = !{!183, !184, !185, !186, !187, !188, !189, !190, !191, !192}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !104, line: 87, baseType: !97, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !181, file: !104, line: 88, baseType: !25, size: 32, align: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "utf8", scope: !181, file: !104, line: 89, baseType: !25, size: 32, align: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !181, file: !104, line: 91, baseType: !113, size: 64, align: 64, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "modification_timestamp", scope: !181, file: !104, line: 92, baseType: !113, size: 64, align: 64, offset: 192)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "access_timestamp", scope: !181, file: !104, line: 94, baseType: !113, size: 64, align: 64, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "status_change_timestamp", scope: !181, file: !104, line: 96, baseType: !113, size: 64, align: 64, offset: 320)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !181, file: !104, line: 98, baseType: !113, size: 64, align: 64, offset: 384)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "group_id", scope: !181, file: !104, line: 99, baseType: !113, size: 64, align: 64, offset: 448)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "filemode", scope: !181, file: !104, line: 100, baseType: !113, size: 64, align: 64, offset: 512)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "url_close_dir", scope: !37, file: !36, line: 96, baseType: !132, size: 64, align: 64, offset: 1344)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "url_delete", scope: !37, file: !36, line: 97, baseType: !132, size: 64, align: 64, offset: 1408)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "url_move", scope: !37, file: !36, line: 98, baseType: !196, size: 64, align: 64, offset: 1472)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!197 = !DISubroutineType(types: !198)
!198 = !{!25, !47, !47}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "default_whitelist", scope: !37, file: !36, line: 99, baseType: !40, size: 64, align: 64, offset: 1536)
!200 = !{i32 2, !"Dwarf Version", i32 4}
!201 = !{i32 2, !"Debug Info Version", i32 3}
!202 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!203 = distinct !DISubprogram(name: "data_open", scope: !33, file: !33, line: 33, type: !45, isLocal: true, isDefinition: true, scopeLine: 34, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !204)
!204 = !{}
!205 = !DILocalVariable(name: "h", arg: 1, scope: !203, file: !33, line: 33, type: !47)
!206 = !DIExpression()
!207 = !DILocation(line: 33, column: 56, scope: !203)
!208 = !DILocalVariable(name: "uri", arg: 2, scope: !203, file: !33, line: 33, type: !40)
!209 = !DILocation(line: 33, column: 71, scope: !203)
!210 = !DILocalVariable(name: "flags", arg: 3, scope: !203, file: !33, line: 33, type: !25)
!211 = !DILocation(line: 33, column: 80, scope: !203)
!212 = !DILocalVariable(name: "dc", scope: !203, file: !33, line: 35, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "DataContext", file: !33, line: 31, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 26, size: 256, align: 64, elements: !216)
!216 = !{!217, !221, !222, !226}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !33, line: 27, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !28, line: 48, baseType: !140)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tofree", scope: !215, file: !33, line: 28, baseType: !26, size: 64, align: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !33, line: 29, baseType: !223, size: 64, align: 64, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !224, line: 216, baseType: !225)
!224 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!225 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !215, file: !33, line: 30, baseType: !223, size: 64, align: 64, offset: 192)
!227 = !DILocation(line: 35, column: 18, scope: !203)
!228 = !DILocation(line: 35, column: 23, scope: !203)
!229 = !DILocation(line: 35, column: 26, scope: !203)
!230 = !DILocalVariable(name: "data", scope: !203, file: !33, line: 36, type: !40)
!231 = !DILocation(line: 36, column: 17, scope: !203)
!232 = !DILocalVariable(name: "opt", scope: !203, file: !33, line: 36, type: !40)
!233 = !DILocation(line: 36, column: 24, scope: !203)
!234 = !DILocalVariable(name: "next", scope: !203, file: !33, line: 36, type: !40)
!235 = !DILocation(line: 36, column: 30, scope: !203)
!236 = !DILocalVariable(name: "ddata", scope: !203, file: !33, line: 37, type: !97)
!237 = !DILocation(line: 37, column: 11, scope: !203)
!238 = !DILocalVariable(name: "ret", scope: !203, file: !33, line: 38, type: !25)
!239 = !DILocation(line: 38, column: 9, scope: !203)
!240 = !DILocalVariable(name: "base64", scope: !203, file: !33, line: 38, type: !25)
!241 = !DILocation(line: 38, column: 14, scope: !203)
!242 = !DILocalVariable(name: "in_size", scope: !203, file: !33, line: 39, type: !223)
!243 = !DILocation(line: 39, column: 12, scope: !203)
!244 = !DILocation(line: 43, column: 17, scope: !203)
!245 = !DILocation(line: 43, column: 5, scope: !203)
!246 = !DILocation(line: 44, column: 19, scope: !203)
!247 = !DILocation(line: 44, column: 12, scope: !203)
!248 = !DILocation(line: 44, column: 10, scope: !203)
!249 = !DILocation(line: 45, column: 10, scope: !250)
!250 = distinct !DILexicalBlock(scope: !203, file: !33, line: 45, column: 9)
!251 = !DILocation(line: 45, column: 9, scope: !203)
!252 = !DILocation(line: 46, column: 16, scope: !253)
!253 = distinct !DILexicalBlock(scope: !250, file: !33, line: 45, column: 16)
!254 = !DILocation(line: 46, column: 9, scope: !253)
!255 = !DILocation(line: 47, column: 9, scope: !253)
!256 = !DILocation(line: 49, column: 11, scope: !203)
!257 = !DILocation(line: 49, column: 9, scope: !203)
!258 = !DILocation(line: 50, column: 5, scope: !203)
!259 = !DILocation(line: 50, column: 12, scope: !260)
!260 = !DILexicalBlockFile(scope: !203, file: !33, discriminator: 1)
!261 = !DILocation(line: 50, column: 18, scope: !260)
!262 = !DILocation(line: 50, column: 16, scope: !260)
!263 = !DILocation(line: 50, column: 5, scope: !260)
!264 = !DILocation(line: 51, column: 36, scope: !265)
!265 = distinct !DILexicalBlock(scope: !203, file: !33, line: 50, column: 24)
!266 = !DILocation(line: 51, column: 46, scope: !265)
!267 = !DILocation(line: 51, column: 53, scope: !265)
!268 = !DILocation(line: 51, column: 51, scope: !265)
!269 = !DILocation(line: 51, column: 29, scope: !265)
!270 = !DILocation(line: 51, column: 59, scope: !265)
!271 = !DILocation(line: 51, column: 16, scope: !272)
!272 = !DILexicalBlockFile(scope: !265, file: !33, discriminator: 1)
!273 = !DILocation(line: 51, column: 14, scope: !265)
!274 = !DILocation(line: 52, column: 13, scope: !275)
!275 = distinct !DILexicalBlock(scope: !265, file: !33, line: 52, column: 13)
!276 = !DILocation(line: 52, column: 20, scope: !275)
!277 = !DILocation(line: 52, column: 17, scope: !275)
!278 = !DILocation(line: 52, column: 13, scope: !265)
!279 = !DILocation(line: 53, column: 25, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !33, line: 53, column: 17)
!281 = distinct !DILexicalBlock(scope: !275, file: !33, line: 52, column: 25)
!282 = !DILocation(line: 53, column: 35, scope: !280)
!283 = !DILocation(line: 53, column: 42, scope: !280)
!284 = !DILocation(line: 53, column: 40, scope: !280)
!285 = !DILocation(line: 53, column: 18, scope: !280)
!286 = !DILocation(line: 53, column: 17, scope: !281)
!287 = !DILocation(line: 54, column: 24, scope: !288)
!288 = distinct !DILexicalBlock(scope: !280, file: !33, line: 53, column: 48)
!289 = !DILocation(line: 55, column: 30, scope: !288)
!290 = !DILocation(line: 55, column: 37, scope: !288)
