; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dirac_dwt.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dirac_dwt.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.DWTContext = type { i8*, i8*, i32, i32, i32, i32, i32, void (%struct.DWTContext*, i32, i32, i32, i32)*, void ()*, void ()*, void ()*, void ()*, void ()*, void (i8*, i8*, i32)*, [8 x %struct.DWTCompose] }
%struct.DWTCompose = type { [8 x i8*], i32 }
%struct.DWTPlane = type { i32, i32, i32, i8*, i8*, i8* }

@.str = private unnamed_addr constant [28 x i8] c"Unsupported bit depth = %i\0A\00", align 1
@.str.1 = private unnamed_addr constant [25 x i8] c"Unknown wavelet type %d\0A\00", align 1

; Function Attrs: nounwind uwtable
define i32 @ff_spatial_idwt_init(%struct.DWTContext* %d, %struct.DWTPlane* %p, i32 %type, i32 %decomposition_count, i32 %bit_depth) #0 !dbg !33 {
entry:
  %retval = alloca i32, align 4
  %d.addr = alloca %struct.DWTContext*, align 8
  %p.addr = alloca %struct.DWTPlane*, align 8
  %type.addr = alloca i32, align 4
  %decomposition_count.addr = alloca i32, align 4
  %bit_depth.addr = alloca i32, align 4
  %ret = alloca i32, align 4
  store %struct.DWTContext* %d, %struct.DWTContext** %d.addr, align 8
  call void @llvm.dbg.declare(metadata %struct.DWTContext** %d.addr, metadata !86, metadata !87), !dbg !88

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.0 (tags/RELEASE_390/final)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !16)
!1 = !DIFile(filename: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--dirac_dwt.o.i", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dwt_type", file: !4, line: 74, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "libavcodec/dirac_dwt.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15}
!6 = !DIEnumerator(name: "DWT_SNOW_DAUB9_7", value: 0)
!7 = !DIEnumerator(name: "DWT_SNOW_LEGALL5_3", value: 1)
!8 = !DIEnumerator(name: "DWT_DIRAC_DD9_7", value: 2)
!9 = !DIEnumerator(name: "DWT_DIRAC_LEGALL5_3", value: 3)
!10 = !DIEnumerator(name: "DWT_DIRAC_DD13_7", value: 4)
!11 = !DIEnumerator(name: "DWT_DIRAC_HAAR0", value: 5)
!12 = !DIEnumerator(name: "DWT_DIRAC_HAAR1", value: 6)
!13 = !DIEnumerator(name: "DWT_DIRAC_FIDELITY", value: 7)
!14 = !DIEnumerator(name: "DWT_DIRAC_DAUB9_7", value: 8)
!15 = !DIEnumerator(name: "DWT_NUM_TYPES", value: 9)
!16 = !{!17, !18, !19, !20, !24, !28}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 48, baseType: !23)
!22 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!23 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64, align: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !26, line: 195, baseType: !27)
!26 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!27 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !26, line: 196, baseType: !18)
!30 = !{i32 2, !"Dwarf Version", i32 4}
!31 = !{i32 2, !"Debug Info Version", i32 3}
!32 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!33 = distinct !DISubprogram(name: "ff_spatial_idwt_init", scope: !34, file: !34, line: 36, type: !35, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !85)
!34 = !DIFile(filename: "libavcodec/dirac_dwt.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!35 = !DISubroutineType(types: !36)
!36 = !{!18, !37, !75, !3, !18, !18}
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWTContext", file: !4, line: 72, baseType: !39)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DWTContext", file: !4, line: 54, size: 5376, align: 64, elements: !40)
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !53, !57, !58, !59, !60, !61, !65}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !39, file: !4, line: 55, baseType: !20, size: 64, align: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !39, file: !4, line: 56, baseType: !20, size: 64, align: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !39, file: !4, line: 57, baseType: !18, size: 32, align: 32, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !39, file: !4, line: 58, baseType: !18, size: 32, align: 32, offset: 160)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !39, file: !4, line: 59, baseType: !18, size: 32, align: 32, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "decomposition_count", scope: !39, file: !4, line: 60, baseType: !18, size: 32, align: 32, offset: 224)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "support", scope: !39, file: !4, line: 61, baseType: !18, size: 32, align: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_compose", scope: !39, file: !4, line: 63, baseType: !49, size: 64, align: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64, align: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{null, !52, !18, !18, !18, !18}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64, align: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_compose_l0", scope: !39, file: !4, line: 64, baseType: !54, size: 64, align: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_compose_h0", scope: !39, file: !4, line: 65, baseType: !54, size: 64, align: 64, offset: 448)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_compose_l1", scope: !39, file: !4, line: 66, baseType: !54, size: 64, align: 64, offset: 512)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_compose_h1", scope: !39, file: !4, line: 67, baseType: !54, size: 64, align: 64, offset: 576)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "vertical_compose", scope: !39, file: !4, line: 68, baseType: !54, size: 64, align: 64, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "horizontal_compose", scope: !39, file: !4, line: 69, baseType: !62, size: 64, align: 64, offset: 704)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64, align: 64)
!63 = !DISubroutineType(types: !64)
!64 = !{null, !20, !20, !18}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "cs", scope: !39, file: !4, line: 71, baseType: !66, size: 4608, align: 64, offset: 768)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 4608, align: 64, elements: !72)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWTCompose", file: !4, line: 35, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DWTCompose", file: !4, line: 32, size: 576, align: 64, elements: !69)
!69 = !{!70, !74}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !68, file: !4, line: 33, baseType: !71, size: 512, align: 64)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 512, align: 64, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 8)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !68, file: !4, line: 34, baseType: !18, size: 32, align: 32, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64, align: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWTPlane", file: !4, line: 44, baseType: !77)
!77 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DWTPlane", file: !4, line: 37, size: 320, align: 64, elements: !78)
!78 = !{!79, !80, !81, !82, !83, !84}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !77, file: !4, line: 38, baseType: !18, size: 32, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !77, file: !4, line: 39, baseType: !18, size: 32, align: 32, offset: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !77, file: !4, line: 40, baseType: !18, size: 32, align: 32, offset: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !77, file: !4, line: 41, baseType: !20, size: 64, align: 64, offset: 128)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "buf_base", scope: !77, file: !4, line: 42, baseType: !20, size: 64, align: 64, offset: 192)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "tmp", scope: !77, file: !4, line: 43, baseType: !20, size: 64, align: 64, offset: 256)
!85 = !{}
!86 = !DILocalVariable(name: "d", arg: 1, scope: !33, file: !34, line: 36, type: !37)
!87 = !DIExpression()
!88 = !DILocation(line: 36, column: 38, scope: !33)
!89 = !DILocalVariable(name: "p", arg: 2, scope: !33, file: !34, line: 36, type: !75)
!90 = !DILocation(line: 36, column: 51, scope: !33)
!91 = !DILocalVariable(name: "type", arg: 3, scope: !33, file: !34, line: 36, type: !3)
!92 = !DILocation(line: 36, column: 68, scope: !33)
!93 = !DILocalVariable(name: "decomposition_count", arg: 4, scope: !33, file: !34, line: 37, type: !18)
!94 = !DILocation(line: 37, column: 30, scope: !33)
!95 = !DILocalVariable(name: "bit_depth", arg: 5, scope: !33, file: !34, line: 37, type: !18)
!96 = !DILocation(line: 37, column: 55, scope: !33)
!97 = !DILocalVariable(name: "ret", scope: !33, file: !34, line: 39, type: !18)
!98 = !DILocation(line: 39, column: 9, scope: !33)
!99 = !DILocation(line: 41, column: 17, scope: !33)
!100 = !DILocation(line: 41, column: 20, scope: !33)
!101 = !DILocation(line: 41, column: 5, scope: !33)
!102 = !DILocation(line: 41, column: 8, scope: !33)
!103 = !DILocation(line: 41, column: 15, scope: !33)
!104 = !DILocation(line: 42, column: 16, scope: !33)
!105 = !DILocation(line: 42, column: 19, scope: !33)
!106 = !DILocation(line: 42, column: 5, scope: !33)
!107 = !DILocation(line: 42, column: 8, scope: !33)
!108 = !DILocation(line: 42, column: 14, scope: !33)
!109 = !DILocation(line: 43, column: 17, scope: !33)
!110 = !DILocation(line: 43, column: 20, scope: !33)
!111 = !DILocation(line: 43, column: 5, scope: !33)
!112 = !DILocation(line: 43, column: 8, scope: !33)
!113 = !DILocation(line: 43, column: 15, scope: !33)
!114 = !DILocation(line: 44, column: 17, scope: !33)
!115 = !DILocation(line: 44, column: 20, scope: !33)
!116 = !DILocation(line: 44, column: 5, scope: !33)
!117 = !DILocation(line: 44, column: 8, scope: !33)
!118 = !DILocation(line: 44, column: 15, scope: !33)
!119 = !DILocation(line: 45, column: 15, scope: !33)
!120 = !DILocation(line: 45, column: 18, scope: !33)
!121 = !DILocation(line: 45, column: 5, scope: !33)
!122 = !DILocation(line: 45, column: 8, scope: !33)
!123 = !DILocation(line: 45, column: 13, scope: !33)
!124 = !DILocation(line: 46, column: 30, scope: !33)
!125 = !DILocation(line: 46, column: 5, scope: !33)
!126 = !DILocation(line: 46, column: 8, scope: !33)
!127 = !DILocation(line: 46, column: 28, scope: !33)
!128 = !DILocation(line: 48, column: 9, scope: !129)
!129 = distinct !DILexicalBlock(scope: !33, file: !34, line: 48, column: 9)
!130 = !DILocation(line: 48, column: 19, scope: !129)
!131 = !DILocation(line: 48, column: 9, scope: !33)
!132 = !DILocation(line: 49, column: 41, scope: !129)
!133 = !DILocation(line: 49, column: 44, scope: !129)
!134 = !DILocation(line: 49, column: 15, scope: !129)
!135 = !DILocation(line: 49, column: 13, scope: !129)
!136 = !DILocation(line: 49, column: 9, scope: !129)
!137 = !DILocation(line: 50, column: 14, scope: !138)
!138 = distinct !DILexicalBlock(scope: !129, file: !34, line: 50, column: 14)
!139 = !DILocation(line: 50, column: 24, scope: !138)
!140 = !DILocation(line: 50, column: 14, scope: !129)
!141 = !DILocation(line: 51, column: 42, scope: !138)
!142 = !DILocation(line: 51, column: 45, scope: !138)
!143 = !DILocation(line: 51, column: 15, scope: !138)
!144 = !DILocation(line: 51, column: 13, scope: !138)
!145 = !DILocation(line: 51, column: 9, scope: !138)
!146 = !DILocation(line: 52, column: 14, scope: !147)
!147 = distinct !DILexicalBlock(scope: !138, file: !34, line: 52, column: 14)
!148 = !DILocation(line: 52, column: 24, scope: !147)
!149 = !DILocation(line: 52, column: 14, scope: !138)
!150 = !DILocation(line: 53, column: 42, scope: !147)
!151 = !DILocation(line: 53, column: 45, scope: !147)
!152 = !DILocation(line: 53, column: 15, scope: !147)
!153 = !DILocation(line: 53, column: 13, scope: !147)
