; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp9_raw_reorder_bsf.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--vp9_raw_reorder_bsf.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }
%struct.AVBSFContext = type { %struct.AVClass*, %struct.AVBitStreamFilter*, %struct.AVBSFInternal*, i8*, %struct.AVCodecParameters*, %struct.AVCodecParameters*, %struct.AVRational, %struct.AVRational }
%struct.AVBitStreamFilter = type { i8*, i32*, %struct.AVClass*, i32, {}*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }
%struct.AVBSFInternal = type opaque
%struct.AVCodecParameters = type { i32, i32, i32, i8*, i32, i32, i64, i32, i32, i32, i32, i32, i32, %struct.AVRational, i32, i32, i32, i32, i32, i32, i32, i64, i32, i32, i32, i32, i32, i32, i32 }
%struct.AVRational = type { i32, i32 }

!588 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!589 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!590 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!591 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!592 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !525, line: 538, size: 32, align: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !601}
!594 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!595 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!596 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!597 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!598 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!599 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!600 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!601 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!602 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !4, line: 1175, size: 32, align: 32, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!604 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!605 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!606 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!607 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!608 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!609 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!610 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!611 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!612 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!613 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!614 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!615 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!616 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!617 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!618 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!619 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!620 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!621 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!622 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!623 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!624 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!625 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!626 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!627 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!628 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!629 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!630 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!631 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!632 = !{!633, !634, !635, !638, !639, !646, !648}
!633 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!634 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !636, line: 197, baseType: !637)
!636 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!637 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "unaligned_32", file: !641, line: 221, size: 32, align: 8, elements: !642)
!641 = !DIFile(filename: "./libavutil/intreadwrite.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "l", scope: !640, file: !641, line: 221, baseType: !644, size: 32, align: 32)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !645, line: 51, baseType: !634)
!645 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !645, line: 48, baseType: !649)
!649 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!650 = !{!651, !844}
!651 = distinct !DIGlobalVariable(name: "ff_vp9_raw_reorder_bsf", scope: !0, file: !652, line: 401, type: !653, isLocal: false, isDefinition: true, variable: { i8*, i32*, %struct.AVClass*, i32, i32 (%struct.AVBSFContext*)*, i32 (%struct.AVBSFContext*, %struct.AVPacket*)*, void (%struct.AVBSFContext*)*, void (%struct.AVBSFContext*)* }* @ff_vp9_raw_reorder_bsf)
!652 = !DIFile(filename: "libavcodec/vp9_raw_reorder_bsf.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBitStreamFilter", file: !4, line: 5830, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBitStreamFilter", file: !4, line: 5796, size: 512, align: 64, elements: !656)
!656 = !{!657, !661, !664, !743, !744, !801, !839, !843}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !655, file: !4, line: 5797, baseType: !658, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "codec_ids", scope: !655, file: !4, line: 5804, baseType: !662, size: 64, align: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !655, file: !4, line: 5815, baseType: !665, size: 64, align: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !486, line: 143, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !486, line: 67, size: 640, align: 64, elements: !669)
!669 = !{!670, !671, !675, !702, !703, !704, !705, !709, !715, !717, !721}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !668, file: !486, line: 72, baseType: !658, size: 64, align: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !668, file: !486, line: 78, baseType: !672, size: 64, align: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64, align: 64)
!673 = !DISubroutineType(types: !674)
!674 = !{!658, !638}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !668, file: !486, line: 85, baseType: !676, size: 64, align: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64, align: 64)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !464, line: 246, size: 512, align: 64, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !698, !699, !700, !701}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !464, line: 247, baseType: !658, size: 64, align: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !678, file: !464, line: 253, baseType: !658, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !678, file: !464, line: 259, baseType: !633, size: 32, align: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !678, file: !464, line: 260, baseType: !463, size: 32, align: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !678, file: !464, line: 271, baseType: !685, size: 64, align: 64, offset: 192)
!685 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !464, line: 265, size: 64, align: 64, elements: !686)
!686 = !{!687, !688, !690, !691}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !685, file: !464, line: 266, baseType: !635, size: 64, align: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !685, file: !464, line: 267, baseType: !689, size: 64, align: 64)
!689 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !685, file: !464, line: 268, baseType: !658, size: 64, align: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !685, file: !464, line: 270, baseType: !692, size: 64, align: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !693, line: 61, baseType: !694)
!693 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !693, line: 58, size: 64, align: 32, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !694, file: !693, line: 59, baseType: !633, size: 32, align: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !694, file: !693, line: 60, baseType: !633, size: 32, align: 32, offset: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !678, file: !464, line: 272, baseType: !689, size: 64, align: 64, offset: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !678, file: !464, line: 273, baseType: !689, size: 64, align: 64, offset: 320)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !678, file: !464, line: 275, baseType: !633, size: 32, align: 32, offset: 384)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !678, file: !464, line: 300, baseType: !658, size: 64, align: 64, offset: 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !668, file: !486, line: 93, baseType: !633, size: 32, align: 32, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !668, file: !486, line: 99, baseType: !633, size: 32, align: 32, offset: 224)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !668, file: !486, line: 108, baseType: !633, size: 32, align: 32, offset: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !668, file: !486, line: 113, baseType: !706, size: 64, align: 64, offset: 320)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64, align: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!638, !638, !638}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !668, file: !486, line: 123, baseType: !710, size: 64, align: 64, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64, align: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{!713, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64, align: 64)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !668, file: !486, line: 130, baseType: !716, size: 32, align: 32, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !486, line: 48, baseType: !485)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !668, file: !486, line: 136, baseType: !718, size: 64, align: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64, align: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!716, !638}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !668, file: !486, line: 142, baseType: !722, size: 64, align: 64, offset: 576)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64, align: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!633, !725, !638, !658, !633}
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64, align: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64, align: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !464, line: 329, size: 128, align: 64, elements: !728)
!728 = !{!729, !741, !742}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !727, file: !464, line: 360, baseType: !730, size: 64, align: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64, align: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64, align: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !464, line: 324, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !464, line: 306, size: 384, align: 64, elements: !734)
!734 = !{!735, !736, !737, !738, !739, !740}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !733, file: !464, line: 307, baseType: !658, size: 64, align: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !733, file: !464, line: 313, baseType: !689, size: 64, align: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !733, file: !464, line: 313, baseType: !689, size: 64, align: 64, offset: 128)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !733, file: !464, line: 318, baseType: !689, size: 64, align: 64, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !733, file: !464, line: 318, baseType: !689, size: 64, align: 64, offset: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !733, file: !464, line: 323, baseType: !633, size: 32, align: 32, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !727, file: !464, line: 364, baseType: !633, size: 32, align: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !727, file: !464, line: 368, baseType: !633, size: 32, align: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !655, file: !4, line: 5825, baseType: !633, size: 32, align: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !655, file: !4, line: 5826, baseType: !745, size: 64, align: 64, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64, align: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!633, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64, align: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFContext", file: !4, line: 5794, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFContext", file: !4, line: 5747, size: 512, align: 64, elements: !751)
!751 = !{!752, !753, !756, !760, !761, !798, !799, !800}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !750, file: !4, line: 5751, baseType: !665, size: 64, align: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !750, file: !4, line: 5756, baseType: !754, size: 64, align: 64, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64, align: 64)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !750, file: !4, line: 5762, baseType: !757, size: 64, align: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64, align: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBSFInternal", file: !4, line: 5735, baseType: !759)
!759 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBSFInternal", file: !4, line: 5735, flags: DIFlagFwdDecl)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !750, file: !4, line: 5768, baseType: !638, size: 64, align: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "par_in", scope: !750, file: !4, line: 5775, baseType: !762, size: 64, align: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64, align: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecParameters", file: !4, line: 4085, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecParameters", file: !4, line: 3936, size: 1152, align: 64, elements: !765)
!765 = !{!766, !767, !768, !769, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !791, !792, !793, !794, !795, !796, !797}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !764, file: !4, line: 3940, baseType: !506, size: 32, align: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !764, file: !4, line: 3944, baseType: !3, size: 32, align: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !764, file: !4, line: 3948, baseType: !644, size: 32, align: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !764, file: !4, line: 3958, baseType: !770, size: 64, align: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64, align: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !764, file: !4, line: 3962, baseType: !633, size: 32, align: 32, offset: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !764, file: !4, line: 3968, baseType: !633, size: 32, align: 32, offset: 224)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !764, file: !4, line: 3973, baseType: !635, size: 64, align: 64, offset: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !764, file: !4, line: 3986, baseType: !633, size: 32, align: 32, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !764, file: !4, line: 3999, baseType: !633, size: 32, align: 32, offset: 352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !764, file: !4, line: 4004, baseType: !633, size: 32, align: 32, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !764, file: !4, line: 4005, baseType: !633, size: 32, align: 32, offset: 416)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !764, file: !4, line: 4010, baseType: !633, size: 32, align: 32, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !764, file: !4, line: 4011, baseType: !633, size: 32, align: 32, offset: 480)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !764, file: !4, line: 4020, baseType: !692, size: 64, align: 32, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !764, file: !4, line: 4025, baseType: !516, size: 32, align: 32, offset: 576)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !764, file: !4, line: 4030, baseType: !524, size: 32, align: 32, offset: 608)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !764, file: !4, line: 4031, baseType: !531, size: 32, align: 32, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !764, file: !4, line: 4032, baseType: !549, size: 32, align: 32, offset: 672)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "color_space", scope: !764, file: !4, line: 4033, baseType: !573, size: 32, align: 32, offset: 704)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !764, file: !4, line: 4034, baseType: !592, size: 32, align: 32, offset: 736)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "video_delay", scope: !764, file: !4, line: 4039, baseType: !633, size: 32, align: 32, offset: 768)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !764, file: !4, line: 4046, baseType: !789, size: 64, align: 64, offset: 832)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !645, line: 55, baseType: !790)
!790 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !764, file: !4, line: 4050, baseType: !633, size: 32, align: 32, offset: 896)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !764, file: !4, line: 4054, baseType: !633, size: 32, align: 32, offset: 928)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !764, file: !4, line: 4061, baseType: !633, size: 32, align: 32, offset: 960)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !764, file: !4, line: 4065, baseType: !633, size: 32, align: 32, offset: 992)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !764, file: !4, line: 4073, baseType: !633, size: 32, align: 32, offset: 1024)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !764, file: !4, line: 4080, baseType: !633, size: 32, align: 32, offset: 1056)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !764, file: !4, line: 4084, baseType: !633, size: 32, align: 32, offset: 1088)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "par_out", scope: !750, file: !4, line: 5781, baseType: !762, size: 64, align: 64, offset: 320)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_in", scope: !750, file: !4, line: 5787, baseType: !692, size: 64, align: 32, offset: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "time_base_out", scope: !750, file: !4, line: 5793, baseType: !692, size: 64, align: 32, offset: 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !655, file: !4, line: 5827, baseType: !802, size: 64, align: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64, align: 64)
!803 = !DISubroutineType(types: !804)
!804 = !{!633, !748, !805}
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !4, line: 1499, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !4, line: 1445, size: 704, align: 64, elements: !808)
!808 = !{!809, !821, !822, !823, !824, !825, !826, !827, !835, !836, !837, !838}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !807, file: !4, line: 1451, baseType: !810, size: 64, align: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64, align: 64)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !812, line: 94, baseType: !813)
!812 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !812, line: 81, size: 192, align: 64, elements: !814)
!814 = !{!815, !819, !820}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !813, file: !812, line: 82, baseType: !816, size: 64, align: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64, align: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !812, line: 73, baseType: !818)
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !812, line: 73, flags: DIFlagFwdDecl)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !813, file: !812, line: 89, baseType: !770, size: 64, align: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !813, file: !812, line: 93, baseType: !633, size: 32, align: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !807, file: !4, line: 1461, baseType: !635, size: 64, align: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !807, file: !4, line: 1467, baseType: !635, size: 64, align: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !807, file: !4, line: 1468, baseType: !770, size: 64, align: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !807, file: !4, line: 1469, baseType: !633, size: 32, align: 32, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !807, file: !4, line: 1470, baseType: !633, size: 32, align: 32, offset: 288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !807, file: !4, line: 1474, baseType: !633, size: 32, align: 32, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !807, file: !4, line: 1479, baseType: !828, size: 64, align: 64, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !4, line: 1415, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !4, line: 1411, size: 128, align: 64, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !830, file: !4, line: 1412, baseType: !770, size: 64, align: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !830, file: !4, line: 1413, baseType: !633, size: 32, align: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !830, file: !4, line: 1414, baseType: !602, size: 32, align: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !807, file: !4, line: 1480, baseType: !633, size: 32, align: 32, offset: 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !807, file: !4, line: 1486, baseType: !635, size: 64, align: 64, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !807, file: !4, line: 1488, baseType: !635, size: 64, align: 64, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !807, file: !4, line: 1497, baseType: !635, size: 64, align: 64, offset: 640)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !655, file: !4, line: 5828, baseType: !840, size: 64, align: 64, offset: 384)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64, align: 64)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !748}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !655, file: !4, line: 5829, baseType: !840, size: 64, align: 64, offset: 448)
!844 = distinct !DIGlobalVariable(name: "vp9_raw_reorder_codec_ids", scope: !0, file: !652, line: 397, type: !845, isLocal: true, isDefinition: true, variable: [2 x i32]* @vp9_raw_reorder_codec_ids)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !663, size: 64, align: 32, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 2)
!848 = !{i32 2, !"Dwarf Version", i32 4}
!849 = !{i32 2, !"Debug Info Version", i32 3}
!850 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!851 = distinct !DISubprogram(name: "vp9_raw_reorder_filter", scope: !652, file: !652, line: 277, type: !803, isLocal: true, isDefinition: true, scopeLine: 278, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !852)
!852 = !{}
!853 = !DILocalVariable(name: "bsf", arg: 1, scope: !851, file: !652, line: 277, type: !748)
!854 = !DIExpression()
!855 = !DILocation(line: 277, column: 49, scope: !851)
!856 = !DILocalVariable(name: "out", arg: 2, scope: !851, file: !652, line: 277, type: !805)
!857 = !DILocation(line: 277, column: 64, scope: !851)
!858 = !DILocalVariable(name: "ctx", scope: !851, file: !652, line: 279, type: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64, align: 64)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9RawReorderContext", file: !652, line: 54, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9RawReorderContext", file: !652, line: 50, size: 640, align: 64, elements: !862)
!862 = !{!863, !864, !884}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !861, file: !652, line: 51, baseType: !635, size: 64, align: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "slot", scope: !861, file: !652, line: 52, baseType: !865, size: 512, align: 64, offset: 64)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 512, align: 64, elements: !882)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "VP9RawReorderFrame", file: !652, line: 48, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VP9RawReorderFrame", file: !652, line: 31, size: 512, align: 64, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !868, file: !652, line: 32, baseType: !805, size: 64, align: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "needs_output", scope: !868, file: !652, line: 33, baseType: !633, size: 32, align: 32, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "needs_display", scope: !868, file: !652, line: 34, baseType: !633, size: 32, align: 32, offset: 96)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !868, file: !652, line: 36, baseType: !635, size: 64, align: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "sequence", scope: !868, file: !652, line: 37, baseType: !635, size: 64, align: 64, offset: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !868, file: !652, line: 38, baseType: !634, size: 32, align: 32, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !868, file: !652, line: 40, baseType: !634, size: 32, align: 32, offset: 288)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "show_existing_frame", scope: !868, file: !652, line: 42, baseType: !634, size: 32, align: 32, offset: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "frame_to_show", scope: !868, file: !652, line: 43, baseType: !634, size: 32, align: 32, offset: 352)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "frame_type", scope: !868, file: !652, line: 45, baseType: !634, size: 32, align: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "show_frame", scope: !868, file: !652, line: 46, baseType: !634, size: 32, align: 32, offset: 416)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "refresh_frame_flags", scope: !868, file: !652, line: 47, baseType: !634, size: 32, align: 32, offset: 448)
!882 = !{!883}
!883 = !DISubrange(count: 8)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next_frame", scope: !861, file: !652, line: 53, baseType: !866, size: 64, align: 64, offset: 576)
!885 = !DILocation(line: 279, column: 27, scope: !851)
!886 = !DILocation(line: 279, column: 33, scope: !851)
!887 = !DILocation(line: 279, column: 38, scope: !851)
!888 = !DILocalVariable(name: "frame", scope: !851, file: !652, line: 280, type: !866)
!889 = !DILocation(line: 280, column: 25, scope: !851)
!890 = !DILocalVariable(name: "in", scope: !851, file: !652, line: 281, type: !805)
!891 = !DILocation(line: 281, column: 15, scope: !851)
!892 = !DILocalVariable(name: "err", scope: !851, file: !652, line: 282, type: !633)
!893 = !DILocation(line: 282, column: 9, scope: !851)
!894 = !DILocalVariable(name: "s", scope: !851, file: !652, line: 282, type: !633)
!895 = !DILocation(line: 282, column: 14, scope: !851)
!896 = !DILocation(line: 284, column: 9, scope: !897)
!897 = distinct !DILexicalBlock(scope: !851, file: !652, line: 284, column: 9)
!898 = !DILocation(line: 284, column: 14, scope: !897)
!899 = !DILocation(line: 284, column: 9, scope: !851)
!900 = !DILocation(line: 285, column: 17, scope: !901)
!901 = distinct !DILexicalBlock(scope: !897, file: !652, line: 284, column: 26)
!902 = !DILocation(line: 285, column: 22, scope: !901)
!903 = !DILocation(line: 285, column: 15, scope: !901)
!904 = !DILocation(line: 287, column: 5, scope: !901)
!905 = !DILocation(line: 288, column: 33, scope: !906)
!906 = distinct !DILexicalBlock(scope: !897, file: !652, line: 287, column: 12)
!907 = !DILocation(line: 288, column: 15, scope: !906)
!908 = !DILocation(line: 288, column: 13, scope: !906)
!909 = !DILocation(line: 289, column: 13, scope: !910)
!910 = distinct !DILexicalBlock(scope: !906, file: !652, line: 289, column: 13)
!911 = !DILocation(line: 289, column: 17, scope: !910)
!912 = !DILocation(line: 289, column: 13, scope: !906)
!913 = !DILocation(line: 290, column: 17, scope: !914)
!914 = distinct !DILexicalBlock(scope: !915, file: !652, line: 290, column: 17)
!915 = distinct !DILexicalBlock(scope: !910, file: !652, line: 289, column: 22)
!916 = !DILocation(line: 290, column: 21, scope: !914)
!917 = !DILocation(line: 290, column: 17, scope: !915)
!918 = !DILocation(line: 291, column: 52, scope: !914)
!919 = !DILocation(line: 291, column: 57, scope: !914)
!920 = !DILocation(line: 291, column: 24, scope: !914)
!921 = !DILocation(line: 291, column: 17, scope: !914)
!922 = !DILocation(line: 292, column: 20, scope: !915)
!923 = !DILocation(line: 292, column: 13, scope: !915)
!924 = !DILocation(line: 295, column: 22, scope: !925)
!925 = distinct !DILexicalBlock(scope: !906, file: !652, line: 295, column: 13)
!926 = !DILocation(line: 295, column: 26, scope: !925)
!927 = !DILocation(line: 295, column: 31, scope: !925)
!928 = !DILocation(line: 295, column: 13, scope: !925)
!929 = !DILocation(line: 295, column: 17, scope: !925)
!930 = !DILocation(line: 295, column: 36, scope: !925)
!931 = !DILocation(line: 295, column: 13, scope: !906)
!932 = !DILocation(line: 296, column: 20, scope: !933)
!933 = distinct !DILexicalBlock(scope: !925, file: !652, line: 295, column: 52)
!934 = !DILocation(line: 296, column: 13, scope: !933)
!935 = !DILocation(line: 298, column: 13, scope: !933)
!936 = !DILocation(line: 299, column: 13, scope: !933)
!937 = !DILocation(line: 302, column: 17, scope: !906)
!938 = !DILocation(line: 302, column: 15, scope: !906)
!939 = !DILocation(line: 303, column: 14, scope: !940)
!940 = distinct !DILexicalBlock(scope: !906, file: !652, line: 303, column: 13)
!941 = !DILocation(line: 303, column: 13, scope: !906)
!942 = !DILocation(line: 304, column: 13, scope: !943)
!943 = distinct !DILexicalBlock(scope: !940, file: !652, line: 303, column: 21)
!944 = !DILocation(line: 305, column: 13, scope: !943)
!945 = !DILocation(line: 308, column: 25, scope: !906)
!946 = !DILocation(line: 308, column: 9, scope: !906)
!947 = !DILocation(line: 308, column: 16, scope: !906)
!948 = !DILocation(line: 308, column: 23, scope: !906)
!949 = !DILocation(line: 309, column: 22, scope: !906)
!950 = !DILocation(line: 309, column: 26, scope: !906)
!951 = !DILocation(line: 309, column: 9, scope: !906)
!952 = !DILocation(line: 309, column: 16, scope: !906)
!953 = !DILocation(line: 309, column: 20, scope: !906)
!954 = !DILocation(line: 310, column: 29, scope: !906)
!955 = !DILocation(line: 310, column: 34, scope: !906)
!956 = !DILocation(line: 310, column: 27, scope: !906)
!957 = !DILocation(line: 310, column: 9, scope: !906)
!958 = !DILocation(line: 310, column: 16, scope: !906)
!959 = !DILocation(line: 310, column: 25, scope: !906)
!960 = !DILocation(line: 311, column: 43, scope: !906)
!961 = !DILocation(line: 311, column: 48, scope: !906)
!962 = !DILocation(line: 311, column: 15, scope: !906)
!963 = !DILocation(line: 311, column: 13, scope: !906)
!964 = !DILocation(line: 312, column: 13, scope: !965)
!965 = distinct !DILexicalBlock(scope: !906, file: !652, line: 312, column: 13)
!966 = !DILocation(line: 312, column: 13, scope: !906)
!967 = !DILocation(line: 313, column: 20, scope: !968)
!968 = distinct !DILexicalBlock(scope: !965, file: !652, line: 312, column: 18)
!969 = !DILocation(line: 314, column: 36, scope: !968)
!970 = !DILocation(line: 313, column: 13, scope: !968)
!971 = !DILocation(line: 315, column: 13, scope: !968)
!972 = !DILocation(line: 318, column: 9, scope: !906)
!973 = !DILocation(line: 318, column: 16, scope: !906)
!974 = !DILocation(line: 318, column: 29, scope: !906)
!975 = !DILocation(line: 319, column: 32, scope: !906)
!976 = !DILocation(line: 319, column: 39, scope: !906)
!977 = !DILocation(line: 319, column: 43, scope: !906)
!978 = !DILocation(line: 319, column: 9, scope: !906)
!979 = !DILocation(line: 319, column: 16, scope: !906)
!980 = !DILocation(line: 319, column: 30, scope: !906)
!981 = !DILocation(line: 321, column: 13, scope: !982)
!982 = distinct !DILexicalBlock(scope: !906, file: !652, line: 321, column: 13)
!983 = !DILocation(line: 321, column: 20, scope: !982)
!984 = !DILocation(line: 321, column: 13, scope: !906)
!985 = !DILocation(line: 322, column: 20, scope: !982)
!986 = !DILocation(line: 323, column: 46, scope: !982)
!987 = !DILocation(line: 323, column: 53, scope: !982)
!988 = !DILocation(line: 324, column: 20, scope: !982)
!989 = !DILocation(line: 324, column: 27, scope: !982)
!990 = !DILocation(line: 324, column: 32, scope: !982)
!991 = !DILocation(line: 324, column: 39, scope: !982)
!992 = !DILocation(line: 322, column: 13, scope: !982)
!993 = !DILocation(line: 326, column: 20, scope: !982)
!994 = !DILocation(line: 328, column: 20, scope: !982)
!995 = !DILocation(line: 328, column: 27, scope: !982)
!996 = !DILocation(line: 328, column: 37, scope: !982)
!997 = !DILocation(line: 328, column: 44, scope: !982)
!998 = !DILocation(line: 328, column: 49, scope: !982)
!999 = !DILocation(line: 328, column: 56, scope: !982)
!1000 = !DILocation(line: 329, column: 20, scope: !982)
!1001 = !DILocation(line: 329, column: 27, scope: !982)
!1002 = !DILocation(line: 329, column: 39, scope: !982)
!1003 = !DILocation(line: 329, column: 46, scope: !982)
!1004 = !DILocation(line: 326, column: 13, scope: !982)
!1005 = !DILocation(line: 331, column: 27, scope: !906)
!1006 = !DILocation(line: 331, column: 9, scope: !906)
!1007 = !DILocation(line: 331, column: 14, scope: !906)
!1008 = !DILocation(line: 331, column: 25, scope: !906)
!1009 = !DILocation(line: 334, column: 12, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !851, file: !652, line: 334, column: 5)
!1011 = !DILocation(line: 334, column: 10, scope: !1010)
!1012 = !DILocation(line: 334, column: 17, scope: !1013)
!1013 = !DILexicalBlockFile(scope: !1014, file: !652, discriminator: 1)
!1014 = distinct !DILexicalBlock(scope: !1010, file: !652, line: 334, column: 5)
!1015 = !DILocation(line: 334, column: 19, scope: !1013)
!1016 = !DILocation(line: 334, column: 5, scope: !1013)
!1017 = !DILocation(line: 335, column: 15, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1019, file: !652, line: 335, column: 13)
!1019 = distinct !DILexicalBlock(scope: !1014, file: !652, line: 334, column: 29)
!1020 = !DILocation(line: 335, column: 22, scope: !1018)
!1021 = !DILocation(line: 335, column: 50, scope: !1018)
!1022 = !DILocation(line: 335, column: 47, scope: !1018)
!1023 = !DILocation(line: 335, column: 42, scope: !1018)
!1024 = !DILocation(line: 335, column: 13, scope: !1019)
!1025 = !DILocation(line: 336, column: 13, scope: !1018)
!1026 = !DILocation(line: 337, column: 23, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !1019, file: !652, line: 337, column: 13)
!1028 = !DILocation(line: 337, column: 13, scope: !1027)
!1029 = !DILocation(line: 337, column: 18, scope: !1027)
!1030 = !DILocation(line: 337, column: 26, scope: !1027)
!1031 = !DILocation(line: 337, column: 39, scope: !1032)
!1032 = !DILexicalBlockFile(scope: !1027, file: !652, discriminator: 1)
!1033 = !DILocation(line: 337, column: 29, scope: !1032)
!1034 = !DILocation(line: 337, column: 34, scope: !1032)
!1035 = !DILocation(line: 337, column: 43, scope: !1032)
!1036 = !DILocation(line: 337, column: 57, scope: !1032)
!1037 = !DILocation(line: 338, column: 23, scope: !1027)
!1038 = !DILocation(line: 338, column: 13, scope: !1027)
!1039 = !DILocation(line: 338, column: 18, scope: !1027)
!1040 = !DILocation(line: 338, column: 27, scope: !1027)
!1041 = !DILocation(line: 338, column: 42, scope: !1027)
!1042 = !DILocation(line: 338, column: 39, scope: !1027)
!1043 = !DILocation(line: 338, column: 33, scope: !1027)
!1044 = !DILocation(line: 337, column: 13, scope: !1045)
!1045 = !DILexicalBlockFile(scope: !1019, file: !652, discriminator: 2)
!1046 = !DILocation(line: 343, column: 47, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1027, file: !652, line: 338, column: 46)
!1048 = !DILocation(line: 343, column: 52, scope: !1047)
!1049 = !DILocation(line: 343, column: 67, scope: !1047)
!1050 = !DILocation(line: 343, column: 57, scope: !1047)
!1051 = !DILocation(line: 343, column: 62, scope: !1047)
!1052 = !DILocation(line: 343, column: 19, scope: !1047)
!1053 = !DILocation(line: 343, column: 17, scope: !1047)
!1054 = !DILocation(line: 344, column: 17, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1047, file: !652, line: 344, column: 17)
!1056 = !DILocation(line: 344, column: 21, scope: !1055)
!1057 = !DILocation(line: 344, column: 17, scope: !1047)
!1058 = !DILocation(line: 345, column: 24, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1055, file: !652, line: 344, column: 26)
!1060 = !DILocation(line: 347, column: 24, scope: !1059)
!1061 = !DILocation(line: 347, column: 27, scope: !1059)
!1062 = !DILocation(line: 345, column: 17, scope: !1059)
!1063 = !DILocation(line: 350, column: 44, scope: !1059)
!1064 = !DILocation(line: 350, column: 49, scope: !1059)
!1065 = !DILocation(line: 350, column: 17, scope: !1059)
!1066 = !DILocation(line: 351, column: 17, scope: !1059)
!1067 = !DILocation(line: 353, column: 13, scope: !1047)
!1068 = !DILocation(line: 355, column: 36, scope: !1019)
!1069 = !DILocation(line: 355, column: 41, scope: !1019)
!1070 = !DILocation(line: 355, column: 9, scope: !1019)
!1071 = !DILocation(line: 356, column: 5, scope: !1019)
!1072 = !DILocation(line: 334, column: 25, scope: !1073)
!1073 = !DILexicalBlockFile(scope: !1014, file: !652, discriminator: 2)
!1074 = !DILocation(line: 334, column: 5, scope: !1073)
!1075 = distinct !{!1075, !1076}
!1076 = !DILocation(line: 334, column: 5, scope: !851)
!1077 = !DILocation(line: 358, column: 12, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !851, file: !652, line: 358, column: 5)
!1079 = !DILocation(line: 358, column: 10, scope: !1078)
!1080 = !DILocation(line: 358, column: 17, scope: !1081)
!1081 = !DILexicalBlockFile(scope: !1082, file: !652, discriminator: 1)
!1082 = distinct !DILexicalBlock(scope: !1078, file: !652, line: 358, column: 5)
!1083 = !DILocation(line: 358, column: 19, scope: !1081)
!1084 = !DILocation(line: 358, column: 5, scope: !1081)
!1085 = !DILocation(line: 359, column: 15, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1087, file: !652, line: 359, column: 13)
!1087 = distinct !DILexicalBlock(scope: !1082, file: !652, line: 358, column: 29)
!1088 = !DILocation(line: 359, column: 22, scope: !1086)
!1089 = !DILocation(line: 359, column: 50, scope: !1086)
!1090 = !DILocation(line: 359, column: 47, scope: !1086)
!1091 = !DILocation(line: 359, column: 42, scope: !1086)
!1092 = !DILocation(line: 359, column: 13, scope: !1087)
!1093 = !DILocation(line: 360, column: 13, scope: !1086)
!1094 = !DILocation(line: 361, column: 24, scope: !1087)
!1095 = !DILocation(line: 361, column: 19, scope: !1087)
!1096 = !DILocation(line: 361, column: 9, scope: !1087)
!1097 = !DILocation(line: 361, column: 14, scope: !1087)
!1098 = !DILocation(line: 361, column: 22, scope: !1087)
!1099 = !DILocation(line: 362, column: 5, scope: !1087)
!1100 = !DILocation(line: 358, column: 25, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !1082, file: !652, discriminator: 2)
!1102 = !DILocation(line: 358, column: 5, scope: !1101)
!1103 = distinct !{!1103, !1104}
!1104 = !DILocation(line: 358, column: 5, scope: !851)
!1105 = !DILocation(line: 363, column: 20, scope: !851)
!1106 = !DILocation(line: 363, column: 27, scope: !851)
!1107 = !DILocation(line: 363, column: 5, scope: !851)
!1108 = !DILocation(line: 363, column: 12, scope: !851)
!1109 = !DILocation(line: 363, column: 18, scope: !851)
!1110 = !DILocation(line: 365, column: 10, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !851, file: !652, line: 365, column: 9)
!1112 = !DILocation(line: 365, column: 17, scope: !1111)
!1113 = !DILocation(line: 365, column: 9, scope: !851)
!1114 = !DILocation(line: 366, column: 43, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1111, file: !652, line: 365, column: 38)
!1116 = !DILocation(line: 366, column: 48, scope: !1115)
!1117 = !DILocation(line: 366, column: 53, scope: !1115)
!1118 = !DILocation(line: 366, column: 15, scope: !1115)
!1119 = !DILocation(line: 366, column: 13, scope: !1115)
!1120 = !DILocation(line: 367, column: 13, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1115, file: !652, line: 367, column: 13)
!1122 = !DILocation(line: 367, column: 17, scope: !1121)
!1123 = !DILocation(line: 367, column: 13, scope: !1115)
!1124 = !DILocation(line: 368, column: 20, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1121, file: !652, line: 367, column: 22)
!1126 = !DILocation(line: 368, column: 13, scope: !1125)
!1127 = !DILocation(line: 370, column: 13, scope: !1125)
!1128 = !DILocation(line: 370, column: 18, scope: !1125)
!1129 = !DILocation(line: 370, column: 29, scope: !1125)
!1130 = !DILocation(line: 371, column: 13, scope: !1125)
!1131 = !DILocation(line: 373, column: 14, scope: !1132)
!1132 = distinct !DILexicalBlock(scope: !1115, file: !652, line: 373, column: 13)
!1133 = !DILocation(line: 373, column: 21, scope: !1132)
!1134 = !DILocation(line: 373, column: 13, scope: !1115)
!1135 = !DILocation(line: 374, column: 13, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !652, line: 373, column: 36)
!1137 = !DILocation(line: 375, column: 13, scope: !1136)
!1138 = !DILocation(line: 375, column: 18, scope: !1136)
!1139 = !DILocation(line: 375, column: 29, scope: !1136)
!1140 = !DILocation(line: 376, column: 9, scope: !1136)
!1141 = !DILocation(line: 377, column: 9, scope: !1115)
!1142 = !DILocation(line: 380, column: 5, scope: !851)
!1143 = !DILocation(line: 380, column: 10, scope: !851)
!1144 = !DILocation(line: 380, column: 21, scope: !851)
!1145 = !DILocation(line: 381, column: 5, scope: !851)
!1146 = !DILocation(line: 384, column: 5, scope: !851)
!1147 = !DILocation(line: 385, column: 12, scope: !851)
!1148 = !DILocation(line: 385, column: 5, scope: !851)
!1149 = !DILocation(line: 386, column: 1, scope: !851)
!1150 = distinct !DISubprogram(name: "vp9_raw_reorder_close", scope: !652, file: !652, line: 388, type: !841, isLocal: true, isDefinition: true, scopeLine: 389, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !852)
!1151 = !DILocalVariable(name: "bsf", arg: 1, scope: !1150, file: !652, line: 388, type: !748)
!1152 = !DILocation(line: 388, column: 49, scope: !1150)
!1153 = !DILocalVariable(name: "ctx", scope: !1150, file: !652, line: 390, type: !859)
!1154 = !DILocation(line: 390, column: 27, scope: !1150)
!1155 = !DILocation(line: 390, column: 33, scope: !1150)
!1156 = !DILocation(line: 390, column: 38, scope: !1150)
!1157 = !DILocalVariable(name: "s", scope: !1150, file: !652, line: 391, type: !633)
!1158 = !DILocation(line: 391, column: 9, scope: !1150)
!1159 = !DILocation(line: 393, column: 12, scope: !1160)
!1160 = distinct !DILexicalBlock(scope: !1150, file: !652, line: 393, column: 5)
!1161 = !DILocation(line: 393, column: 10, scope: !1160)
!1162 = !DILocation(line: 393, column: 17, scope: !1163)
!1163 = !DILexicalBlockFile(scope: !1164, file: !652, discriminator: 1)
!1164 = distinct !DILexicalBlock(scope: !1160, file: !652, line: 393, column: 5)
!1165 = !DILocation(line: 393, column: 19, scope: !1163)
!1166 = !DILocation(line: 393, column: 5, scope: !1163)
!1167 = !DILocation(line: 394, column: 36, scope: !1164)
!1168 = !DILocation(line: 394, column: 41, scope: !1164)
!1169 = !DILocation(line: 394, column: 9, scope: !1164)
!1170 = !DILocation(line: 393, column: 25, scope: !1171)
!1171 = !DILexicalBlockFile(scope: !1164, file: !652, discriminator: 2)
!1172 = !DILocation(line: 393, column: 5, scope: !1171)
!1173 = distinct !{!1173, !1174}
!1174 = !DILocation(line: 393, column: 5, scope: !1150)
!1175 = !DILocation(line: 395, column: 1, scope: !1150)
!1176 = distinct !DISubprogram(name: "vp9_raw_reorder_make_output", scope: !652, file: !652, line: 171, type: !1177, isLocal: true, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !852)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!633, !748, !805, !866}
!1179 = !DILocalVariable(name: "bsf", arg: 1, scope: !1176, file: !652, line: 171, type: !748)
!1180 = !DILocation(line: 171, column: 54, scope: !1176)
!1181 = !DILocalVariable(name: "out", arg: 2, scope: !1176, file: !652, line: 172, type: !805)
!1182 = !DILocation(line: 172, column: 46, scope: !1176)
!1183 = !DILocalVariable(name: "last_frame", arg: 3, scope: !1176, file: !652, line: 173, type: !866)
!1184 = !DILocation(line: 173, column: 56, scope: !1176)
!1185 = !DILocalVariable(name: "ctx", scope: !1176, file: !652, line: 175, type: !859)
!1186 = !DILocation(line: 175, column: 27, scope: !1176)
!1187 = !DILocation(line: 175, column: 33, scope: !1176)
!1188 = !DILocation(line: 175, column: 38, scope: !1176)
!1189 = !DILocalVariable(name: "next_output", scope: !1176, file: !652, line: 176, type: !866)
!1190 = !DILocation(line: 176, column: 25, scope: !1176)
!1191 = !DILocation(line: 176, column: 39, scope: !1176)
!1192 = !DILocalVariable(name: "next_display", scope: !1176, file: !652, line: 177, type: !866)
!1193 = !DILocation(line: 177, column: 24, scope: !1176)
!1194 = !DILocation(line: 177, column: 39, scope: !1176)
!1195 = !DILocalVariable(name: "frame", scope: !1176, file: !652, line: 177, type: !866)
!1196 = !DILocation(line: 177, column: 52, scope: !1176)
!1197 = !DILocalVariable(name: "s", scope: !1176, file: !652, line: 178, type: !633)
!1198 = !DILocation(line: 178, column: 9, scope: !1176)
!1199 = !DILocalVariable(name: "err", scope: !1176, file: !652, line: 178, type: !633)
!1200 = !DILocation(line: 178, column: 12, scope: !1176)
!1201 = !DILocation(line: 180, column: 12, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1176, file: !652, line: 180, column: 5)
!1203 = !DILocation(line: 180, column: 10, scope: !1202)
!1204 = !DILocation(line: 180, column: 17, scope: !1205)
!1205 = !DILexicalBlockFile(scope: !1206, file: !652, discriminator: 1)
!1206 = distinct !DILexicalBlock(scope: !1202, file: !652, line: 180, column: 5)
!1207 = !DILocation(line: 180, column: 19, scope: !1205)
!1208 = !DILocation(line: 180, column: 5, scope: !1205)
!1209 = !DILocation(line: 181, column: 27, scope: !1210)
!1210 = distinct !DILexicalBlock(scope: !1206, file: !652, line: 180, column: 29)
!1211 = !DILocation(line: 181, column: 17, scope: !1210)
!1212 = !DILocation(line: 181, column: 22, scope: !1210)
!1213 = !DILocation(line: 181, column: 15, scope: !1210)
!1214 = !DILocation(line: 182, column: 14, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1210, file: !652, line: 182, column: 13)
!1216 = !DILocation(line: 182, column: 13, scope: !1210)
!1217 = !DILocation(line: 183, column: 13, scope: !1215)
!1218 = !DILocation(line: 184, column: 13, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1210, file: !652, line: 184, column: 13)
!1220 = !DILocation(line: 184, column: 20, scope: !1219)
!1221 = !DILocation(line: 184, column: 33, scope: !1219)
!1222 = !DILocation(line: 184, column: 38, scope: !1223)
!1223 = !DILexicalBlockFile(scope: !1219, file: !652, discriminator: 1)
!1224 = !DILocation(line: 184, column: 50, scope: !1223)
!1225 = !DILocation(line: 185, column: 13, scope: !1219)
!1226 = !DILocation(line: 185, column: 20, scope: !1219)
!1227 = !DILocation(line: 185, column: 31, scope: !1219)
!1228 = !DILocation(line: 185, column: 44, scope: !1219)
!1229 = !DILocation(line: 185, column: 29, scope: !1219)
!1230 = !DILocation(line: 184, column: 13, scope: !1231)
!1231 = !DILexicalBlockFile(scope: !1210, file: !652, discriminator: 2)
!1232 = !DILocation(line: 186, column: 27, scope: !1219)
!1233 = !DILocation(line: 186, column: 25, scope: !1219)
!1234 = !DILocation(line: 186, column: 13, scope: !1219)
!1235 = !DILocation(line: 187, column: 13, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1210, file: !652, line: 187, column: 13)
!1237 = !DILocation(line: 187, column: 20, scope: !1236)
!1238 = !DILocation(line: 187, column: 34, scope: !1236)
!1239 = !DILocation(line: 187, column: 39, scope: !1240)
!1240 = !DILexicalBlockFile(scope: !1236, file: !652, discriminator: 1)
!1241 = !DILocation(line: 187, column: 52, scope: !1240)
!1242 = !DILocation(line: 188, column: 13, scope: !1236)
!1243 = !DILocation(line: 188, column: 20, scope: !1236)
!1244 = !DILocation(line: 188, column: 26, scope: !1236)
!1245 = !DILocation(line: 188, column: 40, scope: !1236)
!1246 = !DILocation(line: 188, column: 24, scope: !1236)
!1247 = !DILocation(line: 187, column: 13, scope: !1231)
!1248 = !DILocation(line: 189, column: 28, scope: !1236)
!1249 = !DILocation(line: 189, column: 26, scope: !1236)
!1250 = !DILocation(line: 189, column: 13, scope: !1236)
!1251 = !DILocation(line: 190, column: 5, scope: !1210)
!1252 = !DILocation(line: 180, column: 25, scope: !1253)
!1253 = !DILexicalBlockFile(scope: !1206, file: !652, discriminator: 2)
!1254 = !DILocation(line: 180, column: 5, scope: !1253)
!1255 = distinct !{!1255, !1256}
!1256 = !DILocation(line: 180, column: 5, scope: !1176)
!1257 = !DILocation(line: 192, column: 10, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1176, file: !652, line: 192, column: 9)
!1259 = !DILocation(line: 192, column: 22, scope: !1258)
!1260 = !DILocation(line: 192, column: 26, scope: !1261)
!1261 = !DILexicalBlockFile(scope: !1258, file: !652, discriminator: 1)
!1262 = !DILocation(line: 192, column: 9, scope: !1261)
!1263 = !DILocation(line: 193, column: 9, scope: !1258)
!1264 = !DILocation(line: 195, column: 10, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1176, file: !652, line: 195, column: 9)
!1266 = !DILocation(line: 195, column: 23, scope: !1265)
!1267 = !DILocation(line: 195, column: 27, scope: !1268)
!1268 = !DILexicalBlockFile(scope: !1265, file: !652, discriminator: 1)
!1269 = !DILocation(line: 195, column: 39, scope: !1268)
!1270 = !DILocation(line: 196, column: 9, scope: !1265)
!1271 = !DILocation(line: 196, column: 22, scope: !1265)
!1272 = !DILocation(line: 196, column: 33, scope: !1265)
!1273 = !DILocation(line: 196, column: 47, scope: !1265)
!1274 = !DILocation(line: 196, column: 31, scope: !1265)
!1275 = !DILocation(line: 195, column: 9, scope: !1276)
!1276 = !DILexicalBlockFile(scope: !1176, file: !652, discriminator: 2)
!1277 = !DILocation(line: 197, column: 17, scope: !1265)
!1278 = !DILocation(line: 197, column: 15, scope: !1265)
!1279 = !DILocation(line: 197, column: 9, scope: !1265)
!1280 = !DILocation(line: 199, column: 17, scope: !1265)
!1281 = !DILocation(line: 199, column: 15, scope: !1265)
!1282 = !DILocation(line: 201, column: 9, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1176, file: !652, line: 201, column: 9)
!1284 = !DILocation(line: 201, column: 16, scope: !1283)
!1285 = !DILocation(line: 201, column: 29, scope: !1283)
!1286 = !DILocation(line: 201, column: 32, scope: !1287)
!1287 = !DILexicalBlockFile(scope: !1283, file: !652, discriminator: 1)
!1288 = !DILocation(line: 201, column: 39, scope: !1287)
!1289 = !DILocation(line: 201, column: 53, scope: !1287)
!1290 = !DILocation(line: 202, column: 9, scope: !1283)
!1291 = !DILocation(line: 202, column: 24, scope: !1283)
!1292 = !DILocation(line: 202, column: 21, scope: !1283)
!1293 = !DILocation(line: 201, column: 9, scope: !1276)
!1294 = !DILocation(line: 203, column: 16, scope: !1295)
!1295 = distinct !DILexicalBlock(scope: !1283, file: !652, line: 202, column: 38)
!1296 = !DILocation(line: 205, column: 16, scope: !1295)
!1297 = !DILocation(line: 205, column: 23, scope: !1295)
!1298 = !DILocation(line: 205, column: 33, scope: !1295)
!1299 = !DILocation(line: 205, column: 40, scope: !1295)
!1300 = !DILocation(line: 203, column: 9, scope: !1295)
!1301 = !DILocation(line: 207, column: 28, scope: !1295)
!1302 = !DILocation(line: 207, column: 33, scope: !1295)
!1303 = !DILocation(line: 207, column: 40, scope: !1295)
!1304 = !DILocation(line: 207, column: 9, scope: !1295)
!1305 = !DILocation(line: 209, column: 31, scope: !1295)
!1306 = !DILocation(line: 209, column: 38, scope: !1295)
!1307 = !DILocation(line: 209, column: 52, scope: !1295)
!1308 = !DILocation(line: 209, column: 9, scope: !1295)
!1309 = !DILocation(line: 209, column: 16, scope: !1295)
!1310 = !DILocation(line: 209, column: 29, scope: !1295)
!1311 = !DILocation(line: 210, column: 5, scope: !1295)
!1312 = !DILocation(line: 210, column: 16, scope: !1313)
!1313 = !DILexicalBlockFile(scope: !1314, file: !652, discriminator: 1)
!1314 = distinct !DILexicalBlock(scope: !1283, file: !652, line: 210, column: 16)
!1315 = !DILocation(line: 210, column: 23, scope: !1313)
!1316 = !DILocation(line: 211, column: 13, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1318, file: !652, line: 211, column: 13)
!1318 = distinct !DILexicalBlock(scope: !1314, file: !652, line: 210, column: 37)
!1319 = !DILocation(line: 211, column: 20, scope: !1317)
!1320 = !DILocation(line: 211, column: 13, scope: !1318)
!1321 = !DILocation(line: 212, column: 20, scope: !1322)
!1322 = distinct !DILexicalBlock(scope: !1317, file: !652, line: 211, column: 35)
!1323 = !DILocation(line: 214, column: 20, scope: !1322)
!1324 = !DILocation(line: 214, column: 27, scope: !1322)
!1325 = !DILocation(line: 214, column: 37, scope: !1322)
!1326 = !DILocation(line: 214, column: 44, scope: !1322)
!1327 = !DILocation(line: 212, column: 13, scope: !1322)
!1328 = !DILocation(line: 215, column: 9, scope: !1322)
!1329 = !DILocation(line: 216, column: 20, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1317, file: !652, line: 215, column: 16)
!1331 = !DILocation(line: 218, column: 20, scope: !1330)
!1332 = !DILocation(line: 218, column: 27, scope: !1330)
!1333 = !DILocation(line: 218, column: 37, scope: !1330)
!1334 = !DILocation(line: 218, column: 44, scope: !1330)
!1335 = !DILocation(line: 216, column: 13, scope: !1330)
!1336 = !DILocation(line: 221, column: 28, scope: !1318)
!1337 = !DILocation(line: 221, column: 33, scope: !1318)
!1338 = !DILocation(line: 221, column: 40, scope: !1318)
!1339 = !DILocation(line: 221, column: 9, scope: !1318)
!1340 = !DILocation(line: 222, column: 20, scope: !1318)
!1341 = !DILocation(line: 222, column: 25, scope: !1318)
!1342 = !DILocation(line: 222, column: 9, scope: !1318)
!1343 = !DILocation(line: 222, column: 14, scope: !1318)
!1344 = !DILocation(line: 222, column: 18, scope: !1318)
!1345 = !DILocation(line: 224, column: 9, scope: !1318)
!1346 = !DILocation(line: 224, column: 16, scope: !1318)
!1347 = !DILocation(line: 224, column: 29, scope: !1318)
!1348 = !DILocation(line: 225, column: 5, scope: !1318)
!1349 = !DILocalVariable(name: "pb", scope: !1350, file: !652, line: 226, type: !1351)
!1350 = distinct !DILexicalBlock(scope: !1314, file: !652, line: 225, column: 12)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "PutBitContext", file: !1352, line: 40, baseType: !1353)
!1352 = !DIFile(filename: "libavcodec/put_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PutBitContext", file: !1352, line: 35, size: 320, align: 64, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1358, !1359, !1360}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "bit_buf", scope: !1353, file: !1352, line: 36, baseType: !644, size: 32, align: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "bit_left", scope: !1353, file: !1352, line: 37, baseType: !633, size: 32, align: 32, offset: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1353, file: !1352, line: 38, baseType: !770, size: 64, align: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "buf_ptr", scope: !1353, file: !1352, line: 38, baseType: !770, size: 64, align: 64, offset: 128)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "buf_end", scope: !1353, file: !1352, line: 38, baseType: !770, size: 64, align: 64, offset: 192)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1353, file: !1352, line: 39, baseType: !633, size: 32, align: 32, offset: 256)
!1361 = !DILocation(line: 226, column: 23, scope: !1350)
!1362 = !DILocation(line: 228, column: 9, scope: !1350)
!1363 = distinct !{!1363, !1362}
!1364 = !DILocation(line: 228, column: 21, scope: !1365)
!1365 = !DILexicalBlockFile(scope: !1366, file: !652, discriminator: 1)
!1366 = distinct !DILexicalBlock(scope: !1367, file: !652, line: 228, column: 18)
!1367 = distinct !DILexicalBlock(scope: !1350, file: !652, line: 228, column: 12)
!1368 = !DILocation(line: 228, column: 28, scope: !1365)
!1369 = !DILocation(line: 228, column: 41, scope: !1365)
!1370 = !DILocation(line: 228, column: 44, scope: !1371)
!1371 = !DILexicalBlockFile(scope: !1366, file: !652, discriminator: 2)
!1372 = !DILocation(line: 228, column: 51, scope: !1371)
!1373 = !DILocation(line: 228, column: 18, scope: !1371)
!1374 = !DILocation(line: 228, column: 69, scope: !1375)
!1375 = !DILexicalBlockFile(scope: !1376, file: !652, discriminator: 3)
!1376 = distinct !DILexicalBlock(scope: !1366, file: !652, line: 228, column: 67)
!1377 = !DILocation(line: 228, column: 137, scope: !1378)
!1378 = !DILexicalBlockFile(scope: !1375, file: !652, discriminator: 5)
!1379 = !DILocation(line: 228, column: 137, scope: !1375)
!1380 = !DILocation(line: 228, column: 148, scope: !1381)
!1381 = !DILexicalBlockFile(scope: !1367, file: !652, discriminator: 4)
!1382 = !DILocation(line: 230, column: 13, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1350, file: !652, line: 230, column: 13)
!1384 = !DILocation(line: 230, column: 20, scope: !1383)
!1385 = !DILocation(line: 230, column: 26, scope: !1383)
!1386 = !DILocation(line: 230, column: 13, scope: !1350)
!1387 = !DILocation(line: 231, column: 20, scope: !1388)
!1388 = distinct !DILexicalBlock(scope: !1383, file: !652, line: 230, column: 32)
!1389 = !DILocation(line: 231, column: 13, scope: !1388)
!1390 = !DILocation(line: 233, column: 13, scope: !1388)
!1391 = !DILocation(line: 233, column: 20, scope: !1388)
!1392 = !DILocation(line: 233, column: 34, scope: !1388)
!1393 = !DILocation(line: 234, column: 13, scope: !1388)
!1394 = !DILocation(line: 237, column: 27, scope: !1350)
!1395 = !DILocation(line: 237, column: 34, scope: !1350)
!1396 = !DILocation(line: 237, column: 13, scope: !1350)
!1397 = !DILocation(line: 237, column: 11, scope: !1350)
!1398 = !DILocation(line: 238, column: 9, scope: !1350)
!1399 = distinct !{!1399, !1398}
!1400 = !DILocation(line: 238, column: 20, scope: !1401)
!1401 = !DILexicalBlockFile(scope: !1402, file: !652, discriminator: 1)
!1402 = distinct !DILexicalBlock(scope: !1403, file: !652, line: 238, column: 18)
!1403 = distinct !DILexicalBlock(scope: !1350, file: !652, line: 238, column: 12)
!1404 = !DILocation(line: 238, column: 22, scope: !1401)
!1405 = !DILocation(line: 238, column: 18, scope: !1401)
!1406 = !DILocation(line: 238, column: 30, scope: !1407)
!1407 = !DILexicalBlockFile(scope: !1408, file: !652, discriminator: 2)
!1408 = distinct !DILexicalBlock(scope: !1402, file: !652, line: 238, column: 28)
!1409 = !DILocation(line: 238, column: 98, scope: !1410)
!1410 = !DILexicalBlockFile(scope: !1407, file: !652, discriminator: 4)
!1411 = !DILocation(line: 238, column: 98, scope: !1407)
!1412 = !DILocation(line: 238, column: 109, scope: !1413)
!1413 = !DILexicalBlockFile(scope: !1403, file: !652, discriminator: 3)
!1414 = !DILocation(line: 240, column: 16, scope: !1350)
!1415 = !DILocation(line: 242, column: 16, scope: !1350)
!1416 = !DILocation(line: 242, column: 23, scope: !1350)
!1417 = !DILocation(line: 242, column: 33, scope: !1350)
!1418 = !DILocation(line: 242, column: 40, scope: !1350)
!1419 = !DILocation(line: 242, column: 45, scope: !1350)
!1420 = !DILocation(line: 240, column: 9, scope: !1350)
!1421 = !DILocation(line: 244, column: 29, scope: !1350)
!1422 = !DILocation(line: 244, column: 15, scope: !1350)
!1423 = !DILocation(line: 244, column: 13, scope: !1350)
!1424 = !DILocation(line: 245, column: 13, scope: !1425)
!1425 = distinct !DILexicalBlock(scope: !1350, file: !652, line: 245, column: 13)
!1426 = !DILocation(line: 245, column: 17, scope: !1425)
!1427 = !DILocation(line: 245, column: 13, scope: !1350)
!1428 = !DILocation(line: 246, column: 20, scope: !1425)
!1429 = !DILocation(line: 246, column: 13, scope: !1425)
!1430 = !DILocation(line: 248, column: 28, scope: !1350)
!1431 = !DILocation(line: 248, column: 33, scope: !1350)
!1432 = !DILocation(line: 248, column: 9, scope: !1350)
!1433 = !DILocation(line: 251, column: 9, scope: !1350)
!1434 = !DILocation(line: 253, column: 26, scope: !1350)
!1435 = !DILocation(line: 253, column: 33, scope: !1350)
!1436 = !DILocation(line: 253, column: 41, scope: !1350)
!1437 = !DILocation(line: 253, column: 9, scope: !1350)
!1438 = !DILocation(line: 255, column: 27, scope: !1350)
!1439 = !DILocation(line: 255, column: 34, scope: !1350)
!1440 = !DILocation(line: 255, column: 42, scope: !1350)
!1441 = !DILocation(line: 255, column: 48, scope: !1350)
!1442 = !DILocation(line: 255, column: 9, scope: !1350)
!1443 = !DILocation(line: 256, column: 13, scope: !1444)
!1444 = distinct !DILexicalBlock(scope: !1350, file: !652, line: 256, column: 13)
!1445 = !DILocation(line: 256, column: 20, scope: !1444)
!1446 = !DILocation(line: 256, column: 28, scope: !1444)
!1447 = !DILocation(line: 256, column: 13, scope: !1350)
!1448 = !DILocation(line: 258, column: 13, scope: !1449)
!1449 = distinct !DILexicalBlock(scope: !1444, file: !652, line: 256, column: 34)
!1450 = !DILocation(line: 259, column: 9, scope: !1449)
!1451 = !DILocation(line: 261, column: 9, scope: !1350)
!1452 = !DILocation(line: 263, column: 26, scope: !1350)
!1453 = !DILocation(line: 263, column: 9, scope: !1350)
!1454 = !DILocation(line: 265, column: 9, scope: !1350)
!1455 = !DILocation(line: 265, column: 16, scope: !1456)
!1456 = !DILexicalBlockFile(scope: !1350, file: !652, discriminator: 1)
!1457 = !DILocation(line: 265, column: 36, scope: !1456)
!1458 = !DILocation(line: 265, column: 9, scope: !1456)
!1459 = !DILocation(line: 266, column: 13, scope: !1350)
!1460 = !DILocation(line: 265, column: 9, scope: !1461)
!1461 = !DILexicalBlockFile(scope: !1350, file: !652, discriminator: 2)
!1462 = distinct !{!1462, !1454}
!1463 = !DILocation(line: 268, column: 9, scope: !1350)
!1464 = !DILocation(line: 269, column: 31, scope: !1350)
!1465 = !DILocation(line: 269, column: 38, scope: !1350)
!1466 = !DILocation(line: 269, column: 20, scope: !1350)
!1467 = !DILocation(line: 269, column: 25, scope: !1350)
!1468 = !DILocation(line: 269, column: 29, scope: !1350)
!1469 = !DILocation(line: 269, column: 9, scope: !1350)
!1470 = !DILocation(line: 269, column: 14, scope: !1350)
!1471 = !DILocation(line: 269, column: 18, scope: !1350)
!1472 = !DILocation(line: 271, column: 9, scope: !1350)
!1473 = !DILocation(line: 271, column: 16, scope: !1350)
!1474 = !DILocation(line: 271, column: 30, scope: !1350)
!1475 = !DILocation(line: 274, column: 5, scope: !1176)
!1476 = !DILocation(line: 275, column: 1, scope: !1176)
!1477 = distinct !DISubprogram(name: "vp9_raw_reorder_frame_parse", scope: !652, file: !652, line: 74, type: !1478, isLocal: true, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !852)
!1478 = !DISubroutineType(types: !1479)
!1479 = !{!633, !748, !866}
!1480 = !DILocalVariable(name: "bsf", arg: 1, scope: !1477, file: !652, line: 74, type: !748)
!1481 = !DILocation(line: 74, column: 54, scope: !1477)
!1482 = !DILocalVariable(name: "frame", arg: 2, scope: !1477, file: !652, line: 74, type: !866)
!1483 = !DILocation(line: 74, column: 79, scope: !1477)
!1484 = !DILocalVariable(name: "bc", scope: !1477, file: !652, line: 76, type: !1485)
!1485 = !DIDerivedType(tag: DW_TAG_typedef, name: "GetBitContext", file: !1486, line: 70, baseType: !1487)
!1486 = !DIFile(filename: "libavcodec/get_bits.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GetBitContext", file: !1486, line: 61, size: 256, align: 64, elements: !1488)
!1488 = !{!1489, !1492, !1493, !1494, !1495}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1487, file: !1486, line: 62, baseType: !1490, size: 64, align: 64)
!1490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1491, size: 64, align: 64)
!1491 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !1487, file: !1486, line: 62, baseType: !1490, size: 64, align: 64, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1487, file: !1486, line: 67, baseType: !633, size: 32, align: 32, offset: 128)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits", scope: !1487, file: !1486, line: 68, baseType: !633, size: 32, align: 32, offset: 160)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "size_in_bits_plus8", scope: !1487, file: !1486, line: 69, baseType: !633, size: 32, align: 32, offset: 192)
!1496 = !DILocation(line: 76, column: 19, scope: !1477)
!1497 = !DILocalVariable(name: "err", scope: !1477, file: !652, line: 77, type: !633)
!1498 = !DILocation(line: 77, column: 9, scope: !1477)
!1499 = !DILocalVariable(name: "frame_marker", scope: !1477, file: !652, line: 79, type: !634)
!1500 = !DILocation(line: 79, column: 18, scope: !1477)
!1501 = !DILocalVariable(name: "profile_low_bit", scope: !1477, file: !652, line: 80, type: !634)
!1502 = !DILocation(line: 80, column: 18, scope: !1477)
!1503 = !DILocalVariable(name: "profile_high_bit", scope: !1477, file: !652, line: 80, type: !634)
!1504 = !DILocation(line: 80, column: 35, scope: !1477)
!1505 = !DILocalVariable(name: "reserved_zero", scope: !1477, file: !652, line: 80, type: !634)
!1506 = !DILocation(line: 80, column: 53, scope: !1477)
!1507 = !DILocalVariable(name: "error_resilient_mode", scope: !1477, file: !652, line: 81, type: !634)
!1508 = !DILocation(line: 81, column: 18, scope: !1477)
!1509 = !DILocalVariable(name: "frame_sync_code", scope: !1477, file: !652, line: 82, type: !634)
!1510 = !DILocation(line: 82, column: 18, scope: !1477)
!1511 = !DILocation(line: 84, column: 30, scope: !1477)
!1512 = !DILocation(line: 84, column: 37, scope: !1477)
!1513 = !DILocation(line: 84, column: 45, scope: !1477)
!1514 = !DILocation(line: 84, column: 55, scope: !1477)
!1515 = !DILocation(line: 84, column: 62, scope: !1477)
!1516 = !DILocation(line: 84, column: 70, scope: !1477)
!1517 = !DILocation(line: 84, column: 53, scope: !1477)
!1518 = !DILocation(line: 84, column: 11, scope: !1477)
!1519 = !DILocation(line: 84, column: 9, scope: !1477)
!1520 = !DILocation(line: 85, column: 9, scope: !1521)
!1521 = distinct !DILexicalBlock(scope: !1477, file: !652, line: 85, column: 9)
!1522 = !DILocation(line: 85, column: 9, scope: !1477)
!1523 = !DILocation(line: 86, column: 16, scope: !1521)
!1524 = !DILocation(line: 86, column: 9, scope: !1521)
!1525 = !DILocation(line: 88, column: 20, scope: !1477)
!1526 = !DILocation(line: 88, column: 18, scope: !1477)
!1527 = !DILocation(line: 89, column: 9, scope: !1528)
!1528 = distinct !DILexicalBlock(scope: !1477, file: !652, line: 89, column: 9)
!1529 = !DILocation(line: 89, column: 22, scope: !1528)
!1530 = !DILocation(line: 89, column: 9, scope: !1477)
!1531 = !DILocation(line: 90, column: 16, scope: !1532)
!1532 = distinct !DILexicalBlock(scope: !1528, file: !652, line: 89, column: 28)
!1533 = !DILocation(line: 91, column: 16, scope: !1532)
!1534 = !DILocation(line: 90, column: 9, scope: !1532)
!1535 = !DILocation(line: 92, column: 9, scope: !1532)
!1536 = !DILocation(line: 95, column: 23, scope: !1477)
!1537 = !DILocation(line: 95, column: 21, scope: !1477)
!1538 = !DILocation(line: 96, column: 24, scope: !1477)
!1539 = !DILocation(line: 96, column: 22, scope: !1477)
!1540 = !DILocation(line: 97, column: 23, scope: !1477)
!1541 = !DILocation(line: 97, column: 40, scope: !1477)
!1542 = !DILocation(line: 97, column: 48, scope: !1477)
!1543 = !DILocation(line: 97, column: 46, scope: !1477)
!1544 = !DILocation(line: 97, column: 5, scope: !1477)
!1545 = !DILocation(line: 97, column: 12, scope: !1477)
!1546 = !DILocation(line: 97, column: 20, scope: !1477)
!1547 = !DILocation(line: 98, column: 9, scope: !1548)
!1548 = distinct !DILexicalBlock(scope: !1477, file: !652, line: 98, column: 9)
!1549 = !DILocation(line: 98, column: 16, scope: !1548)
!1550 = !DILocation(line: 98, column: 24, scope: !1548)
!1551 = !DILocation(line: 98, column: 9, scope: !1477)
!1552 = !DILocation(line: 99, column: 25, scope: !1553)
!1553 = distinct !DILexicalBlock(scope: !1548, file: !652, line: 98, column: 30)
!1554 = !DILocation(line: 99, column: 23, scope: !1553)
!1555 = !DILocation(line: 100, column: 13, scope: !1556)
!1556 = distinct !DILexicalBlock(scope: !1553, file: !652, line: 100, column: 13)
