; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--hwcontext.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavutil--hwcontext.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.HWContextType = type { i32, i8*, i32*, i64, i64, i64, i64, i64, i32 (%struct.AVHWDeviceContext*, i8*, %struct.AVDictionary*, i32)*, i32 (%struct.AVHWDeviceContext*, %struct.AVHWDeviceContext*, i32)*, i32 (%struct.AVHWDeviceContext*)*, void (%struct.AVHWDeviceContext*)*, i32 (%struct.AVHWDeviceContext*, i8*, %struct.AVHWFramesConstraints*)*, i32 (%struct.AVHWFramesContext*)*, void (%struct.AVHWFramesContext*)*, i32 (%struct.AVHWFramesContext*, %struct.AVFrame*)*, i32 (%struct.AVHWFramesContext*, i32, i32**)*, i32 (%struct.AVHWFramesContext*, %struct.AVFrame*, %struct.AVFrame*)*, i32 (%struct.AVHWFramesContext*, %struct.AVFrame*, %struct.AVFrame*)*, i32 (%struct.AVHWFramesContext*, %struct.AVFrame*, %struct.AVFrame*, i32)*, i32 (%struct.AVHWFramesContext*, %struct.AVFrame*, %struct.AVFrame*, i32)*, i32 (%struct.AVHWFramesContext*, %struct.AVHWFramesContext*, i32)*, i32 (%struct.AVHWFramesContext*, %struct.AVHWFramesContext*, i32)* }
%struct.AVHWDeviceContext = type { %struct.AVClass*, %struct.AVHWDeviceInternal*, i32, i8*, void (%struct.AVHWDeviceContext*)*, i8* }

!297 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorTransferCharacteristic", file: !39, line: 464, size: 32, align: 32, elements: !298)
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!299 = !DIEnumerator(name: "AVCOL_TRC_RESERVED0", value: 0)
!300 = !DIEnumerator(name: "AVCOL_TRC_BT709", value: 1)
!301 = !DIEnumerator(name: "AVCOL_TRC_UNSPECIFIED", value: 2)
!302 = !DIEnumerator(name: "AVCOL_TRC_RESERVED", value: 3)
!303 = !DIEnumerator(name: "AVCOL_TRC_GAMMA22", value: 4)
!304 = !DIEnumerator(name: "AVCOL_TRC_GAMMA28", value: 5)
!305 = !DIEnumerator(name: "AVCOL_TRC_SMPTE170M", value: 6)
!306 = !DIEnumerator(name: "AVCOL_TRC_SMPTE240M", value: 7)
!307 = !DIEnumerator(name: "AVCOL_TRC_LINEAR", value: 8)
!308 = !DIEnumerator(name: "AVCOL_TRC_LOG", value: 9)
!309 = !DIEnumerator(name: "AVCOL_TRC_LOG_SQRT", value: 10)
!310 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_4", value: 11)
!311 = !DIEnumerator(name: "AVCOL_TRC_BT1361_ECG", value: 12)
!312 = !DIEnumerator(name: "AVCOL_TRC_IEC61966_2_1", value: 13)
!313 = !DIEnumerator(name: "AVCOL_TRC_BT2020_10", value: 14)
!314 = !DIEnumerator(name: "AVCOL_TRC_BT2020_12", value: 15)
!315 = !DIEnumerator(name: "AVCOL_TRC_SMPTE2084", value: 16)
!316 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST2084", value: 16)
!317 = !DIEnumerator(name: "AVCOL_TRC_SMPTE428", value: 17)
!318 = !DIEnumerator(name: "AVCOL_TRC_SMPTEST428_1", value: 17)
!319 = !DIEnumerator(name: "AVCOL_TRC_ARIB_STD_B67", value: 18)
!320 = !DIEnumerator(name: "AVCOL_TRC_NB", value: 19)
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVColorSpace", file: !39, line: 493, size: 32, align: 32, elements: !322)
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339}
!323 = !DIEnumerator(name: "AVCOL_SPC_RGB", value: 0)
!324 = !DIEnumerator(name: "AVCOL_SPC_BT709", value: 1)
!325 = !DIEnumerator(name: "AVCOL_SPC_UNSPECIFIED", value: 2)
!326 = !DIEnumerator(name: "AVCOL_SPC_RESERVED", value: 3)
!327 = !DIEnumerator(name: "AVCOL_SPC_FCC", value: 4)
!328 = !DIEnumerator(name: "AVCOL_SPC_BT470BG", value: 5)
!329 = !DIEnumerator(name: "AVCOL_SPC_SMPTE170M", value: 6)
!330 = !DIEnumerator(name: "AVCOL_SPC_SMPTE240M", value: 7)
!331 = !DIEnumerator(name: "AVCOL_SPC_YCGCO", value: 8)
!332 = !DIEnumerator(name: "AVCOL_SPC_YCOCG", value: 8)
!333 = !DIEnumerator(name: "AVCOL_SPC_BT2020_NCL", value: 9)
!334 = !DIEnumerator(name: "AVCOL_SPC_BT2020_CL", value: 10)
!335 = !DIEnumerator(name: "AVCOL_SPC_SMPTE2085", value: 11)
!336 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_NCL", value: 12)
!337 = !DIEnumerator(name: "AVCOL_SPC_CHROMA_DERIVED_CL", value: 13)
!338 = !DIEnumerator(name: "AVCOL_SPC_ICTCP", value: 14)
!339 = !DIEnumerator(name: "AVCOL_SPC_NB", value: 15)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVChromaLocation", file: !39, line: 538, size: 32, align: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349}
!342 = !DIEnumerator(name: "AVCHROMA_LOC_UNSPECIFIED", value: 0)
!343 = !DIEnumerator(name: "AVCHROMA_LOC_LEFT", value: 1)
!344 = !DIEnumerator(name: "AVCHROMA_LOC_CENTER", value: 2)
!345 = !DIEnumerator(name: "AVCHROMA_LOC_TOPLEFT", value: 3)
!346 = !DIEnumerator(name: "AVCHROMA_LOC_TOP", value: 4)
!347 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOMLEFT", value: 5)
!348 = !DIEnumerator(name: "AVCHROMA_LOC_BOTTOM", value: 6)
!349 = !DIEnumerator(name: "AVCHROMA_LOC_NB", value: 7)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVHWFrameTransferDirection", file: !4, line: 394, size: 32, align: 32, elements: !351)
!351 = !{!352, !353}
!352 = !DIEnumerator(name: "AV_HWFRAME_TRANSFER_DIRECTION_FROM", value: 0)
!353 = !DIEnumerator(name: "AV_HWFRAME_TRANSFER_DIRECTION_TO", value: 1)
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 499, size: 32, align: 32, elements: !355)
!355 = !{!356, !357, !358, !359}
!356 = !DIEnumerator(name: "AV_HWFRAME_MAP_READ", value: 1)
!357 = !DIEnumerator(name: "AV_HWFRAME_MAP_WRITE", value: 2)
!358 = !DIEnumerator(name: "AV_HWFRAME_MAP_OVERWRITE", value: 4)
!359 = !DIEnumerator(name: "AV_HWFRAME_MAP_DIRECT", value: 8)
!360 = !{!361, !365, !366, !481, !653}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64, align: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !363, line: 48, baseType: !364)
!363 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!364 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceContext", file: !4, line: 109, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceContext", file: !4, line: 60, size: 384, align: 64, elements: !369)
!369 = !{!370, !415, !645, !646, !647, !652}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !368, file: !4, line: 64, baseType: !371, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !18, line: 143, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !18, line: 67, size: 640, align: 64, elements: !375)
!375 = !{!376, !380, !384, !388, !390, !391, !392, !396, !402, !404, !408}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !374, file: !18, line: 72, baseType: !377, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !374, file: !18, line: 78, baseType: !381, size: 64, align: 64, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = !DISubroutineType(types: !383)
!383 = !{!377, !365}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !374, file: !18, line: 85, baseType: !385, size: 64, align: 64, offset: 128)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !18, line: 85, flags: DIFlagFwdDecl)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !374, file: !18, line: 93, baseType: !389, size: 32, align: 32, offset: 192)
!389 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !374, file: !18, line: 99, baseType: !389, size: 32, align: 32, offset: 224)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !374, file: !18, line: 108, baseType: !389, size: 32, align: 32, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !374, file: !18, line: 113, baseType: !393, size: 64, align: 64, offset: 320)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = !DISubroutineType(types: !395)
!395 = !{!365, !365, !365}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !374, file: !18, line: 123, baseType: !397, size: 64, align: 64, offset: 384)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 64, align: 64)
!398 = !DISubroutineType(types: !399)
!399 = !{!400, !400}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !374, file: !18, line: 130, baseType: !403, size: 32, align: 32, offset: 448)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !18, line: 48, baseType: !17)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !374, file: !18, line: 136, baseType: !405, size: 64, align: 64, offset: 512)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64, align: 64)
!406 = !DISubroutineType(types: !407)
!407 = !{!403, !365}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !374, file: !18, line: 142, baseType: !409, size: 64, align: 64, offset: 576)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64, align: 64)
!410 = !DISubroutineType(types: !411)
!411 = !{!389, !412, !365, !377, !389}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64, align: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64, align: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !18, line: 60, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !368, file: !4, line: 70, baseType: !416, size: 64, align: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWDeviceInternal", file: !4, line: 41, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWDeviceInternal", file: !419, line: 102, size: 192, align: 64, elements: !420)
!419 = !DIFile(filename: "libavutil/hwcontext_internal.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!420 = !{!421, !643, !644}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !418, file: !419, line: 103, baseType: !422, size: 64, align: 64)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "HWContextType", file: !419, line: 100, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HWContextType", file: !419, line: 29, size: 1472, align: 64, elements: !426)
!426 = !{!427, !428, !429, !432, !436, !437, !438, !439, !440, !448, !452, !456, !460, !477, !525, !529, !621, !626, !632, !633, !637, !638, !642}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !425, file: !419, line: 30, baseType: !3, size: 32, align: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !425, file: !419, line: 31, baseType: !377, size: 64, align: 64, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !425, file: !419, line: 37, baseType: !430, size: 64, align: 64, offset: 128)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "device_hwctx_size", scope: !425, file: !419, line: 43, baseType: !433, size: 64, align: 64, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !434, line: 216, baseType: !435)
!434 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!435 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "device_priv_size", scope: !425, file: !419, line: 48, baseType: !433, size: 64, align: 64, offset: 256)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "device_hwconfig_size", scope: !425, file: !419, line: 54, baseType: !433, size: 64, align: 64, offset: 320)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "frames_hwctx_size", scope: !425, file: !419, line: 60, baseType: !433, size: 64, align: 64, offset: 384)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "frames_priv_size", scope: !425, file: !419, line: 65, baseType: !433, size: 64, align: 64, offset: 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "device_create", scope: !425, file: !419, line: 67, baseType: !441, size: 64, align: 64, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64, align: 64)
!442 = !DISubroutineType(types: !443)
!443 = !{!389, !366, !377, !444, !389}
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !446, line: 86, baseType: !447)
!446 = !DIFile(filename: "libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !446, line: 86, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "device_derive", scope: !425, file: !419, line: 69, baseType: !449, size: 64, align: 64, offset: 576)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64, align: 64)
!450 = !DISubroutineType(types: !451)
!451 = !{!389, !366, !366, !389}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "device_init", scope: !425, file: !419, line: 72, baseType: !453, size: 64, align: 64, offset: 640)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64, align: 64)
!454 = !DISubroutineType(types: !455)
!455 = !{!389, !366}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "device_uninit", scope: !425, file: !419, line: 73, baseType: !457, size: 64, align: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64, align: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !366}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "frames_get_constraints", scope: !425, file: !419, line: 75, baseType: !461, size: 64, align: 64, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64, align: 64)
!462 = !DISubroutineType(types: !463)
!463 = !{!389, !366, !464, !466}
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64, align: 64)
!465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64, align: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesConstraints", file: !4, line: 459, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesConstraints", file: !4, line: 432, size: 256, align: 64, elements: !469)
!469 = !{!470, !472, !473, !474, !475, !476}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "valid_hw_formats", scope: !468, file: !4, line: 437, baseType: !471, size: 64, align: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "valid_sw_formats", scope: !468, file: !4, line: 444, baseType: !471, size: 64, align: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "min_width", scope: !468, file: !4, line: 450, baseType: !389, size: 32, align: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "min_height", scope: !468, file: !4, line: 451, baseType: !389, size: 32, align: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "max_width", scope: !468, file: !4, line: 457, baseType: !389, size: 32, align: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "max_height", scope: !468, file: !4, line: 458, baseType: !389, size: 32, align: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "frames_init", scope: !425, file: !419, line: 79, baseType: !478, size: 64, align: 64, offset: 832)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64, align: 64)
!479 = !DISubroutineType(types: !480)
!480 = !{!389, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64, align: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesContext", file: !4, line: 229, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesContext", file: !4, line: 123, size: 704, align: 64, elements: !484)
!484 = !{!485, !486, !510, !511, !512, !513, !518, !519, !520, !521, !522, !523, !524}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !483, file: !4, line: 127, baseType: !371, size: 64, align: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !483, file: !4, line: 133, baseType: !487, size: 64, align: 64, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64, align: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVHWFramesInternal", file: !4, line: 111, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWFramesInternal", file: !419, line: 113, size: 320, align: 64, elements: !490)
!490 = !{!491, !492, !493, !498, !509}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "hw_type", scope: !489, file: !419, line: 114, baseType: !422, size: 64, align: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !489, file: !419, line: 115, baseType: !365, size: 64, align: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pool_internal", scope: !489, file: !419, line: 117, baseType: !494, size: 64, align: 64, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64, align: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferPool", file: !496, line: 238, baseType: !497)
!496 = !DIFile(filename: "libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferPool", file: !496, line: 238, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "source_frames", scope: !489, file: !419, line: 123, baseType: !499, size: 64, align: 64, offset: 192)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64, align: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !496, line: 94, baseType: !501)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !496, line: 81, size: 192, align: 64, elements: !502)
!502 = !{!503, !507, !508}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !501, file: !496, line: 82, baseType: !504, size: 64, align: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64, align: 64)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !496, line: 73, baseType: !506)
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !496, line: 73, flags: DIFlagFwdDecl)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !501, file: !496, line: 89, baseType: !361, size: 64, align: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !501, file: !496, line: 93, baseType: !389, size: 32, align: 32, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "source_allocation_map_flags", scope: !489, file: !419, line: 128, baseType: !389, size: 32, align: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "device_ref", scope: !483, file: !4, line: 140, baseType: !499, size: 64, align: 64, offset: 128)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "device_ctx", scope: !483, file: !4, line: 148, baseType: !366, size: 64, align: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !483, file: !4, line: 161, baseType: !365, size: 64, align: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !483, file: !4, line: 169, baseType: !514, size: 64, align: 64, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64, align: 64)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !483, file: !4, line: 174, baseType: !365, size: 64, align: 64, offset: 384)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !483, file: !4, line: 189, baseType: !494, size: 64, align: 64, offset: 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "initial_pool_size", scope: !483, file: !4, line: 198, baseType: !389, size: 32, align: 32, offset: 512)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !483, file: !4, line: 208, baseType: !38, size: 32, align: 32, offset: 544)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sw_format", scope: !483, file: !4, line: 221, baseType: !38, size: 32, align: 32, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !483, file: !4, line: 228, baseType: !389, size: 32, align: 32, offset: 608)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !483, file: !4, line: 228, baseType: !389, size: 32, align: 32, offset: 640)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "frames_uninit", scope: !425, file: !419, line: 80, baseType: !526, size: 64, align: 64, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64, align: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !481}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "frames_get_buffer", scope: !425, file: !419, line: 82, baseType: !530, size: 64, align: 64, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64)
!531 = !DISubroutineType(types: !532)
!532 = !{!389, !481, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !250, line: 646, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !250, line: 268, size: 4288, align: 64, elements: !536)
!536 = !{!537, !541, !543, !545, !546, !547, !548, !549, !550, !551, !558, !561, !562, !563, !564, !565, !566, !567, !570, !571, !572, !573, !574, !575, !576, !577, !579, !581, !582, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !535, file: !250, line: 282, baseType: !538, size: 512, align: 64)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 512, align: 64, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 8)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !535, file: !250, line: 299, baseType: !542, size: 256, align: 32, offset: 512)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 256, align: 32, elements: !539)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !535, file: !250, line: 315, baseType: !544, size: 64, align: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !535, file: !250, line: 326, baseType: !389, size: 32, align: 32, offset: 832)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !535, file: !250, line: 326, baseType: !389, size: 32, align: 32, offset: 864)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !535, file: !250, line: 334, baseType: !389, size: 32, align: 32, offset: 896)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !535, file: !250, line: 341, baseType: !389, size: 32, align: 32, offset: 928)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !535, file: !250, line: 346, baseType: !389, size: 32, align: 32, offset: 960)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !535, file: !250, line: 351, baseType: !238, size: 32, align: 32, offset: 992)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !535, file: !250, line: 356, baseType: !552, size: 64, align: 32, offset: 1024)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !553, line: 61, baseType: !554)
!553 = !DIFile(filename: "libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !553, line: 58, size: 64, align: 32, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !554, file: !553, line: 59, baseType: !389, size: 32, align: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !554, file: !553, line: 60, baseType: !389, size: 32, align: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !535, file: !250, line: 361, baseType: !559, size: 64, align: 64, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !363, line: 40, baseType: !560)
!560 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !535, file: !250, line: 369, baseType: !559, size: 64, align: 64, offset: 1152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !535, file: !250, line: 377, baseType: !559, size: 64, align: 64, offset: 1216)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !535, file: !250, line: 382, baseType: !389, size: 32, align: 32, offset: 1280)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !535, file: !250, line: 386, baseType: !389, size: 32, align: 32, offset: 1312)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !535, file: !250, line: 391, baseType: !389, size: 32, align: 32, offset: 1344)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !535, file: !250, line: 396, baseType: !365, size: 64, align: 64, offset: 1408)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !535, file: !250, line: 403, baseType: !568, size: 512, align: 64, offset: 1472)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 512, align: 64, elements: !539)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !363, line: 55, baseType: !435)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !535, file: !250, line: 410, baseType: !389, size: 32, align: 32, offset: 1984)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !535, file: !250, line: 415, baseType: !389, size: 32, align: 32, offset: 2016)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !535, file: !250, line: 420, baseType: !389, size: 32, align: 32, offset: 2048)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !535, file: !250, line: 425, baseType: !389, size: 32, align: 32, offset: 2080)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !535, file: !250, line: 435, baseType: !559, size: 64, align: 64, offset: 2112)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !535, file: !250, line: 440, baseType: !389, size: 32, align: 32, offset: 2176)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !535, file: !250, line: 445, baseType: !569, size: 64, align: 64, offset: 2240)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !535, file: !250, line: 459, baseType: !578, size: 512, align: 64, offset: 2304)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 512, align: 64, elements: !539)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !535, file: !250, line: 473, baseType: !580, size: 64, align: 64, offset: 2816)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 64, align: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !535, file: !250, line: 477, baseType: !389, size: 32, align: 32, offset: 2880)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !535, file: !250, line: 479, baseType: !583, size: 64, align: 64, offset: 2944)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64, align: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64, align: 64)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !250, line: 207, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !250, line: 201, size: 320, align: 64, elements: !587)
!587 = !{!588, !589, !590, !591, !592}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !586, file: !250, line: 202, baseType: !249, size: 32, align: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !586, file: !250, line: 203, baseType: !361, size: 64, align: 64, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !586, file: !250, line: 204, baseType: !389, size: 32, align: 32, offset: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !586, file: !250, line: 205, baseType: !444, size: 64, align: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !586, file: !250, line: 206, baseType: !499, size: 64, align: 64, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !535, file: !250, line: 480, baseType: !389, size: 32, align: 32, offset: 3008)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !535, file: !250, line: 505, baseType: !389, size: 32, align: 32, offset: 3040)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !535, file: !250, line: 512, baseType: !273, size: 32, align: 32, offset: 3072)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !535, file: !250, line: 514, baseType: !279, size: 32, align: 32, offset: 3104)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !535, file: !250, line: 516, baseType: !297, size: 32, align: 32, offset: 3136)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !535, file: !250, line: 523, baseType: !321, size: 32, align: 32, offset: 3168)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !535, file: !250, line: 525, baseType: !340, size: 32, align: 32, offset: 3200)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !535, file: !250, line: 532, baseType: !559, size: 64, align: 64, offset: 3264)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !535, file: !250, line: 539, baseType: !559, size: 64, align: 64, offset: 3328)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !535, file: !250, line: 547, baseType: !559, size: 64, align: 64, offset: 3392)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !535, file: !250, line: 554, baseType: !444, size: 64, align: 64, offset: 3456)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !535, file: !250, line: 563, baseType: !389, size: 32, align: 32, offset: 3520)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !535, file: !250, line: 572, baseType: !389, size: 32, align: 32, offset: 3552)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !535, file: !250, line: 581, baseType: !389, size: 32, align: 32, offset: 3584)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !535, file: !250, line: 588, baseType: !608, size: 64, align: 64, offset: 3648)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64, align: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !363, line: 36, baseType: !610)
!610 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !535, file: !250, line: 593, baseType: !389, size: 32, align: 32, offset: 3712)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !535, file: !250, line: 596, baseType: !389, size: 32, align: 32, offset: 3744)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !535, file: !250, line: 599, baseType: !499, size: 64, align: 64, offset: 3776)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !535, file: !250, line: 605, baseType: !499, size: 64, align: 64, offset: 3840)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !535, file: !250, line: 616, baseType: !499, size: 64, align: 64, offset: 3904)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !535, file: !250, line: 626, baseType: !433, size: 64, align: 64, offset: 3968)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !535, file: !250, line: 627, baseType: !433, size: 64, align: 64, offset: 4032)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !535, file: !250, line: 628, baseType: !433, size: 64, align: 64, offset: 4096)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !535, file: !250, line: 629, baseType: !433, size: 64, align: 64, offset: 4160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !535, file: !250, line: 645, baseType: !499, size: 64, align: 64, offset: 4224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_get_formats", scope: !425, file: !419, line: 83, baseType: !622, size: 64, align: 64, offset: 1024)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64, align: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!389, !481, !350, !625}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64, align: 64)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_data_to", scope: !425, file: !419, line: 86, baseType: !627, size: 64, align: 64, offset: 1088)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64, align: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{!389, !481, !533, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64, align: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "transfer_data_from", scope: !425, file: !419, line: 88, baseType: !627, size: 64, align: 64, offset: 1152)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "map_to", scope: !425, file: !419, line: 91, baseType: !634, size: 64, align: 64, offset: 1216)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64, align: 64)
!635 = !DISubroutineType(types: !636)
!636 = !{!389, !481, !533, !630, !389}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "map_from", scope: !425, file: !419, line: 93, baseType: !634, size: 64, align: 64, offset: 1280)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "frames_derive_to", scope: !425, file: !419, line: 96, baseType: !639, size: 64, align: 64, offset: 1344)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64, align: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!389, !481, !481, !389}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "frames_derive_from", scope: !425, file: !419, line: 98, baseType: !639, size: 64, align: 64, offset: 1408)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !418, file: !419, line: 104, baseType: !365, size: 64, align: 64, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "source_device", scope: !418, file: !419, line: 110, baseType: !499, size: 64, align: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !368, file: !4, line: 78, baseType: !3, size: 32, align: 32, offset: 128)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !368, file: !4, line: 91, baseType: !365, size: 64, align: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "free", scope: !368, file: !4, line: 103, baseType: !648, size: 64, align: 64, offset: 256)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64, align: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !651}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "user_opaque", scope: !368, file: !4, line: 108, baseType: !365, size: 64, align: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64, align: 64)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "HWMapDescriptor", file: !419, line: 151, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HWMapDescriptor", file: !419, line: 131, size: 256, align: 64, elements: !656)
!656 = !{!657, !658, !659, !664}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !655, file: !419, line: 135, baseType: !533, size: 64, align: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !655, file: !419, line: 141, baseType: !499, size: 64, align: 64, offset: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "unmap", scope: !655, file: !419, line: 145, baseType: !660, size: 64, align: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64, align: 64)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !481, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64, align: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !655, file: !419, line: 150, baseType: !365, size: 64, align: 64, offset: 192)
!665 = !{!666, !672, !677, !678}
!666 = distinct !DIGlobalVariable(name: "hw_type_names", scope: !0, file: !667, line: 65, type: !668, isLocal: true, isDefinition: true, variable: [11 x i8*]* @hw_type_names)
!667 = !DIFile(filename: "libavutil/hwcontext.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 704, align: 64, elements: !670)
!669 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!670 = !{!671}
!671 = !DISubrange(count: 11)
!672 = distinct !DIGlobalVariable(name: "hw_table", scope: !0, file: !667, line: 31, type: !673, isLocal: true, isDefinition: true, variable: [1 x %struct.HWContextType*]* @hw_table)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 64, align: 64, elements: !675)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !422)
!675 = !{!676}
!676 = !DISubrange(count: 1)
!677 = distinct !DIGlobalVariable(name: "hwdevice_ctx_class", scope: !0, file: !667, line: 112, type: !372, isLocal: true, isDefinition: true, variable: %struct.AVClass* @hwdevice_ctx_class)
!678 = distinct !DIGlobalVariable(name: "hwframe_ctx_class", scope: !0, file: !667, line: 214, type: !372, isLocal: true, isDefinition: true, variable: %struct.AVClass* @hwframe_ctx_class)
!679 = !{i32 2, !"Dwarf Version", i32 4}
!680 = !{i32 2, !"Debug Info Version", i32 3}
!681 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!682 = distinct !DISubprogram(name: "av_hwdevice_find_type_by_name", scope: !667, file: !667, line: 78, type: !683, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{!3, !377}
!685 = !{}
!686 = !DILocalVariable(name: "name", arg: 1, scope: !682, file: !667, line: 78, type: !377)
!687 = !DIExpression()
!688 = !DILocation(line: 78, column: 63, scope: !682)
!689 = !DILocalVariable(name: "type", scope: !682, file: !667, line: 80, type: !389)
!690 = !DILocation(line: 80, column: 9, scope: !682)
!691 = !DILocation(line: 81, column: 15, scope: !692)
!692 = distinct !DILexicalBlock(scope: !682, file: !667, line: 81, column: 5)
!693 = !DILocation(line: 81, column: 10, scope: !692)
!694 = !DILocation(line: 81, column: 20, scope: !695)
!695 = !DILexicalBlockFile(scope: !696, file: !667, discriminator: 1)
!696 = distinct !DILexicalBlock(scope: !692, file: !667, line: 81, column: 5)
!697 = !DILocation(line: 81, column: 25, scope: !695)
!698 = !DILocation(line: 81, column: 5, scope: !695)
!699 = !DILocation(line: 82, column: 27, scope: !700)
!700 = distinct !DILexicalBlock(scope: !701, file: !667, line: 82, column: 13)
!701 = distinct !DILexicalBlock(scope: !696, file: !667, line: 81, column: 89)
!702 = !DILocation(line: 82, column: 13, scope: !700)
!703 = !DILocation(line: 82, column: 33, scope: !700)
!704 = !DILocation(line: 82, column: 58, scope: !705)
!705 = !DILexicalBlockFile(scope: !700, file: !667, discriminator: 1)
!706 = !DILocation(line: 82, column: 44, scope: !705)
!707 = !DILocation(line: 82, column: 65, scope: !705)
!708 = !DILocation(line: 82, column: 37, scope: !705)
!709 = !DILocation(line: 82, column: 13, scope: !705)
!710 = !DILocation(line: 83, column: 20, scope: !700)
!711 = !DILocation(line: 83, column: 13, scope: !700)
!712 = !DILocation(line: 84, column: 5, scope: !701)
!713 = !DILocation(line: 81, column: 85, scope: !714)
!714 = !DILexicalBlockFile(scope: !696, file: !667, discriminator: 2)
!715 = !DILocation(line: 81, column: 5, scope: !714)
!716 = distinct !{!716, !717}
!717 = !DILocation(line: 81, column: 5, scope: !682)
!718 = !DILocation(line: 85, column: 5, scope: !682)
!719 = !DILocation(line: 86, column: 1, scope: !682)
