; ModuleID = '/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ccaption_dec.o.i'
source_filename = "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs/[inter]libavcodec--ccaption_dec.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.AVClass = type { i8*, i8* (i8*)*, %struct.AVOption*, i32, i32, i32, i8* (i8*, i8*)*, %struct.AVClass* (%struct.AVClass*)*, i32, i32 (i8*)*, i32 (%struct.AVOptionRanges**, i8*, i8*, i32)* }
%struct.AVOption = type { i8*, i8*, i32, i32, %union.anon, double, double, i32, i8* }
%union.anon = type { i64 }
%struct.AVOptionRanges = type { %struct.AVOptionRange**, i32, i32 }
%struct.AVOptionRange = type { i8*, double, double, double, double, i32 }

!861 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_VOICE_OVER", value: 7)
!862 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_KARAOKE", value: 8)
!863 = !DIEnumerator(name: "AV_AUDIO_SERVICE_TYPE_NB", value: 9)
!864 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVDiscard", file: !14, line: 798, size: 32, align: 32, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !871, !872}
!866 = !DIEnumerator(name: "AVDISCARD_NONE", value: -16)
!867 = !DIEnumerator(name: "AVDISCARD_DEFAULT", value: 0)
!868 = !DIEnumerator(name: "AVDISCARD_NONREF", value: 8)
!869 = !DIEnumerator(name: "AVDISCARD_BIDIR", value: 16)
!870 = !DIEnumerator(name: "AVDISCARD_NONINTRA", value: 24)
!871 = !DIEnumerator(name: "AVDISCARD_NONKEY", value: 32)
!872 = !DIEnumerator(name: "AVDISCARD_ALL", value: 48)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVPacketSideDataType", file: !14, line: 1175, size: 32, align: 32, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!875 = !DIEnumerator(name: "AV_PKT_DATA_PALETTE", value: 0)
!876 = !DIEnumerator(name: "AV_PKT_DATA_NEW_EXTRADATA", value: 1)
!877 = !DIEnumerator(name: "AV_PKT_DATA_PARAM_CHANGE", value: 2)
!878 = !DIEnumerator(name: "AV_PKT_DATA_H263_MB_INFO", value: 3)
!879 = !DIEnumerator(name: "AV_PKT_DATA_REPLAYGAIN", value: 4)
!880 = !DIEnumerator(name: "AV_PKT_DATA_DISPLAYMATRIX", value: 5)
!881 = !DIEnumerator(name: "AV_PKT_DATA_STEREO3D", value: 6)
!882 = !DIEnumerator(name: "AV_PKT_DATA_AUDIO_SERVICE_TYPE", value: 7)
!883 = !DIEnumerator(name: "AV_PKT_DATA_QUALITY_STATS", value: 8)
!884 = !DIEnumerator(name: "AV_PKT_DATA_FALLBACK_TRACK", value: 9)
!885 = !DIEnumerator(name: "AV_PKT_DATA_CPB_PROPERTIES", value: 10)
!886 = !DIEnumerator(name: "AV_PKT_DATA_SKIP_SAMPLES", value: 11)
!887 = !DIEnumerator(name: "AV_PKT_DATA_JP_DUALMONO", value: 12)
!888 = !DIEnumerator(name: "AV_PKT_DATA_STRINGS_METADATA", value: 13)
!889 = !DIEnumerator(name: "AV_PKT_DATA_SUBTITLE_POSITION", value: 14)
!890 = !DIEnumerator(name: "AV_PKT_DATA_MATROSKA_BLOCKADDITIONAL", value: 15)
!891 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_IDENTIFIER", value: 16)
!892 = !DIEnumerator(name: "AV_PKT_DATA_WEBVTT_SETTINGS", value: 17)
!893 = !DIEnumerator(name: "AV_PKT_DATA_METADATA_UPDATE", value: 18)
!894 = !DIEnumerator(name: "AV_PKT_DATA_MPEGTS_STREAM_ID", value: 19)
!895 = !DIEnumerator(name: "AV_PKT_DATA_MASTERING_DISPLAY_METADATA", value: 20)
!896 = !DIEnumerator(name: "AV_PKT_DATA_SPHERICAL", value: 21)
!897 = !DIEnumerator(name: "AV_PKT_DATA_CONTENT_LIGHT_LEVEL", value: 22)
!898 = !DIEnumerator(name: "AV_PKT_DATA_A53_CC", value: 23)
!899 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INIT_INFO", value: 24)
!900 = !DIEnumerator(name: "AV_PKT_DATA_ENCRYPTION_INFO", value: 25)
!901 = !DIEnumerator(name: "AV_PKT_DATA_AFD", value: 26)
!902 = !DIEnumerator(name: "AV_PKT_DATA_NB", value: 27)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AVSubtitleType", file: !14, line: 3865, size: 32, align: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "SUBTITLE_NONE", value: 0)
!906 = !DIEnumerator(name: "SUBTITLE_BITMAP", value: 1)
!907 = !DIEnumerator(name: "SUBTITLE_TEXT", value: 2)
!908 = !DIEnumerator(name: "SUBTITLE_ASS", value: 3)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cc_mode", file: !910, line: 39, size: 32, align: 32, elements: !911)
!910 = !DIFile(filename: "libavcodec/ccaption_dec.c", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "CCMODE_POPON", value: 0)
!913 = !DIEnumerator(name: "CCMODE_PAINTON", value: 1)
!914 = !DIEnumerator(name: "CCMODE_ROLLUP", value: 2)
!915 = !DIEnumerator(name: "CCMODE_TEXT", value: 3)
!916 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cc_charset", file: !910, line: 66, size: 32, align: 32, elements: !917)
!917 = !{!918, !919, !920, !921}
!918 = !DIEnumerator(name: "CCSET_BASIC_AMERICAN", value: 0)
!919 = !DIEnumerator(name: "CCSET_SPECIAL_AMERICAN", value: 1)
!920 = !DIEnumerator(name: "CCSET_EXTENDED_SPANISH_FRENCH_MISC", value: 2)
!921 = !DIEnumerator(name: "CCSET_EXTENDED_PORTUGUESE_GERMAN_DANISH", value: 3)
!922 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cc_font", file: !910, line: 59, size: 32, align: 32, elements: !923)
!923 = !{!924, !925, !926, !927}
!924 = !DIEnumerator(name: "CCFONT_REGULAR", value: 0)
!925 = !DIEnumerator(name: "CCFONT_ITALICS", value: 1)
!926 = !DIEnumerator(name: "CCFONT_UNDERLINED", value: 2)
!927 = !DIEnumerator(name: "CCFONT_UNDERLINED_ITALICS", value: 3)
!928 = !{!929, !930}
!929 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!930 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!931 = !{!932, !1565, !1566, !1572, !1639, !1645, !1646}
!932 = distinct !DIGlobalVariable(name: "ff_ccaption_decoder", scope: !0, file: !910, line: 832, type: !933, isLocal: false, isDefinition: true, variable: %struct.AVCodec* @ff_ccaption_decoder)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodec", file: !14, line: 3610, baseType: !934)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodec", file: !14, line: 3468, size: 1984, align: 64, elements: !935)
!935 = !{!936, !940, !941, !942, !943, !944, !953, !956, !959, !962, !968, !971, !1047, !1055, !1056, !1057, !1059, !1464, !1470, !1475, !1479, !1480, !1520, !1540, !1544, !1545, !1549, !1553, !1554, !1558, !1559, !1560}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !934, file: !14, line: 3475, baseType: !937, size: 64, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64, align: 64)
!938 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !939)
!939 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !934, file: !14, line: 3480, baseType: !937, size: 64, align: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !934, file: !14, line: 3481, baseType: !3, size: 32, align: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !934, file: !14, line: 3482, baseType: !13, size: 32, align: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !934, file: !14, line: 3487, baseType: !930, size: 32, align: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "supported_framerates", scope: !934, file: !14, line: 3488, baseType: !945, size: 64, align: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64, align: 64)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVRational", file: !948, line: 61, baseType: !949)
!948 = !DIFile(filename: "./libavutil/rational.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVRational", file: !948, line: 58, size: 64, align: 32, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !949, file: !948, line: 59, baseType: !930, size: 32, align: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "den", scope: !949, file: !948, line: 60, baseType: !930, size: 32, align: 32, offset: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmts", scope: !934, file: !14, line: 3489, baseType: !954, size: 64, align: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64, align: 64)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "supported_samplerates", scope: !934, file: !14, line: 3490, baseType: !957, size: 64, align: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64, align: 64)
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmts", scope: !934, file: !14, line: 3491, baseType: !960, size: 64, align: 64, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layouts", scope: !934, file: !14, line: 3492, baseType: !963, size: 64, align: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64, align: 64)
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !966, line: 55, baseType: !967)
!966 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!967 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "max_lowres", scope: !934, file: !14, line: 3493, baseType: !969, size: 8, align: 8, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !966, line: 48, baseType: !970)
!970 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "priv_class", scope: !934, file: !14, line: 3494, baseType: !972, size: 64, align: 64, offset: 640)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64, align: 64)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClass", file: !713, line: 143, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVClass", file: !713, line: 67, size: 640, align: 64, elements: !976)
!976 = !{!977, !978, !983, !1006, !1007, !1008, !1009, !1013, !1019, !1021, !1025}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !975, file: !713, line: 72, baseType: !937, size: 64, align: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "item_name", scope: !975, file: !713, line: 78, baseType: !979, size: 64, align: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64, align: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!937, !982}
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "option", scope: !975, file: !713, line: 85, baseType: !984, size: 64, align: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64, align: 64)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOption", file: !691, line: 246, size: 512, align: 64, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !1002, !1003, !1004, !1005}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !691, line: 247, baseType: !937, size: 64, align: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !986, file: !691, line: 253, baseType: !937, size: 64, align: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !986, file: !691, line: 259, baseType: !930, size: 32, align: 32, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !986, file: !691, line: 260, baseType: !690, size: 32, align: 32, offset: 160)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "default_val", scope: !986, file: !691, line: 271, baseType: !993, size: 64, align: 64, offset: 192)
!993 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !691, line: 265, size: 64, align: 64, elements: !994)
!994 = !{!995, !998, !1000, !1001}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "i64", scope: !993, file: !691, line: 266, baseType: !996, size: 64, align: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !966, line: 40, baseType: !997)
!997 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dbl", scope: !993, file: !691, line: 267, baseType: !999, size: 64, align: 64)
!999 = !DIBasicType(name: "double", size: 64, align: 64, encoding: DW_ATE_float)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !993, file: !691, line: 268, baseType: !937, size: 64, align: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !993, file: !691, line: 270, baseType: !947, size: 64, align: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !986, file: !691, line: 272, baseType: !999, size: 64, align: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !986, file: !691, line: 273, baseType: !999, size: 64, align: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !691, line: 275, baseType: !930, size: 32, align: 32, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "unit", scope: !986, file: !691, line: 300, baseType: !937, size: 64, align: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !975, file: !713, line: 93, baseType: !930, size: 32, align: 32, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset_offset", scope: !975, file: !713, line: 99, baseType: !930, size: 32, align: 32, offset: 224)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "parent_log_context_offset", scope: !975, file: !713, line: 108, baseType: !930, size: 32, align: 32, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "child_next", scope: !975, file: !713, line: 113, baseType: !1010, size: 64, align: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64, align: 64)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!982, !982, !982}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "child_class_next", scope: !975, file: !713, line: 123, baseType: !1014, size: 64, align: 64, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64, align: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1017, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64, align: 64)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !975)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "category", scope: !975, file: !713, line: 130, baseType: !1020, size: 32, align: 32, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVClassCategory", file: !713, line: 48, baseType: !712)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "get_category", scope: !975, file: !713, line: 136, baseType: !1022, size: 64, align: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64, align: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!1020, !982}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "query_ranges", scope: !975, file: !713, line: 142, baseType: !1026, size: 64, align: 64, offset: 576)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64, align: 64)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!930, !1029, !982, !937, !930}
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64, align: 64)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64, align: 64)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRanges", file: !691, line: 329, size: 128, align: 64, elements: !1032)
!1032 = !{!1033, !1045, !1046}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "range", scope: !1031, file: !691, line: 360, baseType: !1034, size: 64, align: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64, align: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64, align: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOptionRange", file: !691, line: 324, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVOptionRange", file: !691, line: 306, size: 384, align: 64, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1043, !1044}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1037, file: !691, line: 307, baseType: !937, size: 64, align: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "value_min", scope: !1037, file: !691, line: 313, baseType: !999, size: 64, align: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "value_max", scope: !1037, file: !691, line: 313, baseType: !999, size: 64, align: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "component_min", scope: !1037, file: !691, line: 318, baseType: !999, size: 64, align: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "component_max", scope: !1037, file: !691, line: 318, baseType: !999, size: 64, align: 64, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "is_range", scope: !1037, file: !691, line: 323, baseType: !930, size: 32, align: 32, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "nb_ranges", scope: !1031, file: !691, line: 364, baseType: !930, size: 32, align: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_components", scope: !1031, file: !691, line: 368, baseType: !930, size: 32, align: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !934, file: !14, line: 3495, baseType: !1048, size: 64, align: 64, offset: 704)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64, align: 64)
!1049 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVProfile", file: !14, line: 3404, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVProfile", file: !14, line: 3401, size: 128, align: 64, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1051, file: !14, line: 3402, baseType: !930, size: 32, align: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1051, file: !14, line: 3403, baseType: !937, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "wrapper_name", scope: !934, file: !14, line: 3507, baseType: !937, size: 64, align: 64, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !934, file: !14, line: 3516, baseType: !930, size: 32, align: 32, offset: 832)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !934, file: !14, line: 3517, baseType: !1058, size: 64, align: 64, offset: 896)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64, align: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread_copy", scope: !934, file: !14, line: 3527, baseType: !1060, size: 64, align: 64, offset: 960)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64, align: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!930, !1063}
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64, align: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecContext", file: !14, line: 3360, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecContext", file: !14, line: 1556, size: 8448, align: 64, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070, !1073, !1074, !1075, !1076, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1201, !1205, !1206, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1395, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "av_class", scope: !1065, file: !14, line: 1561, baseType: !972, size: 64, align: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "log_level_offset", scope: !1065, file: !14, line: 1562, baseType: !930, size: 32, align: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "codec_type", scope: !1065, file: !14, line: 1564, baseType: !3, size: 32, align: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "codec", scope: !1065, file: !14, line: 1565, baseType: !1071, size: 64, align: 64, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64, align: 64)
!1072 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !934)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "codec_id", scope: !1065, file: !14, line: 1566, baseType: !13, size: 32, align: 32, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "codec_tag", scope: !1065, file: !14, line: 1581, baseType: !929, size: 32, align: 32, offset: 224)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data", scope: !1065, file: !14, line: 1583, baseType: !982, size: 64, align: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "internal", scope: !1065, file: !14, line: 1591, baseType: !1077, size: 64, align: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64, align: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecInternal", file: !14, line: 1532, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1065, file: !14, line: 1598, baseType: !982, size: 64, align: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate", scope: !1065, file: !14, line: 1606, baseType: !996, size: 64, align: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bit_rate_tolerance", scope: !1065, file: !14, line: 1614, baseType: !930, size: 32, align: 32, offset: 512)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "global_quality", scope: !1065, file: !14, line: 1622, baseType: !930, size: 32, align: 32, offset: 544)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "compression_level", scope: !1065, file: !14, line: 1628, baseType: !930, size: 32, align: 32, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1065, file: !14, line: 1636, baseType: !930, size: 32, align: 32, offset: 608)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "flags2", scope: !1065, file: !14, line: 1643, baseType: !930, size: 32, align: 32, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "extradata", scope: !1065, file: !14, line: 1657, baseType: !1087, size: 64, align: 64, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64, align: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "extradata_size", scope: !1065, file: !14, line: 1658, baseType: !930, size: 32, align: 32, offset: 768)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "time_base", scope: !1065, file: !14, line: 1679, baseType: !947, size: 64, align: 32, offset: 800)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ticks_per_frame", scope: !1065, file: !14, line: 1688, baseType: !930, size: 32, align: 32, offset: 864)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !1065, file: !14, line: 1712, baseType: !930, size: 32, align: 32, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1065, file: !14, line: 1729, baseType: !930, size: 32, align: 32, offset: 928)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1065, file: !14, line: 1729, baseType: !930, size: 32, align: 32, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "coded_width", scope: !1065, file: !14, line: 1744, baseType: !930, size: 32, align: 32, offset: 992)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "coded_height", scope: !1065, file: !14, line: 1744, baseType: !930, size: 32, align: 32, offset: 1024)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gop_size", scope: !1065, file: !14, line: 1751, baseType: !930, size: 32, align: 32, offset: 1056)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1065, file: !14, line: 1766, baseType: !473, size: 32, align: 32, offset: 1088)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "draw_horiz_band", scope: !1065, file: !14, line: 1791, baseType: !1099, size: 64, align: 64, offset: 1152)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64, align: 64)
!1100 = !DISubroutineType(types: !1101)
!1101 = !{null, !1102, !1103, !1200, !930, !930, !930}
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64, align: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64, align: 64)
!1104 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1105)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrame", file: !744, line: 646, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrame", file: !744, line: 268, size: 4288, align: 64, elements: !1107)
!1107 = !{!1108, !1112, !1114, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1152, !1154, !1155, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1188, !1189, !1190, !1191, !1192, !1193, !1196, !1197, !1198, !1199}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1106, file: !744, line: 282, baseType: !1109, size: 512, align: 64)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 512, align: 64, elements: !1110)
!1110 = !{!1111}
!1111 = !DISubrange(count: 8)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1106, file: !744, line: 299, baseType: !1113, size: 256, align: 32, offset: 512)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 256, align: 32, elements: !1110)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "extended_data", scope: !1106, file: !744, line: 315, baseType: !1115, size: 64, align: 64, offset: 768)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64, align: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1106, file: !744, line: 326, baseType: !930, size: 32, align: 32, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !1106, file: !744, line: 326, baseType: !930, size: 32, align: 32, offset: 864)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nb_samples", scope: !1106, file: !744, line: 334, baseType: !930, size: 32, align: 32, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1106, file: !744, line: 341, baseType: !930, size: 32, align: 32, offset: 928)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "key_frame", scope: !1106, file: !744, line: 346, baseType: !930, size: 32, align: 32, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "pict_type", scope: !1106, file: !744, line: 351, baseType: !733, size: 32, align: 32, offset: 992)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1106, file: !744, line: 356, baseType: !947, size: 64, align: 32, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1106, file: !744, line: 361, baseType: !996, size: 64, align: 64, offset: 1088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pts", scope: !1106, file: !744, line: 369, baseType: !996, size: 64, align: 64, offset: 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_dts", scope: !1106, file: !744, line: 377, baseType: !996, size: 64, align: 64, offset: 1216)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "coded_picture_number", scope: !1106, file: !744, line: 382, baseType: !930, size: 32, align: 32, offset: 1280)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "display_picture_number", scope: !1106, file: !744, line: 386, baseType: !930, size: 32, align: 32, offset: 1312)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "quality", scope: !1106, file: !744, line: 391, baseType: !930, size: 32, align: 32, offset: 1344)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !1106, file: !744, line: 396, baseType: !982, size: 64, align: 64, offset: 1408)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1106, file: !744, line: 403, baseType: !1131, size: 512, align: 64, offset: 1472)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 512, align: 64, elements: !1110)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "repeat_pict", scope: !1106, file: !744, line: 410, baseType: !930, size: 32, align: 32, offset: 1984)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced_frame", scope: !1106, file: !744, line: 415, baseType: !930, size: 32, align: 32, offset: 2016)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "top_field_first", scope: !1106, file: !744, line: 420, baseType: !930, size: 32, align: 32, offset: 2048)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "palette_has_changed", scope: !1106, file: !744, line: 425, baseType: !930, size: 32, align: 32, offset: 2080)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1106, file: !744, line: 435, baseType: !996, size: 64, align: 64, offset: 2112)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1106, file: !744, line: 440, baseType: !930, size: 32, align: 32, offset: 2176)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1106, file: !744, line: 445, baseType: !965, size: 64, align: 64, offset: 2240)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1106, file: !744, line: 459, baseType: !1140, size: 512, align: 64, offset: 2304)
!1140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 512, align: 64, elements: !1110)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64, align: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBufferRef", file: !1143, line: 94, baseType: !1144)
!1143 = !DIFile(filename: "./libavutil/buffer.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBufferRef", file: !1143, line: 81, size: 192, align: 64, elements: !1145)
!1145 = !{!1146, !1150, !1151}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1144, file: !1143, line: 82, baseType: !1147, size: 64, align: 64)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64, align: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBuffer", file: !1143, line: 73, baseType: !1149)
!1149 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVBuffer", file: !1143, line: 73, flags: DIFlagFwdDecl)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1144, file: !1143, line: 89, baseType: !1087, size: 64, align: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !1143, line: 93, baseType: !930, size: 32, align: 32, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "extended_buf", scope: !1106, file: !744, line: 473, baseType: !1153, size: 64, align: 64, offset: 2816)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64, align: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "nb_extended_buf", scope: !1106, file: !744, line: 477, baseType: !930, size: 32, align: 32, offset: 2880)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1106, file: !744, line: 479, baseType: !1156, size: 64, align: 64, offset: 2944)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64, align: 64)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64, align: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVFrameSideData", file: !744, line: 207, baseType: !1159)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVFrameSideData", file: !744, line: 201, size: 320, align: 64, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1164, !1169}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1159, file: !744, line: 202, baseType: !743, size: 32, align: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1159, file: !744, line: 203, baseType: !1087, size: 64, align: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1159, file: !744, line: 204, baseType: !930, size: 32, align: 32, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1159, file: !744, line: 205, baseType: !1165, size: 64, align: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64, align: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVDictionary", file: !1167, line: 86, baseType: !1168)
!1167 = !DIFile(filename: "./libavutil/dict.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVDictionary", file: !1167, line: 86, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1159, file: !744, line: 206, baseType: !1141, size: 64, align: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "nb_side_data", scope: !1106, file: !744, line: 480, baseType: !930, size: 32, align: 32, offset: 3008)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1106, file: !744, line: 505, baseType: !930, size: 32, align: 32, offset: 3040)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1106, file: !744, line: 512, baseType: !767, size: 32, align: 32, offset: 3072)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1106, file: !744, line: 514, baseType: !773, size: 32, align: 32, offset: 3104)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1106, file: !744, line: 516, baseType: !791, size: 32, align: 32, offset: 3136)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1106, file: !744, line: 523, baseType: !815, size: 32, align: 32, offset: 3168)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_location", scope: !1106, file: !744, line: 525, baseType: !834, size: 32, align: 32, offset: 3200)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "best_effort_timestamp", scope: !1106, file: !744, line: 532, baseType: !996, size: 64, align: 64, offset: 3264)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_pos", scope: !1106, file: !744, line: 539, baseType: !996, size: 64, align: 64, offset: 3328)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_duration", scope: !1106, file: !744, line: 547, baseType: !996, size: 64, align: 64, offset: 3392)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "metadata", scope: !1106, file: !744, line: 554, baseType: !1165, size: 64, align: 64, offset: 3456)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "decode_error_flags", scope: !1106, file: !744, line: 563, baseType: !930, size: 32, align: 32, offset: 3520)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1106, file: !744, line: 572, baseType: !930, size: 32, align: 32, offset: 3552)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_size", scope: !1106, file: !744, line: 581, baseType: !930, size: 32, align: 32, offset: 3584)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_table", scope: !1106, file: !744, line: 588, baseType: !1185, size: 64, align: 64, offset: 3648)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64, align: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !966, line: 36, baseType: !1187)
!1187 = !DIBasicType(name: "signed char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "qstride", scope: !1106, file: !744, line: 593, baseType: !930, size: 32, align: 32, offset: 3712)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "qscale_type", scope: !1106, file: !744, line: 596, baseType: !930, size: 32, align: 32, offset: 3744)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "qp_table_buf", scope: !1106, file: !744, line: 599, baseType: !1141, size: 64, align: 64, offset: 3776)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1106, file: !744, line: 605, baseType: !1141, size: 64, align: 64, offset: 3840)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "opaque_ref", scope: !1106, file: !744, line: 616, baseType: !1141, size: 64, align: 64, offset: 3904)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "crop_top", scope: !1106, file: !744, line: 626, baseType: !1194, size: 64, align: 64, offset: 3968)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1195, line: 216, baseType: !967)
!1195 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "crop_bottom", scope: !1106, file: !744, line: 627, baseType: !1194, size: 64, align: 64, offset: 4032)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "crop_left", scope: !1106, file: !744, line: 628, baseType: !1194, size: 64, align: 64, offset: 4096)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "crop_right", scope: !1106, file: !744, line: 629, baseType: !1194, size: 64, align: 64, offset: 4160)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "private_ref", scope: !1106, file: !744, line: 645, baseType: !1141, size: 64, align: 64, offset: 4224)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64, align: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "get_format", scope: !1065, file: !14, line: 1808, baseType: !1202, size: 64, align: 64, offset: 1216)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64, align: 64)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{!473, !1102, !954}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "max_b_frames", scope: !1065, file: !14, line: 1816, baseType: !930, size: 32, align: 32, offset: 1280)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_factor", scope: !1065, file: !14, line: 1825, baseType: !1207, size: 32, align: 32, offset: 1312)
!1207 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "b_frame_strategy", scope: !1065, file: !14, line: 1830, baseType: !930, size: 32, align: 32, offset: 1344)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "b_quant_offset", scope: !1065, file: !14, line: 1838, baseType: !1207, size: 32, align: 32, offset: 1376)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "has_b_frames", scope: !1065, file: !14, line: 1846, baseType: !930, size: 32, align: 32, offset: 1408)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "mpeg_quant", scope: !1065, file: !14, line: 1851, baseType: !930, size: 32, align: 32, offset: 1440)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_factor", scope: !1065, file: !14, line: 1861, baseType: !1207, size: 32, align: 32, offset: 1472)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "i_quant_offset", scope: !1065, file: !14, line: 1868, baseType: !1207, size: 32, align: 32, offset: 1504)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "lumi_masking", scope: !1065, file: !14, line: 1875, baseType: !1207, size: 32, align: 32, offset: 1536)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "temporal_cplx_masking", scope: !1065, file: !14, line: 1882, baseType: !1207, size: 32, align: 32, offset: 1568)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "spatial_cplx_masking", scope: !1065, file: !14, line: 1889, baseType: !1207, size: 32, align: 32, offset: 1600)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "p_masking", scope: !1065, file: !14, line: 1896, baseType: !1207, size: 32, align: 32, offset: 1632)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "dark_masking", scope: !1065, file: !14, line: 1903, baseType: !1207, size: 32, align: 32, offset: 1664)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "slice_count", scope: !1065, file: !14, line: 1910, baseType: !930, size: 32, align: 32, offset: 1696)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "prediction_method", scope: !1065, file: !14, line: 1915, baseType: !930, size: 32, align: 32, offset: 1728)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "slice_offset", scope: !1065, file: !14, line: 1926, baseType: !1200, size: 64, align: 64, offset: 1792)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "sample_aspect_ratio", scope: !1065, file: !14, line: 1935, baseType: !947, size: 64, align: 32, offset: 1856)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "me_cmp", scope: !1065, file: !14, line: 1942, baseType: !930, size: 32, align: 32, offset: 1920)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "me_sub_cmp", scope: !1065, file: !14, line: 1948, baseType: !930, size: 32, align: 32, offset: 1952)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cmp", scope: !1065, file: !14, line: 1954, baseType: !930, size: 32, align: 32, offset: 1984)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ildct_cmp", scope: !1065, file: !14, line: 1960, baseType: !930, size: 32, align: 32, offset: 2016)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "dia_size", scope: !1065, file: !14, line: 1984, baseType: !930, size: 32, align: 32, offset: 2048)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "last_predictor_count", scope: !1065, file: !14, line: 1991, baseType: !930, size: 32, align: 32, offset: 2080)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pre_me", scope: !1065, file: !14, line: 1996, baseType: !930, size: 32, align: 32, offset: 2112)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "me_pre_cmp", scope: !1065, file: !14, line: 2004, baseType: !930, size: 32, align: 32, offset: 2144)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "pre_dia_size", scope: !1065, file: !14, line: 2011, baseType: !930, size: 32, align: 32, offset: 2176)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "me_subpel_quality", scope: !1065, file: !14, line: 2018, baseType: !930, size: 32, align: 32, offset: 2208)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "me_range", scope: !1065, file: !14, line: 2027, baseType: !930, size: 32, align: 32, offset: 2240)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "slice_flags", scope: !1065, file: !14, line: 2034, baseType: !930, size: 32, align: 32, offset: 2272)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "mb_decision", scope: !1065, file: !14, line: 2044, baseType: !930, size: 32, align: 32, offset: 2304)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "intra_matrix", scope: !1065, file: !14, line: 2054, baseType: !1237, size: 64, align: 64, offset: 2368)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !966, line: 49, baseType: !1239)
!1239 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "inter_matrix", scope: !1065, file: !14, line: 2061, baseType: !1237, size: 64, align: 64, offset: 2432)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "scenechange_threshold", scope: !1065, file: !14, line: 2066, baseType: !930, size: 32, align: 32, offset: 2496)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "noise_reduction", scope: !1065, file: !14, line: 2070, baseType: !930, size: 32, align: 32, offset: 2528)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "intra_dc_precision", scope: !1065, file: !14, line: 2078, baseType: !930, size: 32, align: 32, offset: 2560)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "skip_top", scope: !1065, file: !14, line: 2085, baseType: !930, size: 32, align: 32, offset: 2592)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "skip_bottom", scope: !1065, file: !14, line: 2092, baseType: !930, size: 32, align: 32, offset: 2624)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmin", scope: !1065, file: !14, line: 2099, baseType: !930, size: 32, align: 32, offset: 2656)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "mb_lmax", scope: !1065, file: !14, line: 2106, baseType: !930, size: 32, align: 32, offset: 2688)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "me_penalty_compensation", scope: !1065, file: !14, line: 2113, baseType: !930, size: 32, align: 32, offset: 2720)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bidir_refine", scope: !1065, file: !14, line: 2120, baseType: !930, size: 32, align: 32, offset: 2752)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "brd_scale", scope: !1065, file: !14, line: 2125, baseType: !930, size: 32, align: 32, offset: 2784)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "keyint_min", scope: !1065, file: !14, line: 2133, baseType: !930, size: 32, align: 32, offset: 2816)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1065, file: !14, line: 2140, baseType: !930, size: 32, align: 32, offset: 2848)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "chromaoffset", scope: !1065, file: !14, line: 2145, baseType: !930, size: 32, align: 32, offset: 2880)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "mv0_threshold", scope: !1065, file: !14, line: 2153, baseType: !930, size: 32, align: 32, offset: 2912)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "b_sensitivity", scope: !1065, file: !14, line: 2158, baseType: !930, size: 32, align: 32, offset: 2944)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "color_primaries", scope: !1065, file: !14, line: 2166, baseType: !773, size: 32, align: 32, offset: 2976)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "color_trc", scope: !1065, file: !14, line: 2173, baseType: !791, size: 32, align: 32, offset: 3008)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "colorspace", scope: !1065, file: !14, line: 2180, baseType: !815, size: 32, align: 32, offset: 3040)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "color_range", scope: !1065, file: !14, line: 2187, baseType: !767, size: 32, align: 32, offset: 3072)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_sample_location", scope: !1065, file: !14, line: 2194, baseType: !834, size: 32, align: 32, offset: 3104)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "slices", scope: !1065, file: !14, line: 2203, baseType: !930, size: 32, align: 32, offset: 3136)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "field_order", scope: !1065, file: !14, line: 2209, baseType: !844, size: 32, align: 32, offset: 3168)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "sample_rate", scope: !1065, file: !14, line: 2212, baseType: !930, size: 32, align: 32, offset: 3200)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !1065, file: !14, line: 2213, baseType: !930, size: 32, align: 32, offset: 3232)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fmt", scope: !1065, file: !14, line: 2220, baseType: !673, size: 32, align: 32, offset: 3264)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "frame_size", scope: !1065, file: !14, line: 2232, baseType: !930, size: 32, align: 32, offset: 3296)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "frame_number", scope: !1065, file: !14, line: 2243, baseType: !930, size: 32, align: 32, offset: 3328)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "block_align", scope: !1065, file: !14, line: 2249, baseType: !930, size: 32, align: 32, offset: 3360)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "cutoff", scope: !1065, file: !14, line: 2256, baseType: !930, size: 32, align: 32, offset: 3392)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "channel_layout", scope: !1065, file: !14, line: 2263, baseType: !965, size: 64, align: 64, offset: 3456)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "request_channel_layout", scope: !1065, file: !14, line: 2270, baseType: !965, size: 64, align: 64, offset: 3520)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "audio_service_type", scope: !1065, file: !14, line: 2277, baseType: !852, size: 32, align: 32, offset: 3584)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "request_sample_fmt", scope: !1065, file: !14, line: 2285, baseType: !673, size: 32, align: 32, offset: 3616)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "get_buffer2", scope: !1065, file: !14, line: 2367, baseType: !1275, size: 64, align: 64, offset: 3648)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64, align: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!930, !1102, !1278, !930}
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64, align: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "refcounted_frames", scope: !1065, file: !14, line: 2383, baseType: !930, size: 32, align: 32, offset: 3712)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "qcompress", scope: !1065, file: !14, line: 2386, baseType: !1207, size: 32, align: 32, offset: 3744)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "qblur", scope: !1065, file: !14, line: 2387, baseType: !1207, size: 32, align: 32, offset: 3776)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "qmin", scope: !1065, file: !14, line: 2394, baseType: !930, size: 32, align: 32, offset: 3808)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "qmax", scope: !1065, file: !14, line: 2401, baseType: !930, size: 32, align: 32, offset: 3840)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "max_qdiff", scope: !1065, file: !14, line: 2408, baseType: !930, size: 32, align: 32, offset: 3872)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "rc_buffer_size", scope: !1065, file: !14, line: 2415, baseType: !930, size: 32, align: 32, offset: 3904)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override_count", scope: !1065, file: !14, line: 2422, baseType: !930, size: 32, align: 32, offset: 3936)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "rc_override", scope: !1065, file: !14, line: 2423, baseType: !1288, size: 64, align: 64, offset: 3968)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64, align: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "RcOverride", file: !14, line: 831, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RcOverride", file: !14, line: 826, size: 128, align: 32, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1290, file: !14, line: 827, baseType: !930, size: 32, align: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1290, file: !14, line: 828, baseType: !930, size: 32, align: 32, offset: 32)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "qscale", scope: !1290, file: !14, line: 829, baseType: !930, size: 32, align: 32, offset: 64)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "quality_factor", scope: !1290, file: !14, line: 830, baseType: !1207, size: 32, align: 32, offset: 96)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_rate", scope: !1065, file: !14, line: 2430, baseType: !996, size: 64, align: 64, offset: 4032)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_rate", scope: !1065, file: !14, line: 2437, baseType: !996, size: 64, align: 64, offset: 4096)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "rc_max_available_vbv_use", scope: !1065, file: !14, line: 2444, baseType: !1207, size: 32, align: 32, offset: 4160)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "rc_min_vbv_overflow_use", scope: !1065, file: !14, line: 2451, baseType: !1207, size: 32, align: 32, offset: 4192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "rc_initial_buffer_occupancy", scope: !1065, file: !14, line: 2458, baseType: !930, size: 32, align: 32, offset: 4224)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "coder_type", scope: !1065, file: !14, line: 2469, baseType: !930, size: 32, align: 32, offset: 4256)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "context_model", scope: !1065, file: !14, line: 2475, baseType: !930, size: 32, align: 32, offset: 4288)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_threshold", scope: !1065, file: !14, line: 2481, baseType: !930, size: 32, align: 32, offset: 4320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_factor", scope: !1065, file: !14, line: 2485, baseType: !930, size: 32, align: 32, offset: 4352)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_exp", scope: !1065, file: !14, line: 2489, baseType: !930, size: 32, align: 32, offset: 4384)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "frame_skip_cmp", scope: !1065, file: !14, line: 2493, baseType: !930, size: 32, align: 32, offset: 4416)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "trellis", scope: !1065, file: !14, line: 2501, baseType: !930, size: 32, align: 32, offset: 4448)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "min_prediction_order", scope: !1065, file: !14, line: 2506, baseType: !930, size: 32, align: 32, offset: 4480)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "max_prediction_order", scope: !1065, file: !14, line: 2510, baseType: !930, size: 32, align: 32, offset: 4512)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "timecode_frame_start", scope: !1065, file: !14, line: 2514, baseType: !996, size: 64, align: 64, offset: 4544)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_callback", scope: !1065, file: !14, line: 2528, baseType: !1312, size: 64, align: 64, offset: 4608)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64, align: 64)
!1313 = !DISubroutineType(types: !1314)
!1314 = !{null, !1102, !982, !930, !930}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "rtp_payload_size", scope: !1065, file: !14, line: 2534, baseType: !930, size: 32, align: 32, offset: 4672)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "mv_bits", scope: !1065, file: !14, line: 2545, baseType: !930, size: 32, align: 32, offset: 4704)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "header_bits", scope: !1065, file: !14, line: 2547, baseType: !930, size: 32, align: 32, offset: 4736)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "i_tex_bits", scope: !1065, file: !14, line: 2549, baseType: !930, size: 32, align: 32, offset: 4768)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "p_tex_bits", scope: !1065, file: !14, line: 2551, baseType: !930, size: 32, align: 32, offset: 4800)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "i_count", scope: !1065, file: !14, line: 2553, baseType: !930, size: 32, align: 32, offset: 4832)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "p_count", scope: !1065, file: !14, line: 2555, baseType: !930, size: 32, align: 32, offset: 4864)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !1065, file: !14, line: 2557, baseType: !930, size: 32, align: 32, offset: 4896)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "misc_bits", scope: !1065, file: !14, line: 2559, baseType: !930, size: 32, align: 32, offset: 4928)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "frame_bits", scope: !1065, file: !14, line: 2563, baseType: !930, size: 32, align: 32, offset: 4960)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "stats_out", scope: !1065, file: !14, line: 2571, baseType: !1326, size: 64, align: 64, offset: 4992)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64, align: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "stats_in", scope: !1065, file: !14, line: 2579, baseType: !1326, size: 64, align: 64, offset: 5056)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "workaround_bugs", scope: !1065, file: !14, line: 2586, baseType: !930, size: 32, align: 32, offset: 5120)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "strict_std_compliance", scope: !1065, file: !14, line: 2615, baseType: !930, size: 32, align: 32, offset: 5152)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "error_concealment", scope: !1065, file: !14, line: 2627, baseType: !930, size: 32, align: 32, offset: 5184)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !1065, file: !14, line: 2637, baseType: !930, size: 32, align: 32, offset: 5216)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "err_recognition", scope: !1065, file: !14, line: 2681, baseType: !930, size: 32, align: 32, offset: 5248)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "reordered_opaque", scope: !1065, file: !14, line: 2709, baseType: !996, size: 64, align: 64, offset: 5312)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel", scope: !1065, file: !14, line: 2716, baseType: !1335, size: 64, align: 64, offset: 5376)
!1335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1336, size: 64, align: 64)
!1336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1337)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVHWAccel", file: !14, line: 3636, size: 896, align: 64, elements: !1338)
!1338 = !{!1339, !1340, !1341, !1342, !1343, !1344, !1348, !1355, !1359, !1360, !1361, !1362, !1368, !1369, !1370, !1371, !1372}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1337, file: !14, line: 3642, baseType: !937, size: 64, align: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1337, file: !14, line: 3649, baseType: !3, size: 32, align: 32, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1337, file: !14, line: 3656, baseType: !13, size: 32, align: 32, offset: 96)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "pix_fmt", scope: !1337, file: !14, line: 3663, baseType: !473, size: 32, align: 32, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "capabilities", scope: !1337, file: !14, line: 3669, baseType: !930, size: 32, align: 32, offset: 160)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_frame", scope: !1337, file: !14, line: 3682, baseType: !1345, size: 64, align: 64, offset: 192)
!1345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1346, size: 64, align: 64)
!1346 = !DISubroutineType(types: !1347)
!1347 = !{!930, !1063, !1278}
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "start_frame", scope: !1337, file: !14, line: 3698, baseType: !1349, size: 64, align: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64, align: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!930, !1063, !1352, !1354}
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64, align: 64)
!1353 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !966, line: 51, baseType: !929)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "decode_params", scope: !1337, file: !14, line: 3712, baseType: !1356, size: 64, align: 64, offset: 320)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64, align: 64)
!1357 = !DISubroutineType(types: !1358)
!1358 = !{!930, !1063, !930, !1352, !1354}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "decode_slice", scope: !1337, file: !14, line: 3726, baseType: !1349, size: 64, align: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "end_frame", scope: !1337, file: !14, line: 3737, baseType: !1060, size: 64, align: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "frame_priv_data_size", scope: !1337, file: !14, line: 3746, baseType: !930, size: 32, align: 32, offset: 512)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "decode_mb", scope: !1337, file: !14, line: 3757, baseType: !1363, size: 64, align: 64, offset: 576)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64, align: 64)
!1364 = !DISubroutineType(types: !1365)
!1365 = !{null, !1366}
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64, align: 64)
!1367 = !DICompositeType(tag: DW_TAG_structure_type, name: "MpegEncContext", file: !14, line: 3617, flags: DIFlagFwdDecl)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1337, file: !14, line: 3766, baseType: !1060, size: 64, align: 64, offset: 640)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !1337, file: !14, line: 3774, baseType: !1060, size: 64, align: 64, offset: 704)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "priv_data_size", scope: !1337, file: !14, line: 3780, baseType: !930, size: 32, align: 32, offset: 768)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !1337, file: !14, line: 3785, baseType: !930, size: 32, align: 32, offset: 800)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "frame_params", scope: !1337, file: !14, line: 3795, baseType: !1373, size: 64, align: 64, offset: 832)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64, align: 64)
!1374 = !DISubroutineType(types: !1375)
!1375 = !{!930, !1063, !1141}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_context", scope: !1065, file: !14, line: 2728, baseType: !982, size: 64, align: 64, offset: 5440)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !1065, file: !14, line: 2735, baseType: !1131, size: 512, align: 64, offset: 5504)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "dct_algo", scope: !1065, file: !14, line: 2742, baseType: !930, size: 32, align: 32, offset: 6016)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "idct_algo", scope: !1065, file: !14, line: 2755, baseType: !930, size: 32, align: 32, offset: 6048)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_coded_sample", scope: !1065, file: !14, line: 2776, baseType: !930, size: 32, align: 32, offset: 6080)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "bits_per_raw_sample", scope: !1065, file: !14, line: 2783, baseType: !930, size: 32, align: 32, offset: 6112)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "lowres", scope: !1065, file: !14, line: 2791, baseType: !930, size: 32, align: 32, offset: 6144)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "coded_frame", scope: !1065, file: !14, line: 2802, baseType: !1278, size: 64, align: 64, offset: 6208)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "thread_count", scope: !1065, file: !14, line: 2811, baseType: !930, size: 32, align: 32, offset: 6272)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "thread_type", scope: !1065, file: !14, line: 2821, baseType: !930, size: 32, align: 32, offset: 6304)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "active_thread_type", scope: !1065, file: !14, line: 2830, baseType: !930, size: 32, align: 32, offset: 6336)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "thread_safe_callbacks", scope: !1065, file: !14, line: 2840, baseType: !930, size: 32, align: 32, offset: 6368)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !1065, file: !14, line: 2851, baseType: !1389, size: 64, align: 64, offset: 6400)
!1389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1390, size: 64, align: 64)
!1390 = !DISubroutineType(types: !1391)
!1391 = !{!930, !1102, !1392, !982, !1200, !930, !930}
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64, align: 64)
!1393 = !DISubroutineType(types: !1394)
!1394 = !{!930, !1102, !982}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "execute2", scope: !1065, file: !14, line: 2871, baseType: !1396, size: 64, align: 64, offset: 6464)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64, align: 64)
!1397 = !DISubroutineType(types: !1398)
!1398 = !{!930, !1102, !1399, !982, !1200, !930}
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64, align: 64)
!1400 = !DISubroutineType(types: !1401)
!1401 = !{!930, !1102, !982, !930, !930}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "nsse_weight", scope: !1065, file: !14, line: 2878, baseType: !930, size: 32, align: 32, offset: 6528)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !1065, file: !14, line: 2885, baseType: !930, size: 32, align: 32, offset: 6560)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1065, file: !14, line: 3005, baseType: !930, size: 32, align: 32, offset: 6592)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "skip_loop_filter", scope: !1065, file: !14, line: 3013, baseType: !864, size: 32, align: 32, offset: 6624)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "skip_idct", scope: !1065, file: !14, line: 3020, baseType: !864, size: 32, align: 32, offset: 6656)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "skip_frame", scope: !1065, file: !14, line: 3027, baseType: !864, size: 32, align: 32, offset: 6688)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header", scope: !1065, file: !14, line: 3037, baseType: !1087, size: 64, align: 64, offset: 6720)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "subtitle_header_size", scope: !1065, file: !14, line: 3038, baseType: !930, size: 32, align: 32, offset: 6784)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "vbv_delay", scope: !1065, file: !14, line: 3050, baseType: !965, size: 64, align: 64, offset: 6848)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_only_packets", scope: !1065, file: !14, line: 3065, baseType: !930, size: 32, align: 32, offset: 6912)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "initial_padding", scope: !1065, file: !14, line: 3083, baseType: !930, size: 32, align: 32, offset: 6944)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "framerate", scope: !1065, file: !14, line: 3092, baseType: !947, size: 64, align: 32, offset: 6976)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "sw_pix_fmt", scope: !1065, file: !14, line: 3099, baseType: !473, size: 32, align: 32, offset: 7040)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_timebase", scope: !1065, file: !14, line: 3106, baseType: !947, size: 64, align: 32, offset: 7072)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "codec_descriptor", scope: !1065, file: !14, line: 3113, baseType: !1417, size: 64, align: 64, offset: 7168)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64, align: 64)
!1418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1419)
!1419 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDescriptor", file: !14, line: 740, baseType: !1420)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDescriptor", file: !14, line: 712, size: 384, align: 64, elements: !1421)
!1421 = !{!1422, !1423, !1424, !1425, !1426, !1427, !1430}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1420, file: !14, line: 713, baseType: !13, size: 32, align: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1420, file: !14, line: 714, baseType: !3, size: 32, align: 32, offset: 32)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1420, file: !14, line: 720, baseType: !937, size: 64, align: 64, offset: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "long_name", scope: !1420, file: !14, line: 724, baseType: !937, size: 64, align: 64, offset: 128)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "props", scope: !1420, file: !14, line: 728, baseType: !930, size: 32, align: 32, offset: 192)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "mime_types", scope: !1420, file: !14, line: 734, baseType: !1428, size: 64, align: 64, offset: 256)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64, align: 64)
!1429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "profiles", scope: !1420, file: !14, line: 739, baseType: !1431, size: 64, align: 64, offset: 320)
!1431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1432, size: 64, align: 64)
!1432 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1051)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_pts", scope: !1065, file: !14, line: 3129, baseType: !996, size: 64, align: 64, offset: 7232)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_num_faulty_dts", scope: !1065, file: !14, line: 3130, baseType: !996, size: 64, align: 64, offset: 7296)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_pts", scope: !1065, file: !14, line: 3131, baseType: !996, size: 64, align: 64, offset: 7360)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "pts_correction_last_dts", scope: !1065, file: !14, line: 3132, baseType: !996, size: 64, align: 64, offset: 7424)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc", scope: !1065, file: !14, line: 3139, baseType: !1326, size: 64, align: 64, offset: 7488)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "sub_charenc_mode", scope: !1065, file: !14, line: 3147, baseType: !930, size: 32, align: 32, offset: 7552)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "skip_alpha", scope: !1065, file: !14, line: 3165, baseType: !930, size: 32, align: 32, offset: 7584)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "seek_preroll", scope: !1065, file: !14, line: 3172, baseType: !930, size: 32, align: 32, offset: 7616)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "debug_mv", scope: !1065, file: !14, line: 3180, baseType: !930, size: 32, align: 32, offset: 7648)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "chroma_intra_matrix", scope: !1065, file: !14, line: 3191, baseType: !1237, size: 64, align: 64, offset: 7680)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "dump_separator", scope: !1065, file: !14, line: 3199, baseType: !1087, size: 64, align: 64, offset: 7744)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "codec_whitelist", scope: !1065, file: !14, line: 3207, baseType: !1326, size: 64, align: 64, offset: 7808)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "properties", scope: !1065, file: !14, line: 3214, baseType: !929, size: 32, align: 32, offset: 7872)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "coded_side_data", scope: !1065, file: !14, line: 3224, baseType: !1447, size: 64, align: 64, offset: 7936)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64, align: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacketSideData", file: !14, line: 1415, baseType: !1449)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacketSideData", file: !14, line: 1411, size: 128, align: 64, elements: !1450)
!1450 = !{!1451, !1452, !1453}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1449, file: !14, line: 1412, baseType: !1087, size: 64, align: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1449, file: !14, line: 1413, baseType: !930, size: 32, align: 32, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1449, file: !14, line: 1414, baseType: !873, size: 32, align: 32, offset: 96)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "nb_coded_side_data", scope: !1065, file: !14, line: 3225, baseType: !930, size: 32, align: 32, offset: 8000)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "hw_frames_ctx", scope: !1065, file: !14, line: 3249, baseType: !1141, size: 64, align: 64, offset: 8064)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "sub_text_format", scope: !1065, file: !14, line: 3256, baseType: !930, size: 32, align: 32, offset: 8128)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "trailing_padding", scope: !1065, file: !14, line: 3271, baseType: !930, size: 32, align: 32, offset: 8160)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "max_pixels", scope: !1065, file: !14, line: 3279, baseType: !996, size: 64, align: 64, offset: 8192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "hw_device_ctx", scope: !1065, file: !14, line: 3301, baseType: !1141, size: 64, align: 64, offset: 8256)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "hwaccel_flags", scope: !1065, file: !14, line: 3310, baseType: !930, size: 32, align: 32, offset: 8320)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "apply_cropping", scope: !1065, file: !14, line: 3337, baseType: !930, size: 32, align: 32, offset: 8352)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "extra_hw_frames", scope: !1065, file: !14, line: 3351, baseType: !930, size: 32, align: 32, offset: 8384)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "discard_damaged_percentage", scope: !1065, file: !14, line: 3359, baseType: !930, size: 32, align: 32, offset: 8416)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "update_thread_context", scope: !934, file: !14, line: 3535, baseType: !1465, size: 64, align: 64, offset: 1024)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64, align: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!930, !1063, !1468}
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64, align: 64)
!1469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !934, file: !14, line: 3541, baseType: !1471, size: 64, align: 64, offset: 1088)
!1471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1472, size: 64, align: 64)
!1472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1473)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVCodecDefault", file: !14, line: 3461, baseType: !1474)
!1474 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecDefault", file: !14, line: 3461, flags: DIFlagFwdDecl)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "init_static_data", scope: !934, file: !14, line: 3549, baseType: !1476, size: 64, align: 64, offset: 1152)
!1476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1477, size: 64, align: 64)
!1477 = !DISubroutineType(types: !1478)
!1478 = !{null, !1058}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !934, file: !14, line: 3551, baseType: !1060, size: 64, align: 64, offset: 1216)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "encode_sub", scope: !934, file: !14, line: 3552, baseType: !1481, size: 64, align: 64, offset: 1280)
!1481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1482, size: 64, align: 64)
!1482 = !DISubroutineType(types: !1483)
!1483 = !{!930, !1063, !1087, !930, !1484}
!1484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1485, size: 64, align: 64)
!1485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1486)
!1486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitle", file: !14, line: 3920, size: 256, align: 64, elements: !1487)
!1487 = !{!1488, !1489, !1490, !1491, !1492, !1519}
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !1486, file: !14, line: 3921, baseType: !1238, size: 16, align: 16)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "start_display_time", scope: !1486, file: !14, line: 3922, baseType: !1354, size: 32, align: 32, offset: 32)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "end_display_time", scope: !1486, file: !14, line: 3923, baseType: !1354, size: 32, align: 32, offset: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "num_rects", scope: !1486, file: !14, line: 3924, baseType: !929, size: 32, align: 32, offset: 96)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "rects", scope: !1486, file: !14, line: 3925, baseType: !1493, size: 64, align: 64, offset: 128)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64, align: 64)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64, align: 64)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVSubtitleRect", file: !14, line: 3918, baseType: !1496)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVSubtitleRect", file: !14, line: 3885, size: 1600, align: 64, elements: !1497)
!1497 = !{!1498, !1499, !1500, !1501, !1502, !1503, !1509, !1513, !1515, !1516, !1517, !1518}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1496, file: !14, line: 3886, baseType: !930, size: 32, align: 32)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1496, file: !14, line: 3887, baseType: !930, size: 32, align: 32, offset: 32)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !1496, file: !14, line: 3888, baseType: !930, size: 32, align: 32, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1496, file: !14, line: 3889, baseType: !930, size: 32, align: 32, offset: 96)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "nb_colors", scope: !1496, file: !14, line: 3890, baseType: !930, size: 32, align: 32, offset: 128)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "pict", scope: !1496, file: !14, line: 3897, baseType: !1504, size: 768, align: 64, offset: 192)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPicture", file: !14, line: 3858, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPicture", file: !14, line: 3853, size: 768, align: 64, elements: !1506)
!1506 = !{!1507, !1508}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1505, file: !14, line: 3855, baseType: !1109, size: 512, align: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1505, file: !14, line: 3857, baseType: !1113, size: 256, align: 32, offset: 512)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1496, file: !14, line: 3903, baseType: !1510, size: 256, align: 64, offset: 960)
!1510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 256, align: 64, elements: !1511)
!1511 = !{!1512}
!1512 = !DISubrange(count: 4)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "linesize", scope: !1496, file: !14, line: 3904, baseType: !1514, size: 128, align: 32, offset: 1216)
!1514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 128, align: 32, elements: !1511)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1496, file: !14, line: 3906, baseType: !903, size: 32, align: 32, offset: 1344)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !1496, file: !14, line: 3908, baseType: !1326, size: 64, align: 64, offset: 1408)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "ass", scope: !1496, file: !14, line: 3915, baseType: !1326, size: 64, align: 64, offset: 1472)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1496, file: !14, line: 3917, baseType: !930, size: 32, align: 32, offset: 1536)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1486, file: !14, line: 3926, baseType: !996, size: 64, align: 64, offset: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "encode2", scope: !934, file: !14, line: 3564, baseType: !1521, size: 64, align: 64, offset: 1344)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64, align: 64)
!1522 = !DISubroutineType(types: !1523)
!1523 = !{!930, !1063, !1524, !1103, !1200}
!1524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1525, size: 64, align: 64)
!1525 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVPacket", file: !14, line: 1499, baseType: !1526)
!1526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVPacket", file: !14, line: 1445, size: 704, align: 64, elements: !1527)
!1527 = !{!1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539}
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1526, file: !14, line: 1451, baseType: !1141, size: 64, align: 64)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "pts", scope: !1526, file: !14, line: 1461, baseType: !996, size: 64, align: 64, offset: 64)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "dts", scope: !1526, file: !14, line: 1467, baseType: !996, size: 64, align: 64, offset: 128)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1526, file: !14, line: 1468, baseType: !1087, size: 64, align: 64, offset: 192)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1526, file: !14, line: 1469, baseType: !930, size: 32, align: 32, offset: 256)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "stream_index", scope: !1526, file: !14, line: 1470, baseType: !930, size: 32, align: 32, offset: 288)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1526, file: !14, line: 1474, baseType: !930, size: 32, align: 32, offset: 320)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "side_data", scope: !1526, file: !14, line: 1479, baseType: !1447, size: 64, align: 64, offset: 384)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "side_data_elems", scope: !1526, file: !14, line: 1480, baseType: !930, size: 32, align: 32, offset: 448)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "duration", scope: !1526, file: !14, line: 1486, baseType: !996, size: 64, align: 64, offset: 512)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !1526, file: !14, line: 1488, baseType: !996, size: 64, align: 64, offset: 576)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "convergence_duration", scope: !1526, file: !14, line: 1497, baseType: !996, size: 64, align: 64, offset: 640)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "decode", scope: !934, file: !14, line: 3566, baseType: !1541, size: 64, align: 64, offset: 1408)
!1541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1542, size: 64, align: 64)
!1542 = !DISubroutineType(types: !1543)
!1543 = !{!930, !1063, !982, !1200, !1524}
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !934, file: !14, line: 3567, baseType: !1060, size: 64, align: 64, offset: 1472)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "send_frame", scope: !934, file: !14, line: 3576, baseType: !1546, size: 64, align: 64, offset: 1536)
!1546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1547, size: 64, align: 64)
!1547 = !DISubroutineType(types: !1548)
!1548 = !{!930, !1063, !1103}
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "receive_packet", scope: !934, file: !14, line: 3577, baseType: !1550, size: 64, align: 64, offset: 1600)
!1550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1551, size: 64, align: 64)
!1551 = !DISubroutineType(types: !1552)
!1552 = !{!930, !1063, !1524}
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "receive_frame", scope: !934, file: !14, line: 3584, baseType: !1345, size: 64, align: 64, offset: 1664)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "flush", scope: !934, file: !14, line: 3589, baseType: !1555, size: 64, align: 64, offset: 1728)
!1555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1556, size: 64, align: 64)
!1556 = !DISubroutineType(types: !1557)
!1557 = !{null, !1063}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "caps_internal", scope: !934, file: !14, line: 3594, baseType: !930, size: 32, align: 32, offset: 1792)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "bsfs", scope: !934, file: !14, line: 3600, baseType: !937, size: 64, align: 64, offset: 1856)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "hw_configs", scope: !934, file: !14, line: 3609, baseType: !1561, size: 64, align: 64, offset: 1920)
!1561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1562, size: 64, align: 64)
!1562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1563, size: 64, align: 64)
!1563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1564)
!1564 = !DICompositeType(tag: DW_TAG_structure_type, name: "AVCodecHWConfigInternal", file: !14, line: 3609, flags: DIFlagFwdDecl)
!1565 = distinct !DIGlobalVariable(name: "ccaption_dec_class", scope: !0, file: !910, line: 825, type: !973, isLocal: true, isDefinition: true, variable: %struct.AVClass* @ccaption_dec_class)
!1566 = distinct !DIGlobalVariable(name: "options", scope: !0, file: !910, line: 820, type: !1567, isLocal: true, isDefinition: true, variable: [2 x %struct.AVOption]* @options)
!1567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1568, size: 1024, align: 64, elements: !1570)
!1568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1569)
!1569 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVOption", file: !691, line: 301, baseType: !986)
!1570 = !{!1571}
!1571 = !DISubrange(count: 2)
!1572 = distinct !DIGlobalVariable(name: "row_map", scope: !1573, file: !910, line: 554, type: !1635, isLocal: true, isDefinition: true, variable: [16 x i8]* @handle_pac.row_map)
!1573 = distinct !DISubprogram(name: "handle_pac", scope: !910, file: !910, line: 552, type: !1574, isLocal: true, isDefinition: true, scopeLine: 553, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1634)
!1574 = !DISubroutineType(types: !1575)
!1575 = !{null, !1576, !969, !969}
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64, align: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCaptionSubContext", file: !910, line: 253, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CCaptionSubContext", file: !910, line: 228, size: 40768, align: 64, elements: !1579)
!1579 = !{!1580, !1582, !1583, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1631, !1632, !1633}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "class", scope: !1578, file: !910, line: 229, baseType: !1581, size: 64, align: 64)
!1581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64, align: 64)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "real_time", scope: !1578, file: !910, line: 230, baseType: !930, size: 32, align: 32, offset: 64)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "screen", scope: !1578, file: !910, line: 231, baseType: !1584, size: 31712, align: 16, offset: 96)
!1584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1585, size: 31712, align: 16, elements: !1570)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Screen", file: !910, line: 213, size: 15856, align: 16, elements: !1586)
!1586 = !{!1587, !1592, !1593, !1594, !1595}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "characters", scope: !1585, file: !910, line: 215, baseType: !1588, size: 3960, align: 8)
!1588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 3960, align: 8, elements: !1589)
!1589 = !{!1590, !1591}
!1590 = !DISubrange(count: 15)
!1591 = !DISubrange(count: 33)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "charsets", scope: !1585, file: !910, line: 216, baseType: !1588, size: 3960, align: 8, offset: 3960)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !1585, file: !910, line: 217, baseType: !1588, size: 3960, align: 8, offset: 7920)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "fonts", scope: !1585, file: !910, line: 218, baseType: !1588, size: 3960, align: 8, offset: 11880)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "row_used", scope: !1585, file: !910, line: 225, baseType: !1596, size: 16, align: 16, offset: 15840)
!1596 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !966, line: 37, baseType: !1597)
!1597 = !DIBasicType(name: "short", size: 16, align: 16, encoding: DW_ATE_signed)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "active_screen", scope: !1578, file: !910, line: 232, baseType: !930, size: 32, align: 32, offset: 31808)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_row", scope: !1578, file: !910, line: 233, baseType: !969, size: 8, align: 8, offset: 31840)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_column", scope: !1578, file: !910, line: 234, baseType: !969, size: 8, align: 8, offset: 31848)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_color", scope: !1578, file: !910, line: 235, baseType: !969, size: 8, align: 8, offset: 31856)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_font", scope: !1578, file: !910, line: 236, baseType: !969, size: 8, align: 8, offset: 31864)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_charset", scope: !1578, file: !910, line: 237, baseType: !969, size: 8, align: 8, offset: 31872)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1578, file: !910, line: 238, baseType: !1605, size: 8192, align: 64, offset: 31936)
!1605 = !DIDerivedType(tag: DW_TAG_typedef, name: "AVBPrint", file: !1606, line: 82, baseType: !1607)
!1606 = !DIFile(filename: "./libavutil/bprint.h", directory: "/home/ubuntu_1604/Desktop/ffmped_bcmake_outputs")
!1607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AVBPrint", file: !1606, line: 82, size: 8192, align: 64, elements: !1608)
!1608 = !{!1609, !1610, !1611, !1612, !1613, !1617}
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1607, file: !1606, line: 82, baseType: !1326, size: 64, align: 64)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1607, file: !1606, line: 82, baseType: !929, size: 32, align: 32, offset: 64)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1607, file: !1606, line: 82, baseType: !929, size: 32, align: 32, offset: 96)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "size_max", scope: !1607, file: !1606, line: 82, baseType: !929, size: 32, align: 32, offset: 128)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_internal_buffer", scope: !1607, file: !1606, line: 82, baseType: !1614, size: 8, align: 8, offset: 160)
!1614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 8, align: 8, elements: !1615)
!1615 = !{!1616}
!1616 = !DISubrange(count: 1)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_padding", scope: !1607, file: !1606, line: 82, baseType: !1618, size: 8000, align: 8, offset: 168)
!1618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 8000, align: 8, elements: !1619)
!1619 = !{!1620}
!1620 = !DISubrange(count: 1000)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_changed", scope: !1578, file: !910, line: 239, baseType: !930, size: 32, align: 32, offset: 40128)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "rollup", scope: !1578, file: !910, line: 240, baseType: !930, size: 32, align: 32, offset: 40160)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1578, file: !910, line: 241, baseType: !909, size: 32, align: 32, offset: 40192)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !1578, file: !910, line: 242, baseType: !996, size: 64, align: 64, offset: 40256)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "startv_time", scope: !1578, file: !910, line: 244, baseType: !996, size: 64, align: 64, offset: 40320)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "end_time", scope: !1578, file: !910, line: 245, baseType: !996, size: 64, align: 64, offset: 40384)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "screen_touched", scope: !1578, file: !910, line: 246, baseType: !930, size: 32, align: 32, offset: 40448)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "last_real_time", scope: !1578, file: !910, line: 247, baseType: !996, size: 64, align: 64, offset: 40512)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "prev_cmd", scope: !1578, file: !910, line: 248, baseType: !1630, size: 16, align: 8, offset: 40576)
!1630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 16, align: 8, elements: !1570)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "pktbuf", scope: !1578, file: !910, line: 250, baseType: !1087, size: 64, align: 64, offset: 40640)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "pktbuf_size", scope: !1578, file: !910, line: 251, baseType: !930, size: 32, align: 32, offset: 40704)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "readorder", scope: !1578, file: !910, line: 252, baseType: !930, size: 32, align: 32, offset: 40736)
!1634 = !{}
!1635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1636, size: 128, align: 8, elements: !1637)
!1636 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1186)
!1637 = !{!1638}
!1638 = !DISubrange(count: 16)
!1639 = distinct !DIGlobalVariable(name: "pac2_attribs", scope: !0, file: !910, line: 176, type: !1640, isLocal: true, isDefinition: true, variable: [32 x [3 x i8]]* @pac2_attribs)
!1640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1641, size: 768, align: 8, elements: !1642)
!1641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!1642 = !{!1643, !1644}
!1643 = !DISubrange(count: 32)
!1644 = !DISubrange(count: 3)
!1645 = distinct !DIGlobalVariable(name: "ms_tb", scope: !0, file: !910, line: 33, type: !946, isLocal: true, isDefinition: true, variable: %struct.AVRational* @ms_tb)
!1646 = distinct !DIGlobalVariable(name: "charset_overrides", scope: !0, file: !910, line: 73, type: !1647, isLocal: true, isDefinition: true, variable: [4 x [128 x i8*]]* @charset_overrides)
!1647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !937, size: 32768, align: 64, elements: !1648)
!1648 = !{!1512, !1649}
!1649 = !DISubrange(count: 128)
!1650 = !{i32 2, !"Dwarf Version", i32 4}
!1651 = !{i32 2, !"Debug Info Version", i32 3}
!1652 = !{!"clang version 3.9.0 (tags/RELEASE_390/final)"}
!1653 = distinct !DISubprogram(name: "init_decoder", scope: !910, file: !910, line: 256, type: !1061, isLocal: true, isDefinition: true, scopeLine: 257, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1634)
!1654 = !DILocalVariable(name: "avctx", arg: 1, scope: !1653, file: !910, line: 256, type: !1063)
!1655 = !DIExpression()
!1656 = !DILocation(line: 256, column: 63, scope: !1653)
!1657 = !DILocalVariable(name: "ret", scope: !1653, file: !910, line: 258, type: !930)
!1658 = !DILocation(line: 258, column: 9, scope: !1653)
!1659 = !DILocalVariable(name: "ctx", scope: !1653, file: !910, line: 259, type: !1576)
!1660 = !DILocation(line: 259, column: 25, scope: !1653)
!1661 = !DILocation(line: 259, column: 31, scope: !1653)
!1662 = !DILocation(line: 259, column: 38, scope: !1653)
!1663 = !DILocation(line: 261, column: 21, scope: !1653)
!1664 = !DILocation(line: 261, column: 26, scope: !1653)
!1665 = !DILocation(line: 261, column: 5, scope: !1653)
!1666 = !DILocation(line: 263, column: 5, scope: !1653)
!1667 = !DILocation(line: 263, column: 10, scope: !1653)
!1668 = !DILocation(line: 263, column: 15, scope: !1653)
!1669 = !DILocation(line: 264, column: 5, scope: !1653)
!1670 = !DILocation(line: 264, column: 10, scope: !1653)
!1671 = !DILocation(line: 264, column: 17, scope: !1653)
!1672 = !DILocation(line: 265, column: 5, scope: !1653)
!1673 = !DILocation(line: 265, column: 10, scope: !1653)
!1674 = !DILocation(line: 265, column: 21, scope: !1653)
!1675 = !DILocation(line: 266, column: 34, scope: !1653)
!1676 = !DILocation(line: 266, column: 11, scope: !1653)
!1677 = !DILocation(line: 266, column: 9, scope: !1653)
!1678 = !DILocation(line: 275, column: 9, scope: !1679)
!1679 = distinct !DILexicalBlock(scope: !1653, file: !910, line: 275, column: 9)
!1680 = !DILocation(line: 275, column: 13, scope: !1679)
!1681 = !DILocation(line: 275, column: 9, scope: !1653)
!1682 = !DILocation(line: 276, column: 16, scope: !1683)
!1683 = distinct !DILexicalBlock(scope: !1679, file: !910, line: 275, column: 18)
!1684 = !DILocation(line: 276, column: 9, scope: !1683)
!1685 = !DILocation(line: 279, column: 12, scope: !1653)
!1686 = !DILocation(line: 279, column: 5, scope: !1653)
!1687 = !DILocation(line: 280, column: 1, scope: !1653)
!1688 = distinct !DISubprogram(name: "decode", scope: !910, file: !910, line: 750, type: !1542, isLocal: true, isDefinition: true, scopeLine: 751, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !1634)
